; ModuleID = 'ira-costs.bc'
source_filename = "ira-costs.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.costs = type { i32, [1 x i32] }
%struct.ira_loop_tree_node = type { %struct.basic_block_def*, %struct.loop*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, %struct.ira_loop_tree_node*, i32, i8, %struct.ira_allocno**, i8, [27 x i32], %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def* }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }

!518 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!519 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!520 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!521 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!522 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!523 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!524 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!525 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!526 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!527 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!528 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!529 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!530 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!531 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!532 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!533 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!534 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!535 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!536 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!537 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!538 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!539 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!540 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!541 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!542 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!543 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!544 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!545 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!546 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!547 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!548 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!549 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!550 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!551 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!552 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!553 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!554 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!555 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!556 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!557 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!558 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!559 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!560 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!561 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!562 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!563 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !564, line: 36, baseType: !7, size: 32, elements: !565)
!564 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!565 = !{!566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584}
!566 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!567 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!568 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!569 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!570 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!571 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!572 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!573 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!574 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!575 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!576 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!577 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!578 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!579 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!580 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!581 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!582 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!583 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!584 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!585 = !{!586, !587, !588, !589, !592, !593, !595, !603, !604, !590, !37, !5, !420, !672, !7, !563, !1698, !1700}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!588 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "costs", file: !3, line: 60, size: 64, elements: !597)
!597 = !{!598, !599}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "mem_cost", scope: !596, file: !3, line: 62, baseType: !588, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !596, file: !3, line: 66, baseType: !600, size: 32, offset: 32)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 32, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 1)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !605, line: 50, baseType: !606)
!605 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !421, line: 240, size: 384, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !607, file: !421, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !607, file: !421, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !607, file: !421, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !607, file: !421, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !607, file: !421, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !607, file: !421, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !607, file: !421, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !607, file: !421, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !607, file: !421, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !607, file: !421, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !607, file: !421, line: 321, baseType: !620, size: 320, offset: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !421, line: 315, size: 320, elements: !621)
!621 = !{!622, !1665, !1667, !1696, !1697}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !620, file: !421, line: 316, baseType: !623, size: 64)
!623 = !DICompositeType(tag: DW_TAG_array_type, baseType: !624, size: 64, elements: !601)
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !421, line: 183, baseType: !625)
!625 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !421, line: 166, size: 64, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !639, !640, !652, !655, !717, !1643, !1644, !1655, !1662}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !625, file: !421, line: 168, baseType: !588, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !625, file: !421, line: 169, baseType: !7, size: 32)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !625, file: !421, line: 170, baseType: !593, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !625, file: !421, line: 171, baseType: !604, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !625, file: !421, line: 172, baseType: !632, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !605, line: 53, baseType: !633)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !421, line: 359, size: 128, elements: !635)
!635 = !{!636, !637}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !634, file: !421, line: 360, baseType: !588, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !634, file: !421, line: 361, baseType: !638, size: 64, offset: 64)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 64, elements: !601)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !625, file: !421, line: 173, baseType: !37, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !625, file: !421, line: 174, baseType: !641, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !421, line: 133, baseType: !642)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 115, size: 32, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !642, file: !421, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !642, file: !421, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !642, file: !421, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !642, file: !421, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !642, file: !421, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !642, file: !421, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !642, file: !421, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !642, file: !421, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !625, file: !421, line: 175, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !421, line: 175, flags: DIFlagFwdDecl)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !625, file: !421, line: 176, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !658, line: 75, size: 256, elements: !659)
!658 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!659 = !{!660, !675, !676, !677}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !657, file: !658, line: 76, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !658, line: 68, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !658, line: 63, size: 320, elements: !664)
!664 = !{!665, !667, !668, !669}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !663, file: !658, line: 64, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !663, file: !658, line: 65, baseType: !666, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !663, file: !658, line: 66, baseType: !7, size: 32, offset: 128)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !663, file: !658, line: 67, baseType: !670, size: 128, offset: 192)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 128, elements: !673)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !658, line: 29, baseType: !672)
!672 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!673 = !{!674}
!674 = !DISubrange(count: 2)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !657, file: !658, line: 77, baseType: !661, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !657, file: !658, line: 78, baseType: !7, size: 32, offset: 128)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !657, file: !658, line: 79, baseType: !678, size: 64, offset: 192)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !658, line: 49, baseType: !680)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !658, line: 45, size: 832, elements: !681)
!681 = !{!682, !683, !684}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !680, file: !658, line: 46, baseType: !666, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !680, file: !658, line: 47, baseType: !656, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !680, file: !658, line: 48, baseType: !685, size: 704, offset: 128)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !686, line: 164, size: 704, elements: !687)
!686 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!687 = !{!688, !690, !700, !701, !702, !703, !704, !705, !709, !713, !714, !715, !716}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !685, file: !686, line: 166, baseType: !689, size: 64)
!689 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !685, file: !686, line: 167, baseType: !691, size: 64, offset: 64)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !686, line: 157, size: 192, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !692, file: !686, line: 159, baseType: !590, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !692, file: !686, line: 160, baseType: !691, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !692, file: !686, line: 161, baseType: !697, size: 32, offset: 128)
!697 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 32, elements: !698)
!698 = !{!699}
!699 = !DISubrange(count: 4)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !685, file: !686, line: 168, baseType: !590, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !685, file: !686, line: 169, baseType: !590, size: 64, offset: 192)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !685, file: !686, line: 170, baseType: !590, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !685, file: !686, line: 171, baseType: !689, size: 64, offset: 320)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !685, file: !686, line: 172, baseType: !588, size: 32, offset: 384)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !685, file: !686, line: 176, baseType: !706, size: 64, offset: 448)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DISubroutineType(types: !708)
!708 = !{!691, !592, !689}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !685, file: !686, line: 177, baseType: !710, size: 64, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DISubroutineType(types: !712)
!712 = !{null, !592, !691}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !685, file: !686, line: 178, baseType: !592, size: 64, offset: 576)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !685, file: !686, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !685, file: !686, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !685, file: !686, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !625, file: !421, line: 177, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !605, line: 56, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !194, line: 3371, size: 1792, elements: !721)
!721 = !{!722, !755, !761, !772, !791, !802, !807, !814, !820, !833, !845, !883, !888, !916, !924, !925, !930, !939, !945, !950, !954, !958, !1270, !1319, !1325, !1332, !1339, !1362, !1387, !1404, !1416, !1438, !1453, !1625}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !720, file: !194, line: 3372, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !194, line: 360, size: 64, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !723, file: !194, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !723, file: !194, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !723, file: !194, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !723, file: !194, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !723, file: !194, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !723, file: !194, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !723, file: !194, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !723, file: !194, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !723, file: !194, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !723, file: !194, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !723, file: !194, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !723, file: !194, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !723, file: !194, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !723, file: !194, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !723, file: !194, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !723, file: !194, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !723, file: !194, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !723, file: !194, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !723, file: !194, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !723, file: !194, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !723, file: !194, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !723, file: !194, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !723, file: !194, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !723, file: !194, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !723, file: !194, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !723, file: !194, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !723, file: !194, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !723, file: !194, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !723, file: !194, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !723, file: !194, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !720, file: !194, line: 3373, baseType: !756, size: 192)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !194, line: 402, size: 192, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !756, file: !194, line: 403, baseType: !723, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !756, file: !194, line: 404, baseType: !718, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !194, line: 405, baseType: !718, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !720, file: !194, line: 3374, baseType: !762, size: 320)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !194, line: 1384, size: 320, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !194, line: 1385, baseType: !756, size: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !762, file: !194, line: 1386, baseType: !766, size: 128, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !767, line: 58, baseType: !768)
!767 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !767, line: 54, size: 128, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !768, file: !767, line: 56, baseType: !672, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !768, file: !767, line: 57, baseType: !689, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !720, file: !194, line: 3375, baseType: !773, size: 256)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !194, line: 1397, size: 256, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !194, line: 1398, baseType: !756, size: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !773, file: !194, line: 1399, baseType: !777, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !779, line: 52, size: 256, elements: !780)
!779 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!780 = !{!781, !782, !783, !784, !785, !786, !787}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !778, file: !779, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !778, file: !779, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !778, file: !779, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !778, file: !779, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !778, file: !779, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !778, file: !779, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !778, file: !779, line: 62, baseType: !788, size: 192, offset: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 192, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 3)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !720, file: !194, line: 3376, baseType: !792, size: 256)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !194, line: 1408, size: 256, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !194, line: 1409, baseType: !756, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !792, file: !194, line: 1410, baseType: !796, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !798, line: 27, size: 192, elements: !799)
!798 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !797, file: !798, line: 29, baseType: !766, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !797, file: !798, line: 30, baseType: !37, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !720, file: !194, line: 3377, baseType: !803, size: 256)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !194, line: 1437, size: 256, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !194, line: 1438, baseType: !756, size: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !803, file: !194, line: 1439, baseType: !718, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !720, file: !194, line: 3378, baseType: !808, size: 256)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !194, line: 1418, size: 256, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !194, line: 1419, baseType: !756, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !808, file: !194, line: 1420, baseType: !588, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !808, file: !194, line: 1421, baseType: !813, size: 8, offset: 224)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 8, elements: !601)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !720, file: !194, line: 3379, baseType: !815, size: 320)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !194, line: 1428, size: 320, elements: !816)
!816 = !{!817, !818, !819}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !815, file: !194, line: 1429, baseType: !756, size: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !815, file: !194, line: 1430, baseType: !718, size: 64, offset: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !815, file: !194, line: 1431, baseType: !718, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !720, file: !194, line: 3380, baseType: !821, size: 320)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !194, line: 1460, size: 320, elements: !822)
!822 = !{!823, !824}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !194, line: 1461, baseType: !756, size: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !821, file: !194, line: 1462, baseType: !825, size: 128, offset: 192)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !826, line: 31, size: 128, elements: !827)
!826 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!827 = !{!828, !831, !832}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !825, file: !826, line: 32, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !825, file: !826, line: 33, baseType: !7, size: 32, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !825, file: !826, line: 34, baseType: !7, size: 32, offset: 96)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !720, file: !194, line: 3381, baseType: !834, size: 384)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !194, line: 2507, size: 384, elements: !835)
!835 = !{!836, !837, !842, !843, !844}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !194, line: 2508, baseType: !756, size: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !834, file: !194, line: 2509, baseType: !838, size: 32, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !839, line: 58, baseType: !840)
!839 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !841, line: 44, baseType: !7)
!841 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!842 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !834, file: !194, line: 2510, baseType: !7, size: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !834, file: !194, line: 2511, baseType: !718, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !834, file: !194, line: 2512, baseType: !718, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !720, file: !194, line: 3382, baseType: !846, size: 896)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !194, line: 2652, size: 896, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !846, file: !194, line: 2653, baseType: !834, size: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !846, file: !194, line: 2654, baseType: !718, size: 64, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !846, file: !194, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !846, file: !194, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !846, file: !194, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !846, file: !194, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !846, file: !194, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !846, file: !194, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !846, file: !194, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !846, file: !194, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !846, file: !194, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !846, file: !194, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !846, file: !194, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !846, file: !194, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !846, file: !194, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !846, file: !194, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !846, file: !194, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !846, file: !194, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !846, file: !194, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !846, file: !194, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !846, file: !194, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !846, file: !194, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !846, file: !194, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !846, file: !194, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !846, file: !194, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !846, file: !194, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !846, file: !194, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !846, file: !194, line: 2703, baseType: !7, size: 32, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !846, file: !194, line: 2705, baseType: !718, size: 64, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !846, file: !194, line: 2706, baseType: !718, size: 64, offset: 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !846, file: !194, line: 2707, baseType: !718, size: 64, offset: 704)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !846, file: !194, line: 2708, baseType: !718, size: 64, offset: 768)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !846, file: !194, line: 2711, baseType: !881, size: 64, offset: 832)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !194, line: 2711, flags: DIFlagFwdDecl)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !720, file: !194, line: 3383, baseType: !884, size: 960)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !194, line: 2756, size: 960, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !884, file: !194, line: 2757, baseType: !846, size: 896)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !884, file: !194, line: 2758, baseType: !604, size: 64, offset: 896)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !720, file: !194, line: 3384, baseType: !889, size: 1472)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !194, line: 3114, size: 1472, elements: !890)
!890 = !{!891, !912, !913, !914, !915}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !889, file: !194, line: 3115, baseType: !892, size: 1216)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !194, line: 2984, size: 1216, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !194, line: 2985, baseType: !884, size: 960)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !892, file: !194, line: 2986, baseType: !718, size: 64, offset: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !892, file: !194, line: 2987, baseType: !718, size: 64, offset: 1024)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !892, file: !194, line: 2988, baseType: !718, size: 64, offset: 1088)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !892, file: !194, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !892, file: !194, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !892, file: !194, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !892, file: !194, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !892, file: !194, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !892, file: !194, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !892, file: !194, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !892, file: !194, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !892, file: !194, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !892, file: !194, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !892, file: !194, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !892, file: !194, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !892, file: !194, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !892, file: !194, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !889, file: !194, line: 3117, baseType: !718, size: 64, offset: 1216)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !889, file: !194, line: 3119, baseType: !718, size: 64, offset: 1280)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !889, file: !194, line: 3121, baseType: !718, size: 64, offset: 1344)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !889, file: !194, line: 3123, baseType: !718, size: 64, offset: 1408)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !720, file: !194, line: 3385, baseType: !917, size: 1088)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !194, line: 2874, size: 1088, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !917, file: !194, line: 2875, baseType: !884, size: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !917, file: !194, line: 2876, baseType: !604, size: 64, offset: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !917, file: !194, line: 2877, baseType: !922, size: 64, offset: 1024)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !194, line: 2856, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !720, file: !194, line: 3386, baseType: !892, size: 1216)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !720, file: !194, line: 3387, baseType: !926, size: 1280)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !194, line: 3093, size: 1280, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !926, file: !194, line: 3094, baseType: !892, size: 1216)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !926, file: !194, line: 3095, baseType: !922, size: 64, offset: 1216)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !720, file: !194, line: 3388, baseType: !931, size: 1216)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !194, line: 2824, size: 1216, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !931, file: !194, line: 2825, baseType: !846, size: 896)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !931, file: !194, line: 2827, baseType: !718, size: 64, offset: 896)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !931, file: !194, line: 2828, baseType: !718, size: 64, offset: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !931, file: !194, line: 2829, baseType: !718, size: 64, offset: 1024)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !931, file: !194, line: 2830, baseType: !718, size: 64, offset: 1088)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !931, file: !194, line: 2831, baseType: !718, size: 64, offset: 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !720, file: !194, line: 3389, baseType: !940, size: 1024)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !194, line: 2850, size: 1024, elements: !941)
!941 = !{!942, !943, !944}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !194, line: 2851, baseType: !884, size: 960)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !940, file: !194, line: 2852, baseType: !588, size: 32, offset: 960)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !940, file: !194, line: 2853, baseType: !588, size: 32, offset: 992)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !720, file: !194, line: 3390, baseType: !946, size: 1024)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !194, line: 2857, size: 1024, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !946, file: !194, line: 2858, baseType: !884, size: 960)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !946, file: !194, line: 2859, baseType: !922, size: 64, offset: 960)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !720, file: !194, line: 3391, baseType: !951, size: 960)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !194, line: 2862, size: 960, elements: !952)
!952 = !{!953}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !194, line: 2863, baseType: !884, size: 960)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !720, file: !194, line: 3392, baseType: !955, size: 1472)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !194, line: 3304, size: 1472, elements: !956)
!956 = !{!957}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !955, file: !194, line: 3305, baseType: !889, size: 1472)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !720, file: !194, line: 3393, baseType: !959, size: 1792)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !194, line: 3248, size: 1792, elements: !960)
!960 = !{!961, !962, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !959, file: !194, line: 3249, baseType: !889, size: 1472)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !959, file: !194, line: 3251, baseType: !963, size: 64, offset: 1472)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !965, line: 463, size: 1152, elements: !966)
!965 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!966 = !{!967, !970, !1130, !1131, !1134, !1193, !1194, !1195, !1196, !1197, !1198, !1222, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !964, file: !965, line: 464, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !965, line: 464, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !964, file: !965, line: 467, baseType: !971, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !179, line: 374, size: 640, elements: !973)
!973 = !{!974, !1105, !1106, !1119, !1120, !1121, !1122, !1123, !1124, !1126, !1128, !1129}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !972, file: !179, line: 377, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !605, line: 111, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !179, line: 217, size: 832, elements: !978)
!978 = !{!979, !1014, !1015, !1016, !1075, !1079, !1080, !1081, !1099, !1100, !1101, !1102, !1103, !1104}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !977, file: !179, line: 219, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !179, line: 151, baseType: !982)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !179, line: 151, size: 128, elements: !983)
!983 = !{!984}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !982, file: !179, line: 151, baseType: !985, size: 128)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !179, line: 150, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !179, line: 150, size: 128, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !986, file: !179, line: 150, baseType: !7, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !986, file: !179, line: 150, baseType: !7, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !986, file: !179, line: 150, baseType: !991, size: 64, offset: 64)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !992, size: 64, elements: !601)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !605, line: 108, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !179, line: 122, size: 512, elements: !995)
!995 = !{!996, !997, !998, !1006, !1007, !1008, !1009, !1010, !1011, !1012}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !994, file: !179, line: 124, baseType: !976, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !994, file: !179, line: 125, baseType: !976, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !994, file: !179, line: 131, baseType: !999, size: 64, offset: 128)
!999 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !179, line: 128, size: 64, elements: !1000)
!1000 = !{!1001, !1005}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !999, file: !179, line: 129, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !605, line: 66, baseType: !1003)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !605, line: 65, flags: DIFlagFwdDecl)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !999, file: !179, line: 130, baseType: !604, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !994, file: !179, line: 134, baseType: !592, size: 64, offset: 192)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !994, file: !179, line: 137, baseType: !718, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !994, file: !179, line: 138, baseType: !838, size: 32, offset: 320)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !994, file: !179, line: 142, baseType: !7, size: 32, offset: 352)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !994, file: !179, line: 144, baseType: !588, size: 32, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !994, file: !179, line: 145, baseType: !588, size: 32, offset: 416)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !994, file: !179, line: 146, baseType: !1013, size: 64, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !179, line: 119, baseType: !689)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !977, file: !179, line: 220, baseType: !980, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !977, file: !179, line: 223, baseType: !592, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !977, file: !179, line: 226, baseType: !1017, size: 64, offset: 192)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !166, line: 100, size: 1216, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1029, !1030, !1031, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1065, !1073, !1074}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1018, file: !166, line: 102, baseType: !588, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1018, file: !166, line: 105, baseType: !7, size: 32, offset: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1018, file: !166, line: 108, baseType: !976, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1018, file: !166, line: 111, baseType: !976, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1018, file: !166, line: 114, baseType: !1025, size: 64, offset: 192)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !166, line: 41, size: 64, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1025, file: !166, line: 42, baseType: !165, size: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1025, file: !166, line: 43, baseType: !7, size: 32, offset: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1018, file: !166, line: 117, baseType: !7, size: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1018, file: !166, line: 120, baseType: !7, size: 32, offset: 288)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1018, file: !166, line: 123, baseType: !1032, size: 64, offset: 320)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !166, line: 87, baseType: !1034)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !166, line: 87, size: 128, elements: !1035)
!1035 = !{!1036}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1034, file: !166, line: 87, baseType: !1037, size: 128)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !166, line: 85, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !166, line: 85, size: 128, elements: !1039)
!1039 = !{!1040, !1041, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1038, file: !166, line: 85, baseType: !7, size: 32)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1038, file: !166, line: 85, baseType: !7, size: 32, offset: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1038, file: !166, line: 85, baseType: !1043, size: 64, offset: 64)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1044, size: 64, elements: !601)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !166, line: 84, baseType: !1017)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1018, file: !166, line: 126, baseType: !1017, size: 64, offset: 384)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1018, file: !166, line: 129, baseType: !1017, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1018, file: !166, line: 132, baseType: !592, size: 64, offset: 512)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1018, file: !166, line: 139, baseType: !718, size: 64, offset: 576)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1018, file: !166, line: 143, baseType: !766, size: 128, offset: 640)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1018, file: !166, line: 146, baseType: !766, size: 128, offset: 768)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1018, file: !166, line: 148, baseType: !587, size: 8, offset: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1018, file: !166, line: 149, baseType: !587, size: 8, offset: 904)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1018, file: !166, line: 153, baseType: !174, size: 32, offset: 928)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1018, file: !166, line: 156, baseType: !1055, size: 64, offset: 960)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !166, line: 48, size: 320, elements: !1057)
!1057 = !{!1058, !1062, !1063, !1064}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1056, file: !166, line: 50, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !605, line: 58, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !605, line: 57, flags: DIFlagFwdDecl)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1056, file: !166, line: 59, baseType: !766, size: 128, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1056, file: !166, line: 64, baseType: !587, size: 8, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1056, file: !166, line: 67, baseType: !1055, size: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1018, file: !166, line: 159, baseType: !1066, size: 64, offset: 1024)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !166, line: 72, size: 256, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1067, file: !166, line: 74, baseType: !993, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1067, file: !166, line: 77, baseType: !1066, size: 64, offset: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1067, file: !166, line: 78, baseType: !1066, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1067, file: !166, line: 81, baseType: !1066, size: 64, offset: 192)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1018, file: !166, line: 162, baseType: !587, size: 8, offset: 1088)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1018, file: !166, line: 166, baseType: !718, size: 64, offset: 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !977, file: !179, line: 229, baseType: !1076, size: 128, offset: 256)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 128, elements: !673)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !179, line: 229, flags: DIFlagFwdDecl)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !977, file: !179, line: 232, baseType: !976, size: 64, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !977, file: !179, line: 233, baseType: !976, size: 64, offset: 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !977, file: !179, line: 238, baseType: !1082, size: 64, offset: 512)
!1082 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !179, line: 235, size: 64, elements: !1083)
!1083 = !{!1084, !1090}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1082, file: !179, line: 236, baseType: !1085, size: 64)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !179, line: 273, size: 128, elements: !1087)
!1087 = !{!1088, !1089}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1086, file: !179, line: 275, baseType: !1002, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1086, file: !179, line: 278, baseType: !1002, size: 64, offset: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1082, file: !179, line: 237, baseType: !1091, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !179, line: 259, size: 320, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097, !1098}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1092, file: !179, line: 261, baseType: !604, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1092, file: !179, line: 262, baseType: !604, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1092, file: !179, line: 266, baseType: !604, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1092, file: !179, line: 267, baseType: !604, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1092, file: !179, line: 270, baseType: !588, size: 32, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !977, file: !179, line: 241, baseType: !1013, size: 64, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !977, file: !179, line: 244, baseType: !588, size: 32, offset: 640)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !977, file: !179, line: 247, baseType: !588, size: 32, offset: 672)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !977, file: !179, line: 250, baseType: !588, size: 32, offset: 704)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !977, file: !179, line: 253, baseType: !588, size: 32, offset: 736)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !977, file: !179, line: 256, baseType: !588, size: 32, offset: 768)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !972, file: !179, line: 378, baseType: !975, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !972, file: !179, line: 381, baseType: !1107, size: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !179, line: 282, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !179, line: 282, size: 128, elements: !1110)
!1110 = !{!1111}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1109, file: !179, line: 282, baseType: !1112, size: 128)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !179, line: 281, baseType: !1113)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !179, line: 281, size: 128, elements: !1114)
!1114 = !{!1115, !1116, !1117}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1113, file: !179, line: 281, baseType: !7, size: 32)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1113, file: !179, line: 281, baseType: !7, size: 32, offset: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1113, file: !179, line: 281, baseType: !1118, size: 64, offset: 64)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 64, elements: !601)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !972, file: !179, line: 384, baseType: !588, size: 32, offset: 192)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !972, file: !179, line: 387, baseType: !588, size: 32, offset: 224)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !972, file: !179, line: 390, baseType: !588, size: 32, offset: 256)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !972, file: !179, line: 394, baseType: !1107, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !972, file: !179, line: 396, baseType: !178, size: 32, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !972, file: !179, line: 399, baseType: !1125, size: 64, offset: 416)
!1125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !184, size: 64, elements: !673)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !972, file: !179, line: 402, baseType: !1127, size: 64, offset: 480)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !673)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !972, file: !179, line: 406, baseType: !588, size: 32, offset: 544)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !972, file: !179, line: 409, baseType: !588, size: 32, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !964, file: !965, line: 470, baseType: !1003, size: 64, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !964, file: !965, line: 473, baseType: !1132, size: 64, offset: 192)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !965, line: 166, flags: DIFlagFwdDecl)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !964, file: !965, line: 476, baseType: !1135, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !166, line: 187, size: 256, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1192}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1136, file: !166, line: 189, baseType: !588, size: 32)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1136, file: !166, line: 192, baseType: !1032, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1136, file: !166, line: 197, baseType: !1141, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1142, line: 144, baseType: !1143)
!1142 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1142, line: 100, size: 896, elements: !1145)
!1145 = !{!1146, !1154, !1159, !1164, !1166, !1169, !1170, !1171, !1172, !1173, !1178, !1180, !1181, !1186, !1191}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1144, file: !1142, line: 102, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1142, line: 52, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DISubroutineType(types: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1142, line: 47, baseType: !7)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1144, file: !1142, line: 105, baseType: !1155, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1142, line: 59, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{!588, !1152, !1152}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1144, file: !1142, line: 108, baseType: !1160, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1142, line: 63, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{null, !592}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1144, file: !1142, line: 111, baseType: !1165, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1144, file: !1142, line: 114, baseType: !1167, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1168, line: 46, baseType: !672)
!1168 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1144, file: !1142, line: 117, baseType: !1167, size: 64, offset: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1144, file: !1142, line: 120, baseType: !1167, size: 64, offset: 384)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1144, file: !1142, line: 124, baseType: !7, size: 32, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1144, file: !1142, line: 128, baseType: !7, size: 32, offset: 480)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1144, file: !1142, line: 131, baseType: !1174, size: 64, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1142, line: 75, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DISubroutineType(types: !1177)
!1177 = !{!592, !1167, !1167}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1144, file: !1142, line: 132, baseType: !1179, size: 64, offset: 576)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1142, line: 78, baseType: !1161)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1144, file: !1142, line: 135, baseType: !592, size: 64, offset: 640)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1144, file: !1142, line: 136, baseType: !1182, size: 64, offset: 704)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1142, line: 82, baseType: !1183)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = !DISubroutineType(types: !1185)
!1185 = !{!592, !592, !1167, !1167}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1144, file: !1142, line: 137, baseType: !1187, size: 64, offset: 768)
!1187 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1142, line: 83, baseType: !1188)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DISubroutineType(types: !1190)
!1190 = !{null, !592, !592}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1144, file: !1142, line: 141, baseType: !7, size: 32, offset: 832)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1136, file: !166, line: 200, baseType: !1017, size: 64, offset: 192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !964, file: !965, line: 479, baseType: !1141, size: 64, offset: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !964, file: !965, line: 484, baseType: !718, size: 64, offset: 384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !964, file: !965, line: 488, baseType: !718, size: 64, offset: 448)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !964, file: !965, line: 493, baseType: !718, size: 64, offset: 512)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !964, file: !965, line: 496, baseType: !718, size: 64, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !964, file: !965, line: 501, baseType: !1199, size: 64, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !6, line: 2355, size: 576, elements: !1201)
!1201 = !{!1202, !1205, !1206, !1207, !1208, !1210, !1211, !1216, !1217, !1218, !1219, !1220, !1221}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1200, file: !6, line: 2356, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !6, line: 2356, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1200, file: !6, line: 2357, baseType: !593, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1200, file: !6, line: 2358, baseType: !588, size: 32, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1200, file: !6, line: 2359, baseType: !588, size: 32, offset: 160)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1200, file: !6, line: 2360, baseType: !1209, size: 128, offset: 192)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 128, elements: !698)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1200, file: !6, line: 2364, baseType: !588, size: 32, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1200, file: !6, line: 2367, baseType: !1212, size: 128, offset: 384)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !6, line: 2349, size: 128, elements: !1213)
!1213 = !{!1214, !1215}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1212, file: !6, line: 2351, baseType: !604, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1212, file: !6, line: 2352, baseType: !689, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1200, file: !6, line: 2371, baseType: !189, size: 32, offset: 512)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1200, file: !6, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1200, file: !6, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1200, file: !6, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1200, file: !6, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1200, file: !6, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !964, file: !965, line: 504, baseType: !1223, size: 64, offset: 704)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !965, line: 504, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !964, file: !965, line: 507, baseType: !1141, size: 64, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !964, file: !965, line: 510, baseType: !588, size: 32, offset: 832)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !964, file: !965, line: 513, baseType: !588, size: 32, offset: 864)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !964, file: !965, line: 516, baseType: !838, size: 32, offset: 896)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !964, file: !965, line: 519, baseType: !838, size: 32, offset: 928)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !964, file: !965, line: 522, baseType: !7, size: 32, offset: 960)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !964, file: !965, line: 523, baseType: !7, size: 32, offset: 992)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !964, file: !965, line: 528, baseType: !593, size: 64, offset: 1024)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !964, file: !965, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !964, file: !965, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !964, file: !965, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !964, file: !965, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !964, file: !965, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !964, file: !965, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !964, file: !965, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !964, file: !965, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !964, file: !965, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !964, file: !965, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !964, file: !965, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !964, file: !965, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !964, file: !965, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !964, file: !965, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !964, file: !965, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !964, file: !965, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !959, file: !194, line: 3254, baseType: !718, size: 64, offset: 1536)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !959, file: !194, line: 3257, baseType: !718, size: 64, offset: 1600)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !959, file: !194, line: 3258, baseType: !718, size: 64, offset: 1664)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !959, file: !194, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !959, file: !194, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !959, file: !194, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !959, file: !194, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !959, file: !194, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !959, file: !194, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !959, file: !194, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !959, file: !194, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !959, file: !194, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !959, file: !194, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !959, file: !194, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !959, file: !194, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !959, file: !194, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !959, file: !194, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !959, file: !194, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !959, file: !194, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !959, file: !194, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !959, file: !194, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !194, line: 3394, baseType: !1271, size: 1344)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !194, line: 2279, size: 1344, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1298, !1299, !1300, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1271, file: !194, line: 2280, baseType: !756, size: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1271, file: !194, line: 2281, baseType: !718, size: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1271, file: !194, line: 2282, baseType: !718, size: 64, offset: 256)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1271, file: !194, line: 2283, baseType: !718, size: 64, offset: 320)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1271, file: !194, line: 2284, baseType: !718, size: 64, offset: 384)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1271, file: !194, line: 2285, baseType: !7, size: 32, offset: 448)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1271, file: !194, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1271, file: !194, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1271, file: !194, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1271, file: !194, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1271, file: !194, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1271, file: !194, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1271, file: !194, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1271, file: !194, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1271, file: !194, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1271, file: !194, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1271, file: !194, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1271, file: !194, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1271, file: !194, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1271, file: !194, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1271, file: !194, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1271, file: !194, line: 2305, baseType: !7, size: 32, offset: 512)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1271, file: !194, line: 2306, baseType: !1296, size: 32, offset: 544)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1297, line: 31, baseType: !588)
!1297 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1271, file: !194, line: 2307, baseType: !718, size: 64, offset: 576)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1271, file: !194, line: 2308, baseType: !718, size: 64, offset: 640)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1271, file: !194, line: 2314, baseType: !1301, size: 64, offset: 704)
!1301 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !194, line: 2309, size: 64, elements: !1302)
!1302 = !{!1303, !1304, !1305}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1301, file: !194, line: 2310, baseType: !588, size: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1301, file: !194, line: 2311, baseType: !593, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1301, file: !194, line: 2312, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !194, line: 2277, flags: DIFlagFwdDecl)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1271, file: !194, line: 2315, baseType: !718, size: 64, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1271, file: !194, line: 2316, baseType: !718, size: 64, offset: 832)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1271, file: !194, line: 2317, baseType: !718, size: 64, offset: 896)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1271, file: !194, line: 2318, baseType: !718, size: 64, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1271, file: !194, line: 2319, baseType: !718, size: 64, offset: 1024)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1271, file: !194, line: 2320, baseType: !718, size: 64, offset: 1088)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1271, file: !194, line: 2321, baseType: !718, size: 64, offset: 1152)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1271, file: !194, line: 2322, baseType: !718, size: 64, offset: 1216)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1271, file: !194, line: 2324, baseType: !1317, size: 64, offset: 1280)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !194, line: 2324, flags: DIFlagFwdDecl)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !720, file: !194, line: 3395, baseType: !1320, size: 320)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !194, line: 1469, size: 320, elements: !1321)
!1321 = !{!1322, !1323, !1324}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1320, file: !194, line: 1470, baseType: !756, size: 192)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1320, file: !194, line: 1471, baseType: !718, size: 64, offset: 192)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1320, file: !194, line: 1472, baseType: !718, size: 64, offset: 256)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !720, file: !194, line: 3396, baseType: !1326, size: 320)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !194, line: 1482, size: 320, elements: !1327)
!1327 = !{!1328, !1329, !1330}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1326, file: !194, line: 1483, baseType: !756, size: 192)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1326, file: !194, line: 1484, baseType: !588, size: 32, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1326, file: !194, line: 1485, baseType: !1331, size: 64, offset: 256)
!1331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 64, elements: !601)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !720, file: !194, line: 3397, baseType: !1333, size: 384)
