; ModuleID = 'ira.bc'
source_filename = "ira.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }

!813 = !{!814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!814 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!815 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!816 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!817 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!818 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!819 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!820 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!821 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!822 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!823 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!824 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!825 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!826 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!827 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!828 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!829 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!830 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!831 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!832 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!833 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!834 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!835 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!836 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!837 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!838 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!839 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!840 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!841 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!842 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!843 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!844 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!845 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!846 = !{!847, !848, !849, !850, !853, !854, !856, !851, !863, !5, !397, !610, !866, !647, !860, !669, !868, !938, !2103, !2112, !812, !939, !873, !2121, !7, !2088, !2128, !2139, !865}
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!849 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !852)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_table", file: !858, line: 269, baseType: !859)
!858 = !DIFile(filename: "./regs.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !860, size: 432, elements: !861)
!860 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!861 = !{!862}
!862 = !DISubrange(count: 27)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !864, line: 42, baseType: !865)
!864 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!865 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_lr_bb_info", file: !870, line: 826, size: 256, elements: !871)
!870 = !DIFile(filename: "./df.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!871 = !{!872, !935, !936, !937}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !869, file: !870, line: 829, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !874, line: 47, baseType: !875)
!874 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !877, line: 75, size: 256, elements: !878)
!877 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!878 = !{!879, !893, !894, !895}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !876, file: !877, line: 76, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !877, line: 68, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !877, line: 63, size: 320, elements: !883)
!883 = !{!884, !886, !887, !888}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !882, file: !877, line: 64, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !882, file: !877, line: 65, baseType: !885, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !882, file: !877, line: 66, baseType: !7, size: 32, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !882, file: !877, line: 67, baseType: !889, size: 128, offset: 192)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 128, elements: !891)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !877, line: 29, baseType: !865)
!891 = !{!892}
!892 = !DISubrange(count: 2)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !876, file: !877, line: 77, baseType: !880, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !876, file: !877, line: 78, baseType: !7, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !876, file: !877, line: 79, baseType: !896, size: 64, offset: 192)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !877, line: 49, baseType: !898)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !877, line: 45, size: 832, elements: !899)
!899 = !{!900, !901, !902}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !898, file: !877, line: 46, baseType: !885, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !898, file: !877, line: 47, baseType: !875, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !898, file: !877, line: 48, baseType: !903, size: 704, offset: 128)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !904, line: 164, size: 704, elements: !905)
!904 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!905 = !{!906, !908, !918, !919, !920, !921, !922, !923, !927, !931, !932, !933, !934}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !903, file: !904, line: 166, baseType: !907, size: 64)
!907 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !903, file: !904, line: 167, baseType: !909, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !904, line: 157, size: 192, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !910, file: !904, line: 159, baseType: !851, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !910, file: !904, line: 160, baseType: !909, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !910, file: !904, line: 161, baseType: !915, size: 32, offset: 128)
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 32, elements: !916)
!916 = !{!917}
!917 = !DISubrange(count: 4)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !903, file: !904, line: 168, baseType: !851, size: 64, offset: 128)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !903, file: !904, line: 169, baseType: !851, size: 64, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !903, file: !904, line: 170, baseType: !851, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !903, file: !904, line: 171, baseType: !907, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !903, file: !904, line: 172, baseType: !849, size: 32, offset: 384)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !903, file: !904, line: 176, baseType: !924, size: 64, offset: 448)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{!909, !853, !907}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !903, file: !904, line: 177, baseType: !928, size: 64, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{null, !853, !909}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !903, file: !904, line: 178, baseType: !853, size: 64, offset: 576)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !903, file: !904, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !903, file: !904, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !903, file: !904, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !869, file: !870, line: 831, baseType: !873, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !869, file: !870, line: 834, baseType: !873, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !869, file: !870, line: 835, baseType: !873, size: 64, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !874, line: 50, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !670, line: 240, size: 384, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !941, file: !670, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !941, file: !670, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !941, file: !670, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !941, file: !670, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !941, file: !670, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !941, file: !670, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !941, file: !670, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !941, file: !670, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !941, file: !670, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !941, file: !670, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !941, file: !670, line: 321, baseType: !954, size: 320, offset: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !670, line: 315, size: 320, elements: !955)
!955 = !{!956, !2038, !2040, !2101, !2102}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !954, file: !670, line: 316, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !958, size: 64, elements: !973)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !670, line: 183, baseType: !959)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !670, line: 166, size: 64, elements: !960)
!960 = !{!961, !962, !963, !964, !965, !975, !976, !988, !991, !992, !2016, !2017, !2028, !2035}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !959, file: !670, line: 168, baseType: !849, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !959, file: !670, line: 169, baseType: !7, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !959, file: !670, line: 170, baseType: !854, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !959, file: !670, line: 171, baseType: !939, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !959, file: !670, line: 172, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !874, line: 53, baseType: !967)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !670, line: 359, size: 128, elements: !969)
!969 = !{!970, !971}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !968, file: !670, line: 360, baseType: !849, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !968, file: !670, line: 361, baseType: !972, size: 64, offset: 64)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 64, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 1)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !959, file: !670, line: 173, baseType: !5, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !959, file: !670, line: 174, baseType: !977, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !670, line: 133, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !670, line: 115, size: 32, elements: !979)
!979 = !{!980, !981, !982, !983, !984, !985, !986, !987}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !978, file: !670, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !978, file: !670, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !978, file: !670, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !978, file: !670, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !978, file: !670, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !978, file: !670, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !978, file: !670, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !978, file: !670, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !959, file: !670, line: 175, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !670, line: 175, flags: DIFlagFwdDecl)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !959, file: !670, line: 176, baseType: !875, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !959, file: !670, line: 177, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !874, line: 56, baseType: !994)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !171, line: 3371, size: 1792, elements: !996)
!996 = !{!997, !1030, !1036, !1047, !1066, !1077, !1082, !1089, !1095, !1108, !1120, !1158, !1163, !1191, !1199, !1200, !1205, !1214, !1220, !1225, !1229, !1233, !1655, !1704, !1710, !1716, !1723, !1746, !1760, !1777, !1789, !1811, !1826, !1998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !995, file: !171, line: 3372, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !171, line: 360, size: 64, elements: !999)
!999 = !{!1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !998, file: !171, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !998, file: !171, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !998, file: !171, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !998, file: !171, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !998, file: !171, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !998, file: !171, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !998, file: !171, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !998, file: !171, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !998, file: !171, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !998, file: !171, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !998, file: !171, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !998, file: !171, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !998, file: !171, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !998, file: !171, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !998, file: !171, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !998, file: !171, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !998, file: !171, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !998, file: !171, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !998, file: !171, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !998, file: !171, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !998, file: !171, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !998, file: !171, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !998, file: !171, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !998, file: !171, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !998, file: !171, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !998, file: !171, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !998, file: !171, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !998, file: !171, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !998, file: !171, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !998, file: !171, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !995, file: !171, line: 3373, baseType: !1031, size: 192)
!1031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !171, line: 402, size: 192, elements: !1032)
!1032 = !{!1033, !1034, !1035}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1031, file: !171, line: 403, baseType: !998, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1031, file: !171, line: 404, baseType: !993, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1031, file: !171, line: 405, baseType: !993, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !995, file: !171, line: 3374, baseType: !1037, size: 320)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !171, line: 1384, size: 320, elements: !1038)
!1038 = !{!1039, !1040}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1037, file: !171, line: 1385, baseType: !1031, size: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1037, file: !171, line: 1386, baseType: !1041, size: 128, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1042, line: 58, baseType: !1043)
!1042 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1042, line: 54, size: 128, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1043, file: !1042, line: 56, baseType: !865, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1043, file: !1042, line: 57, baseType: !907, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !995, file: !171, line: 3375, baseType: !1048, size: 256)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !171, line: 1397, size: 256, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1048, file: !171, line: 1398, baseType: !1031, size: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1048, file: !171, line: 1399, baseType: !1052, size: 64, offset: 192)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1054, line: 52, size: 256, elements: !1055)
!1054 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1055 = !{!1056, !1057, !1058, !1059, !1060, !1061, !1062}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1053, file: !1054, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1053, file: !1054, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1053, file: !1054, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1053, file: !1054, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1053, file: !1054, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1053, file: !1054, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1053, file: !1054, line: 62, baseType: !1063, size: 192, offset: 64)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !865, size: 192, elements: !1064)
!1064 = !{!1065}
!1065 = !DISubrange(count: 3)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !995, file: !171, line: 3376, baseType: !1067, size: 256)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !171, line: 1408, size: 256, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !171, line: 1409, baseType: !1031, size: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1067, file: !171, line: 1410, baseType: !1071, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1073, line: 27, size: 192, elements: !1074)
!1073 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1072, file: !1073, line: 29, baseType: !1041, size: 128)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1072, file: !1073, line: 30, baseType: !5, size: 32, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !995, file: !171, line: 3377, baseType: !1078, size: 256)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !171, line: 1437, size: 256, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !171, line: 1438, baseType: !1031, size: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1078, file: !171, line: 1439, baseType: !993, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !995, file: !171, line: 3378, baseType: !1083, size: 256)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !171, line: 1418, size: 256, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1083, file: !171, line: 1419, baseType: !1031, size: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1083, file: !171, line: 1420, baseType: !849, size: 32, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1083, file: !171, line: 1421, baseType: !1088, size: 8, offset: 224)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 8, elements: !973)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !995, file: !171, line: 3379, baseType: !1090, size: 320)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !171, line: 1428, size: 320, elements: !1091)
!1091 = !{!1092, !1093, !1094}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !171, line: 1429, baseType: !1031, size: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1090, file: !171, line: 1430, baseType: !993, size: 64, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1090, file: !171, line: 1431, baseType: !993, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !995, file: !171, line: 3380, baseType: !1096, size: 320)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !171, line: 1460, size: 320, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !171, line: 1461, baseType: !1031, size: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1096, file: !171, line: 1462, baseType: !1100, size: 128, offset: 192)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1101, line: 31, size: 128, elements: !1102)
!1101 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1102 = !{!1103, !1106, !1107}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1100, file: !1101, line: 32, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !848)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1100, file: !1101, line: 33, baseType: !7, size: 32, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1100, file: !1101, line: 34, baseType: !7, size: 32, offset: 96)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !995, file: !171, line: 3381, baseType: !1109, size: 384)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !171, line: 2507, size: 384, elements: !1110)
!1110 = !{!1111, !1112, !1117, !1118, !1119}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !171, line: 2508, baseType: !1031, size: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1109, file: !171, line: 2509, baseType: !1113, size: 32, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1114, line: 58, baseType: !1115)
!1114 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1116, line: 44, baseType: !7)
!1116 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1109, file: !171, line: 2510, baseType: !7, size: 32, offset: 224)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1109, file: !171, line: 2511, baseType: !993, size: 64, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1109, file: !171, line: 2512, baseType: !993, size: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !995, file: !171, line: 3382, baseType: !1121, size: 896)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !171, line: 2652, size: 896, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1121, file: !171, line: 2653, baseType: !1109, size: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1121, file: !171, line: 2654, baseType: !993, size: 64, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1121, file: !171, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1121, file: !171, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1121, file: !171, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1121, file: !171, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1121, file: !171, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1121, file: !171, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1121, file: !171, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1121, file: !171, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1121, file: !171, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1121, file: !171, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1121, file: !171, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1121, file: !171, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1121, file: !171, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1121, file: !171, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1121, file: !171, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1121, file: !171, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1121, file: !171, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1121, file: !171, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1121, file: !171, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1121, file: !171, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1121, file: !171, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1121, file: !171, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1121, file: !171, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1121, file: !171, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1121, file: !171, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1121, file: !171, line: 2703, baseType: !7, size: 32, offset: 512)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1121, file: !171, line: 2705, baseType: !993, size: 64, offset: 576)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1121, file: !171, line: 2706, baseType: !993, size: 64, offset: 640)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1121, file: !171, line: 2707, baseType: !993, size: 64, offset: 704)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1121, file: !171, line: 2708, baseType: !993, size: 64, offset: 768)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1121, file: !171, line: 2711, baseType: !1156, size: 64, offset: 832)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !171, line: 2711, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !995, file: !171, line: 3383, baseType: !1159, size: 960)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !171, line: 2756, size: 960, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1159, file: !171, line: 2757, baseType: !1121, size: 896)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1159, file: !171, line: 2758, baseType: !939, size: 64, offset: 896)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !995, file: !171, line: 3384, baseType: !1164, size: 1472)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !171, line: 3114, size: 1472, elements: !1165)
!1165 = !{!1166, !1187, !1188, !1189, !1190}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1164, file: !171, line: 3115, baseType: !1167, size: 1216)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !171, line: 2984, size: 1216, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !171, line: 2985, baseType: !1159, size: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1167, file: !171, line: 2986, baseType: !993, size: 64, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1167, file: !171, line: 2987, baseType: !993, size: 64, offset: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1167, file: !171, line: 2988, baseType: !993, size: 64, offset: 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1167, file: !171, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1167, file: !171, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1167, file: !171, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1167, file: !171, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1167, file: !171, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1167, file: !171, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1167, file: !171, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1167, file: !171, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1167, file: !171, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1167, file: !171, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1167, file: !171, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1167, file: !171, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1167, file: !171, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1167, file: !171, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1164, file: !171, line: 3117, baseType: !993, size: 64, offset: 1216)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1164, file: !171, line: 3119, baseType: !993, size: 64, offset: 1280)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1164, file: !171, line: 3121, baseType: !993, size: 64, offset: 1344)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1164, file: !171, line: 3123, baseType: !993, size: 64, offset: 1408)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !995, file: !171, line: 3385, baseType: !1192, size: 1088)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !171, line: 2874, size: 1088, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1192, file: !171, line: 2875, baseType: !1159, size: 960)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1192, file: !171, line: 2876, baseType: !939, size: 64, offset: 960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1192, file: !171, line: 2877, baseType: !1197, size: 64, offset: 1024)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !171, line: 2856, flags: DIFlagFwdDecl)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !995, file: !171, line: 3386, baseType: !1167, size: 1216)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !995, file: !171, line: 3387, baseType: !1201, size: 1280)
!1201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !171, line: 3093, size: 1280, elements: !1202)
!1202 = !{!1203, !1204}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1201, file: !171, line: 3094, baseType: !1167, size: 1216)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1201, file: !171, line: 3095, baseType: !1197, size: 64, offset: 1216)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !995, file: !171, line: 3388, baseType: !1206, size: 1216)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !171, line: 2824, size: 1216, elements: !1207)
!1207 = !{!1208, !1209, !1210, !1211, !1212, !1213}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1206, file: !171, line: 2825, baseType: !1121, size: 896)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1206, file: !171, line: 2827, baseType: !993, size: 64, offset: 896)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1206, file: !171, line: 2828, baseType: !993, size: 64, offset: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1206, file: !171, line: 2829, baseType: !993, size: 64, offset: 1024)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1206, file: !171, line: 2830, baseType: !993, size: 64, offset: 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1206, file: !171, line: 2831, baseType: !993, size: 64, offset: 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !995, file: !171, line: 3389, baseType: !1215, size: 1024)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !171, line: 2850, size: 1024, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1215, file: !171, line: 2851, baseType: !1159, size: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1215, file: !171, line: 2852, baseType: !849, size: 32, offset: 960)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1215, file: !171, line: 2853, baseType: !849, size: 32, offset: 992)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !995, file: !171, line: 3390, baseType: !1221, size: 1024)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !171, line: 2857, size: 1024, elements: !1222)
!1222 = !{!1223, !1224}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1221, file: !171, line: 2858, baseType: !1159, size: 960)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1221, file: !171, line: 2859, baseType: !1197, size: 64, offset: 960)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !995, file: !171, line: 3391, baseType: !1226, size: 960)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !171, line: 2862, size: 960, elements: !1227)
!1227 = !{!1228}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1226, file: !171, line: 2863, baseType: !1159, size: 960)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !995, file: !171, line: 3392, baseType: !1230, size: 1472)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !171, line: 3304, size: 1472, elements: !1231)
!1231 = !{!1232}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1230, file: !171, line: 3305, baseType: !1164, size: 1472)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !995, file: !171, line: 3393, baseType: !1234, size: 1792)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !171, line: 3248, size: 1792, elements: !1235)
!1235 = !{!1236, !1237, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1234, file: !171, line: 3249, baseType: !1164, size: 1472)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1234, file: !171, line: 3251, baseType: !1238, size: 64, offset: 1472)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1240, line: 463, size: 1152, elements: !1241)
!1240 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1241 = !{!1242, !1406, !1566, !1567, !1570, !1578, !1579, !1580, !1581, !1582, !1583, !1607, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1239, file: !1240, line: 464, baseType: !1243, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1245)
!1245 = !{!1246, !1295, !1308, !1322, !1374, !1387}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1244, file: !135, line: 197, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1283, !1292, !1293, !1294}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1249, file: !135, line: 119, baseType: !1248, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1249, file: !135, line: 122, baseType: !1248, size: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1249, file: !135, line: 123, baseType: !1248, size: 64, offset: 128)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1249, file: !135, line: 126, baseType: !849, size: 32, offset: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1249, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1249, file: !135, line: 165, baseType: !1257, size: 192, offset: 256)
!1257 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1258)
!1258 = !{!1259, !1272, !1278}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1257, file: !135, line: 137, baseType: !1260, size: 128)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1261)
!1261 = !{!1262, !1271}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1260, file: !135, line: 135, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1269, !1270}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1264, file: !135, line: 96, baseType: !1263, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1264, file: !135, line: 97, baseType: !1263, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1264, file: !135, line: 101, baseType: !993, size: 64, offset: 128)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1264, file: !135, line: 106, baseType: !993, size: 64, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1264, file: !135, line: 111, baseType: !993, size: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1260, file: !135, line: 136, baseType: !1263, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1257, file: !135, line: 151, baseType: !1273, size: 192)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1274)
!1274 = !{!1275, !1276, !1277}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1273, file: !135, line: 141, baseType: !993, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1273, file: !135, line: 145, baseType: !993, size: 64, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1273, file: !135, line: 150, baseType: !849, size: 32, offset: 128)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1257, file: !135, line: 164, baseType: !1279, size: 128)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1280)
!1280 = !{!1281, !1282}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1279, file: !135, line: 161, baseType: !993, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1279, file: !135, line: 163, baseType: !1113, size: 32, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1249, file: !135, line: 168, baseType: !1284, size: 64, offset: 448)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1290, !1291}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1285, file: !135, line: 70, baseType: !1284, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1285, file: !135, line: 73, baseType: !1248, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1285, file: !135, line: 78, baseType: !993, size: 64, offset: 128)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1285, file: !135, line: 85, baseType: !939, size: 64, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1285, file: !135, line: 88, baseType: !849, size: 32, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1249, file: !135, line: 173, baseType: !939, size: 64, offset: 512)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1249, file: !135, line: 173, baseType: !939, size: 64, offset: 576)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1249, file: !135, line: 177, baseType: !848, size: 8, offset: 640)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1244, file: !135, line: 200, baseType: !1296, size: 64, offset: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1299)
!1299 = !{!1300}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1298, file: !135, line: 185, baseType: !1301, size: 128)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1303)
!1303 = !{!1304, !1305, !1306}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1302, file: !135, line: 184, baseType: !7, size: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1302, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1302, file: !135, line: 184, baseType: !1307, size: 64, offset: 64)
!1307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1247, size: 64, elements: !973)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1244, file: !135, line: 203, baseType: !1309, size: 64, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1311)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1312)
!1312 = !{!1313}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1311, file: !135, line: 189, baseType: !1314, size: 128)
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1315)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1316)
!1316 = !{!1317, !1318, !1319}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1315, file: !135, line: 188, baseType: !7, size: 32)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1315, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1315, file: !135, line: 188, baseType: !1320, size: 64, offset: 64)
!1320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1321, size: 64, elements: !973)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1284)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1244, file: !135, line: 207, baseType: !1323, size: 64, offset: 192)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1324, line: 144, baseType: !1325)
!1324 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1326, size: 64)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1324, line: 100, size: 896, elements: !1327)
!1327 = !{!1328, !1336, !1341, !1346, !1348, !1351, !1352, !1353, !1354, !1355, !1360, !1362, !1363, !1368, !1373}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1326, file: !1324, line: 102, baseType: !1329, size: 64)
!1329 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1324, line: 52, baseType: !1330)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DISubroutineType(types: !1332)
!1332 = !{!1333, !1334}
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1324, line: 47, baseType: !7)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1326, file: !1324, line: 105, baseType: !1337, size: 64, offset: 64)
!1337 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1324, line: 59, baseType: !1338)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DISubroutineType(types: !1340)
!1340 = !{!849, !1334, !1334}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1326, file: !1324, line: 108, baseType: !1342, size: 64, offset: 128)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1324, line: 63, baseType: !1343)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DISubroutineType(types: !1345)
!1345 = !{null, !853}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1326, file: !1324, line: 111, baseType: !1347, size: 64, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1326, file: !1324, line: 114, baseType: !1349, size: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1350, line: 46, baseType: !865)
!1350 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1326, file: !1324, line: 117, baseType: !1349, size: 64, offset: 320)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1326, file: !1324, line: 120, baseType: !1349, size: 64, offset: 384)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1326, file: !1324, line: 124, baseType: !7, size: 32, offset: 448)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1326, file: !1324, line: 128, baseType: !7, size: 32, offset: 480)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1326, file: !1324, line: 131, baseType: !1356, size: 64, offset: 512)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1324, line: 75, baseType: !1357)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = !DISubroutineType(types: !1359)
!1359 = !{!853, !1349, !1349}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1326, file: !1324, line: 132, baseType: !1361, size: 64, offset: 576)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1324, line: 78, baseType: !1343)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1326, file: !1324, line: 135, baseType: !853, size: 64, offset: 640)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1326, file: !1324, line: 136, baseType: !1364, size: 64, offset: 704)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1324, line: 82, baseType: !1365)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = !DISubroutineType(types: !1367)
!1367 = !{!853, !853, !1349, !1349}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1326, file: !1324, line: 137, baseType: !1369, size: 64, offset: 768)
!1369 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1324, line: 83, baseType: !1370)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = !DISubroutineType(types: !1372)
!1372 = !{null, !853, !853}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1326, file: !1324, line: 141, baseType: !7, size: 32, offset: 832)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1244, file: !135, line: 211, baseType: !1375, size: 64, offset: 256)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !171, line: 183, baseType: !1377)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !171, line: 183, size: 128, elements: !1378)
!1378 = !{!1379}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1377, file: !171, line: 183, baseType: !1380, size: 128)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !171, line: 182, baseType: !1381)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !171, line: 182, size: 128, elements: !1382)
!1382 = !{!1383, !1384, !1385}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1381, file: !171, line: 182, baseType: !7, size: 32)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1381, file: !171, line: 182, baseType: !7, size: 32, offset: 32)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1381, file: !171, line: 182, baseType: !1386, size: 64, offset: 64)
!1386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !993, size: 64, elements: !973)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1244, file: !135, line: 220, baseType: !1388, size: 64, offset: 320)
!1388 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1389)
!1389 = !{!1390, !1391}
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1388, file: !135, line: 218, baseType: !1375, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1388, file: !135, line: 219, baseType: !1392, size: 64)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1394, line: 29, baseType: !1395)
!1394 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1394, line: 29, size: 96, elements: !1396)
!1396 = !{!1397}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1395, file: !1394, line: 29, baseType: !1398, size: 96)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1394, line: 27, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1394, line: 27, size: 96, elements: !1400)
!1400 = !{!1401, !1402, !1403}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1399, file: !1394, line: 27, baseType: !7, size: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1399, file: !1394, line: 27, baseType: !7, size: 32, offset: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1399, file: !1394, line: 27, baseType: !1404, size: 8, offset: 64)
!1404 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1405, size: 8, elements: !973)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1394, line: 26, baseType: !848)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1239, file: !1240, line: 467, baseType: !1407, size: 64, offset: 64)
!1407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1408, size: 64)
!1408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !155, line: 374, size: 640, elements: !1409)
!1409 = !{!1410, !1541, !1542, !1555, !1556, !1557, !1558, !1559, !1560, !1562, !1564, !1565}
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1408, file: !155, line: 377, baseType: !1411, size: 64)
!1411 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !874, line: 111, baseType: !1412)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !155, line: 217, size: 832, elements: !1414)
!1414 = !{!1415, !1450, !1451, !1452, !1511, !1515, !1516, !1517, !1535, !1536, !1537, !1538, !1539, !1540}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1413, file: !155, line: 219, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1417, size: 64)
!1417 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !155, line: 151, baseType: !1418)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !155, line: 151, size: 128, elements: !1419)
!1419 = !{!1420}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1418, file: !155, line: 151, baseType: !1421, size: 128)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !155, line: 150, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !155, line: 150, size: 128, elements: !1423)
!1423 = !{!1424, !1425, !1426}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1422, file: !155, line: 150, baseType: !7, size: 32)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1422, file: !155, line: 150, baseType: !7, size: 32, offset: 32)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1422, file: !155, line: 150, baseType: !1427, size: 64, offset: 64)
!1427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1428, size: 64, elements: !973)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !874, line: 108, baseType: !1429)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !155, line: 122, size: 512, elements: !1431)
!1431 = !{!1432, !1433, !1434, !1442, !1443, !1444, !1445, !1446, !1447, !1448}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1430, file: !155, line: 124, baseType: !1412, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1430, file: !155, line: 125, baseType: !1412, size: 64, offset: 64)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1430, file: !155, line: 131, baseType: !1435, size: 64, offset: 128)
!1435 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !155, line: 128, size: 64, elements: !1436)
!1436 = !{!1437, !1441}
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1435, file: !155, line: 129, baseType: !1438, size: 64)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !874, line: 66, baseType: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !874, line: 65, flags: DIFlagFwdDecl)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1435, file: !155, line: 130, baseType: !939, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1430, file: !155, line: 134, baseType: !853, size: 64, offset: 192)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1430, file: !155, line: 137, baseType: !993, size: 64, offset: 256)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1430, file: !155, line: 138, baseType: !1113, size: 32, offset: 320)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1430, file: !155, line: 142, baseType: !7, size: 32, offset: 352)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1430, file: !155, line: 144, baseType: !849, size: 32, offset: 384)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1430, file: !155, line: 145, baseType: !849, size: 32, offset: 416)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1430, file: !155, line: 146, baseType: !1449, size: 64, offset: 448)
!1449 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !155, line: 119, baseType: !907)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1413, file: !155, line: 220, baseType: !1416, size: 64, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1413, file: !155, line: 223, baseType: !853, size: 64, offset: 128)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1413, file: !155, line: 226, baseType: !1453, size: 64, offset: 192)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 100, size: 1216, elements: !1455)
!1455 = !{!1456, !1457, !1458, !1459, !1460, !1465, !1466, !1467, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1501, !1509, !1510}
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1454, file: !142, line: 102, baseType: !849, size: 32)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1454, file: !142, line: 105, baseType: !7, size: 32, offset: 32)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1454, file: !142, line: 108, baseType: !1412, size: 64, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1454, file: !142, line: 111, baseType: !1412, size: 64, offset: 128)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1454, file: !142, line: 114, baseType: !1461, size: 64, offset: 192)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !142, line: 41, size: 64, elements: !1462)
!1462 = !{!1463, !1464}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1461, file: !142, line: 42, baseType: !141, size: 32)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1461, file: !142, line: 43, baseType: !7, size: 32, offset: 32)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1454, file: !142, line: 117, baseType: !7, size: 32, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1454, file: !142, line: 120, baseType: !7, size: 32, offset: 288)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1454, file: !142, line: 123, baseType: !1468, size: 64, offset: 320)
!1468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1469, size: 64)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !142, line: 87, baseType: !1470)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !142, line: 87, size: 128, elements: !1471)
!1471 = !{!1472}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1470, file: !142, line: 87, baseType: !1473, size: 128)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !142, line: 85, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !142, line: 85, size: 128, elements: !1475)
!1475 = !{!1476, !1477, !1478}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1474, file: !142, line: 85, baseType: !7, size: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1474, file: !142, line: 85, baseType: !7, size: 32, offset: 32)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1474, file: !142, line: 85, baseType: !1479, size: 64, offset: 64)
!1479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1480, size: 64, elements: !973)
!1480 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !142, line: 84, baseType: !1453)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1454, file: !142, line: 126, baseType: !1453, size: 64, offset: 384)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1454, file: !142, line: 129, baseType: !1453, size: 64, offset: 448)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1454, file: !142, line: 132, baseType: !853, size: 64, offset: 512)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1454, file: !142, line: 139, baseType: !993, size: 64, offset: 576)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1454, file: !142, line: 143, baseType: !1041, size: 128, offset: 640)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1454, file: !142, line: 146, baseType: !1041, size: 128, offset: 768)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1454, file: !142, line: 148, baseType: !848, size: 8, offset: 896)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1454, file: !142, line: 149, baseType: !848, size: 8, offset: 904)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1454, file: !142, line: 153, baseType: !150, size: 32, offset: 928)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1454, file: !142, line: 156, baseType: !1491, size: 64, offset: 960)
!1491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1492, size: 64)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !142, line: 48, size: 320, elements: !1493)
!1493 = !{!1494, !1498, !1499, !1500}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1492, file: !142, line: 50, baseType: !1495, size: 64)
!1495 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !874, line: 58, baseType: !1496)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !874, line: 57, flags: DIFlagFwdDecl)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1492, file: !142, line: 59, baseType: !1041, size: 128, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1492, file: !142, line: 64, baseType: !848, size: 8, offset: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1492, file: !142, line: 67, baseType: !1491, size: 64, offset: 256)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1454, file: !142, line: 159, baseType: !1502, size: 64, offset: 1024)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !142, line: 72, size: 256, elements: !1504)
!1504 = !{!1505, !1506, !1507, !1508}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1503, file: !142, line: 74, baseType: !1429, size: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1503, file: !142, line: 77, baseType: !1502, size: 64, offset: 64)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1503, file: !142, line: 78, baseType: !1502, size: 64, offset: 128)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1503, file: !142, line: 81, baseType: !1502, size: 64, offset: 192)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1454, file: !142, line: 162, baseType: !848, size: 8, offset: 1088)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1454, file: !142, line: 166, baseType: !993, size: 64, offset: 1152)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1413, file: !155, line: 229, baseType: !1512, size: 128, offset: 256)
!1512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1513, size: 128, elements: !891)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1514, size: 64)
!1514 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !155, line: 229, flags: DIFlagFwdDecl)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1413, file: !155, line: 232, baseType: !1412, size: 64, offset: 384)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1413, file: !155, line: 233, baseType: !1412, size: 64, offset: 448)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1413, file: !155, line: 238, baseType: !1518, size: 64, offset: 512)
!1518 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !155, line: 235, size: 64, elements: !1519)
!1519 = !{!1520, !1526}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1518, file: !155, line: 236, baseType: !1521, size: 64)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1522, size: 64)
!1522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !155, line: 273, size: 128, elements: !1523)
!1523 = !{!1524, !1525}
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1522, file: !155, line: 275, baseType: !1438, size: 64)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1522, file: !155, line: 278, baseType: !1438, size: 64, offset: 64)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1518, file: !155, line: 237, baseType: !1527, size: 64)
!1527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1528, size: 64)
!1528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !155, line: 259, size: 320, elements: !1529)
!1529 = !{!1530, !1531, !1532, !1533, !1534}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1528, file: !155, line: 261, baseType: !939, size: 64)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1528, file: !155, line: 262, baseType: !939, size: 64, offset: 64)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1528, file: !155, line: 266, baseType: !939, size: 64, offset: 128)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1528, file: !155, line: 267, baseType: !939, size: 64, offset: 192)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1528, file: !155, line: 270, baseType: !849, size: 32, offset: 256)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1413, file: !155, line: 241, baseType: !1449, size: 64, offset: 576)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1413, file: !155, line: 244, baseType: !849, size: 32, offset: 640)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1413, file: !155, line: 247, baseType: !849, size: 32, offset: 672)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1413, file: !155, line: 250, baseType: !849, size: 32, offset: 704)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1413, file: !155, line: 253, baseType: !849, size: 32, offset: 736)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1413, file: !155, line: 256, baseType: !849, size: 32, offset: 768)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1408, file: !155, line: 378, baseType: !1411, size: 64, offset: 64)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1408, file: !155, line: 381, baseType: !1543, size: 64, offset: 128)
!1543 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1544, size: 64)
!1544 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !155, line: 282, baseType: !1545)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !155, line: 282, size: 128, elements: !1546)
!1546 = !{!1547}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1545, file: !155, line: 282, baseType: !1548, size: 128)
!1548 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !155, line: 281, baseType: !1549)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !155, line: 281, size: 128, elements: !1550)
!1550 = !{!1551, !1552, !1553}
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1549, file: !155, line: 281, baseType: !7, size: 32)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1549, file: !155, line: 281, baseType: !7, size: 32, offset: 32)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1549, file: !155, line: 281, baseType: !1554, size: 64, offset: 64)
!1554 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1411, size: 64, elements: !973)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1408, file: !155, line: 384, baseType: !849, size: 32, offset: 192)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1408, file: !155, line: 387, baseType: !849, size: 32, offset: 224)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1408, file: !155, line: 390, baseType: !849, size: 32, offset: 256)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1408, file: !155, line: 394, baseType: !1543, size: 64, offset: 320)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1408, file: !155, line: 396, baseType: !154, size: 32, offset: 384)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1408, file: !155, line: 399, baseType: !1561, size: 64, offset: 416)
!1561 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !891)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1408, file: !155, line: 402, baseType: !1563, size: 64, offset: 480)
!1563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !891)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1408, file: !155, line: 406, baseType: !849, size: 32, offset: 544)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1408, file: !155, line: 409, baseType: !849, size: 32, offset: 576)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1239, file: !1240, line: 470, baseType: !1439, size: 64, offset: 128)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1239, file: !1240, line: 473, baseType: !1568, size: 64, offset: 192)
!1568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1569, size: 64)
!1569 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1240, line: 166, flags: DIFlagFwdDecl)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1239, file: !1240, line: 476, baseType: !1571, size: 64, offset: 256)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !142, line: 187, size: 256, elements: !1573)
!1573 = !{!1574, !1575, !1576, !1577}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1572, file: !142, line: 189, baseType: !849, size: 32)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1572, file: !142, line: 192, baseType: !1468, size: 64, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1572, file: !142, line: 197, baseType: !1323, size: 64, offset: 128)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1572, file: !142, line: 200, baseType: !1453, size: 64, offset: 192)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1239, file: !1240, line: 479, baseType: !1323, size: 64, offset: 320)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1239, file: !1240, line: 484, baseType: !993, size: 64, offset: 384)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1239, file: !1240, line: 488, baseType: !993, size: 64, offset: 448)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1239, file: !1240, line: 493, baseType: !993, size: 64, offset: 512)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1239, file: !1240, line: 496, baseType: !993, size: 64, offset: 576)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1239, file: !1240, line: 501, baseType: !1584, size: 64, offset: 640)
!1584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1585, size: 64)
!1585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !166, line: 2355, size: 576, elements: !1586)
!1586 = !{!1587, !1590, !1591, !1592, !1593, !1595, !1596, !1601, !1602, !1603, !1604, !1605, !1606}
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1585, file: !166, line: 2356, baseType: !1588, size: 64)
!1588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1589, size: 64)
!1589 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !166, line: 2356, flags: DIFlagFwdDecl)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1585, file: !166, line: 2357, baseType: !854, size: 64, offset: 64)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1585, file: !166, line: 2358, baseType: !849, size: 32, offset: 128)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1585, file: !166, line: 2359, baseType: !849, size: 32, offset: 160)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1585, file: !166, line: 2360, baseType: !1594, size: 128, offset: 192)
!1594 = !DICompositeType(tag: DW_TAG_array_type, baseType: !849, size: 128, elements: !916)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1585, file: !166, line: 2364, baseType: !849, size: 32, offset: 320)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1585, file: !166, line: 2367, baseType: !1597, size: 128, offset: 384)
!1597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !166, line: 2349, size: 128, elements: !1598)
!1598 = !{!1599, !1600}
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1597, file: !166, line: 2351, baseType: !939, size: 64)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1597, file: !166, line: 2352, baseType: !907, size: 64, offset: 64)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1585, file: !166, line: 2371, baseType: !165, size: 32, offset: 512)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1585, file: !166, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1585, file: !166, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1585, file: !166, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1585, file: !166, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1585, file: !166, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1239, file: !1240, line: 504, baseType: !1608, size: 64, offset: 704)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64)
!1609 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1240, line: 504, flags: DIFlagFwdDecl)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1239, file: !1240, line: 507, baseType: !1323, size: 64, offset: 768)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1239, file: !1240, line: 510, baseType: !849, size: 32, offset: 832)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1239, file: !1240, line: 513, baseType: !849, size: 32, offset: 864)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1239, file: !1240, line: 516, baseType: !1113, size: 32, offset: 896)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1239, file: !1240, line: 519, baseType: !1113, size: 32, offset: 928)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1239, file: !1240, line: 522, baseType: !7, size: 32, offset: 960)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1239, file: !1240, line: 523, baseType: !7, size: 32, offset: 992)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1239, file: !1240, line: 528, baseType: !854, size: 64, offset: 1024)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1239, file: !1240, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1239, file: !1240, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1239, file: !1240, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1239, file: !1240, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1239, file: !1240, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1239, file: !1240, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1239, file: !1240, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1239, file: !1240, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1239, file: !1240, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1239, file: !1240, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1239, file: !1240, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1239, file: !1240, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1239, file: !1240, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1239, file: !1240, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1239, file: !1240, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1239, file: !1240, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1234, file: !171, line: 3254, baseType: !993, size: 64, offset: 1536)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1234, file: !171, line: 3257, baseType: !993, size: 64, offset: 1600)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1234, file: !171, line: 3258, baseType: !993, size: 64, offset: 1664)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1234, file: !171, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1234, file: !171, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
