; ModuleID = 'lambda-mat.bc'
source_filename = "lambda-mat.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [2 x i8] c"\0A\00", align 1
@.str.1 = private unnamed_addr constant [13 x i8] c"lambda-mat.c\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"?\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"./lambda.h\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"%3d \00", align 1

; Function Attrs: inlinehint nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "lambda-mat.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13, !16}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_vector", file: !15, line: 31, baseType: !16)
!15 = !DIFile(filename: "./lambda.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!17 = !{i32 2, !"Dwarf Version", i32 4}
!18 = !{i32 2, !"Debug Info Version", i32 3}
!19 = !{i32 1, !"wchar_size", i32 4}
!20 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!21 = distinct !DISubprogram(name: "vprintf", scope: !22, file: !22, line: 39, type: !23, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !34)
!22 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!23 = !DISubroutineType(types: !24)
!24 = !{!6, !25, !26}
!25 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !28)
!28 = !{!29, !31, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !27, file: !1, baseType: !30, size: 32)
!30 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !27, file: !1, baseType: !30, size: 32, offset: 32)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !27, file: !1, baseType: !10, size: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !27, file: !1, baseType: !10, size: 64, offset: 128)
!34 = !{!35, !36}
!35 = !DILocalVariable(name: "__fmt", arg: 1, scope: !21, file: !22, line: 39, type: !25)
!36 = !DILocalVariable(name: "__arg", arg: 2, scope: !21, file: !22, line: 39, type: !26)
!37 = !DILocation(line: 0, scope: !21)
!38 = !DILocation(line: 41, column: 20, scope: !21)
!39 = !DILocation(line: 41, column: 10, scope: !21)
!40 = !DILocation(line: 41, column: 3, scope: !21)
!41 = distinct !DISubprogram(name: "getchar", scope: !22, file: !22, line: 47, type: !42, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!42 = !DISubroutineType(types: !43)
!43 = !{!6}
!44 = !DILocation(line: 49, column: 16, scope: !41)
!45 = !DILocation(line: 49, column: 10, scope: !41)
!46 = !DILocation(line: 49, column: 3, scope: !41)
!47 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !22, file: !22, line: 56, type: !48, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !109)
!48 = !DISubroutineType(types: !49)
!49 = !{!6, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !52, line: 7, baseType: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !71, !73, !74, !75, !79, !81, !83, !87, !90, !92, !95, !98, !99, !100, !104, !105}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 51, baseType: !6, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 54, baseType: !8, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 55, baseType: !8, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 56, baseType: !8, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 57, baseType: !8, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 58, baseType: !8, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 59, baseType: !8, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 60, baseType: !8, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 61, baseType: !8, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 64, baseType: !8, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 65, baseType: !8, size: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 66, baseType: !8, size: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 36, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 70, baseType: !72, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 72, baseType: !6, size: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 73, baseType: !6, size: 32, offset: 928)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 74, baseType: !76, size: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !77, line: 152, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!78 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 77, baseType: !80, size: 16, offset: 1024)
!80 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 78, baseType: !82, size: 8, offset: 1040)
!82 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 79, baseType: !84, size: 8, offset: 1048)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 81, baseType: !88, size: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 43, baseType: null)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 89, baseType: !91, size: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !77, line: 153, baseType: !78)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !53, file: !54, line: 91, baseType: !93, size: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !54, line: 37, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !53, file: !54, line: 92, baseType: !96, size: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !54, line: 38, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !53, file: !54, line: 93, baseType: !72, size: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !53, file: !54, line: 94, baseType: !10, size: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 95, baseType: !101, size: 64, offset: 1472)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !102, line: 46, baseType: !103)
!102 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!103 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 96, baseType: !6, size: 32, offset: 1536)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 98, baseType: !106, size: 160, offset: 1568)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 20)
!109 = !{!110}
!110 = !DILocalVariable(name: "__fp", arg: 1, scope: !47, file: !22, line: 56, type: !50)
!111 = !DILocation(line: 0, scope: !47)
!112 = !DILocation(line: 58, column: 10, scope: !47)
!113 = !DILocation(line: 58, column: 3, scope: !47)
!114 = distinct !DISubprogram(name: "getc_unlocked", scope: !22, file: !22, line: 66, type: !48, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !115)
!115 = !{!116}
!116 = !DILocalVariable(name: "__fp", arg: 1, scope: !114, file: !22, line: 66, type: !50)
!117 = !DILocation(line: 0, scope: !114)
!118 = !DILocation(line: 68, column: 10, scope: !114)
!119 = !DILocation(line: 68, column: 3, scope: !114)
!120 = distinct !DISubprogram(name: "getchar_unlocked", scope: !22, file: !22, line: 73, type: !42, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!121 = !DILocation(line: 75, column: 10, scope: !120)
!122 = !DILocation(line: 75, column: 3, scope: !120)
!123 = distinct !DISubprogram(name: "putchar", scope: !22, file: !22, line: 82, type: !124, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !126)
!124 = !DISubroutineType(types: !125)
!125 = !{!6, !6}
!126 = !{!127}
!127 = !DILocalVariable(name: "__c", arg: 1, scope: !123, file: !22, line: 82, type: !6)
!128 = !DILocation(line: 0, scope: !123)
!129 = !DILocation(line: 84, column: 21, scope: !123)
!130 = !DILocation(line: 84, column: 10, scope: !123)
!131 = !DILocation(line: 84, column: 3, scope: !123)
!132 = distinct !DISubprogram(name: "fputc_unlocked", scope: !22, file: !22, line: 91, type: !133, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !135)
!133 = !DISubroutineType(types: !134)
!134 = !{!6, !6, !50}
!135 = !{!136, !137}
!136 = !DILocalVariable(name: "__c", arg: 1, scope: !132, file: !22, line: 91, type: !6)
!137 = !DILocalVariable(name: "__stream", arg: 2, scope: !132, file: !22, line: 91, type: !50)
!138 = !DILocation(line: 0, scope: !132)
!139 = !DILocation(line: 93, column: 10, scope: !132)
!140 = !DILocation(line: 93, column: 3, scope: !132)
!141 = distinct !DISubprogram(name: "putc_unlocked", scope: !22, file: !22, line: 101, type: !133, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !142)
!142 = !{!143, !144}
!143 = !DILocalVariable(name: "__c", arg: 1, scope: !141, file: !22, line: 101, type: !6)
!144 = !DILocalVariable(name: "__stream", arg: 2, scope: !141, file: !22, line: 101, type: !50)
!145 = !DILocation(line: 0, scope: !141)
!146 = !DILocation(line: 103, column: 10, scope: !141)
!147 = !DILocation(line: 103, column: 3, scope: !141)
!148 = distinct !DISubprogram(name: "putchar_unlocked", scope: !22, file: !22, line: 108, type: !124, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !149)
!149 = !{!150}
!150 = !DILocalVariable(name: "__c", arg: 1, scope: !148, file: !22, line: 108, type: !6)
!151 = !DILocation(line: 0, scope: !148)
!152 = !DILocation(line: 110, column: 10, scope: !148)
!153 = !DILocation(line: 110, column: 3, scope: !148)
!154 = distinct !DISubprogram(name: "getline", scope: !22, file: !22, line: 118, type: !155, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !159)
!155 = !DISubroutineType(types: !156)
!156 = !{!157, !7, !158, !50}
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !77, line: 193, baseType: !78)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!159 = !{!160, !161, !162}
!160 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !154, file: !22, line: 118, type: !7)
!161 = !DILocalVariable(name: "__n", arg: 2, scope: !154, file: !22, line: 118, type: !158)
!162 = !DILocalVariable(name: "__stream", arg: 3, scope: !154, file: !22, line: 118, type: !50)
!163 = !DILocation(line: 0, scope: !154)
!164 = !DILocation(line: 120, column: 10, scope: !154)
!165 = !DILocation(line: 120, column: 3, scope: !154)
!166 = distinct !DISubprogram(name: "feof_unlocked", scope: !22, file: !22, line: 128, type: !48, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !167)
!167 = !{!168}
!168 = !DILocalVariable(name: "__stream", arg: 1, scope: !166, file: !22, line: 128, type: !50)
!169 = !DILocation(line: 0, scope: !166)
!170 = !DILocation(line: 130, column: 10, scope: !166)
!171 = !DILocation(line: 130, column: 3, scope: !166)
!172 = distinct !DISubprogram(name: "ferror_unlocked", scope: !22, file: !22, line: 135, type: !48, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !173)
!173 = !{!174}
!174 = !DILocalVariable(name: "__stream", arg: 1, scope: !172, file: !22, line: 135, type: !50)
!175 = !DILocation(line: 0, scope: !172)
!176 = !DILocation(line: 137, column: 10, scope: !172)
!177 = !DILocation(line: 137, column: 3, scope: !172)
!178 = distinct !DISubprogram(name: "tolower", scope: !179, file: !179, line: 207, type: !124, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !180)
!179 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!180 = !{!181}
!181 = !DILocalVariable(name: "__c", arg: 1, scope: !178, file: !179, line: 207, type: !6)
!182 = !DILocation(line: 0, scope: !178)
!183 = !DILocation(line: 209, column: 22, scope: !178)
!184 = !DILocation(line: 209, column: 39, scope: !178)
!185 = !DILocation(line: 209, column: 38, scope: !178)
!186 = !DILocation(line: 209, column: 37, scope: !178)
!187 = !DILocation(line: 209, column: 10, scope: !178)
!188 = !DILocation(line: 209, column: 3, scope: !178)
!189 = distinct !DISubprogram(name: "toupper", scope: !179, file: !179, line: 213, type: !124, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !190)
!190 = !{!191}
!191 = !DILocalVariable(name: "__c", arg: 1, scope: !189, file: !179, line: 213, type: !6)
!192 = !DILocation(line: 0, scope: !189)
!193 = !DILocation(line: 215, column: 22, scope: !189)
!194 = !DILocation(line: 215, column: 39, scope: !189)
!195 = !DILocation(line: 215, column: 38, scope: !189)
!196 = !DILocation(line: 215, column: 37, scope: !189)
!197 = !DILocation(line: 215, column: 10, scope: !189)
!198 = !DILocation(line: 215, column: 3, scope: !189)
!199 = distinct !DISubprogram(name: "atoi", scope: !200, file: !200, line: 361, type: !201, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !203)
!200 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!201 = !DISubroutineType(types: !202)
!202 = !{!6, !11}
!203 = !{!204}
!204 = !DILocalVariable(name: "__nptr", arg: 1, scope: !199, file: !200, line: 361, type: !11)
!205 = !DILocation(line: 0, scope: !199)
!206 = !DILocation(line: 363, column: 16, scope: !199)
!207 = !DILocation(line: 363, column: 10, scope: !199)
!208 = !DILocation(line: 363, column: 3, scope: !199)
!209 = distinct !DISubprogram(name: "atol", scope: !200, file: !200, line: 366, type: !210, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !212)
!210 = !DISubroutineType(types: !211)
!211 = !{!78, !11}
!212 = !{!213}
!213 = !DILocalVariable(name: "__nptr", arg: 1, scope: !209, file: !200, line: 366, type: !11)
!214 = !DILocation(line: 0, scope: !209)
!215 = !DILocation(line: 368, column: 10, scope: !209)
!216 = !DILocation(line: 368, column: 3, scope: !209)
!217 = distinct !DISubprogram(name: "atoll", scope: !200, file: !200, line: 373, type: !218, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !221)
!218 = !DISubroutineType(types: !219)
!219 = !{!220, !11}
!220 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!221 = !{!222}
!222 = !DILocalVariable(name: "__nptr", arg: 1, scope: !217, file: !200, line: 373, type: !11)
!223 = !DILocation(line: 0, scope: !217)
!224 = !DILocation(line: 375, column: 10, scope: !217)
!225 = !DILocation(line: 375, column: 3, scope: !217)
!226 = distinct !DISubprogram(name: "bsearch", scope: !227, file: !227, line: 20, type: !228, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !236)
!227 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!228 = !DISubroutineType(types: !229)
!229 = !{!10, !230, !230, !101, !101, !232}
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64)
!231 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !200, line: 808, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DISubroutineType(types: !235)
!235 = !{!6, !230, !230}
!236 = !{!237, !238, !239, !240, !241, !242, !243, !244, !245, !246}
!237 = !DILocalVariable(name: "__key", arg: 1, scope: !226, file: !227, line: 20, type: !230)
!238 = !DILocalVariable(name: "__base", arg: 2, scope: !226, file: !227, line: 20, type: !230)
!239 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !226, file: !227, line: 20, type: !101)
!240 = !DILocalVariable(name: "__size", arg: 4, scope: !226, file: !227, line: 20, type: !101)
!241 = !DILocalVariable(name: "__compar", arg: 5, scope: !226, file: !227, line: 21, type: !232)
!242 = !DILocalVariable(name: "__l", scope: !226, file: !227, line: 23, type: !101)
!243 = !DILocalVariable(name: "__u", scope: !226, file: !227, line: 23, type: !101)
!244 = !DILocalVariable(name: "__idx", scope: !226, file: !227, line: 23, type: !101)
!245 = !DILocalVariable(name: "__p", scope: !226, file: !227, line: 24, type: !230)
!246 = !DILocalVariable(name: "__comparison", scope: !226, file: !227, line: 25, type: !6)
!247 = !DILocation(line: 0, scope: !226)
!248 = !DILocation(line: 29, column: 3, scope: !226)
!249 = !DILocation(line: 27, column: 7, scope: !226)
!250 = !DILocation(line: 29, column: 14, scope: !226)
!251 = !DILocation(line: 31, column: 20, scope: !252)
!252 = distinct !DILexicalBlock(scope: !226, file: !227, line: 30, column: 5)
!253 = !DILocation(line: 31, column: 27, scope: !252)
!254 = !DILocation(line: 32, column: 56, scope: !252)
!255 = !DILocation(line: 32, column: 47, scope: !252)
!256 = !DILocation(line: 33, column: 22, scope: !252)
!257 = !DILocation(line: 34, column: 24, scope: !258)
!258 = distinct !DILexicalBlock(scope: !252, file: !227, line: 34, column: 11)
!259 = !DILocation(line: 34, column: 11, scope: !252)
!260 = !DILocation(line: 36, column: 29, scope: !261)
!261 = distinct !DILexicalBlock(scope: !258, file: !227, line: 36, column: 16)
!262 = !DILocation(line: 36, column: 16, scope: !258)
!263 = !DILocation(line: 37, column: 14, scope: !261)
!264 = distinct !{!264, !248, !265}
!265 = !DILocation(line: 40, column: 5, scope: !226)
!266 = !DILocation(line: 43, column: 1, scope: !226)
!267 = distinct !DISubprogram(name: "atof", scope: !268, file: !268, line: 25, type: !269, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !272)
!268 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!269 = !DISubroutineType(types: !270)
!270 = !{!271, !11}
!271 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!272 = !{!273}
!273 = !DILocalVariable(name: "__nptr", arg: 1, scope: !267, file: !268, line: 25, type: !11)
!274 = !DILocation(line: 0, scope: !267)
!275 = !DILocation(line: 27, column: 10, scope: !267)
!276 = !DILocation(line: 27, column: 3, scope: !267)
!277 = distinct !DISubprogram(name: "strtoimax", scope: !278, file: !278, line: 324, type: !279, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !285)
!278 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!279 = !DISubroutineType(types: !280)
!280 = !{!281, !25, !284, !6}
!281 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !282, line: 101, baseType: !283)
!282 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !77, line: 72, baseType: !78)
!284 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !7)
!285 = !{!286, !287, !288}
!286 = !DILocalVariable(name: "nptr", arg: 1, scope: !277, file: !278, line: 324, type: !25)
!287 = !DILocalVariable(name: "endptr", arg: 2, scope: !277, file: !278, line: 324, type: !284)
!288 = !DILocalVariable(name: "base", arg: 3, scope: !277, file: !278, line: 324, type: !6)
!289 = !DILocation(line: 0, scope: !277)
!290 = !DILocation(line: 327, column: 10, scope: !277)
!291 = !DILocation(line: 327, column: 3, scope: !277)
!292 = distinct !DISubprogram(name: "strtoumax", scope: !278, file: !278, line: 336, type: !293, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !297)
!293 = !DISubroutineType(types: !294)
!294 = !{!295, !25, !284, !6}
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !282, line: 102, baseType: !296)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !77, line: 73, baseType: !103)
!297 = !{!298, !299, !300}
!298 = !DILocalVariable(name: "nptr", arg: 1, scope: !292, file: !278, line: 336, type: !25)
!299 = !DILocalVariable(name: "endptr", arg: 2, scope: !292, file: !278, line: 336, type: !284)
!300 = !DILocalVariable(name: "base", arg: 3, scope: !292, file: !278, line: 336, type: !6)
!301 = !DILocation(line: 0, scope: !292)
!302 = !DILocation(line: 339, column: 10, scope: !292)
!303 = !DILocation(line: 339, column: 3, scope: !292)
!304 = distinct !DISubprogram(name: "wcstoimax", scope: !278, file: !278, line: 348, type: !305, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !314)
!305 = !DISubroutineType(types: !306)
!306 = !{!281, !307, !311, !6}
!307 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !310)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !278, line: 34, baseType: !6)
!311 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!314 = !{!315, !316, !317}
!315 = !DILocalVariable(name: "nptr", arg: 1, scope: !304, file: !278, line: 348, type: !307)
!316 = !DILocalVariable(name: "endptr", arg: 2, scope: !304, file: !278, line: 348, type: !311)
!317 = !DILocalVariable(name: "base", arg: 3, scope: !304, file: !278, line: 348, type: !6)
!318 = !DILocation(line: 0, scope: !304)
!319 = !DILocation(line: 351, column: 10, scope: !304)
!320 = !DILocation(line: 351, column: 3, scope: !304)
!321 = distinct !DISubprogram(name: "wcstoumax", scope: !278, file: !278, line: 362, type: !322, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{!295, !307, !311, !6}
!324 = !{!325, !326, !327}
!325 = !DILocalVariable(name: "nptr", arg: 1, scope: !321, file: !278, line: 362, type: !307)
!326 = !DILocalVariable(name: "endptr", arg: 2, scope: !321, file: !278, line: 362, type: !311)
!327 = !DILocalVariable(name: "base", arg: 3, scope: !321, file: !278, line: 362, type: !6)
!328 = !DILocation(line: 0, scope: !321)
!329 = !DILocation(line: 365, column: 10, scope: !321)
!330 = !DILocation(line: 365, column: 3, scope: !321)
!331 = distinct !DISubprogram(name: "stat", scope: !332, file: !332, line: 453, type: !333, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !372)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!333 = !DISubroutineType(types: !334)
!334 = !{!6, !11, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !337, line: 46, size: 1152, elements: !338)
!337 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!338 = !{!339, !341, !343, !345, !347, !349, !351, !352, !353, !354, !356, !358, !366, !367, !368}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !336, file: !337, line: 48, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !77, line: 145, baseType: !103)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !336, file: !337, line: 53, baseType: !342, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !77, line: 148, baseType: !103)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !336, file: !337, line: 61, baseType: !344, size: 64, offset: 128)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !77, line: 151, baseType: !103)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !336, file: !337, line: 62, baseType: !346, size: 32, offset: 192)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !77, line: 150, baseType: !30)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !336, file: !337, line: 64, baseType: !348, size: 32, offset: 224)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !77, line: 146, baseType: !30)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !336, file: !337, line: 65, baseType: !350, size: 32, offset: 256)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !77, line: 147, baseType: !30)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !336, file: !337, line: 67, baseType: !6, size: 32, offset: 288)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !336, file: !337, line: 69, baseType: !340, size: 64, offset: 320)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !336, file: !337, line: 74, baseType: !76, size: 64, offset: 384)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !336, file: !337, line: 78, baseType: !355, size: 64, offset: 448)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !77, line: 174, baseType: !78)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !336, file: !337, line: 80, baseType: !357, size: 64, offset: 512)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !77, line: 179, baseType: !78)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !336, file: !337, line: 91, baseType: !359, size: 128, offset: 576)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !360, line: 10, size: 128, elements: !361)
!360 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!361 = !{!362, !364}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !359, file: !360, line: 12, baseType: !363, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !77, line: 160, baseType: !78)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !359, file: !360, line: 16, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !77, line: 196, baseType: !78)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !336, file: !337, line: 92, baseType: !359, size: 128, offset: 704)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !336, file: !337, line: 93, baseType: !359, size: 128, offset: 832)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !336, file: !337, line: 106, baseType: !369, size: 192, offset: 960)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !365, size: 192, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 3)
!372 = !{!373, !374}
!373 = !DILocalVariable(name: "__path", arg: 1, scope: !331, file: !332, line: 453, type: !11)
!374 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !331, file: !332, line: 453, type: !335)
!375 = !DILocation(line: 0, scope: !331)
!376 = !DILocation(line: 455, column: 10, scope: !331)
!377 = !DILocation(line: 455, column: 3, scope: !331)
!378 = distinct !DISubprogram(name: "lstat", scope: !332, file: !332, line: 460, type: !333, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !379)
!379 = !{!380, !381}
!380 = !DILocalVariable(name: "__path", arg: 1, scope: !378, file: !332, line: 460, type: !11)
!381 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !378, file: !332, line: 460, type: !335)
!382 = !DILocation(line: 0, scope: !378)
!383 = !DILocation(line: 462, column: 10, scope: !378)
!384 = !DILocation(line: 462, column: 3, scope: !378)
!385 = distinct !DISubprogram(name: "fstat", scope: !332, file: !332, line: 467, type: !386, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !388)
!386 = !DISubroutineType(types: !387)
!387 = !{!6, !6, !335}
!388 = !{!389, !390}
!389 = !DILocalVariable(name: "__fd", arg: 1, scope: !385, file: !332, line: 467, type: !6)
!390 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !385, file: !332, line: 467, type: !335)
!391 = !DILocation(line: 0, scope: !385)
!392 = !DILocation(line: 469, column: 10, scope: !385)
!393 = !DILocation(line: 469, column: 3, scope: !385)
!394 = distinct !DISubprogram(name: "fstatat", scope: !332, file: !332, line: 474, type: !395, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !397)
!395 = !DISubroutineType(types: !396)
!396 = !{!6, !6, !11, !335, !6}
!397 = !{!398, !399, !400, !401}
!398 = !DILocalVariable(name: "__fd", arg: 1, scope: !394, file: !332, line: 474, type: !6)
!399 = !DILocalVariable(name: "__filename", arg: 2, scope: !394, file: !332, line: 474, type: !11)
!400 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !394, file: !332, line: 474, type: !335)
!401 = !DILocalVariable(name: "__flag", arg: 4, scope: !394, file: !332, line: 474, type: !6)
!402 = !DILocation(line: 0, scope: !394)
!403 = !DILocation(line: 477, column: 10, scope: !394)
!404 = !DILocation(line: 477, column: 3, scope: !394)
!405 = distinct !DISubprogram(name: "mknod", scope: !332, file: !332, line: 483, type: !406, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !408)
!406 = !DISubroutineType(types: !407)
!407 = !{!6, !11, !346, !340}
!408 = !{!409, !410, !411}
!409 = !DILocalVariable(name: "__path", arg: 1, scope: !405, file: !332, line: 483, type: !11)
!410 = !DILocalVariable(name: "__mode", arg: 2, scope: !405, file: !332, line: 483, type: !346)
!411 = !DILocalVariable(name: "__dev", arg: 3, scope: !405, file: !332, line: 483, type: !340)
!412 = !DILocation(line: 0, scope: !405)
!413 = !DILocation(line: 485, column: 10, scope: !405)
!414 = !DILocation(line: 485, column: 3, scope: !405)
!415 = distinct !DISubprogram(name: "mknodat", scope: !332, file: !332, line: 491, type: !416, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !418)
!416 = !DISubroutineType(types: !417)
!417 = !{!6, !6, !11, !346, !340}
!418 = !{!419, !420, !421, !422}
!419 = !DILocalVariable(name: "__fd", arg: 1, scope: !415, file: !332, line: 491, type: !6)
!420 = !DILocalVariable(name: "__path", arg: 2, scope: !415, file: !332, line: 491, type: !11)
!421 = !DILocalVariable(name: "__mode", arg: 3, scope: !415, file: !332, line: 491, type: !346)
!422 = !DILocalVariable(name: "__dev", arg: 4, scope: !415, file: !332, line: 491, type: !340)
!423 = !DILocation(line: 0, scope: !415)
!424 = !DILocation(line: 494, column: 10, scope: !415)
!425 = !DILocation(line: 494, column: 3, scope: !415)
!426 = distinct !DISubprogram(name: "stat64", scope: !332, file: !332, line: 502, type: !427, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !449)
!427 = !DISubroutineType(types: !428)
!428 = !{!6, !11, !429}
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !337, line: 119, size: 1152, elements: !431)
!431 = !{!432, !433, !435, !436, !437, !438, !439, !440, !441, !442, !443, !445, !446, !447, !448}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !430, file: !337, line: 121, baseType: !340, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !430, file: !337, line: 123, baseType: !434, size: 64, offset: 64)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !77, line: 149, baseType: !103)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !430, file: !337, line: 124, baseType: !344, size: 64, offset: 128)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !430, file: !337, line: 125, baseType: !346, size: 32, offset: 192)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !430, file: !337, line: 132, baseType: !348, size: 32, offset: 224)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !430, file: !337, line: 133, baseType: !350, size: 32, offset: 256)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !430, file: !337, line: 135, baseType: !6, size: 32, offset: 288)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !430, file: !337, line: 136, baseType: !340, size: 64, offset: 320)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !430, file: !337, line: 137, baseType: !76, size: 64, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !430, file: !337, line: 143, baseType: !355, size: 64, offset: 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !430, file: !337, line: 144, baseType: !444, size: 64, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !77, line: 180, baseType: !78)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !430, file: !337, line: 152, baseType: !359, size: 128, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !430, file: !337, line: 153, baseType: !359, size: 128, offset: 704)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !430, file: !337, line: 154, baseType: !359, size: 128, offset: 832)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !430, file: !337, line: 164, baseType: !369, size: 192, offset: 960)
!449 = !{!450, !451}
!450 = !DILocalVariable(name: "__path", arg: 1, scope: !426, file: !332, line: 502, type: !11)
!451 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !426, file: !332, line: 502, type: !429)
!452 = !DILocation(line: 0, scope: !426)
!453 = !DILocation(line: 504, column: 10, scope: !426)
!454 = !DILocation(line: 504, column: 3, scope: !426)
!455 = distinct !DISubprogram(name: "lstat64", scope: !332, file: !332, line: 509, type: !427, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !456)
!456 = !{!457, !458}
!457 = !DILocalVariable(name: "__path", arg: 1, scope: !455, file: !332, line: 509, type: !11)
!458 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !455, file: !332, line: 509, type: !429)
!459 = !DILocation(line: 0, scope: !455)
!460 = !DILocation(line: 511, column: 10, scope: !455)
!461 = !DILocation(line: 511, column: 3, scope: !455)
!462 = distinct !DISubprogram(name: "fstat64", scope: !332, file: !332, line: 516, type: !463, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !465)
!463 = !DISubroutineType(types: !464)
!464 = !{!6, !6, !429}
!465 = !{!466, !467}
!466 = !DILocalVariable(name: "__fd", arg: 1, scope: !462, file: !332, line: 516, type: !6)
!467 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !462, file: !332, line: 516, type: !429)
!468 = !DILocation(line: 0, scope: !462)
!469 = !DILocation(line: 518, column: 10, scope: !462)
!470 = !DILocation(line: 518, column: 3, scope: !462)
!471 = distinct !DISubprogram(name: "fstatat64", scope: !332, file: !332, line: 523, type: !472, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{!6, !6, !11, !429, !6}
!474 = !{!475, !476, !477, !478}
!475 = !DILocalVariable(name: "__fd", arg: 1, scope: !471, file: !332, line: 523, type: !6)
!476 = !DILocalVariable(name: "__filename", arg: 2, scope: !471, file: !332, line: 523, type: !11)
!477 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !471, file: !332, line: 523, type: !429)
!478 = !DILocalVariable(name: "__flag", arg: 4, scope: !471, file: !332, line: 523, type: !6)
!479 = !DILocation(line: 0, scope: !471)
!480 = !DILocation(line: 526, column: 10, scope: !471)
!481 = !DILocation(line: 526, column: 3, scope: !471)
!482 = distinct !DISubprogram(name: "lambda_matrix_new", scope: !1, file: !1, line: 36, type: !483, scopeLine: 37, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !486)
!483 = !DISubroutineType(types: !484)
!484 = !{!485, !6, !6}
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_matrix", file: !15, line: 42, baseType: !13)
!486 = !{!487, !488, !489, !490}
!487 = !DILocalVariable(name: "m", arg: 1, scope: !482, file: !1, line: 36, type: !6)
!488 = !DILocalVariable(name: "n", arg: 2, scope: !482, file: !1, line: 36, type: !6)
!489 = !DILocalVariable(name: "mat", scope: !482, file: !1, line: 38, type: !485)
!490 = !DILocalVariable(name: "i", scope: !482, file: !1, line: 39, type: !6)
!491 = !DILocation(line: 0, scope: !482)
!492 = !DILocation(line: 41, column: 9, scope: !482)
!493 = !DILocation(line: 43, column: 8, scope: !494)
!494 = distinct !DILexicalBlock(scope: !482, file: !1, line: 43, column: 3)
!495 = !DILocation(line: 0, scope: !494)
!496 = !DILocation(line: 43, column: 17, scope: !497)
!497 = distinct !DILexicalBlock(scope: !494, file: !1, line: 43, column: 3)
!498 = !DILocation(line: 43, column: 3, scope: !494)
!499 = !DILocation(line: 44, column: 14, scope: !497)
!500 = !DILocation(line: 44, column: 5, scope: !497)
!501 = !DILocation(line: 44, column: 12, scope: !497)
!502 = !DILocation(line: 43, column: 23, scope: !497)
