; ModuleID = 'lambda-code.bc'
source_filename = "lambda-code.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!405 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!406 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!407 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!408 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!409 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!410 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!411 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!412 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!413 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!414 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!415 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!416 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!417 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!418 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!422 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!423 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!424 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!426 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !389, line: 727, baseType: !5, size: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!429 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!430 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!431 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!432 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!433 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!434 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!435 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!436 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!452 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !454, line: 119, baseType: !5, size: 32, elements: !455)
!454 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!455 = !{!456, !457, !458, !459}
!456 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!457 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!458 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!459 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!460 = !{!461, !462, !463, !464, !467, !468, !470, !465, !480, !489, !494, !505, !132, !477, !1857, !495, !830, !1868, !863, !5, !1870, !1875, !1888, !1900, !632, !1903, !1908, !1920, !1929, !1930, !2029, !1962, !1974, !1071}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!463 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_body_vector", file: !471, line: 76, baseType: !472)
!471 = !DIFile(filename: "./lambda.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lambda_body_vector_s", file: !471, line: 71, size: 128, elements: !474)
!474 = !{!475, !478, !479}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "coefficients", scope: !473, file: !471, line: 73, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_vector", file: !471, line: 31, baseType: !477)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !473, file: !471, line: 74, baseType: !463, size: 32, offset: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "denominator", scope: !473, file: !471, line: 75, baseType: !463, size: 32, offset: 96)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_linear_expression", file: !471, line: 100, baseType: !481)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lambda_linear_expression_s", file: !471, line: 93, size: 320, elements: !483)
!483 = !{!484, !485, !486, !487, !488}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "coefficients", scope: !482, file: !471, line: 95, baseType: !476, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "constant", scope: !482, file: !471, line: 96, baseType: !463, size: 32, offset: 64)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "invariant_coefficients", scope: !482, file: !471, line: 97, baseType: !476, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "denominator", scope: !482, file: !471, line: 98, baseType: !463, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !482, file: !471, line: 99, baseType: !481, size: 64, offset: 256)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_loopnest", file: !471, line: 145, baseType: !490)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lambda_loopnest_s", file: !471, line: 140, size: 128, elements: !492)
!492 = !{!493, !503, !504}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "loops", scope: !491, file: !471, line: 142, baseType: !494, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_loop", file: !471, line: 127, baseType: !496)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lambda_loop_s", file: !471, line: 121, size: 256, elements: !498)
!498 = !{!499, !500, !501, !502}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lower_bound", scope: !497, file: !471, line: 123, baseType: !480, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "upper_bound", scope: !497, file: !471, line: 124, baseType: !480, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "linear_offset", scope: !497, file: !471, line: 125, baseType: !480, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "step", scope: !497, file: !471, line: 126, baseType: !463, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "depth", scope: !491, file: !471, line: 143, baseType: !463, size: 32, offset: 64)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "invariants", scope: !491, file: !471, line: 144, baseType: !463, size: 32, offset: 96)
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !506, line: 56, baseType: !507)
!506 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !509)
!509 = !{!510, !543, !549, !562, !581, !592, !597, !606, !612, !625, !637, !675, !1185, !1213, !1230, !1231, !1236, !1245, !1251, !1256, !1260, !1264, !1508, !1555, !1561, !1567, !1574, !1587, !1601, !1618, !1630, !1652, !1667, !1839}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !508, file: !133, line: 3372, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !512)
!512 = !{!513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !511, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !511, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !511, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !511, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !511, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !511, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !511, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !511, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !511, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !511, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !511, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !511, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !511, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !511, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !511, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !511, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !511, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !511, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !511, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !511, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !511, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !511, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !511, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !511, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !511, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !511, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !511, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !511, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !511, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !511, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !508, file: !133, line: 3373, baseType: !544, size: 192)
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !545)
!545 = !{!546, !547, !548}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !544, file: !133, line: 403, baseType: !511, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !544, file: !133, line: 404, baseType: !505, size: 64, offset: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !544, file: !133, line: 405, baseType: !505, size: 64, offset: 128)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !508, file: !133, line: 3374, baseType: !550, size: 320)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !551)
!551 = !{!552, !553}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !550, file: !133, line: 1385, baseType: !544, size: 192)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !550, file: !133, line: 1386, baseType: !554, size: 128, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !555, line: 58, baseType: !556)
!555 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !555, line: 54, size: 128, elements: !557)
!557 = !{!558, !560}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !556, file: !555, line: 56, baseType: !559, size: 64)
!559 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !556, file: !555, line: 57, baseType: !561, size: 64, offset: 64)
!561 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !508, file: !133, line: 3375, baseType: !563, size: 256)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !563, file: !133, line: 1398, baseType: !544, size: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !563, file: !133, line: 1399, baseType: !567, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !569, line: 52, size: 256, elements: !570)
!569 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!570 = !{!571, !572, !573, !574, !575, !576, !577}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !568, file: !569, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !568, file: !569, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !568, file: !569, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !568, file: !569, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !568, file: !569, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !568, file: !569, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !568, file: !569, line: 62, baseType: !578, size: 192, offset: 64)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 192, elements: !579)
!579 = !{!580}
!580 = !DISubrange(count: 3)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !508, file: !133, line: 3376, baseType: !582, size: 256)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !583)
!583 = !{!584, !585}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !582, file: !133, line: 1409, baseType: !544, size: 192)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !582, file: !133, line: 1410, baseType: !586, size: 64, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !588, line: 27, size: 192, elements: !589)
!588 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !587, file: !588, line: 29, baseType: !554, size: 128)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !587, file: !588, line: 30, baseType: !3, size: 32, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !508, file: !133, line: 3377, baseType: !593, size: 256)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !593, file: !133, line: 1438, baseType: !544, size: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !593, file: !133, line: 1439, baseType: !505, size: 64, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !508, file: !133, line: 3378, baseType: !598, size: 256)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !599)
!599 = !{!600, !601, !602}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !598, file: !133, line: 1419, baseType: !544, size: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !598, file: !133, line: 1420, baseType: !463, size: 32, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !598, file: !133, line: 1421, baseType: !603, size: 8, offset: 224)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 8, elements: !604)
!604 = !{!605}
!605 = !DISubrange(count: 1)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !508, file: !133, line: 3379, baseType: !607, size: 320)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !608)
!608 = !{!609, !610, !611}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !607, file: !133, line: 1429, baseType: !544, size: 192)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !607, file: !133, line: 1430, baseType: !505, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !607, file: !133, line: 1431, baseType: !505, size: 64, offset: 256)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !508, file: !133, line: 3380, baseType: !613, size: 320)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !614)
!614 = !{!615, !616}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !613, file: !133, line: 1461, baseType: !544, size: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !613, file: !133, line: 1462, baseType: !617, size: 128, offset: 192)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !618, line: 31, size: 128, elements: !619)
!618 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!619 = !{!620, !623, !624}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !617, file: !618, line: 32, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !617, file: !618, line: 33, baseType: !5, size: 32, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !617, file: !618, line: 34, baseType: !5, size: 32, offset: 96)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !508, file: !133, line: 3381, baseType: !626, size: 384)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !627)
!627 = !{!628, !629, !634, !635, !636}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !626, file: !133, line: 2508, baseType: !544, size: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !626, file: !133, line: 2509, baseType: !630, size: 32, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !631, line: 58, baseType: !632)
!631 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !633, line: 44, baseType: !5)
!633 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!634 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !626, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !626, file: !133, line: 2511, baseType: !505, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !626, file: !133, line: 2512, baseType: !505, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !508, file: !133, line: 3382, baseType: !638, size: 896)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !638, file: !133, line: 2653, baseType: !626, size: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !638, file: !133, line: 2654, baseType: !505, size: 64, offset: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !638, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !638, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !638, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !638, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !638, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !638, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !638, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !638, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !638, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !638, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !638, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !638, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !638, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !638, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !638, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !638, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !638, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !638, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !638, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !638, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !638, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !638, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !638, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !638, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !638, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !638, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !638, file: !133, line: 2705, baseType: !505, size: 64, offset: 576)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !638, file: !133, line: 2706, baseType: !505, size: 64, offset: 640)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !638, file: !133, line: 2707, baseType: !505, size: 64, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !638, file: !133, line: 2708, baseType: !505, size: 64, offset: 768)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !638, file: !133, line: 2711, baseType: !673, size: 64, offset: 832)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !508, file: !133, line: 3383, baseType: !676, size: 960)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !676, file: !133, line: 2757, baseType: !638, size: 896)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !676, file: !133, line: 2758, baseType: !680, size: 64, offset: 896)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !506, line: 50, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !683, line: 240, size: 384, elements: !684)
!683 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !682, file: !683, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !682, file: !683, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !682, file: !683, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !682, file: !683, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !682, file: !683, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !682, file: !683, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !682, file: !683, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !682, file: !683, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !682, file: !683, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !682, file: !683, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !682, file: !683, line: 321, baseType: !696, size: 320, offset: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !683, line: 315, size: 320, elements: !697)
!697 = !{!698, !1152, !1154, !1183, !1184}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !696, file: !683, line: 316, baseType: !699, size: 64)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 64, elements: !604)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !683, line: 183, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !683, line: 166, size: 64, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !715, !716, !728, !731, !791, !792, !1129, !1142, !1149}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !701, file: !683, line: 168, baseType: !463, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !701, file: !683, line: 169, baseType: !5, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !701, file: !683, line: 170, baseType: !468, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !701, file: !683, line: 171, baseType: !680, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !701, file: !683, line: 172, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !506, line: 53, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !683, line: 359, size: 128, elements: !711)
!711 = !{!712, !713}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !710, file: !683, line: 360, baseType: !463, size: 32)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !710, file: !683, line: 361, baseType: !714, size: 64, offset: 64)
!714 = !DICompositeType(tag: DW_TAG_array_type, baseType: !680, size: 64, elements: !604)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !701, file: !683, line: 173, baseType: !3, size: 32)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !701, file: !683, line: 174, baseType: !717, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !683, line: 133, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !683, line: 115, size: 32, elements: !719)
!719 = !{!720, !721, !722, !723, !724, !725, !726, !727}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !718, file: !683, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !718, file: !683, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !718, file: !683, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !718, file: !683, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !718, file: !683, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !718, file: !683, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !718, file: !683, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !718, file: !683, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !701, file: !683, line: 175, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !683, line: 175, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !701, file: !683, line: 176, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !734, line: 75, size: 256, elements: !735)
!734 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!735 = !{!736, !750, !751, !752}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !733, file: !734, line: 76, baseType: !737, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !734, line: 68, baseType: !739)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !734, line: 63, size: 320, elements: !740)
!740 = !{!741, !743, !744, !745}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !739, file: !734, line: 64, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !739, file: !734, line: 65, baseType: !742, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !739, file: !734, line: 66, baseType: !5, size: 32, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !739, file: !734, line: 67, baseType: !746, size: 128, offset: 192)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !747, size: 128, elements: !748)
!747 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !734, line: 29, baseType: !559)
!748 = !{!749}
!749 = !DISubrange(count: 2)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !733, file: !734, line: 77, baseType: !737, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !733, file: !734, line: 78, baseType: !5, size: 32, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !733, file: !734, line: 79, baseType: !753, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !734, line: 49, baseType: !755)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !734, line: 45, size: 832, elements: !756)
!756 = !{!757, !758, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !755, file: !734, line: 46, baseType: !742, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !755, file: !734, line: 47, baseType: !732, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !755, file: !734, line: 48, baseType: !760, size: 704, offset: 128)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !761, line: 164, size: 704, elements: !762)
!761 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!762 = !{!763, !764, !774, !775, !776, !777, !778, !779, !783, !787, !788, !789, !790}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !760, file: !761, line: 166, baseType: !561, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !760, file: !761, line: 167, baseType: !765, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !761, line: 157, size: 192, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !766, file: !761, line: 159, baseType: !465, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !766, file: !761, line: 160, baseType: !765, size: 64, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !766, file: !761, line: 161, baseType: !771, size: 32, offset: 128)
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 32, elements: !772)
!772 = !{!773}
!773 = !DISubrange(count: 4)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !760, file: !761, line: 168, baseType: !465, size: 64, offset: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !760, file: !761, line: 169, baseType: !465, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !760, file: !761, line: 170, baseType: !465, size: 64, offset: 256)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !760, file: !761, line: 171, baseType: !561, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !760, file: !761, line: 172, baseType: !463, size: 32, offset: 384)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !760, file: !761, line: 176, baseType: !780, size: 64, offset: 448)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!765, !467, !561}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !760, file: !761, line: 177, baseType: !784, size: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DISubroutineType(types: !786)
!786 = !{null, !467, !765}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !760, file: !761, line: 178, baseType: !467, size: 64, offset: 576)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !760, file: !761, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !760, file: !761, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !760, file: !761, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !701, file: !683, line: 177, baseType: !505, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !701, file: !683, line: 178, baseType: !793, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !341, line: 217, size: 832, elements: !795)
!795 = !{!796, !1041, !1042, !1043, !1099, !1103, !1104, !1105, !1123, !1124, !1125, !1126, !1127, !1128}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !794, file: !341, line: 219, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !341, line: 151, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !341, line: 151, size: 128, elements: !800)
!800 = !{!801}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !799, file: !341, line: 151, baseType: !802, size: 128)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !341, line: 150, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !341, line: 150, size: 128, elements: !804)
!804 = !{!805, !806, !807}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !803, file: !341, line: 150, baseType: !5, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !803, file: !341, line: 150, baseType: !5, size: 32, offset: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !803, file: !341, line: 150, baseType: !808, size: 64, offset: 64)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 64, elements: !604)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !506, line: 108, baseType: !810)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !341, line: 122, size: 512, elements: !812)
!812 = !{!813, !814, !815, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !811, file: !341, line: 124, baseType: !793, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !811, file: !341, line: 125, baseType: !793, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !811, file: !341, line: 131, baseType: !816, size: 64, offset: 128)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !341, line: 128, size: 64, elements: !817)
!817 = !{!818, !1032}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !816, file: !341, line: 129, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !506, line: 66, baseType: !820)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !389, line: 143, size: 192, elements: !822)
!822 = !{!823, !1030, !1031}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !821, file: !389, line: 145, baseType: !824, size: 64)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !506, line: 69, baseType: !825)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !826, size: 64)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !389, line: 136, size: 192, elements: !827)
!827 = !{!828, !1028, !1029}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !826, file: !389, line: 137, baseType: !829, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !506, line: 58, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !389, line: 737, size: 768, elements: !832)
!832 = !{!833, !850, !883, !889, !894, !899, !906, !912, !918, !923, !937, !942, !948, !953, !963, !968, !986, !993, !1000, !1006, !1011, !1017, !1023}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !831, file: !389, line: 738, baseType: !834, size: 256)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !389, line: 271, size: 256, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !834, file: !389, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !834, file: !389, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !834, file: !389, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !834, file: !389, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !834, file: !389, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !834, file: !389, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !834, file: !389, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !834, file: !389, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !834, file: !389, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !834, file: !389, line: 312, baseType: !5, size: 32, offset: 32)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !834, file: !389, line: 316, baseType: !630, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !834, file: !389, line: 319, baseType: !5, size: 32, offset: 96)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !834, file: !389, line: 323, baseType: !793, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !834, file: !389, line: 327, baseType: !505, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !831, file: !389, line: 739, baseType: !851, size: 448)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !389, line: 350, size: 448, elements: !852)
!852 = !{!853, !881}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !851, file: !389, line: 353, baseType: !854, size: 384)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !389, line: 333, size: 384, elements: !855)
!855 = !{!856, !857, !864}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !854, file: !389, line: 336, baseType: !834, size: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !854, file: !389, line: 343, baseType: !858, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !454, line: 37, size: 128, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !859, file: !454, line: 39, baseType: !858, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !859, file: !454, line: 40, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !854, file: !389, line: 344, baseType: !865, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !454, line: 45, size: 320, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !866, file: !454, line: 47, baseType: !865, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !866, file: !454, line: 48, baseType: !870, size: 256, offset: 64)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !871)
!871 = !{!872, !874, !875, !880}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !870, file: !133, line: 1884, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !870, file: !133, line: 1885, baseType: !873, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !870, file: !133, line: 1891, baseType: !876, size: 64, offset: 128)
!876 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !870, file: !133, line: 1891, size: 64, elements: !877)
!877 = !{!878, !879}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !876, file: !133, line: 1891, baseType: !829, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !876, file: !133, line: 1891, baseType: !505, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !870, file: !133, line: 1892, baseType: !863, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !851, file: !389, line: 359, baseType: !882, size: 64, offset: 384)
!882 = !DICompositeType(tag: DW_TAG_array_type, baseType: !505, size: 64, elements: !604)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !831, file: !389, line: 740, baseType: !884, size: 512)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !389, line: 365, size: 512, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !884, file: !389, line: 368, baseType: !854, size: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !884, file: !389, line: 373, baseType: !505, size: 64, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !884, file: !389, line: 374, baseType: !505, size: 64, offset: 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !831, file: !389, line: 741, baseType: !890, size: 576)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !389, line: 380, size: 576, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !890, file: !389, line: 383, baseType: !884, size: 512)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !890, file: !389, line: 389, baseType: !882, size: 64, offset: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !831, file: !389, line: 742, baseType: !895, size: 320)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !389, line: 395, size: 320, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !895, file: !389, line: 397, baseType: !834, size: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !895, file: !389, line: 400, baseType: !819, size: 64, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !831, file: !389, line: 743, baseType: !900, size: 448)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !389, line: 406, size: 448, elements: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !900, file: !389, line: 408, baseType: !834, size: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !900, file: !389, line: 412, baseType: !505, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !900, file: !389, line: 420, baseType: !505, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !900, file: !389, line: 423, baseType: !819, size: 64, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !831, file: !389, line: 744, baseType: !907, size: 384)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !389, line: 429, size: 384, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !907, file: !389, line: 431, baseType: !834, size: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !907, file: !389, line: 434, baseType: !505, size: 64, offset: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !907, file: !389, line: 437, baseType: !819, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !831, file: !389, line: 745, baseType: !913, size: 384)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !389, line: 443, size: 384, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !913, file: !389, line: 445, baseType: !834, size: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !913, file: !389, line: 449, baseType: !505, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !913, file: !389, line: 453, baseType: !819, size: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !831, file: !389, line: 746, baseType: !919, size: 320)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !389, line: 459, size: 320, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !919, file: !389, line: 461, baseType: !834, size: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !919, file: !389, line: 464, baseType: !505, size: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !831, file: !389, line: 747, baseType: !924, size: 768)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !389, line: 469, size: 768, elements: !925)
!925 = !{!926, !927, !928, !929, !930}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !924, file: !389, line: 471, baseType: !834, size: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !924, file: !389, line: 474, baseType: !5, size: 32, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !924, file: !389, line: 475, baseType: !5, size: 32, offset: 288)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !924, file: !389, line: 478, baseType: !505, size: 64, offset: 320)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !924, file: !389, line: 481, baseType: !931, size: 384, offset: 384)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !932, size: 384, elements: !604)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !932, file: !133, line: 1920, baseType: !870, size: 256)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !932, file: !133, line: 1921, baseType: !505, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !932, file: !133, line: 1922, baseType: !630, size: 32, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !831, file: !389, line: 748, baseType: !938, size: 320)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !389, line: 487, size: 320, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !938, file: !389, line: 490, baseType: !834, size: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !938, file: !389, line: 494, baseType: !463, size: 32, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !831, file: !389, line: 749, baseType: !943, size: 384)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !389, line: 500, size: 384, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !943, file: !389, line: 502, baseType: !834, size: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !943, file: !389, line: 506, baseType: !819, size: 64, offset: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !943, file: !389, line: 510, baseType: !819, size: 64, offset: 320)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !831, file: !389, line: 750, baseType: !949, size: 320)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !389, line: 529, size: 320, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !949, file: !389, line: 531, baseType: !834, size: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !949, file: !389, line: 540, baseType: !819, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !831, file: !389, line: 751, baseType: !954, size: 704)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !389, line: 546, size: 704, elements: !955)
!955 = !{!956, !957, !958, !959, !960, !961, !962}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !954, file: !389, line: 549, baseType: !884, size: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !954, file: !389, line: 553, baseType: !468, size: 64, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !954, file: !389, line: 557, baseType: !462, size: 8, offset: 576)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !954, file: !389, line: 558, baseType: !462, size: 8, offset: 584)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !954, file: !389, line: 559, baseType: !462, size: 8, offset: 592)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !954, file: !389, line: 560, baseType: !462, size: 8, offset: 600)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !954, file: !389, line: 566, baseType: !882, size: 64, offset: 640)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !831, file: !389, line: 752, baseType: !964, size: 384)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !389, line: 571, size: 384, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !964, file: !389, line: 573, baseType: !895, size: 320)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !964, file: !389, line: 577, baseType: !505, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !831, file: !389, line: 753, baseType: !969, size: 576)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !389, line: 600, size: 576, elements: !970)
!970 = !{!971, !972, !973, !976, !985}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !969, file: !389, line: 602, baseType: !895, size: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !969, file: !389, line: 605, baseType: !505, size: 64, offset: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !969, file: !389, line: 609, baseType: !974, size: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !975, line: 46, baseType: !559)
!975 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!976 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !969, file: !389, line: 612, baseType: !977, size: 64, offset: 448)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !978, size: 64)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !389, line: 581, size: 320, elements: !979)
!979 = !{!980, !981, !982, !983, !984}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !978, file: !389, line: 583, baseType: !132, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !978, file: !389, line: 586, baseType: !505, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !978, file: !389, line: 589, baseType: !505, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !978, file: !389, line: 592, baseType: !505, size: 64, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !978, file: !389, line: 595, baseType: !505, size: 64, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !969, file: !389, line: 616, baseType: !819, size: 64, offset: 512)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !831, file: !389, line: 754, baseType: !987, size: 512)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !389, line: 622, size: 512, elements: !988)
!988 = !{!989, !990, !991, !992}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !987, file: !389, line: 624, baseType: !895, size: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !987, file: !389, line: 628, baseType: !505, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !987, file: !389, line: 632, baseType: !505, size: 64, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !987, file: !389, line: 636, baseType: !505, size: 64, offset: 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !831, file: !389, line: 755, baseType: !994, size: 704)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !389, line: 642, size: 704, elements: !995)
!995 = !{!996, !997, !998, !999}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !994, file: !389, line: 644, baseType: !987, size: 512)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !994, file: !389, line: 648, baseType: !505, size: 64, offset: 512)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !994, file: !389, line: 652, baseType: !505, size: 64, offset: 576)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !994, file: !389, line: 653, baseType: !505, size: 64, offset: 640)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !831, file: !389, line: 756, baseType: !1001, size: 448)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !389, line: 663, size: 448, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1001, file: !389, line: 665, baseType: !895, size: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1001, file: !389, line: 668, baseType: !505, size: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1001, file: !389, line: 673, baseType: !505, size: 64, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !831, file: !389, line: 757, baseType: !1007, size: 384)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !389, line: 694, size: 384, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1007, file: !389, line: 696, baseType: !895, size: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1007, file: !389, line: 699, baseType: !505, size: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !831, file: !389, line: 758, baseType: !1012, size: 384)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !389, line: 681, size: 384, elements: !1013)
!1013 = !{!1014, !1015, !1016}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1012, file: !389, line: 683, baseType: !834, size: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1012, file: !389, line: 686, baseType: !505, size: 64, offset: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1012, file: !389, line: 689, baseType: !505, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !831, file: !389, line: 759, baseType: !1018, size: 384)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !389, line: 707, size: 384, elements: !1019)
!1019 = !{!1020, !1021, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1018, file: !389, line: 709, baseType: !834, size: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1018, file: !389, line: 712, baseType: !505, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1018, file: !389, line: 712, baseType: !505, size: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !831, file: !389, line: 760, baseType: !1024, size: 320)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !389, line: 718, size: 320, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1024, file: !389, line: 720, baseType: !834, size: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1024, file: !389, line: 723, baseType: !505, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !826, file: !389, line: 138, baseType: !825, size: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !826, file: !389, line: 139, baseType: !825, size: 64, offset: 128)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !821, file: !389, line: 146, baseType: !824, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !821, file: !389, line: 152, baseType: !819, size: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !816, file: !341, line: 130, baseType: !680, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !811, file: !341, line: 134, baseType: !467, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !811, file: !341, line: 137, baseType: !505, size: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !811, file: !341, line: 138, baseType: !630, size: 32, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !811, file: !341, line: 142, baseType: !5, size: 32, offset: 352)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !811, file: !341, line: 144, baseType: !463, size: 32, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !811, file: !341, line: 145, baseType: !463, size: 32, offset: 416)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !811, file: !341, line: 146, baseType: !1040, size: 64, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !341, line: 119, baseType: !561)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !794, file: !341, line: 220, baseType: !797, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !794, file: !341, line: 223, baseType: !467, size: 64, offset: 128)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !794, file: !341, line: 226, baseType: !1044, size: 64, offset: 192)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 100, size: 1216, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050, !1051, !1056, !1057, !1058, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1089, !1097, !1098}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1045, file: !328, line: 102, baseType: !463, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1045, file: !328, line: 105, baseType: !5, size: 32, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1045, file: !328, line: 108, baseType: !793, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1045, file: !328, line: 111, baseType: !793, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1045, file: !328, line: 114, baseType: !1052, size: 64, offset: 192)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !328, line: 41, size: 64, elements: !1053)
!1053 = !{!1054, !1055}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1052, file: !328, line: 42, baseType: !327, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1052, file: !328, line: 43, baseType: !5, size: 32, offset: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1045, file: !328, line: 117, baseType: !5, size: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1045, file: !328, line: 120, baseType: !5, size: 32, offset: 288)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1045, file: !328, line: 123, baseType: !1059, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !328, line: 87, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !328, line: 87, size: 128, elements: !1062)
!1062 = !{!1063}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1061, file: !328, line: 87, baseType: !1064, size: 128)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !328, line: 85, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !328, line: 85, size: 128, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1065, file: !328, line: 85, baseType: !5, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1065, file: !328, line: 85, baseType: !5, size: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1065, file: !328, line: 85, baseType: !1070, size: 64, offset: 64)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1071, size: 64, elements: !604)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !328, line: 84, baseType: !1044)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1045, file: !328, line: 126, baseType: !1044, size: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1045, file: !328, line: 129, baseType: !1044, size: 64, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1045, file: !328, line: 132, baseType: !467, size: 64, offset: 512)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1045, file: !328, line: 139, baseType: !505, size: 64, offset: 576)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1045, file: !328, line: 143, baseType: !554, size: 128, offset: 640)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1045, file: !328, line: 146, baseType: !554, size: 128, offset: 768)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1045, file: !328, line: 148, baseType: !462, size: 8, offset: 896)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1045, file: !328, line: 149, baseType: !462, size: 8, offset: 904)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1045, file: !328, line: 153, baseType: !336, size: 32, offset: 928)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1045, file: !328, line: 156, baseType: !1082, size: 64, offset: 960)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !328, line: 48, size: 320, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1083, file: !328, line: 50, baseType: !829, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1083, file: !328, line: 59, baseType: !554, size: 128, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1083, file: !328, line: 64, baseType: !462, size: 8, offset: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1083, file: !328, line: 67, baseType: !1082, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1045, file: !328, line: 159, baseType: !1090, size: 64, offset: 1024)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !328, line: 72, size: 256, elements: !1092)
!1092 = !{!1093, !1094, !1095, !1096}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1091, file: !328, line: 74, baseType: !810, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1091, file: !328, line: 77, baseType: !1090, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1091, file: !328, line: 78, baseType: !1090, size: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1091, file: !328, line: 81, baseType: !1090, size: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1045, file: !328, line: 162, baseType: !462, size: 8, offset: 1088)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1045, file: !328, line: 166, baseType: !505, size: 64, offset: 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !794, file: !341, line: 229, baseType: !1100, size: 128, offset: 256)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1101, size: 128, elements: !748)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !341, line: 229, flags: DIFlagFwdDecl)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !794, file: !341, line: 232, baseType: !793, size: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !794, file: !341, line: 233, baseType: !793, size: 64, offset: 448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !794, file: !341, line: 238, baseType: !1106, size: 64, offset: 512)
!1106 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !341, line: 235, size: 64, elements: !1107)
!1107 = !{!1108, !1114}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1106, file: !341, line: 236, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !341, line: 273, size: 128, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1110, file: !341, line: 275, baseType: !819, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1110, file: !341, line: 278, baseType: !819, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1106, file: !341, line: 237, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !341, line: 259, size: 320, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121, !1122}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1116, file: !341, line: 261, baseType: !680, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1116, file: !341, line: 262, baseType: !680, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1116, file: !341, line: 266, baseType: !680, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1116, file: !341, line: 267, baseType: !680, size: 64, offset: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1116, file: !341, line: 270, baseType: !463, size: 32, offset: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !794, file: !341, line: 241, baseType: !1040, size: 64, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !794, file: !341, line: 244, baseType: !463, size: 32, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !794, file: !341, line: 247, baseType: !463, size: 32, offset: 672)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !794, file: !341, line: 250, baseType: !463, size: 32, offset: 704)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !794, file: !341, line: 253, baseType: !463, size: 32, offset: 736)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !794, file: !341, line: 256, baseType: !463, size: 32, offset: 768)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !701, file: !683, line: 179, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !683, line: 150, baseType: !1132)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !683, line: 142, size: 320, elements: !1133)
!1133 = !{!1134, !1135, !1136, !1137, !1140, !1141}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1132, file: !683, line: 144, baseType: !505, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1132, file: !683, line: 145, baseType: !680, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !683, line: 146, baseType: !680, size: 64, offset: 128)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1132, file: !683, line: 147, baseType: !1138, size: 32, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1139, line: 31, baseType: !463)
!1139 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1132, file: !683, line: 148, baseType: !5, size: 32, offset: 224)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1132, file: !683, line: 149, baseType: !462, size: 8, offset: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !701, file: !683, line: 180, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !683, line: 162, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !683, line: 159, size: 128, elements: !1146)
!1146 = !{!1147, !1148}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1145, file: !683, line: 160, baseType: !505, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1145, file: !683, line: 161, baseType: !561, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !701, file: !683, line: 181, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !683, line: 181, flags: DIFlagFwdDecl)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !696, file: !683, line: 317, baseType: !1153, size: 64)
!1153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !561, size: 64, elements: !604)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !696, file: !683, line: 318, baseType: !1155, size: 320)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !683, line: 188, size: 320, elements: !1156)
!1156 = !{!1157, !1159, !1182}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1155, file: !683, line: 190, baseType: !1158, size: 192)
!1158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 192, elements: !579)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1155, file: !683, line: 193, baseType: !1160, size: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !683, line: 206, size: 320, elements: !1162)
!1162 = !{!1163, !1167, !1168, !1169, !1181}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1161, file: !683, line: 208, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !506, line: 62, baseType: !1166)
!1166 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !506, line: 61, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1161, file: !683, line: 211, baseType: !5, size: 32, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !683, line: 214, baseType: !561, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1161, file: !683, line: 224, baseType: !1170, size: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !683, line: 202, baseType: !1172)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !683, line: 202, size: 128, elements: !1173)
!1173 = !{!1174}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1172, file: !683, line: 202, baseType: !1175, size: 128)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !683, line: 200, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !683, line: 200, size: 128, elements: !1177)
!1177 = !{!1178, !1179, !1180}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1176, file: !683, line: 200, baseType: !5, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1176, file: !683, line: 200, baseType: !5, size: 32, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1176, file: !683, line: 200, baseType: !714, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1161, file: !683, line: 234, baseType: !1170, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1155, file: !683, line: 197, baseType: !561, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !696, file: !683, line: 319, baseType: !568, size: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !696, file: !683, line: 320, baseType: !587, size: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !508, file: !133, line: 3384, baseType: !1186, size: 1472)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1187)
!1187 = !{!1188, !1209, !1210, !1211, !1212}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1186, file: !133, line: 3115, baseType: !1189, size: 1216)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1190)
!1190 = !{!1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1189, file: !133, line: 2985, baseType: !676, size: 960)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1189, file: !133, line: 2986, baseType: !505, size: 64, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1189, file: !133, line: 2987, baseType: !505, size: 64, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1189, file: !133, line: 2988, baseType: !505, size: 64, offset: 1088)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1189, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1189, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1189, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1189, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1189, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1189, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1189, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1189, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1189, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1189, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1189, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1189, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1189, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1189, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1186, file: !133, line: 3117, baseType: !505, size: 64, offset: 1216)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1186, file: !133, line: 3119, baseType: !505, size: 64, offset: 1280)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1186, file: !133, line: 3121, baseType: !505, size: 64, offset: 1344)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1186, file: !133, line: 3123, baseType: !505, size: 64, offset: 1408)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !508, file: !133, line: 3385, baseType: !1214, size: 1088)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !133, line: 2875, baseType: !676, size: 960)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1214, file: !133, line: 2876, baseType: !680, size: 64, offset: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1214, file: !133, line: 2877, baseType: !1219, size: 64, offset: 1024)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1221, line: 172, size: 128, elements: !1222)
!1221 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1222 = !{!1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1220, file: !1221, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1220, file: !1221, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1220, file: !1221, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1220, file: !1221, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1220, file: !1221, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1220, file: !1221, line: 195, baseType: !5, size: 32, offset: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1220, file: !1221, line: 199, baseType: !505, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !508, file: !133, line: 3386, baseType: !1189, size: 1216)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !508, file: !133, line: 3387, baseType: !1232, size: 1280)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1232, file: !133, line: 3094, baseType: !1189, size: 1216)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1232, file: !133, line: 3095, baseType: !1219, size: 64, offset: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !508, file: !133, line: 3388, baseType: !1237, size: 1216)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !1238)
!1238 = !{!1239, !1240, !1241, !1242, !1243, !1244}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1237, file: !133, line: 2825, baseType: !638, size: 896)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1237, file: !133, line: 2827, baseType: !505, size: 64, offset: 896)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1237, file: !133, line: 2828, baseType: !505, size: 64, offset: 960)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1237, file: !133, line: 2829, baseType: !505, size: 64, offset: 1024)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1237, file: !133, line: 2830, baseType: !505, size: 64, offset: 1088)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1237, file: !133, line: 2831, baseType: !505, size: 64, offset: 1152)
