; ModuleID = 'lambda-trans.bc'
source_filename = "lambda-trans.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.lambda_trans_matrix_s = type { i32**, i32, i32, i32 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !29 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !43, metadata !DIExpression()), !dbg !45

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "lambda-trans.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lambda_trans_matrix_s", file: !15, line: 50, size: 192, elements: !16)
!15 = !DIFile(filename: "./lambda.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!16 = !{!17, !22, !23, !24}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "matrix", scope: !14, file: !15, line: 52, baseType: !18, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_matrix", file: !15, line: 42, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_vector", file: !15, line: 31, baseType: !21)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "rowsize", scope: !14, file: !15, line: 53, baseType: !6, size: 32, offset: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colsize", scope: !14, file: !15, line: 54, baseType: !6, size: 32, offset: 96)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "denominator", scope: !14, file: !15, line: 55, baseType: !6, size: 32, offset: 128)
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{i32 1, !"wchar_size", i32 4}
!28 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!29 = distinct !DISubprogram(name: "vprintf", scope: !30, file: !30, line: 39, type: !31, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !42)
!30 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!31 = !DISubroutineType(types: !32)
!32 = !{!6, !33, !34}
!33 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !35, size: 64)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !36)
!36 = !{!37, !39, !40, !41}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !35, file: !1, baseType: !38, size: 32)
!38 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !35, file: !1, baseType: !38, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !35, file: !1, baseType: !10, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !35, file: !1, baseType: !10, size: 64, offset: 128)
!42 = !{!43, !44}
!43 = !DILocalVariable(name: "__fmt", arg: 1, scope: !29, file: !30, line: 39, type: !33)
!44 = !DILocalVariable(name: "__arg", arg: 2, scope: !29, file: !30, line: 39, type: !34)
!45 = !DILocation(line: 0, scope: !29)
!46 = !DILocation(line: 41, column: 20, scope: !29)
!47 = !DILocation(line: 41, column: 10, scope: !29)
!48 = !DILocation(line: 41, column: 3, scope: !29)
!49 = distinct !DISubprogram(name: "getchar", scope: !30, file: !30, line: 47, type: !50, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{!6}
!52 = !DILocation(line: 49, column: 16, scope: !49)
!53 = !DILocation(line: 49, column: 10, scope: !49)
!54 = !DILocation(line: 49, column: 3, scope: !49)
!55 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !30, file: !30, line: 56, type: !56, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !117)
!56 = !DISubroutineType(types: !57)
!57 = !{!6, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !60, line: 7, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !81, !82, !83, !87, !89, !91, !95, !98, !100, !103, !106, !107, !108, !112, !113}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 51, baseType: !6, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 54, baseType: !8, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 55, baseType: !8, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 56, baseType: !8, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 57, baseType: !8, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 58, baseType: !8, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 59, baseType: !8, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 60, baseType: !8, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 61, baseType: !8, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 64, baseType: !8, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 65, baseType: !8, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 66, baseType: !8, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 70, baseType: !80, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 72, baseType: !6, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 73, baseType: !6, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 74, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 77, baseType: !88, size: 16, offset: 1024)
!88 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 78, baseType: !90, size: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 79, baseType: !92, size: 8, offset: 1048)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 81, baseType: !96, size: 64, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 43, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 89, baseType: !99, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !86)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !61, file: !62, line: 91, baseType: !101, size: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !62, line: 37, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !61, file: !62, line: 92, baseType: !104, size: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !62, line: 38, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !61, file: !62, line: 93, baseType: !80, size: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !61, file: !62, line: 94, baseType: !10, size: 64, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 95, baseType: !109, size: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!111 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 96, baseType: !6, size: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 98, baseType: !114, size: 160, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !{!118}
!118 = !DILocalVariable(name: "__fp", arg: 1, scope: !55, file: !30, line: 56, type: !58)
!119 = !DILocation(line: 0, scope: !55)
!120 = !DILocation(line: 58, column: 10, scope: !55)
!121 = !DILocation(line: 58, column: 3, scope: !55)
!122 = distinct !DISubprogram(name: "getc_unlocked", scope: !30, file: !30, line: 66, type: !56, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !123)
!123 = !{!124}
!124 = !DILocalVariable(name: "__fp", arg: 1, scope: !122, file: !30, line: 66, type: !58)
!125 = !DILocation(line: 0, scope: !122)
!126 = !DILocation(line: 68, column: 10, scope: !122)
!127 = !DILocation(line: 68, column: 3, scope: !122)
!128 = distinct !DISubprogram(name: "getchar_unlocked", scope: !30, file: !30, line: 73, type: !50, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!129 = !DILocation(line: 75, column: 10, scope: !128)
!130 = !DILocation(line: 75, column: 3, scope: !128)
!131 = distinct !DISubprogram(name: "putchar", scope: !30, file: !30, line: 82, type: !132, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{!6, !6}
!134 = !{!135}
!135 = !DILocalVariable(name: "__c", arg: 1, scope: !131, file: !30, line: 82, type: !6)
!136 = !DILocation(line: 0, scope: !131)
!137 = !DILocation(line: 84, column: 21, scope: !131)
!138 = !DILocation(line: 84, column: 10, scope: !131)
!139 = !DILocation(line: 84, column: 3, scope: !131)
!140 = distinct !DISubprogram(name: "fputc_unlocked", scope: !30, file: !30, line: 91, type: !141, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{!6, !6, !58}
!143 = !{!144, !145}
!144 = !DILocalVariable(name: "__c", arg: 1, scope: !140, file: !30, line: 91, type: !6)
!145 = !DILocalVariable(name: "__stream", arg: 2, scope: !140, file: !30, line: 91, type: !58)
!146 = !DILocation(line: 0, scope: !140)
!147 = !DILocation(line: 93, column: 10, scope: !140)
!148 = !DILocation(line: 93, column: 3, scope: !140)
!149 = distinct !DISubprogram(name: "putc_unlocked", scope: !30, file: !30, line: 101, type: !141, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !150)
!150 = !{!151, !152}
!151 = !DILocalVariable(name: "__c", arg: 1, scope: !149, file: !30, line: 101, type: !6)
!152 = !DILocalVariable(name: "__stream", arg: 2, scope: !149, file: !30, line: 101, type: !58)
!153 = !DILocation(line: 0, scope: !149)
!154 = !DILocation(line: 103, column: 10, scope: !149)
!155 = !DILocation(line: 103, column: 3, scope: !149)
!156 = distinct !DISubprogram(name: "putchar_unlocked", scope: !30, file: !30, line: 108, type: !132, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !157)
!157 = !{!158}
!158 = !DILocalVariable(name: "__c", arg: 1, scope: !156, file: !30, line: 108, type: !6)
!159 = !DILocation(line: 0, scope: !156)
!160 = !DILocation(line: 110, column: 10, scope: !156)
!161 = !DILocation(line: 110, column: 3, scope: !156)
!162 = distinct !DISubprogram(name: "getline", scope: !30, file: !30, line: 118, type: !163, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !167)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !7, !166, !58}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 193, baseType: !86)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!167 = !{!168, !169, !170}
!168 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !162, file: !30, line: 118, type: !7)
!169 = !DILocalVariable(name: "__n", arg: 2, scope: !162, file: !30, line: 118, type: !166)
!170 = !DILocalVariable(name: "__stream", arg: 3, scope: !162, file: !30, line: 118, type: !58)
!171 = !DILocation(line: 0, scope: !162)
!172 = !DILocation(line: 120, column: 10, scope: !162)
!173 = !DILocation(line: 120, column: 3, scope: !162)
!174 = distinct !DISubprogram(name: "feof_unlocked", scope: !30, file: !30, line: 128, type: !56, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !175)
!175 = !{!176}
!176 = !DILocalVariable(name: "__stream", arg: 1, scope: !174, file: !30, line: 128, type: !58)
!177 = !DILocation(line: 0, scope: !174)
!178 = !DILocation(line: 130, column: 10, scope: !174)
!179 = !DILocation(line: 130, column: 3, scope: !174)
!180 = distinct !DISubprogram(name: "ferror_unlocked", scope: !30, file: !30, line: 135, type: !56, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !181)
!181 = !{!182}
!182 = !DILocalVariable(name: "__stream", arg: 1, scope: !180, file: !30, line: 135, type: !58)
!183 = !DILocation(line: 0, scope: !180)
!184 = !DILocation(line: 137, column: 10, scope: !180)
!185 = !DILocation(line: 137, column: 3, scope: !180)
!186 = distinct !DISubprogram(name: "tolower", scope: !187, file: !187, line: 207, type: !132, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !188)
!187 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!188 = !{!189}
!189 = !DILocalVariable(name: "__c", arg: 1, scope: !186, file: !187, line: 207, type: !6)
!190 = !DILocation(line: 0, scope: !186)
!191 = !DILocation(line: 209, column: 22, scope: !186)
!192 = !DILocation(line: 209, column: 39, scope: !186)
!193 = !DILocation(line: 209, column: 38, scope: !186)
!194 = !DILocation(line: 209, column: 37, scope: !186)
!195 = !DILocation(line: 209, column: 10, scope: !186)
!196 = !DILocation(line: 209, column: 3, scope: !186)
!197 = distinct !DISubprogram(name: "toupper", scope: !187, file: !187, line: 213, type: !132, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !198)
!198 = !{!199}
!199 = !DILocalVariable(name: "__c", arg: 1, scope: !197, file: !187, line: 213, type: !6)
!200 = !DILocation(line: 0, scope: !197)
!201 = !DILocation(line: 215, column: 22, scope: !197)
!202 = !DILocation(line: 215, column: 39, scope: !197)
!203 = !DILocation(line: 215, column: 38, scope: !197)
!204 = !DILocation(line: 215, column: 37, scope: !197)
!205 = !DILocation(line: 215, column: 10, scope: !197)
!206 = !DILocation(line: 215, column: 3, scope: !197)
!207 = distinct !DISubprogram(name: "atoi", scope: !208, file: !208, line: 361, type: !209, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !211)
!208 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!209 = !DISubroutineType(types: !210)
!210 = !{!6, !11}
!211 = !{!212}
!212 = !DILocalVariable(name: "__nptr", arg: 1, scope: !207, file: !208, line: 361, type: !11)
!213 = !DILocation(line: 0, scope: !207)
!214 = !DILocation(line: 363, column: 16, scope: !207)
!215 = !DILocation(line: 363, column: 10, scope: !207)
!216 = !DILocation(line: 363, column: 3, scope: !207)
!217 = distinct !DISubprogram(name: "atol", scope: !208, file: !208, line: 366, type: !218, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !220)
!218 = !DISubroutineType(types: !219)
!219 = !{!86, !11}
!220 = !{!221}
!221 = !DILocalVariable(name: "__nptr", arg: 1, scope: !217, file: !208, line: 366, type: !11)
!222 = !DILocation(line: 0, scope: !217)
!223 = !DILocation(line: 368, column: 10, scope: !217)
!224 = !DILocation(line: 368, column: 3, scope: !217)
!225 = distinct !DISubprogram(name: "atoll", scope: !208, file: !208, line: 373, type: !226, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !229)
!226 = !DISubroutineType(types: !227)
!227 = !{!228, !11}
!228 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!229 = !{!230}
!230 = !DILocalVariable(name: "__nptr", arg: 1, scope: !225, file: !208, line: 373, type: !11)
!231 = !DILocation(line: 0, scope: !225)
!232 = !DILocation(line: 375, column: 10, scope: !225)
!233 = !DILocation(line: 375, column: 3, scope: !225)
!234 = distinct !DISubprogram(name: "bsearch", scope: !235, file: !235, line: 20, type: !236, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !244)
!235 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!236 = !DISubroutineType(types: !237)
!237 = !{!10, !238, !238, !109, !109, !240}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !208, line: 808, baseType: !241)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DISubroutineType(types: !243)
!243 = !{!6, !238, !238}
!244 = !{!245, !246, !247, !248, !249, !250, !251, !252, !253, !254}
!245 = !DILocalVariable(name: "__key", arg: 1, scope: !234, file: !235, line: 20, type: !238)
!246 = !DILocalVariable(name: "__base", arg: 2, scope: !234, file: !235, line: 20, type: !238)
!247 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !234, file: !235, line: 20, type: !109)
!248 = !DILocalVariable(name: "__size", arg: 4, scope: !234, file: !235, line: 20, type: !109)
!249 = !DILocalVariable(name: "__compar", arg: 5, scope: !234, file: !235, line: 21, type: !240)
!250 = !DILocalVariable(name: "__l", scope: !234, file: !235, line: 23, type: !109)
!251 = !DILocalVariable(name: "__u", scope: !234, file: !235, line: 23, type: !109)
!252 = !DILocalVariable(name: "__idx", scope: !234, file: !235, line: 23, type: !109)
!253 = !DILocalVariable(name: "__p", scope: !234, file: !235, line: 24, type: !238)
!254 = !DILocalVariable(name: "__comparison", scope: !234, file: !235, line: 25, type: !6)
!255 = !DILocation(line: 0, scope: !234)
!256 = !DILocation(line: 29, column: 3, scope: !234)
!257 = !DILocation(line: 27, column: 7, scope: !234)
!258 = !DILocation(line: 29, column: 14, scope: !234)
!259 = !DILocation(line: 31, column: 20, scope: !260)
!260 = distinct !DILexicalBlock(scope: !234, file: !235, line: 30, column: 5)
!261 = !DILocation(line: 31, column: 27, scope: !260)
!262 = !DILocation(line: 32, column: 56, scope: !260)
!263 = !DILocation(line: 32, column: 47, scope: !260)
!264 = !DILocation(line: 33, column: 22, scope: !260)
!265 = !DILocation(line: 34, column: 24, scope: !266)
!266 = distinct !DILexicalBlock(scope: !260, file: !235, line: 34, column: 11)
!267 = !DILocation(line: 34, column: 11, scope: !260)
!268 = !DILocation(line: 36, column: 29, scope: !269)
!269 = distinct !DILexicalBlock(scope: !266, file: !235, line: 36, column: 16)
!270 = !DILocation(line: 36, column: 16, scope: !266)
!271 = !DILocation(line: 37, column: 14, scope: !269)
!272 = distinct !{!272, !256, !273}
!273 = !DILocation(line: 40, column: 5, scope: !234)
!274 = !DILocation(line: 43, column: 1, scope: !234)
!275 = distinct !DISubprogram(name: "atof", scope: !276, file: !276, line: 25, type: !277, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !280)
!276 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!277 = !DISubroutineType(types: !278)
!278 = !{!279, !11}
!279 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!280 = !{!281}
!281 = !DILocalVariable(name: "__nptr", arg: 1, scope: !275, file: !276, line: 25, type: !11)
!282 = !DILocation(line: 0, scope: !275)
!283 = !DILocation(line: 27, column: 10, scope: !275)
!284 = !DILocation(line: 27, column: 3, scope: !275)
!285 = distinct !DISubprogram(name: "strtoimax", scope: !286, file: !286, line: 324, type: !287, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !293)
!286 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!287 = !DISubroutineType(types: !288)
!288 = !{!289, !33, !292, !6}
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !290, line: 101, baseType: !291)
!290 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !85, line: 72, baseType: !86)
!292 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !7)
!293 = !{!294, !295, !296}
!294 = !DILocalVariable(name: "nptr", arg: 1, scope: !285, file: !286, line: 324, type: !33)
!295 = !DILocalVariable(name: "endptr", arg: 2, scope: !285, file: !286, line: 324, type: !292)
!296 = !DILocalVariable(name: "base", arg: 3, scope: !285, file: !286, line: 324, type: !6)
!297 = !DILocation(line: 0, scope: !285)
!298 = !DILocation(line: 327, column: 10, scope: !285)
!299 = !DILocation(line: 327, column: 3, scope: !285)
!300 = distinct !DISubprogram(name: "strtoumax", scope: !286, file: !286, line: 336, type: !301, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !305)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !33, !292, !6}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !290, line: 102, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !85, line: 73, baseType: !111)
!305 = !{!306, !307, !308}
!306 = !DILocalVariable(name: "nptr", arg: 1, scope: !300, file: !286, line: 336, type: !33)
!307 = !DILocalVariable(name: "endptr", arg: 2, scope: !300, file: !286, line: 336, type: !292)
!308 = !DILocalVariable(name: "base", arg: 3, scope: !300, file: !286, line: 336, type: !6)
!309 = !DILocation(line: 0, scope: !300)
!310 = !DILocation(line: 339, column: 10, scope: !300)
!311 = !DILocation(line: 339, column: 3, scope: !300)
!312 = distinct !DISubprogram(name: "wcstoimax", scope: !286, file: !286, line: 348, type: !313, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !322)
!313 = !DISubroutineType(types: !314)
!314 = !{!289, !315, !319, !6}
!315 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !286, line: 34, baseType: !6)
!319 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !320)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!322 = !{!323, !324, !325}
!323 = !DILocalVariable(name: "nptr", arg: 1, scope: !312, file: !286, line: 348, type: !315)
!324 = !DILocalVariable(name: "endptr", arg: 2, scope: !312, file: !286, line: 348, type: !319)
!325 = !DILocalVariable(name: "base", arg: 3, scope: !312, file: !286, line: 348, type: !6)
!326 = !DILocation(line: 0, scope: !312)
!327 = !DILocation(line: 351, column: 10, scope: !312)
!328 = !DILocation(line: 351, column: 3, scope: !312)
!329 = distinct !DISubprogram(name: "wcstoumax", scope: !286, file: !286, line: 362, type: !330, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !332)
!330 = !DISubroutineType(types: !331)
!331 = !{!303, !315, !319, !6}
!332 = !{!333, !334, !335}
!333 = !DILocalVariable(name: "nptr", arg: 1, scope: !329, file: !286, line: 362, type: !315)
!334 = !DILocalVariable(name: "endptr", arg: 2, scope: !329, file: !286, line: 362, type: !319)
!335 = !DILocalVariable(name: "base", arg: 3, scope: !329, file: !286, line: 362, type: !6)
!336 = !DILocation(line: 0, scope: !329)
!337 = !DILocation(line: 365, column: 10, scope: !329)
!338 = !DILocation(line: 365, column: 3, scope: !329)
!339 = distinct !DISubprogram(name: "stat", scope: !340, file: !340, line: 453, type: !341, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !380)
!340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!341 = !DISubroutineType(types: !342)
!342 = !{!6, !11, !343}
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !345, line: 46, size: 1152, elements: !346)
!345 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!346 = !{!347, !349, !351, !353, !355, !357, !359, !360, !361, !362, !364, !366, !374, !375, !376}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !344, file: !345, line: 48, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !85, line: 145, baseType: !111)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !344, file: !345, line: 53, baseType: !350, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !85, line: 148, baseType: !111)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !344, file: !345, line: 61, baseType: !352, size: 64, offset: 128)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !85, line: 151, baseType: !111)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !344, file: !345, line: 62, baseType: !354, size: 32, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !85, line: 150, baseType: !38)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !344, file: !345, line: 64, baseType: !356, size: 32, offset: 224)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !85, line: 146, baseType: !38)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !344, file: !345, line: 65, baseType: !358, size: 32, offset: 256)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !85, line: 147, baseType: !38)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !344, file: !345, line: 67, baseType: !6, size: 32, offset: 288)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !344, file: !345, line: 69, baseType: !348, size: 64, offset: 320)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !344, file: !345, line: 74, baseType: !84, size: 64, offset: 384)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !344, file: !345, line: 78, baseType: !363, size: 64, offset: 448)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !85, line: 174, baseType: !86)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !344, file: !345, line: 80, baseType: !365, size: 64, offset: 512)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !85, line: 179, baseType: !86)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !344, file: !345, line: 91, baseType: !367, size: 128, offset: 576)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !368, line: 10, size: 128, elements: !369)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!369 = !{!370, !372}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !367, file: !368, line: 12, baseType: !371, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !85, line: 160, baseType: !86)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !367, file: !368, line: 16, baseType: !373, size: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !85, line: 196, baseType: !86)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !344, file: !345, line: 92, baseType: !367, size: 128, offset: 704)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !344, file: !345, line: 93, baseType: !367, size: 128, offset: 832)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !344, file: !345, line: 106, baseType: !377, size: 192, offset: 960)
!377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !373, size: 192, elements: !378)
!378 = !{!379}
!379 = !DISubrange(count: 3)
!380 = !{!381, !382}
!381 = !DILocalVariable(name: "__path", arg: 1, scope: !339, file: !340, line: 453, type: !11)
!382 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !339, file: !340, line: 453, type: !343)
!383 = !DILocation(line: 0, scope: !339)
!384 = !DILocation(line: 455, column: 10, scope: !339)
!385 = !DILocation(line: 455, column: 3, scope: !339)
!386 = distinct !DISubprogram(name: "lstat", scope: !340, file: !340, line: 460, type: !341, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !387)
!387 = !{!388, !389}
!388 = !DILocalVariable(name: "__path", arg: 1, scope: !386, file: !340, line: 460, type: !11)
!389 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !386, file: !340, line: 460, type: !343)
!390 = !DILocation(line: 0, scope: !386)
!391 = !DILocation(line: 462, column: 10, scope: !386)
!392 = !DILocation(line: 462, column: 3, scope: !386)
!393 = distinct !DISubprogram(name: "fstat", scope: !340, file: !340, line: 467, type: !394, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !396)
!394 = !DISubroutineType(types: !395)
!395 = !{!6, !6, !343}
!396 = !{!397, !398}
!397 = !DILocalVariable(name: "__fd", arg: 1, scope: !393, file: !340, line: 467, type: !6)
!398 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !393, file: !340, line: 467, type: !343)
!399 = !DILocation(line: 0, scope: !393)
!400 = !DILocation(line: 469, column: 10, scope: !393)
!401 = !DILocation(line: 469, column: 3, scope: !393)
!402 = distinct !DISubprogram(name: "fstatat", scope: !340, file: !340, line: 474, type: !403, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !405)
!403 = !DISubroutineType(types: !404)
!404 = !{!6, !6, !11, !343, !6}
!405 = !{!406, !407, !408, !409}
!406 = !DILocalVariable(name: "__fd", arg: 1, scope: !402, file: !340, line: 474, type: !6)
!407 = !DILocalVariable(name: "__filename", arg: 2, scope: !402, file: !340, line: 474, type: !11)
!408 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !402, file: !340, line: 474, type: !343)
!409 = !DILocalVariable(name: "__flag", arg: 4, scope: !402, file: !340, line: 474, type: !6)
!410 = !DILocation(line: 0, scope: !402)
!411 = !DILocation(line: 477, column: 10, scope: !402)
!412 = !DILocation(line: 477, column: 3, scope: !402)
!413 = distinct !DISubprogram(name: "mknod", scope: !340, file: !340, line: 483, type: !414, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !416)
!414 = !DISubroutineType(types: !415)
!415 = !{!6, !11, !354, !348}
!416 = !{!417, !418, !419}
!417 = !DILocalVariable(name: "__path", arg: 1, scope: !413, file: !340, line: 483, type: !11)
!418 = !DILocalVariable(name: "__mode", arg: 2, scope: !413, file: !340, line: 483, type: !354)
!419 = !DILocalVariable(name: "__dev", arg: 3, scope: !413, file: !340, line: 483, type: !348)
!420 = !DILocation(line: 0, scope: !413)
!421 = !DILocation(line: 485, column: 10, scope: !413)
!422 = !DILocation(line: 485, column: 3, scope: !413)
!423 = distinct !DISubprogram(name: "mknodat", scope: !340, file: !340, line: 491, type: !424, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !426)
!424 = !DISubroutineType(types: !425)
!425 = !{!6, !6, !11, !354, !348}
!426 = !{!427, !428, !429, !430}
!427 = !DILocalVariable(name: "__fd", arg: 1, scope: !423, file: !340, line: 491, type: !6)
!428 = !DILocalVariable(name: "__path", arg: 2, scope: !423, file: !340, line: 491, type: !11)
!429 = !DILocalVariable(name: "__mode", arg: 3, scope: !423, file: !340, line: 491, type: !354)
!430 = !DILocalVariable(name: "__dev", arg: 4, scope: !423, file: !340, line: 491, type: !348)
!431 = !DILocation(line: 0, scope: !423)
!432 = !DILocation(line: 494, column: 10, scope: !423)
!433 = !DILocation(line: 494, column: 3, scope: !423)
!434 = distinct !DISubprogram(name: "stat64", scope: !340, file: !340, line: 502, type: !435, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !457)
!435 = !DISubroutineType(types: !436)
!436 = !{!6, !11, !437}
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !438, size: 64)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !345, line: 119, size: 1152, elements: !439)
!439 = !{!440, !441, !443, !444, !445, !446, !447, !448, !449, !450, !451, !453, !454, !455, !456}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !438, file: !345, line: 121, baseType: !348, size: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !438, file: !345, line: 123, baseType: !442, size: 64, offset: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !85, line: 149, baseType: !111)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !438, file: !345, line: 124, baseType: !352, size: 64, offset: 128)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !438, file: !345, line: 125, baseType: !354, size: 32, offset: 192)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !438, file: !345, line: 132, baseType: !356, size: 32, offset: 224)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !438, file: !345, line: 133, baseType: !358, size: 32, offset: 256)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !438, file: !345, line: 135, baseType: !6, size: 32, offset: 288)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !438, file: !345, line: 136, baseType: !348, size: 64, offset: 320)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !438, file: !345, line: 137, baseType: !84, size: 64, offset: 384)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !438, file: !345, line: 143, baseType: !363, size: 64, offset: 448)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !438, file: !345, line: 144, baseType: !452, size: 64, offset: 512)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !85, line: 180, baseType: !86)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !438, file: !345, line: 152, baseType: !367, size: 128, offset: 576)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !438, file: !345, line: 153, baseType: !367, size: 128, offset: 704)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !438, file: !345, line: 154, baseType: !367, size: 128, offset: 832)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !438, file: !345, line: 164, baseType: !377, size: 192, offset: 960)
!457 = !{!458, !459}
!458 = !DILocalVariable(name: "__path", arg: 1, scope: !434, file: !340, line: 502, type: !11)
!459 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !434, file: !340, line: 502, type: !437)
!460 = !DILocation(line: 0, scope: !434)
!461 = !DILocation(line: 504, column: 10, scope: !434)
!462 = !DILocation(line: 504, column: 3, scope: !434)
!463 = distinct !DISubprogram(name: "lstat64", scope: !340, file: !340, line: 509, type: !435, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !464)
!464 = !{!465, !466}
!465 = !DILocalVariable(name: "__path", arg: 1, scope: !463, file: !340, line: 509, type: !11)
!466 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !463, file: !340, line: 509, type: !437)
!467 = !DILocation(line: 0, scope: !463)
!468 = !DILocation(line: 511, column: 10, scope: !463)
!469 = !DILocation(line: 511, column: 3, scope: !463)
!470 = distinct !DISubprogram(name: "fstat64", scope: !340, file: !340, line: 516, type: !471, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{!6, !6, !437}
!473 = !{!474, !475}
!474 = !DILocalVariable(name: "__fd", arg: 1, scope: !470, file: !340, line: 516, type: !6)
!475 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !470, file: !340, line: 516, type: !437)
!476 = !DILocation(line: 0, scope: !470)
!477 = !DILocation(line: 518, column: 10, scope: !470)
!478 = !DILocation(line: 518, column: 3, scope: !470)
!479 = distinct !DISubprogram(name: "fstatat64", scope: !340, file: !340, line: 523, type: !480, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !482)
!480 = !DISubroutineType(types: !481)
!481 = !{!6, !6, !11, !437, !6}
!482 = !{!483, !484, !485, !486}
!483 = !DILocalVariable(name: "__fd", arg: 1, scope: !479, file: !340, line: 523, type: !6)
!484 = !DILocalVariable(name: "__filename", arg: 2, scope: !479, file: !340, line: 523, type: !11)
!485 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !479, file: !340, line: 523, type: !437)
!486 = !DILocalVariable(name: "__flag", arg: 4, scope: !479, file: !340, line: 523, type: !6)
!487 = !DILocation(line: 0, scope: !479)
!488 = !DILocation(line: 526, column: 10, scope: !479)
!489 = !DILocation(line: 526, column: 3, scope: !479)
!490 = distinct !DISubprogram(name: "lambda_trans_matrix_new", scope: !1, file: !1, line: 34, type: !491, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !494)
!491 = !DISubroutineType(types: !492)
!492 = !{!493, !6, !6}
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "lambda_trans_matrix", file: !15, line: 56, baseType: !13)
!494 = !{!495, !496, !497}
!495 = !DILocalVariable(name: "colsize", arg: 1, scope: !490, file: !1, line: 34, type: !6)
!496 = !DILocalVariable(name: "rowsize", arg: 2, scope: !490, file: !1, line: 34, type: !6)
!497 = !DILocalVariable(name: "ret", scope: !490, file: !1, line: 36, type: !493)
!498 = !DILocation(line: 0, scope: !490)
!499 = !DILocation(line: 38, column: 9, scope: !490)
!500 = !DILocation(line: 39, column: 22, scope: !490)
!501 = !DILocation(line: 39, column: 3, scope: !490)
!502 = !DILocation(line: 39, column: 20, scope: !490)
!503 = !DILocation(line: 40, column: 3, scope: !490)
!504 = !DILocation(line: 40, column: 21, scope: !490)
!505 = !DILocation(line: 41, column: 3, scope: !490)
!506 = !DILocation(line: 41, column: 21, scope: !490)
!507 = !DILocation(line: 42, column: 3, scope: !490)
!508 = !DILocation(line: 42, column: 25, scope: !490)
!509 = !DILocation(line: 43, column: 3, scope: !490)
