; ModuleID = 'langhooks.bc'
source_filename = "langhooks.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!1089 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ORDERED_RUNTIME_NEXT", value: 677, isUnsigned: true)
!1090 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_STATIC_START", value: 678, isUnsigned: true)
!1091 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_START", value: 679, isUnsigned: true)
!1092 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_START", value: 680, isUnsigned: true)
!1093 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_START", value: 681, isUnsigned: true)
!1094 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_START", value: 682, isUnsigned: true)
!1095 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_START", value: 683, isUnsigned: true)
!1096 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_START", value: 684, isUnsigned: true)
!1097 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_START", value: 685, isUnsigned: true)
!1098 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_STATIC_NEXT", value: 686, isUnsigned: true)
!1099 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_NEXT", value: 687, isUnsigned: true)
!1100 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_NEXT", value: 688, isUnsigned: true)
!1101 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_NEXT", value: 689, isUnsigned: true)
!1102 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_NEXT", value: 690, isUnsigned: true)
!1103 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_NEXT", value: 691, isUnsigned: true)
!1104 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_NEXT", value: 692, isUnsigned: true)
!1105 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_NEXT", value: 693, isUnsigned: true)
!1106 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_STATIC_START", value: 694, isUnsigned: true)
!1107 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_DYNAMIC_START", value: 695, isUnsigned: true)
!1108 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_GUIDED_START", value: 696, isUnsigned: true)
!1109 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_RUNTIME_START", value: 697, isUnsigned: true)
!1110 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END", value: 698, isUnsigned: true)
!1111 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END_NOWAIT", value: 699, isUnsigned: true)
!1112 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_START", value: 700, isUnsigned: true)
!1113 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_END", value: 701, isUnsigned: true)
!1114 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_START", value: 702, isUnsigned: true)
!1115 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_END", value: 703, isUnsigned: true)
!1116 = !DIEnumerator(name: "BUILT_IN_GOMP_TASK", value: 704, isUnsigned: true)
!1117 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_START", value: 705, isUnsigned: true)
!1118 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_NEXT", value: 706, isUnsigned: true)
!1119 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_SECTIONS_START", value: 707, isUnsigned: true)
!1120 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END", value: 708, isUnsigned: true)
!1121 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END_NOWAIT", value: 709, isUnsigned: true)
!1122 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_START", value: 710, isUnsigned: true)
!1123 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_START", value: 711, isUnsigned: true)
!1124 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_END", value: 712, isUnsigned: true)
!1125 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MIN", value: 713, isUnsigned: true)
!1126 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MAX", value: 716, isUnsigned: true)
!1127 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MIN", value: 717, isUnsigned: true)
!1128 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MAX", value: 720, isUnsigned: true)
!1129 = !DIEnumerator(name: "END_BUILTINS", value: 721, isUnsigned: true)
!1130 = !{!1131, !1132, !1133, !1134, !1137, !1138, !1140, !134, !1135, !1194, !1500, !1267, !410}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1133 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1136)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1141, line: 56, baseType: !1142)
!1141 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !1144)
!1144 = !{!1145, !1178, !1184, !1197, !1216, !1227, !1232, !1241, !1247, !1260, !1272, !1310, !1803, !1831, !1839, !1840, !1845, !1854, !1860, !1865, !1869, !1873, !2047, !2094, !2100, !2106, !2113, !2124, !2149, !2166, !2178, !2200, !2215, !2387}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1143, file: !135, line: 3372, baseType: !1146, size: 64)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1146, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1146, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1146, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1146, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1146, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1146, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1146, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1146, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1146, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1146, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1146, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1146, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1146, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1146, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1146, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1146, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1146, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1146, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1146, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1146, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1146, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1146, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1146, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1146, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1146, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1146, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1146, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1146, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1146, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1146, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1143, file: !135, line: 3373, baseType: !1179, size: 192)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !1180)
!1180 = !{!1181, !1182, !1183}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1179, file: !135, line: 403, baseType: !1146, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1179, file: !135, line: 404, baseType: !1140, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1179, file: !135, line: 405, baseType: !1140, size: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1143, file: !135, line: 3374, baseType: !1185, size: 320)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1185, file: !135, line: 1385, baseType: !1179, size: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1185, file: !135, line: 1386, baseType: !1189, size: 128, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1190, line: 58, baseType: !1191)
!1190 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1190, line: 54, size: 128, elements: !1192)
!1192 = !{!1193, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1191, file: !1190, line: 56, baseType: !1194, size: 64)
!1194 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1191, file: !1190, line: 57, baseType: !1196, size: 64, offset: 64)
!1196 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1143, file: !135, line: 3375, baseType: !1198, size: 256)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !1199)
!1199 = !{!1200, !1201}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1198, file: !135, line: 1398, baseType: !1179, size: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1198, file: !135, line: 1399, baseType: !1202, size: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1204, line: 52, size: 256, elements: !1205)
!1204 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1205 = !{!1206, !1207, !1208, !1209, !1210, !1211, !1212}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1203, file: !1204, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1203, file: !1204, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1203, file: !1204, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1203, file: !1204, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1203, file: !1204, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1203, file: !1204, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1203, file: !1204, line: 62, baseType: !1213, size: 192, offset: 64)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1194, size: 192, elements: !1214)
!1214 = !{!1215}
!1215 = !DISubrange(count: 3)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1143, file: !135, line: 3376, baseType: !1217, size: 256)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !1218)
!1218 = !{!1219, !1220}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1217, file: !135, line: 1409, baseType: !1179, size: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1217, file: !135, line: 1410, baseType: !1221, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1223, line: 27, size: 192, elements: !1224)
!1223 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1224 = !{!1225, !1226}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1222, file: !1223, line: 29, baseType: !1189, size: 128)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1222, file: !1223, line: 30, baseType: !5, size: 32, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1143, file: !135, line: 3377, baseType: !1228, size: 256)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !1229)
!1229 = !{!1230, !1231}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1228, file: !135, line: 1438, baseType: !1179, size: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1228, file: !135, line: 1439, baseType: !1140, size: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1143, file: !135, line: 3378, baseType: !1233, size: 256)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !1234)
!1234 = !{!1235, !1236, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1233, file: !135, line: 1419, baseType: !1179, size: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1233, file: !135, line: 1420, baseType: !1133, size: 32, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1233, file: !135, line: 1421, baseType: !1238, size: 8, offset: 224)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 8, elements: !1239)
!1239 = !{!1240}
!1240 = !DISubrange(count: 1)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1143, file: !135, line: 3379, baseType: !1242, size: 320)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !1243)
!1243 = !{!1244, !1245, !1246}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1242, file: !135, line: 1429, baseType: !1179, size: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1242, file: !135, line: 1430, baseType: !1140, size: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1242, file: !135, line: 1431, baseType: !1140, size: 64, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1143, file: !135, line: 3380, baseType: !1248, size: 320)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !1249)
!1249 = !{!1250, !1251}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1248, file: !135, line: 1461, baseType: !1179, size: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1248, file: !135, line: 1462, baseType: !1252, size: 128, offset: 192)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1253, line: 31, size: 128, elements: !1254)
!1253 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1254 = !{!1255, !1258, !1259}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1252, file: !1253, line: 32, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1132)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1252, file: !1253, line: 33, baseType: !7, size: 32, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1252, file: !1253, line: 34, baseType: !7, size: 32, offset: 96)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1143, file: !135, line: 3381, baseType: !1261, size: 384)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !1262)
!1262 = !{!1263, !1264, !1269, !1270, !1271}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1261, file: !135, line: 2508, baseType: !1179, size: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1261, file: !135, line: 2509, baseType: !1265, size: 32, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1266, line: 58, baseType: !1267)
!1266 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1268, line: 44, baseType: !7)
!1268 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1261, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1261, file: !135, line: 2511, baseType: !1140, size: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1261, file: !135, line: 2512, baseType: !1140, size: 64, offset: 320)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1143, file: !135, line: 3382, baseType: !1273, size: 896)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1273, file: !135, line: 2653, baseType: !1261, size: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1273, file: !135, line: 2654, baseType: !1140, size: 64, offset: 384)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1273, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1273, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1273, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1273, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1273, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1273, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1273, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1273, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1273, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1273, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1273, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1273, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1273, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1273, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1273, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1273, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1273, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1273, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1273, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1273, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1273, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1273, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1273, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1273, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1273, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1273, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1273, file: !135, line: 2705, baseType: !1140, size: 64, offset: 576)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1273, file: !135, line: 2706, baseType: !1140, size: 64, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1273, file: !135, line: 2707, baseType: !1140, size: 64, offset: 704)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1273, file: !135, line: 2708, baseType: !1140, size: 64, offset: 768)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1273, file: !135, line: 2711, baseType: !1308, size: 64, offset: 832)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1143, file: !135, line: 3383, baseType: !1311, size: 960)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1312)
!1312 = !{!1313, !1314}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1311, file: !135, line: 2757, baseType: !1273, size: 896)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1311, file: !135, line: 2758, baseType: !1315, size: 64, offset: 896)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1141, line: 50, baseType: !1316)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1318, line: 240, size: 384, elements: !1319)
!1318 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1319 = !{!1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1317, file: !1318, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1317, file: !1318, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1317, file: !1318, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1317, file: !1318, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1317, file: !1318, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1317, file: !1318, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1317, file: !1318, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1317, file: !1318, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1317, file: !1318, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1317, file: !1318, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1317, file: !1318, line: 321, baseType: !1331, size: 320, offset: 64)
!1331 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1318, line: 315, size: 320, elements: !1332)
!1332 = !{!1333, !1736, !1738, !1801, !1802}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1331, file: !1318, line: 316, baseType: !1334, size: 64)
!1334 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1335, size: 64, elements: !1239)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1318, line: 183, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1318, line: 166, size: 64, elements: !1337)
!1337 = !{!1338, !1339, !1340, !1341, !1342, !1350, !1351, !1363, !1366, !1426, !1427, !1713, !1726, !1733}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1336, file: !1318, line: 168, baseType: !1133, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1336, file: !1318, line: 169, baseType: !7, size: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1336, file: !1318, line: 170, baseType: !1138, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1336, file: !1318, line: 171, baseType: !1315, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1336, file: !1318, line: 172, baseType: !1343, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1141, line: 53, baseType: !1344)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1318, line: 359, size: 128, elements: !1346)
!1346 = !{!1347, !1348}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1345, file: !1318, line: 360, baseType: !1133, size: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1345, file: !1318, line: 361, baseType: !1349, size: 64, offset: 64)
!1349 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1315, size: 64, elements: !1239)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1336, file: !1318, line: 173, baseType: !5, size: 32)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1336, file: !1318, line: 174, baseType: !1352, size: 32)
!1352 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1318, line: 133, baseType: !1353)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1318, line: 115, size: 32, elements: !1354)
!1354 = !{!1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1353, file: !1318, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1353, file: !1318, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1353, file: !1318, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1353, file: !1318, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1353, file: !1318, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1353, file: !1318, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1353, file: !1318, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1353, file: !1318, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1336, file: !1318, line: 175, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1318, line: 175, flags: DIFlagFwdDecl)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1336, file: !1318, line: 176, baseType: !1367, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1369, line: 75, size: 256, elements: !1370)
!1369 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1370 = !{!1371, !1385, !1386, !1387}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1368, file: !1369, line: 76, baseType: !1372, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1373, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1369, line: 68, baseType: !1374)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1369, line: 63, size: 320, elements: !1375)
!1375 = !{!1376, !1378, !1379, !1380}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1374, file: !1369, line: 64, baseType: !1377, size: 64)
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1374, file: !1369, line: 65, baseType: !1377, size: 64, offset: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1374, file: !1369, line: 66, baseType: !7, size: 32, offset: 128)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1374, file: !1369, line: 67, baseType: !1381, size: 128, offset: 192)
!1381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1382, size: 128, elements: !1383)
!1382 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1369, line: 29, baseType: !1194)
!1383 = !{!1384}
!1384 = !DISubrange(count: 2)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1368, file: !1369, line: 77, baseType: !1372, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1368, file: !1369, line: 78, baseType: !7, size: 32, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1368, file: !1369, line: 79, baseType: !1388, size: 64, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1369, line: 49, baseType: !1390)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1369, line: 45, size: 832, elements: !1391)
!1391 = !{!1392, !1393, !1394}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1390, file: !1369, line: 46, baseType: !1377, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1390, file: !1369, line: 47, baseType: !1367, size: 64, offset: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1390, file: !1369, line: 48, baseType: !1395, size: 704, offset: 128)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1396, line: 164, size: 704, elements: !1397)
!1396 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1397 = !{!1398, !1399, !1409, !1410, !1411, !1412, !1413, !1414, !1418, !1422, !1423, !1424, !1425}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1395, file: !1396, line: 166, baseType: !1196, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1395, file: !1396, line: 167, baseType: !1400, size: 64, offset: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1396, line: 157, size: 192, elements: !1402)
!1402 = !{!1403, !1404, !1405}
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1401, file: !1396, line: 159, baseType: !1135, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1401, file: !1396, line: 160, baseType: !1400, size: 64, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1401, file: !1396, line: 161, baseType: !1406, size: 32, offset: 128)
!1406 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1136, size: 32, elements: !1407)
!1407 = !{!1408}
!1408 = !DISubrange(count: 4)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1395, file: !1396, line: 168, baseType: !1135, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1395, file: !1396, line: 169, baseType: !1135, size: 64, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1395, file: !1396, line: 170, baseType: !1135, size: 64, offset: 256)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1395, file: !1396, line: 171, baseType: !1196, size: 64, offset: 320)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1395, file: !1396, line: 172, baseType: !1133, size: 32, offset: 384)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1395, file: !1396, line: 176, baseType: !1415, size: 64, offset: 448)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DISubroutineType(types: !1417)
!1417 = !{!1400, !1137, !1196}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1395, file: !1396, line: 177, baseType: !1419, size: 64, offset: 512)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DISubroutineType(types: !1421)
!1421 = !{null, !1137, !1400}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1395, file: !1396, line: 178, baseType: !1137, size: 64, offset: 576)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1395, file: !1396, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1395, file: !1396, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1395, file: !1396, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1336, file: !1318, line: 177, baseType: !1140, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1336, file: !1318, line: 178, baseType: !1428, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !1430)
!1430 = !{!1431, !1678, !1679, !1680, !1683, !1687, !1688, !1689, !1707, !1708, !1709, !1710, !1711, !1712}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1429, file: !330, line: 219, baseType: !1432, size: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !1434)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !1435)
!1435 = !{!1436}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1434, file: !330, line: 151, baseType: !1437, size: 128)
!1437 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !1438)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !1439)
!1439 = !{!1440, !1441, !1442}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1438, file: !330, line: 150, baseType: !7, size: 32)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1438, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1438, file: !330, line: 150, baseType: !1443, size: 64, offset: 64)
!1443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1444, size: 64, elements: !1239)
!1444 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1141, line: 108, baseType: !1445)
!1445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !1447)
!1447 = !{!1448, !1449, !1450, !1670, !1671, !1672, !1673, !1674, !1675, !1676}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1446, file: !330, line: 124, baseType: !1428, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1446, file: !330, line: 125, baseType: !1428, size: 64, offset: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1446, file: !330, line: 131, baseType: !1451, size: 64, offset: 128)
!1451 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !1452)
!1452 = !{!1453, !1669}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1451, file: !330, line: 129, baseType: !1454, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1141, line: 66, baseType: !1455)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1457, line: 143, size: 192, elements: !1458)
!1457 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1458 = !{!1459, !1667, !1668}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1456, file: !1457, line: 145, baseType: !1460, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1141, line: 69, baseType: !1461)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1457, line: 136, size: 192, elements: !1463)
!1463 = !{!1464, !1665, !1666}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1462, file: !1457, line: 137, baseType: !1465, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1141, line: 58, baseType: !1466)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1457, line: 737, size: 768, elements: !1468)
!1468 = !{!1469, !1486, !1520, !1526, !1531, !1536, !1543, !1549, !1555, !1560, !1574, !1579, !1585, !1590, !1600, !1605, !1623, !1630, !1637, !1643, !1648, !1654, !1660}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1467, file: !1457, line: 738, baseType: !1470, size: 256)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1457, line: 271, size: 256, elements: !1471)
!1471 = !{!1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1470, file: !1457, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1470, file: !1457, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1470, file: !1457, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1470, file: !1457, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1470, file: !1457, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1470, file: !1457, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1470, file: !1457, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1470, file: !1457, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1470, file: !1457, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1470, file: !1457, line: 312, baseType: !7, size: 32, offset: 32)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1470, file: !1457, line: 316, baseType: !1265, size: 32, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1470, file: !1457, line: 319, baseType: !7, size: 32, offset: 96)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1470, file: !1457, line: 323, baseType: !1428, size: 64, offset: 128)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1470, file: !1457, line: 327, baseType: !1140, size: 64, offset: 192)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1467, file: !1457, line: 739, baseType: !1487, size: 448)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1457, line: 350, size: 448, elements: !1488)
!1488 = !{!1489, !1518}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1487, file: !1457, line: 353, baseType: !1490, size: 384)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1457, line: 333, size: 384, elements: !1491)
!1491 = !{!1492, !1493, !1501}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1490, file: !1457, line: 336, baseType: !1470, size: 256)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1490, file: !1457, line: 343, baseType: !1494, size: 64, offset: 256)
!1494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1495, size: 64)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1496, line: 37, size: 128, elements: !1497)
!1496 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1497 = !{!1498, !1499}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1495, file: !1496, line: 39, baseType: !1494, size: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1495, file: !1496, line: 40, baseType: !1500, size: 64, offset: 64)
!1500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1490, file: !1457, line: 344, baseType: !1502, size: 64, offset: 320)
!1502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1503, size: 64)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1496, line: 45, size: 320, elements: !1504)
!1504 = !{!1505, !1506}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1503, file: !1496, line: 47, baseType: !1502, size: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1503, file: !1496, line: 48, baseType: !1507, size: 256, offset: 64)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1508)
!1508 = !{!1509, !1511, !1512, !1517}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1507, file: !135, line: 1884, baseType: !1510, size: 64)
!1510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1507, size: 64)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1507, file: !135, line: 1885, baseType: !1510, size: 64, offset: 64)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1507, file: !135, line: 1891, baseType: !1513, size: 64, offset: 128)
!1513 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1507, file: !135, line: 1891, size: 64, elements: !1514)
!1514 = !{!1515, !1516}
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1513, file: !135, line: 1891, baseType: !1465, size: 64)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1513, file: !135, line: 1891, baseType: !1140, size: 64)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1507, file: !135, line: 1892, baseType: !1500, size: 64, offset: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1487, file: !1457, line: 359, baseType: !1519, size: 64, offset: 384)
!1519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1140, size: 64, elements: !1239)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1467, file: !1457, line: 740, baseType: !1521, size: 512)
!1521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1457, line: 365, size: 512, elements: !1522)
!1522 = !{!1523, !1524, !1525}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1521, file: !1457, line: 368, baseType: !1490, size: 384)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1521, file: !1457, line: 373, baseType: !1140, size: 64, offset: 384)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1521, file: !1457, line: 374, baseType: !1140, size: 64, offset: 448)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1467, file: !1457, line: 741, baseType: !1527, size: 576)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1457, line: 380, size: 576, elements: !1528)
!1528 = !{!1529, !1530}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1527, file: !1457, line: 383, baseType: !1521, size: 512)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1527, file: !1457, line: 389, baseType: !1519, size: 64, offset: 512)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1467, file: !1457, line: 742, baseType: !1532, size: 320)
!1532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1457, line: 395, size: 320, elements: !1533)
!1533 = !{!1534, !1535}
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1532, file: !1457, line: 397, baseType: !1470, size: 256)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1532, file: !1457, line: 400, baseType: !1454, size: 64, offset: 256)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1467, file: !1457, line: 743, baseType: !1537, size: 448)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1457, line: 406, size: 448, elements: !1538)
!1538 = !{!1539, !1540, !1541, !1542}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1537, file: !1457, line: 408, baseType: !1470, size: 256)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1537, file: !1457, line: 412, baseType: !1140, size: 64, offset: 256)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1537, file: !1457, line: 420, baseType: !1140, size: 64, offset: 320)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1537, file: !1457, line: 423, baseType: !1454, size: 64, offset: 384)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1467, file: !1457, line: 744, baseType: !1544, size: 384)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1457, line: 429, size: 384, elements: !1545)
!1545 = !{!1546, !1547, !1548}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1544, file: !1457, line: 431, baseType: !1470, size: 256)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1544, file: !1457, line: 434, baseType: !1140, size: 64, offset: 256)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1544, file: !1457, line: 437, baseType: !1454, size: 64, offset: 320)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1467, file: !1457, line: 745, baseType: !1550, size: 384)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1457, line: 443, size: 384, elements: !1551)
!1551 = !{!1552, !1553, !1554}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1550, file: !1457, line: 445, baseType: !1470, size: 256)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1550, file: !1457, line: 449, baseType: !1140, size: 64, offset: 256)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1550, file: !1457, line: 453, baseType: !1454, size: 64, offset: 320)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1467, file: !1457, line: 746, baseType: !1556, size: 320)
!1556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1457, line: 459, size: 320, elements: !1557)
!1557 = !{!1558, !1559}
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1556, file: !1457, line: 461, baseType: !1470, size: 256)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1556, file: !1457, line: 464, baseType: !1140, size: 64, offset: 256)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1467, file: !1457, line: 747, baseType: !1561, size: 768)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1457, line: 469, size: 768, elements: !1562)
!1562 = !{!1563, !1564, !1565, !1566, !1567}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1561, file: !1457, line: 471, baseType: !1470, size: 256)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1561, file: !1457, line: 474, baseType: !7, size: 32, offset: 256)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1561, file: !1457, line: 475, baseType: !7, size: 32, offset: 288)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1561, file: !1457, line: 478, baseType: !1140, size: 64, offset: 320)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1561, file: !1457, line: 481, baseType: !1568, size: 384, offset: 384)
!1568 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1569, size: 384, elements: !1239)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1570)
!1570 = !{!1571, !1572, !1573}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1569, file: !135, line: 1920, baseType: !1507, size: 256)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1569, file: !135, line: 1921, baseType: !1140, size: 64, offset: 256)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1569, file: !135, line: 1922, baseType: !1265, size: 32, offset: 320)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1467, file: !1457, line: 748, baseType: !1575, size: 320)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1457, line: 487, size: 320, elements: !1576)
!1576 = !{!1577, !1578}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1575, file: !1457, line: 490, baseType: !1470, size: 256)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1575, file: !1457, line: 494, baseType: !1133, size: 32, offset: 256)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1467, file: !1457, line: 749, baseType: !1580, size: 384)
!1580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1457, line: 500, size: 384, elements: !1581)
!1581 = !{!1582, !1583, !1584}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1580, file: !1457, line: 502, baseType: !1470, size: 256)
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1580, file: !1457, line: 506, baseType: !1454, size: 64, offset: 256)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1580, file: !1457, line: 510, baseType: !1454, size: 64, offset: 320)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1467, file: !1457, line: 750, baseType: !1586, size: 320)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1457, line: 529, size: 320, elements: !1587)
!1587 = !{!1588, !1589}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1586, file: !1457, line: 531, baseType: !1470, size: 256)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1586, file: !1457, line: 540, baseType: !1454, size: 64, offset: 256)
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1467, file: !1457, line: 751, baseType: !1591, size: 704)
!1591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1457, line: 546, size: 704, elements: !1592)
!1592 = !{!1593, !1594, !1595, !1596, !1597, !1598, !1599}
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1591, file: !1457, line: 549, baseType: !1521, size: 512)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1591, file: !1457, line: 553, baseType: !1138, size: 64, offset: 512)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1591, file: !1457, line: 557, baseType: !1132, size: 8, offset: 576)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1591, file: !1457, line: 558, baseType: !1132, size: 8, offset: 584)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1591, file: !1457, line: 559, baseType: !1132, size: 8, offset: 592)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1591, file: !1457, line: 560, baseType: !1132, size: 8, offset: 600)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1591, file: !1457, line: 566, baseType: !1519, size: 64, offset: 640)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1467, file: !1457, line: 752, baseType: !1601, size: 384)
!1601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1457, line: 571, size: 384, elements: !1602)
!1602 = !{!1603, !1604}
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1601, file: !1457, line: 573, baseType: !1532, size: 320)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1601, file: !1457, line: 577, baseType: !1140, size: 64, offset: 320)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1467, file: !1457, line: 753, baseType: !1606, size: 576)
!1606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1457, line: 600, size: 576, elements: !1607)
!1607 = !{!1608, !1609, !1610, !1613, !1622}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1606, file: !1457, line: 602, baseType: !1532, size: 320)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1606, file: !1457, line: 605, baseType: !1140, size: 64, offset: 320)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1606, file: !1457, line: 609, baseType: !1611, size: 64, offset: 384)
!1611 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1612, line: 46, baseType: !1194)
!1612 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1606, file: !1457, line: 612, baseType: !1614, size: 64, offset: 448)
!1614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1615, size: 64)
!1615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1457, line: 581, size: 320, elements: !1616)
!1616 = !{!1617, !1618, !1619, !1620, !1621}
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1615, file: !1457, line: 583, baseType: !134, size: 32)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1615, file: !1457, line: 586, baseType: !1140, size: 64, offset: 64)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1615, file: !1457, line: 589, baseType: !1140, size: 64, offset: 128)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1615, file: !1457, line: 592, baseType: !1140, size: 64, offset: 192)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1615, file: !1457, line: 595, baseType: !1140, size: 64, offset: 256)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1606, file: !1457, line: 616, baseType: !1454, size: 64, offset: 512)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1467, file: !1457, line: 754, baseType: !1624, size: 512)
!1624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1457, line: 622, size: 512, elements: !1625)
!1625 = !{!1626, !1627, !1628, !1629}
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1624, file: !1457, line: 624, baseType: !1532, size: 320)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1624, file: !1457, line: 628, baseType: !1140, size: 64, offset: 320)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1624, file: !1457, line: 632, baseType: !1140, size: 64, offset: 384)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1624, file: !1457, line: 636, baseType: !1140, size: 64, offset: 448)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1467, file: !1457, line: 755, baseType: !1631, size: 704)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1457, line: 642, size: 704, elements: !1632)
!1632 = !{!1633, !1634, !1635, !1636}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1631, file: !1457, line: 644, baseType: !1624, size: 512)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1631, file: !1457, line: 648, baseType: !1140, size: 64, offset: 512)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1631, file: !1457, line: 652, baseType: !1140, size: 64, offset: 576)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1631, file: !1457, line: 653, baseType: !1140, size: 64, offset: 640)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1467, file: !1457, line: 756, baseType: !1638, size: 448)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1457, line: 663, size: 448, elements: !1639)
!1639 = !{!1640, !1641, !1642}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1638, file: !1457, line: 665, baseType: !1532, size: 320)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1638, file: !1457, line: 668, baseType: !1140, size: 64, offset: 320)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1638, file: !1457, line: 673, baseType: !1140, size: 64, offset: 384)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1467, file: !1457, line: 757, baseType: !1644, size: 384)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1457, line: 694, size: 384, elements: !1645)
!1645 = !{!1646, !1647}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1644, file: !1457, line: 696, baseType: !1532, size: 320)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1644, file: !1457, line: 699, baseType: !1140, size: 64, offset: 320)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1467, file: !1457, line: 758, baseType: !1649, size: 384)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1457, line: 681, size: 384, elements: !1650)
!1650 = !{!1651, !1652, !1653}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1649, file: !1457, line: 683, baseType: !1470, size: 256)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1649, file: !1457, line: 686, baseType: !1140, size: 64, offset: 256)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1649, file: !1457, line: 689, baseType: !1140, size: 64, offset: 320)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1467, file: !1457, line: 759, baseType: !1655, size: 384)
!1655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1457, line: 707, size: 384, elements: !1656)
!1656 = !{!1657, !1658, !1659}
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1655, file: !1457, line: 709, baseType: !1470, size: 256)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1655, file: !1457, line: 712, baseType: !1140, size: 64, offset: 256)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1655, file: !1457, line: 712, baseType: !1140, size: 64, offset: 320)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1467, file: !1457, line: 760, baseType: !1661, size: 320)
!1661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1457, line: 718, size: 320, elements: !1662)
!1662 = !{!1663, !1664}
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1661, file: !1457, line: 720, baseType: !1470, size: 256)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1661, file: !1457, line: 723, baseType: !1140, size: 64, offset: 256)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1462, file: !1457, line: 138, baseType: !1461, size: 64, offset: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1462, file: !1457, line: 139, baseType: !1461, size: 64, offset: 128)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1456, file: !1457, line: 146, baseType: !1460, size: 64, offset: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1456, file: !1457, line: 152, baseType: !1454, size: 64, offset: 128)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1451, file: !330, line: 130, baseType: !1315, size: 64)
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1446, file: !330, line: 134, baseType: !1137, size: 64, offset: 192)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1446, file: !330, line: 137, baseType: !1140, size: 64, offset: 256)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1446, file: !330, line: 138, baseType: !1265, size: 32, offset: 320)
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1446, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1446, file: !330, line: 144, baseType: !1133, size: 32, offset: 384)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1446, file: !330, line: 145, baseType: !1133, size: 32, offset: 416)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1446, file: !330, line: 146, baseType: !1677, size: 64, offset: 448)
!1677 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !1196)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1429, file: !330, line: 220, baseType: !1432, size: 64, offset: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1429, file: !330, line: 223, baseType: !1137, size: 64, offset: 128)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1429, file: !330, line: 226, baseType: !1681, size: 64, offset: 192)
!1681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1682, size: 64)
!1682 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1429, file: !330, line: 229, baseType: !1684, size: 128, offset: 256)
!1684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1685, size: 128, elements: !1383)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64)
!1686 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1429, file: !330, line: 232, baseType: !1428, size: 64, offset: 384)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1429, file: !330, line: 233, baseType: !1428, size: 64, offset: 448)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1429, file: !330, line: 238, baseType: !1690, size: 64, offset: 512)
!1690 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1691)
!1691 = !{!1692, !1698}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1690, file: !330, line: 236, baseType: !1693, size: 64)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1694, size: 64)
!1694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1695)
!1695 = !{!1696, !1697}
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1694, file: !330, line: 275, baseType: !1454, size: 64)
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1694, file: !330, line: 278, baseType: !1454, size: 64, offset: 64)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1690, file: !330, line: 237, baseType: !1699, size: 64)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64)
!1700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1701)
!1701 = !{!1702, !1703, !1704, !1705, !1706}
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1700, file: !330, line: 261, baseType: !1315, size: 64)
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1700, file: !330, line: 262, baseType: !1315, size: 64, offset: 64)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1700, file: !330, line: 266, baseType: !1315, size: 64, offset: 128)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1700, file: !330, line: 267, baseType: !1315, size: 64, offset: 192)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1700, file: !330, line: 270, baseType: !1133, size: 32, offset: 256)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1429, file: !330, line: 241, baseType: !1677, size: 64, offset: 576)
!1708 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1429, file: !330, line: 244, baseType: !1133, size: 32, offset: 640)
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1429, file: !330, line: 247, baseType: !1133, size: 32, offset: 672)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1429, file: !330, line: 250, baseType: !1133, size: 32, offset: 704)
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1429, file: !330, line: 253, baseType: !1133, size: 32, offset: 736)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1429, file: !330, line: 256, baseType: !1133, size: 32, offset: 768)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1336, file: !1318, line: 179, baseType: !1714, size: 64)
!1714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1715, size: 64)
!1715 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1318, line: 150, baseType: !1716)
!1716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1318, line: 142, size: 320, elements: !1717)
!1717 = !{!1718, !1719, !1720, !1721, !1724, !1725}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1716, file: !1318, line: 144, baseType: !1140, size: 64)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1716, file: !1318, line: 145, baseType: !1315, size: 64, offset: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1716, file: !1318, line: 146, baseType: !1315, size: 64, offset: 128)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1716, file: !1318, line: 147, baseType: !1722, size: 32, offset: 192)
!1722 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1723, line: 31, baseType: !1133)
!1723 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1716, file: !1318, line: 148, baseType: !7, size: 32, offset: 224)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1716, file: !1318, line: 149, baseType: !1132, size: 8, offset: 256)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1336, file: !1318, line: 180, baseType: !1727, size: 64)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64)
!1728 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1318, line: 162, baseType: !1729)
!1729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1318, line: 159, size: 128, elements: !1730)
!1730 = !{!1731, !1732}
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1729, file: !1318, line: 160, baseType: !1140, size: 64)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1729, file: !1318, line: 161, baseType: !1196, size: 64, offset: 64)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1336, file: !1318, line: 181, baseType: !1734, size: 64)
!1734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1735, size: 64)
!1735 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1318, line: 181, flags: DIFlagFwdDecl)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1331, file: !1318, line: 317, baseType: !1737, size: 64)
!1737 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 64, elements: !1239)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1331, file: !1318, line: 318, baseType: !1739, size: 320)
!1739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1318, line: 188, size: 320, elements: !1740)
!1740 = !{!1741, !1743, !1800}
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1739, file: !1318, line: 190, baseType: !1742, size: 192)
!1742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1335, size: 192, elements: !1214)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1739, file: !1318, line: 193, baseType: !1744, size: 64, offset: 192)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64)
!1745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1318, line: 206, size: 320, elements: !1746)
!1746 = !{!1747, !1785, !1786, !1787, !1799}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1745, file: !1318, line: 208, baseType: !1748, size: 64)
!1748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1749, size: 64)
!1749 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1141, line: 62, baseType: !1750)
!1750 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1751, line: 538, size: 256, elements: !1752)
!1751 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1752 = !{!1753, !1757, !1763, !1776}
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1750, file: !1751, line: 539, baseType: !1754, size: 32)
!1754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1751, line: 482, size: 32, elements: !1755)
!1755 = !{!1756}
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1754, file: !1751, line: 484, baseType: !7, size: 32)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1750, file: !1751, line: 540, baseType: !1758, size: 192)
!1758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1751, line: 488, size: 192, elements: !1759)
!1759 = !{!1760, !1761, !1762}
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1758, file: !1751, line: 489, baseType: !1754, size: 32)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1758, file: !1751, line: 492, baseType: !1138, size: 64, offset: 64)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1758, file: !1751, line: 496, baseType: !1140, size: 64, offset: 128)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1750, file: !1751, line: 541, baseType: !1764, size: 256)
!1764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1751, line: 504, size: 256, elements: !1765)
!1765 = !{!1766, !1767, !1774, !1775}
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1764, file: !1751, line: 505, baseType: !1754, size: 32)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1764, file: !1751, line: 509, baseType: !1768, size: 64, offset: 64)
!1768 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1751, line: 501, baseType: !1769)
!1769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1770, size: 64)
!1770 = !DISubroutineType(types: !1771)
!1771 = !{null, !1772}
!1772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1773, size: 64)
!1773 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1764, file: !1751, line: 510, baseType: !1772, size: 64, offset: 128)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1764, file: !1751, line: 513, baseType: !1748, size: 64, offset: 192)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1750, file: !1751, line: 542, baseType: !1777, size: 128)
!1777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1751, line: 530, size: 128, elements: !1778)
!1778 = !{!1779, !1780}
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1777, file: !1751, line: 531, baseType: !1754, size: 32)
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1777, file: !1751, line: 534, baseType: !1781, size: 64, offset: 64)
!1781 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1751, line: 525, baseType: !1782)
!1782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1783, size: 64)
!1783 = !DISubroutineType(types: !1784)
!1784 = !{!1132, !1140, !1138, !1194, !1194}
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1745, file: !1318, line: 211, baseType: !7, size: 32, offset: 64)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1745, file: !1318, line: 214, baseType: !1196, size: 64, offset: 128)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1745, file: !1318, line: 224, baseType: !1788, size: 64, offset: 192)
!1788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1789, size: 64)
!1789 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1318, line: 202, baseType: !1790)
!1790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1318, line: 202, size: 128, elements: !1791)
!1791 = !{!1792}
!1792 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1790, file: !1318, line: 202, baseType: !1793, size: 128)
!1793 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1318, line: 200, baseType: !1794)
!1794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1318, line: 200, size: 128, elements: !1795)
!1795 = !{!1796, !1797, !1798}
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1794, file: !1318, line: 200, baseType: !7, size: 32)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1794, file: !1318, line: 200, baseType: !7, size: 32, offset: 32)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1794, file: !1318, line: 200, baseType: !1349, size: 64, offset: 64)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1745, file: !1318, line: 234, baseType: !1788, size: 64, offset: 256)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1739, file: !1318, line: 197, baseType: !1196, size: 64, offset: 256)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1331, file: !1318, line: 319, baseType: !1203, size: 256)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1331, file: !1318, line: 320, baseType: !1222, size: 192)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1143, file: !135, line: 3384, baseType: !1804, size: 1472)
!1804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1805)
!1805 = !{!1806, !1827, !1828, !1829, !1830}
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1804, file: !135, line: 3115, baseType: !1807, size: 1216)
!1807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1808)
!1808 = !{!1809, !1810, !1811, !1812, !1813, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826}
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1807, file: !135, line: 2985, baseType: !1311, size: 960)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1807, file: !135, line: 2986, baseType: !1140, size: 64, offset: 960)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1807, file: !135, line: 2987, baseType: !1140, size: 64, offset: 1024)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1807, file: !135, line: 2988, baseType: !1140, size: 64, offset: 1088)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1807, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1807, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1807, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1807, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1807, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1807, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1807, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1807, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1807, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1807, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1823 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1807, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1807, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1807, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1807, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1804, file: !135, line: 3117, baseType: !1140, size: 64, offset: 1216)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1804, file: !135, line: 3119, baseType: !1140, size: 64, offset: 1280)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1804, file: !135, line: 3121, baseType: !1140, size: 64, offset: 1344)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1804, file: !135, line: 3123, baseType: !1140, size: 64, offset: 1408)
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1143, file: !135, line: 3385, baseType: !1832, size: 1088)
!1832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1833)
!1833 = !{!1834, !1835, !1836}
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1832, file: !135, line: 2875, baseType: !1311, size: 960)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1832, file: !135, line: 2876, baseType: !1315, size: 64, offset: 960)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1832, file: !135, line: 2877, baseType: !1837, size: 64, offset: 1024)
!1837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1838, size: 64)
!1838 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !135, line: 2856, flags: DIFlagFwdDecl)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1143, file: !135, line: 3386, baseType: !1807, size: 1216)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1143, file: !135, line: 3387, baseType: !1841, size: 1280)
!1841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1842)
!1842 = !{!1843, !1844}
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1841, file: !135, line: 3094, baseType: !1807, size: 1216)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1841, file: !135, line: 3095, baseType: !1837, size: 64, offset: 1216)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1143, file: !135, line: 3388, baseType: !1846, size: 1216)
!1846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1847)
!1847 = !{!1848, !1849, !1850, !1851, !1852, !1853}
!1848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1846, file: !135, line: 2825, baseType: !1273, size: 896)
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1846, file: !135, line: 2827, baseType: !1140, size: 64, offset: 896)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1846, file: !135, line: 2828, baseType: !1140, size: 64, offset: 960)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1846, file: !135, line: 2829, baseType: !1140, size: 64, offset: 1024)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1846, file: !135, line: 2830, baseType: !1140, size: 64, offset: 1088)
!1853 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1846, file: !135, line: 2831, baseType: !1140, size: 64, offset: 1152)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1143, file: !135, line: 3389, baseType: !1855, size: 1024)
!1855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1856)
!1856 = !{!1857, !1858, !1859}
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1855, file: !135, line: 2851, baseType: !1311, size: 960)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1855, file: !135, line: 2852, baseType: !1133, size: 32, offset: 960)
!1859 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1855, file: !135, line: 2853, baseType: !1133, size: 32, offset: 992)
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1143, file: !135, line: 3390, baseType: !1861, size: 1024)
!1861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1862)
!1862 = !{!1863, !1864}
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1861, file: !135, line: 2858, baseType: !1311, size: 960)
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1861, file: !135, line: 2859, baseType: !1837, size: 64, offset: 960)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1143, file: !135, line: 3391, baseType: !1866, size: 960)
!1866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1867)
!1867 = !{!1868}
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1866, file: !135, line: 2863, baseType: !1311, size: 960)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1143, file: !135, line: 3392, baseType: !1870, size: 1472)
!1870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1871)
!1871 = !{!1872}
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1870, file: !135, line: 3305, baseType: !1804, size: 1472)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1143, file: !135, line: 3393, baseType: !1874, size: 1792)
!1874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1875)
!1875 = !{!1876, !1877, !2026, !2027, !2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046}
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1874, file: !135, line: 3249, baseType: !1804, size: 1472)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1874, file: !135, line: 3251, baseType: !1878, size: 64, offset: 1472)
!1878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1879, size: 64)
!1879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1880, line: 463, size: 1152, elements: !1881)
!1880 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1881 = !{!1882, !1885, !1916, !1917, !1920, !1923, !1971, !1972, !1973, !1974, !1975, !1999, !2002, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2016, !2017, !2018, !2019, !2020, !2021, !2022, !2023, !2024, !2025}
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1879, file: !1880, line: 464, baseType: !1883, size: 64)
!1883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1884, size: 64)
!1884 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1880, line: 464, flags: DIFlagFwdDecl)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1879, file: !1880, line: 467, baseType: !1886, size: 64, offset: 64)
!1886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1887, size: 64)
!1887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1888)
!1888 = !{!1889, !1891, !1892, !1905, !1906, !1907, !1908, !1909, !1910, !1912, !1914, !1915}
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1887, file: !330, line: 377, baseType: !1890, size: 64)
!1890 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1141, line: 111, baseType: !1428)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1887, file: !330, line: 378, baseType: !1890, size: 64, offset: 64)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1887, file: !330, line: 381, baseType: !1893, size: 64, offset: 128)
!1893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1894, size: 64)
!1894 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1895)
!1895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1896)
!1896 = !{!1897}
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1895, file: !330, line: 282, baseType: !1898, size: 128)
!1898 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1899)
!1899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1900)
!1900 = !{!1901, !1902, !1903}
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1899, file: !330, line: 281, baseType: !7, size: 32)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1899, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1899, file: !330, line: 281, baseType: !1904, size: 64, offset: 64)
!1904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1890, size: 64, elements: !1239)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1887, file: !330, line: 384, baseType: !1133, size: 32, offset: 192)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1887, file: !330, line: 387, baseType: !1133, size: 32, offset: 224)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1887, file: !330, line: 390, baseType: !1133, size: 32, offset: 256)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1887, file: !330, line: 394, baseType: !1893, size: 64, offset: 320)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1887, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1887, file: !330, line: 399, baseType: !1911, size: 64, offset: 416)
!1911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !1383)
!1912 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1887, file: !330, line: 402, baseType: !1913, size: 64, offset: 480)
!1913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1383)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1887, file: !330, line: 406, baseType: !1133, size: 32, offset: 544)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1887, file: !330, line: 409, baseType: !1133, size: 32, offset: 576)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1879, file: !1880, line: 470, baseType: !1455, size: 64, offset: 128)
