; ModuleID = 'lcm.bc'
source_filename = "lcm.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!326 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!327 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!328 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!329 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!330 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!331 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!332 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!333 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!334 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!335 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!336 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!337 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!338 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!339 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!340 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!341 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!342 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!347 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!348 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!349 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!350 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!351 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!352 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!353 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!354 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!355 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!356 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!368 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!369 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!370 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!371 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!372 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!373 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!374 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!375 = !{!376, !377, !378, !379, !382, !383, !385, !850}
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!378 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !381)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !387, line: 111, baseType: !388)
!387 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !390)
!390 = !{!391, !1422, !1423, !1424, !1427, !1431, !1432, !1433, !1451, !1452, !1453, !1454, !1455, !1456}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !389, file: !133, line: 219, baseType: !392, size: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !394)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !395)
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !394, file: !133, line: 151, baseType: !397, size: 128)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !398)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !399)
!399 = !{!400, !401, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !398, file: !133, line: 150, baseType: !5, size: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !398, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !398, file: !133, line: 150, baseType: !403, size: 64, offset: 64)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !404, size: 64, elements: !453)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !387, line: 108, baseType: !405)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !407)
!407 = !{!408, !409, !410, !1414, !1415, !1416, !1417, !1418, !1419, !1420}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !406, file: !133, line: 124, baseType: !388, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !406, file: !133, line: 125, baseType: !388, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !406, file: !133, line: 131, baseType: !411, size: 64, offset: 128)
!411 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !412)
!412 = !{!413, !417}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !411, file: !133, line: 129, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !387, line: 66, baseType: !415)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !387, line: 65, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !411, file: !133, line: 130, baseType: !418, size: 64)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !387, line: 50, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !421, line: 240, size: 384, elements: !422)
!421 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!422 = !{!423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !420, file: !421, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !420, file: !421, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !420, file: !421, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !420, file: !421, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !420, file: !421, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !420, file: !421, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !420, file: !421, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !420, file: !421, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !420, file: !421, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !420, file: !421, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !420, file: !421, line: 321, baseType: !434, size: 320, offset: 64)
!434 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !421, line: 315, size: 320, elements: !435)
!435 = !{!436, !1349, !1351, !1412, !1413}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !434, file: !421, line: 316, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_array_type, baseType: !438, size: 64, elements: !453)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !421, line: 183, baseType: !439)
!439 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !421, line: 166, size: 64, elements: !440)
!440 = !{!441, !442, !443, !444, !445, !455, !456, !468, !471, !533, !1327, !1328, !1339, !1346}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !439, file: !421, line: 168, baseType: !378, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !439, file: !421, line: 169, baseType: !5, size: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !439, file: !421, line: 170, baseType: !383, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !439, file: !421, line: 171, baseType: !418, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !439, file: !421, line: 172, baseType: !446, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !387, line: 53, baseType: !447)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !448, size: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !421, line: 359, size: 128, elements: !449)
!449 = !{!450, !451}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !448, file: !421, line: 360, baseType: !378, size: 32)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !448, file: !421, line: 361, baseType: !452, size: 64, offset: 64)
!452 = !DICompositeType(tag: DW_TAG_array_type, baseType: !418, size: 64, elements: !453)
!453 = !{!454}
!454 = !DISubrange(count: 1)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !439, file: !421, line: 173, baseType: !3, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !439, file: !421, line: 174, baseType: !457, size: 32)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !421, line: 133, baseType: !458)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !421, line: 115, size: 32, elements: !459)
!459 = !{!460, !461, !462, !463, !464, !465, !466, !467}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !458, file: !421, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !458, file: !421, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !458, file: !421, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !458, file: !421, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !458, file: !421, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !458, file: !421, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !458, file: !421, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !458, file: !421, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !439, file: !421, line: 175, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !421, line: 175, flags: DIFlagFwdDecl)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !439, file: !421, line: 176, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !474, line: 75, size: 256, elements: !475)
!474 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!475 = !{!476, !491, !492, !493}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !473, file: !474, line: 76, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !474, line: 68, baseType: !479)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !474, line: 63, size: 320, elements: !480)
!480 = !{!481, !483, !484, !485}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !479, file: !474, line: 64, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !479, file: !474, line: 65, baseType: !482, size: 64, offset: 64)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !479, file: !474, line: 66, baseType: !5, size: 32, offset: 128)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !479, file: !474, line: 67, baseType: !486, size: 128, offset: 192)
!486 = !DICompositeType(tag: DW_TAG_array_type, baseType: !487, size: 128, elements: !489)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !474, line: 29, baseType: !488)
!488 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!489 = !{!490}
!490 = !DISubrange(count: 2)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !473, file: !474, line: 77, baseType: !477, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !473, file: !474, line: 78, baseType: !5, size: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !473, file: !474, line: 79, baseType: !494, size: 64, offset: 192)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !474, line: 49, baseType: !496)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !474, line: 45, size: 832, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !496, file: !474, line: 46, baseType: !482, size: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !496, file: !474, line: 47, baseType: !472, size: 64, offset: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !496, file: !474, line: 48, baseType: !501, size: 704, offset: 128)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !502, line: 164, size: 704, elements: !503)
!502 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!503 = !{!504, !506, !516, !517, !518, !519, !520, !521, !525, !529, !530, !531, !532}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !501, file: !502, line: 166, baseType: !505, size: 64)
!505 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !501, file: !502, line: 167, baseType: !507, size: 64, offset: 64)
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !502, line: 157, size: 192, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !508, file: !502, line: 159, baseType: !380, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !508, file: !502, line: 160, baseType: !507, size: 64, offset: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !508, file: !502, line: 161, baseType: !513, size: 32, offset: 128)
!513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 32, elements: !514)
!514 = !{!515}
!515 = !DISubrange(count: 4)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !501, file: !502, line: 168, baseType: !380, size: 64, offset: 128)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !501, file: !502, line: 169, baseType: !380, size: 64, offset: 192)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !501, file: !502, line: 170, baseType: !380, size: 64, offset: 256)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !501, file: !502, line: 171, baseType: !505, size: 64, offset: 320)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !501, file: !502, line: 172, baseType: !378, size: 32, offset: 384)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !501, file: !502, line: 176, baseType: !522, size: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DISubroutineType(types: !524)
!524 = !{!507, !382, !505}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !501, file: !502, line: 177, baseType: !526, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DISubroutineType(types: !528)
!528 = !{null, !382, !507}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !501, file: !502, line: 178, baseType: !382, size: 64, offset: 576)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !501, file: !502, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !501, file: !502, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !501, file: !502, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !439, file: !421, line: 177, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !387, line: 56, baseType: !535)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !537)
!537 = !{!538, !571, !577, !588, !607, !618, !623, !630, !636, !649, !661, !699, !704, !732, !740, !741, !746, !755, !761, !766, !770, !774, !951, !1000, !1006, !1013, !1020, !1046, !1071, !1088, !1100, !1122, !1137, !1309}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !536, file: !149, line: 3372, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !540)
!540 = !{!541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !539, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !539, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !539, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !539, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !539, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !539, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !539, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !539, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !539, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !539, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !539, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !539, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !539, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !539, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !539, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !539, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !539, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !539, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !539, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !539, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !539, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !539, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !539, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !539, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !539, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !539, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !539, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !539, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !539, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !539, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !536, file: !149, line: 3373, baseType: !572, size: 192)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !573)
!573 = !{!574, !575, !576}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !572, file: !149, line: 403, baseType: !539, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !572, file: !149, line: 404, baseType: !534, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !572, file: !149, line: 405, baseType: !534, size: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !536, file: !149, line: 3374, baseType: !578, size: 320)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !149, line: 1385, baseType: !572, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !578, file: !149, line: 1386, baseType: !582, size: 128, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !583, line: 58, baseType: !584)
!583 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !583, line: 54, size: 128, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !584, file: !583, line: 56, baseType: !488, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !584, file: !583, line: 57, baseType: !505, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !536, file: !149, line: 3375, baseType: !589, size: 256)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !589, file: !149, line: 1398, baseType: !572, size: 192)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !589, file: !149, line: 1399, baseType: !593, size: 64, offset: 192)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !595, line: 52, size: 256, elements: !596)
!595 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!596 = !{!597, !598, !599, !600, !601, !602, !603}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !594, file: !595, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !594, file: !595, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !594, file: !595, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !594, file: !595, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !594, file: !595, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !594, file: !595, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !594, file: !595, line: 62, baseType: !604, size: 192, offset: 64)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !488, size: 192, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 3)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !536, file: !149, line: 3376, baseType: !608, size: 256)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !149, line: 1409, baseType: !572, size: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !608, file: !149, line: 1410, baseType: !612, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !614, line: 27, size: 192, elements: !615)
!614 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !613, file: !614, line: 29, baseType: !582, size: 128)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !613, file: !614, line: 30, baseType: !3, size: 32, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !536, file: !149, line: 3377, baseType: !619, size: 256)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !619, file: !149, line: 1438, baseType: !572, size: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !619, file: !149, line: 1439, baseType: !534, size: 64, offset: 192)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !536, file: !149, line: 3378, baseType: !624, size: 256)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !625)
!625 = !{!626, !627, !628}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !624, file: !149, line: 1419, baseType: !572, size: 192)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !624, file: !149, line: 1420, baseType: !378, size: 32, offset: 192)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !624, file: !149, line: 1421, baseType: !629, size: 8, offset: 224)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 8, elements: !453)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !536, file: !149, line: 3379, baseType: !631, size: 320)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !632)
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !631, file: !149, line: 1429, baseType: !572, size: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !631, file: !149, line: 1430, baseType: !534, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !631, file: !149, line: 1431, baseType: !534, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !536, file: !149, line: 3380, baseType: !637, size: 320)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !637, file: !149, line: 1461, baseType: !572, size: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !637, file: !149, line: 1462, baseType: !641, size: 128, offset: 192)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !642, line: 31, size: 128, elements: !643)
!642 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!643 = !{!644, !647, !648}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !641, file: !642, line: 32, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !377)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !641, file: !642, line: 33, baseType: !5, size: 32, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !641, file: !642, line: 34, baseType: !5, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !536, file: !149, line: 3381, baseType: !650, size: 384)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !651)
!651 = !{!652, !653, !658, !659, !660}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !650, file: !149, line: 2508, baseType: !572, size: 192)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !650, file: !149, line: 2509, baseType: !654, size: 32, offset: 192)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !655, line: 58, baseType: !656)
!655 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !657, line: 44, baseType: !5)
!657 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!658 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !650, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !650, file: !149, line: 2511, baseType: !534, size: 64, offset: 256)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !650, file: !149, line: 2512, baseType: !534, size: 64, offset: 320)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !536, file: !149, line: 3382, baseType: !662, size: 896)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !663)
!663 = !{!664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !662, file: !149, line: 2653, baseType: !650, size: 384)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !662, file: !149, line: 2654, baseType: !534, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !662, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !662, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !662, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !662, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !662, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !662, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !662, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !662, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !662, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !662, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !662, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !662, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !662, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !662, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !662, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !662, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !662, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !662, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !662, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !662, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !662, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !662, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !662, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !662, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !662, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !662, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !662, file: !149, line: 2705, baseType: !534, size: 64, offset: 576)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !662, file: !149, line: 2706, baseType: !534, size: 64, offset: 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !662, file: !149, line: 2707, baseType: !534, size: 64, offset: 704)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !662, file: !149, line: 2708, baseType: !534, size: 64, offset: 768)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !662, file: !149, line: 2711, baseType: !697, size: 64, offset: 832)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !536, file: !149, line: 3383, baseType: !700, size: 960)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !700, file: !149, line: 2757, baseType: !662, size: 896)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !700, file: !149, line: 2758, baseType: !418, size: 64, offset: 896)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !536, file: !149, line: 3384, baseType: !705, size: 1472)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !706)
!706 = !{!707, !728, !729, !730, !731}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !149, line: 3115, baseType: !708, size: 1216)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !708, file: !149, line: 2985, baseType: !700, size: 960)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !708, file: !149, line: 2986, baseType: !534, size: 64, offset: 960)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !708, file: !149, line: 2987, baseType: !534, size: 64, offset: 1024)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !708, file: !149, line: 2988, baseType: !534, size: 64, offset: 1088)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !708, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !708, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !708, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !708, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !708, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !708, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !708, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !708, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !708, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !708, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !708, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !708, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !708, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !708, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !705, file: !149, line: 3117, baseType: !534, size: 64, offset: 1216)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !705, file: !149, line: 3119, baseType: !534, size: 64, offset: 1280)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !705, file: !149, line: 3121, baseType: !534, size: 64, offset: 1344)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !705, file: !149, line: 3123, baseType: !534, size: 64, offset: 1408)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !536, file: !149, line: 3385, baseType: !733, size: 1088)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !733, file: !149, line: 2875, baseType: !700, size: 960)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !733, file: !149, line: 2876, baseType: !418, size: 64, offset: 960)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !733, file: !149, line: 2877, baseType: !738, size: 64, offset: 1024)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !149, line: 2856, flags: DIFlagFwdDecl)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !536, file: !149, line: 3386, baseType: !708, size: 1216)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !536, file: !149, line: 3387, baseType: !742, size: 1280)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !743)
!743 = !{!744, !745}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !742, file: !149, line: 3094, baseType: !708, size: 1216)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !742, file: !149, line: 3095, baseType: !738, size: 64, offset: 1216)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !536, file: !149, line: 3388, baseType: !747, size: 1216)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !748)
!748 = !{!749, !750, !751, !752, !753, !754}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !747, file: !149, line: 2825, baseType: !662, size: 896)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !747, file: !149, line: 2827, baseType: !534, size: 64, offset: 896)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !747, file: !149, line: 2828, baseType: !534, size: 64, offset: 960)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !747, file: !149, line: 2829, baseType: !534, size: 64, offset: 1024)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !747, file: !149, line: 2830, baseType: !534, size: 64, offset: 1088)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !747, file: !149, line: 2831, baseType: !534, size: 64, offset: 1152)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !536, file: !149, line: 3389, baseType: !756, size: 1024)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !149, line: 2851, baseType: !700, size: 960)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !756, file: !149, line: 2852, baseType: !378, size: 32, offset: 960)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !756, file: !149, line: 2853, baseType: !378, size: 32, offset: 992)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !536, file: !149, line: 3390, baseType: !762, size: 1024)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !149, line: 2858, baseType: !700, size: 960)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !762, file: !149, line: 2859, baseType: !738, size: 64, offset: 960)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !536, file: !149, line: 3391, baseType: !767, size: 960)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !768)
!768 = !{!769}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !767, file: !149, line: 2863, baseType: !700, size: 960)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !536, file: !149, line: 3392, baseType: !771, size: 1472)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !771, file: !149, line: 3305, baseType: !705, size: 1472)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !536, file: !149, line: 3393, baseType: !775, size: 1792)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !776)
!776 = !{!777, !778, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !775, file: !149, line: 3249, baseType: !705, size: 1472)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !775, file: !149, line: 3251, baseType: !779, size: 64, offset: 1472)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !781, line: 463, size: 1152, elements: !782)
!781 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = !{!783, !786, !816, !817, !820, !823, !875, !876, !877, !878, !879, !903, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !780, file: !781, line: 464, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !781, line: 464, flags: DIFlagFwdDecl)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !780, file: !781, line: 467, baseType: !787, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !789)
!789 = !{!790, !791, !792, !805, !806, !807, !808, !809, !810, !812, !814, !815}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !788, file: !133, line: 377, baseType: !386, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !788, file: !133, line: 378, baseType: !386, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !788, file: !133, line: 381, baseType: !793, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !795)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !796)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !795, file: !133, line: 282, baseType: !798, size: 128)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !799)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !800)
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !799, file: !133, line: 281, baseType: !5, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !799, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !799, file: !133, line: 281, baseType: !804, size: 64, offset: 64)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 64, elements: !453)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !788, file: !133, line: 384, baseType: !378, size: 32, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !788, file: !133, line: 387, baseType: !378, size: 32, offset: 224)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !788, file: !133, line: 390, baseType: !378, size: 32, offset: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !788, file: !133, line: 394, baseType: !793, size: 64, offset: 320)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !788, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !788, file: !133, line: 399, baseType: !811, size: 64, offset: 416)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !489)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !788, file: !133, line: 402, baseType: !813, size: 64, offset: 480)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !489)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !788, file: !133, line: 406, baseType: !378, size: 32, offset: 544)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !788, file: !133, line: 409, baseType: !378, size: 32, offset: 576)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !780, file: !781, line: 470, baseType: !415, size: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !780, file: !781, line: 473, baseType: !818, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !781, line: 166, flags: DIFlagFwdDecl)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !780, file: !781, line: 476, baseType: !821, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !781, line: 476, flags: DIFlagFwdDecl)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !780, file: !781, line: 479, baseType: !824, size: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !825, line: 144, baseType: !826)
!825 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !825, line: 100, size: 896, elements: !828)
!828 = !{!829, !837, !842, !847, !849, !852, !853, !854, !855, !856, !861, !863, !864, !869, !874}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !827, file: !825, line: 102, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !825, line: 52, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !825, line: 47, baseType: !5)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !827, file: !825, line: 105, baseType: !838, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !825, line: 59, baseType: !839)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = !DISubroutineType(types: !841)
!841 = !{!378, !835, !835}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !827, file: !825, line: 108, baseType: !843, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !825, line: 63, baseType: !844)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !845, size: 64)
!845 = !DISubroutineType(types: !846)
!846 = !{null, !382}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !827, file: !825, line: 111, baseType: !848, size: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !827, file: !825, line: 114, baseType: !850, size: 64, offset: 256)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !851, line: 46, baseType: !488)
!851 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!852 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !827, file: !825, line: 117, baseType: !850, size: 64, offset: 320)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !827, file: !825, line: 120, baseType: !850, size: 64, offset: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !827, file: !825, line: 124, baseType: !5, size: 32, offset: 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !827, file: !825, line: 128, baseType: !5, size: 32, offset: 480)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !827, file: !825, line: 131, baseType: !857, size: 64, offset: 512)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !825, line: 75, baseType: !858)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DISubroutineType(types: !860)
!860 = !{!382, !850, !850}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !827, file: !825, line: 132, baseType: !862, size: 64, offset: 576)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !825, line: 78, baseType: !844)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !827, file: !825, line: 135, baseType: !382, size: 64, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !827, file: !825, line: 136, baseType: !865, size: 64, offset: 704)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !825, line: 82, baseType: !866)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DISubroutineType(types: !868)
!868 = !{!382, !382, !850, !850}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !827, file: !825, line: 137, baseType: !870, size: 64, offset: 768)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !825, line: 83, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{null, !382, !382}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !827, file: !825, line: 141, baseType: !5, size: 32, offset: 832)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !780, file: !781, line: 484, baseType: !534, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !780, file: !781, line: 488, baseType: !534, size: 64, offset: 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !780, file: !781, line: 493, baseType: !534, size: 64, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !780, file: !781, line: 496, baseType: !534, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !780, file: !781, line: 501, baseType: !880, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !882)
!882 = !{!883, !886, !887, !888, !889, !891, !892, !897, !898, !899, !900, !901, !902}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !881, file: !144, line: 2356, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !881, file: !144, line: 2357, baseType: !383, size: 64, offset: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !881, file: !144, line: 2358, baseType: !378, size: 32, offset: 128)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !881, file: !144, line: 2359, baseType: !378, size: 32, offset: 160)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !881, file: !144, line: 2360, baseType: !890, size: 128, offset: 192)
!890 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 128, elements: !514)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !881, file: !144, line: 2364, baseType: !378, size: 32, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !881, file: !144, line: 2367, baseType: !893, size: 128, offset: 384)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !893, file: !144, line: 2351, baseType: !418, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !893, file: !144, line: 2352, baseType: !505, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !881, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !881, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !881, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !881, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !881, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !881, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !780, file: !781, line: 504, baseType: !904, size: 64, offset: 704)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !781, line: 504, flags: DIFlagFwdDecl)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !780, file: !781, line: 507, baseType: !824, size: 64, offset: 768)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !780, file: !781, line: 510, baseType: !378, size: 32, offset: 832)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !780, file: !781, line: 513, baseType: !378, size: 32, offset: 864)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !780, file: !781, line: 516, baseType: !654, size: 32, offset: 896)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !780, file: !781, line: 519, baseType: !654, size: 32, offset: 928)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !780, file: !781, line: 522, baseType: !5, size: 32, offset: 960)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !780, file: !781, line: 523, baseType: !5, size: 32, offset: 992)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !780, file: !781, line: 528, baseType: !383, size: 64, offset: 1024)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !780, file: !781, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !780, file: !781, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !780, file: !781, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !780, file: !781, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !780, file: !781, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !780, file: !781, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !780, file: !781, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !780, file: !781, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !780, file: !781, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !780, file: !781, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !780, file: !781, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !780, file: !781, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !780, file: !781, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !780, file: !781, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !780, file: !781, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !780, file: !781, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !775, file: !149, line: 3254, baseType: !534, size: 64, offset: 1536)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !775, file: !149, line: 3257, baseType: !534, size: 64, offset: 1600)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !775, file: !149, line: 3258, baseType: !534, size: 64, offset: 1664)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !775, file: !149, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !775, file: !149, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !775, file: !149, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !775, file: !149, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !775, file: !149, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !775, file: !149, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !775, file: !149, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !775, file: !149, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !775, file: !149, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !775, file: !149, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !775, file: !149, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !775, file: !149, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !775, file: !149, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !775, file: !149, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !775, file: !149, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !775, file: !149, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !775, file: !149, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !775, file: !149, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !536, file: !149, line: 3394, baseType: !952, size: 1344)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !149, line: 2279, size: 1344, elements: !953)
!953 = !{!954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !979, !980, !981, !989, !990, !991, !992, !993, !994, !995, !996, !997}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !149, line: 2280, baseType: !572, size: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !952, file: !149, line: 2281, baseType: !534, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !952, file: !149, line: 2282, baseType: !534, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !952, file: !149, line: 2283, baseType: !534, size: 64, offset: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !952, file: !149, line: 2284, baseType: !534, size: 64, offset: 384)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !952, file: !149, line: 2285, baseType: !5, size: 32, offset: 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !952, file: !149, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !952, file: !149, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !952, file: !149, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !952, file: !149, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !952, file: !149, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !952, file: !149, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !952, file: !149, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !952, file: !149, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !952, file: !149, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !952, file: !149, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !952, file: !149, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !952, file: !149, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !952, file: !149, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !952, file: !149, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !952, file: !149, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !952, file: !149, line: 2305, baseType: !5, size: 32, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !952, file: !149, line: 2306, baseType: !977, size: 32, offset: 544)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !978, line: 31, baseType: !378)
!978 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!979 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !952, file: !149, line: 2307, baseType: !534, size: 64, offset: 576)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !952, file: !149, line: 2308, baseType: !534, size: 64, offset: 640)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !952, file: !149, line: 2314, baseType: !982, size: 64, offset: 704)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !149, line: 2309, size: 64, elements: !983)
!983 = !{!984, !985, !986}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !982, file: !149, line: 2310, baseType: !378, size: 32)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !982, file: !149, line: 2311, baseType: !383, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !982, file: !149, line: 2312, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !149, line: 2277, flags: DIFlagFwdDecl)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !149, line: 2315, baseType: !534, size: 64, offset: 768)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !952, file: !149, line: 2316, baseType: !534, size: 64, offset: 832)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !952, file: !149, line: 2317, baseType: !534, size: 64, offset: 896)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !952, file: !149, line: 2318, baseType: !534, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !952, file: !149, line: 2319, baseType: !534, size: 64, offset: 1024)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !952, file: !149, line: 2320, baseType: !534, size: 64, offset: 1088)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !952, file: !149, line: 2321, baseType: !534, size: 64, offset: 1152)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !952, file: !149, line: 2322, baseType: !534, size: 64, offset: 1216)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !952, file: !149, line: 2324, baseType: !998, size: 64, offset: 1280)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !149, line: 2324, flags: DIFlagFwdDecl)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !536, file: !149, line: 3395, baseType: !1001, size: 320)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !149, line: 1469, size: 320, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1001, file: !149, line: 1470, baseType: !572, size: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1001, file: !149, line: 1471, baseType: !534, size: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1001, file: !149, line: 1472, baseType: !534, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !536, file: !149, line: 3396, baseType: !1007, size: 320)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !149, line: 1482, size: 320, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !149, line: 1483, baseType: !572, size: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1007, file: !149, line: 1484, baseType: !378, size: 32, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1007, file: !149, line: 1485, baseType: !1012, size: 64, offset: 256)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 64, elements: !453)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !536, file: !149, line: 3397, baseType: !1014, size: 384)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !149, line: 1829, size: 384, elements: !1015)
!1015 = !{!1016, !1017, !1018, !1019}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !149, line: 1830, baseType: !572, size: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1014, file: !149, line: 1831, baseType: !654, size: 32, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1014, file: !149, line: 1832, baseType: !534, size: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1014, file: !149, line: 1835, baseType: !1012, size: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !536, file: !149, line: 3398, baseType: !1021, size: 704)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !149, line: 1898, size: 704, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1029, !1030, !1033}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1021, file: !149, line: 1899, baseType: !572, size: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1021, file: !149, line: 1902, baseType: !534, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1021, file: !149, line: 1905, baseType: !1026, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !387, line: 58, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !387, line: 57, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1021, file: !149, line: 1908, baseType: !5, size: 32, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1021, file: !149, line: 1911, baseType: !1031, size: 64, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !149, line: 1876, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1021, file: !149, line: 1914, baseType: !1034, size: 256, offset: 448)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1035)
!1035 = !{!1036, !1038, !1039, !1044}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1034, file: !149, line: 1884, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1034, file: !149, line: 1885, baseType: !1037, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1034, file: !149, line: 1891, baseType: !1040, size: 64, offset: 128)
!1040 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1034, file: !149, line: 1891, size: 64, elements: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1040, file: !149, line: 1891, baseType: !1026, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1040, file: !149, line: 1891, baseType: !534, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1034, file: !149, line: 1892, baseType: !1045, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !536, file: !149, line: 3399, baseType: !1047, size: 704)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !149, line: 2008, size: 704, elements: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1066, !1067, !1068, !1069, !1070}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1047, file: !149, line: 2009, baseType: !572, size: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1047, file: !149, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1047, file: !149, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1047, file: !149, line: 2014, baseType: !654, size: 32, offset: 224)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1047, file: !149, line: 2016, baseType: !534, size: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1047, file: !149, line: 2017, baseType: !1055, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1058)
!1058 = !{!1059}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1057, file: !149, line: 183, baseType: !1060, size: 128)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1062)
!1062 = !{!1063, !1064, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1061, file: !149, line: 182, baseType: !5, size: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1061, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1061, file: !149, line: 182, baseType: !1012, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1047, file: !149, line: 2019, baseType: !534, size: 64, offset: 384)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1047, file: !149, line: 2020, baseType: !534, size: 64, offset: 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1047, file: !149, line: 2021, baseType: !534, size: 64, offset: 512)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1047, file: !149, line: 2022, baseType: !534, size: 64, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1047, file: !149, line: 2023, baseType: !534, size: 64, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !536, file: !149, line: 3400, baseType: !1072, size: 832)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !149, line: 2430, size: 832, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !149, line: 2431, baseType: !572, size: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1072, file: !149, line: 2433, baseType: !534, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1072, file: !149, line: 2434, baseType: !534, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1072, file: !149, line: 2435, baseType: !534, size: 64, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1072, file: !149, line: 2436, baseType: !534, size: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1072, file: !149, line: 2437, baseType: !1055, size: 64, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1072, file: !149, line: 2438, baseType: !534, size: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1072, file: !149, line: 2440, baseType: !534, size: 64, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1072, file: !149, line: 2441, baseType: !534, size: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1072, file: !149, line: 2443, baseType: !1084, size: 128, offset: 704)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !149, line: 182, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !149, line: 182, size: 128, elements: !1086)
!1086 = !{!1087}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1085, file: !149, line: 182, baseType: !1060, size: 128)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !536, file: !149, line: 3401, baseType: !1089, size: 320)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !149, line: 3327, size: 320, elements: !1090)
!1090 = !{!1091, !1092, !1099}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1089, file: !149, line: 3329, baseType: !572, size: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1089, file: !149, line: 3330, baseType: !1093, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !149, line: 3320, size: 192, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1094, file: !149, line: 3322, baseType: !1093, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1094, file: !149, line: 3323, baseType: !1093, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1094, file: !149, line: 3324, baseType: !534, size: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1089, file: !149, line: 3331, baseType: !1093, size: 64, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !536, file: !149, line: 3402, baseType: !1101, size: 256)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !149, line: 1540, size: 256, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1101, file: !149, line: 1541, baseType: !572, size: 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1101, file: !149, line: 1542, baseType: !1105, size: 64, offset: 192)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !149, line: 1538, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !149, line: 1538, size: 192, elements: !1108)
!1108 = !{!1109}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1107, file: !149, line: 1538, baseType: !1110, size: 192)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !149, line: 1537, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !149, line: 1537, size: 192, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1111, file: !149, line: 1537, baseType: !5, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1111, file: !149, line: 1537, baseType: !5, size: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1111, file: !149, line: 1537, baseType: !1116, size: 128, offset: 64)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1117, size: 128, elements: !453)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !149, line: 1535, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !149, line: 1532, size: 128, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1118, file: !149, line: 1533, baseType: !534, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1118, file: !149, line: 1534, baseType: !534, size: 64, offset: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !536, file: !149, line: 3403, baseType: !1123, size: 512)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !149, line: 1938, size: 512, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1134, !1135, !1136}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1123, file: !149, line: 1939, baseType: !572, size: 192)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1123, file: !149, line: 1940, baseType: !654, size: 32, offset: 192)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1123, file: !149, line: 1941, baseType: !148, size: 32, offset: 224)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1123, file: !149, line: 1946, baseType: !1129, size: 32, offset: 256)
!1129 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !149, line: 1942, size: 32, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !1129, file: !149, line: 1943, baseType: !167, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !1129, file: !149, line: 1944, baseType: !174, size: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !1129, file: !149, line: 1945, baseType: !181, size: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !1123, file: !149, line: 1950, baseType: !414, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !1123, file: !149, line: 1951, baseType: !414, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1123, file: !149, line: 1953, baseType: !1012, size: 64, offset: 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !536, file: !149, line: 3404, baseType: !1138, size: 1664)
