; ModuleID = 'loop-iv.bc'
source_filename = "loop-iv.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.loop = type { i32, i32, %struct.basic_block_def*, %struct.basic_block_def*, %struct.lpt_decision, i32, i32, %struct.VEC_loop_p_gc*, %struct.loop*, %struct.loop*, i8*, %union.tree_node*, %struct.double_int, %struct.double_int, i8, i8, i32, %struct.nb_iter_bound*, %struct.loop_exit*, i8, %union.tree_node* }

!509 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!510 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!511 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!512 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!513 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!514 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!515 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!516 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!517 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!518 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!519 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!520 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!521 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!522 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!523 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!524 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!525 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!526 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!527 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!528 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!529 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!530 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!531 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!532 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!533 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !534, line: 36, baseType: !7, size: 32, elements: !535)
!534 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!536 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!537 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!538 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!539 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!540 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!541 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!542 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!543 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!544 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!545 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!546 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!547 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!548 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!549 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!550 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!551 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!552 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!553 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!554 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!555 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "iv_grd_result", file: !3, line: 69, baseType: !7, size: 32, elements: !556)
!556 = !{!557, !558, !559, !560}
!557 = !DIEnumerator(name: "GRD_INVALID", value: 0, isUnsigned: true)
!558 = !DIEnumerator(name: "GRD_INVARIANT", value: 1, isUnsigned: true)
!559 = !DIEnumerator(name: "GRD_MAYBE_BIV", value: 2, isUnsigned: true)
!560 = !DIEnumerator(name: "GRD_SINGLE_DOM", value: 3, isUnsigned: true)
!561 = !{!562, !563, !564, !565, !568, !569, !571, !634, !390, !5, !533, !1700, !589, !606, !1701, !1716, !1732, !1735, !1736, !1737, !1746, !1747, !1749}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!564 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !572, line: 47, baseType: !573)
!572 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !575, line: 75, size: 256, elements: !576)
!575 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!576 = !{!577, !592, !593, !594}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !574, file: !575, line: 76, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !575, line: 68, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !575, line: 63, size: 320, elements: !581)
!581 = !{!582, !584, !585, !586}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !575, line: 64, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !580, file: !575, line: 65, baseType: !583, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !580, file: !575, line: 66, baseType: !7, size: 32, offset: 128)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !580, file: !575, line: 67, baseType: !587, size: 128, offset: 192)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 128, elements: !590)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !575, line: 29, baseType: !589)
!589 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!590 = !{!591}
!591 = !DISubrange(count: 2)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !574, file: !575, line: 77, baseType: !578, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !574, file: !575, line: 78, baseType: !7, size: 32, offset: 128)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !574, file: !575, line: 79, baseType: !595, size: 64, offset: 192)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !575, line: 49, baseType: !597)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !575, line: 45, size: 832, elements: !598)
!598 = !{!599, !600, !601}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !597, file: !575, line: 46, baseType: !583, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !597, file: !575, line: 47, baseType: !573, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !597, file: !575, line: 48, baseType: !602, size: 704, offset: 128)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !603, line: 164, size: 704, elements: !604)
!603 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !{!605, !607, !617, !618, !619, !620, !621, !622, !626, !630, !631, !632, !633}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !602, file: !603, line: 166, baseType: !606, size: 64)
!606 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !602, file: !603, line: 167, baseType: !608, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !603, line: 157, size: 192, elements: !610)
!610 = !{!611, !612, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !609, file: !603, line: 159, baseType: !566, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !609, file: !603, line: 160, baseType: !608, size: 64, offset: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !609, file: !603, line: 161, baseType: !614, size: 32, offset: 128)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 32, elements: !615)
!615 = !{!616}
!616 = !DISubrange(count: 4)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !602, file: !603, line: 168, baseType: !566, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !602, file: !603, line: 169, baseType: !566, size: 64, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !602, file: !603, line: 170, baseType: !566, size: 64, offset: 256)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !602, file: !603, line: 171, baseType: !606, size: 64, offset: 320)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !602, file: !603, line: 172, baseType: !564, size: 32, offset: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !602, file: !603, line: 176, baseType: !623, size: 64, offset: 448)
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DISubroutineType(types: !625)
!625 = !{!608, !568, !606}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !602, file: !603, line: 177, baseType: !627, size: 64, offset: 512)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !568, !608}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !602, file: !603, line: 178, baseType: !568, size: 64, offset: 576)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !602, file: !603, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !602, file: !603, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !602, file: !603, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !572, line: 50, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !391, line: 240, size: 384, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !636, file: !391, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !636, file: !391, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !636, file: !391, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !636, file: !391, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !636, file: !391, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !636, file: !391, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !636, file: !391, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !636, file: !391, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !636, file: !391, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !636, file: !391, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !636, file: !391, line: 321, baseType: !649, size: 320, offset: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !391, line: 315, size: 320, elements: !650)
!650 = !{!651, !1635, !1637, !1698, !1699}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !649, file: !391, line: 316, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 64, elements: !668)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !391, line: 183, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !391, line: 166, size: 64, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !670, !671, !683, !686, !687, !1613, !1614, !1625, !1632}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !654, file: !391, line: 168, baseType: !564, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !654, file: !391, line: 169, baseType: !7, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !654, file: !391, line: 170, baseType: !569, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !654, file: !391, line: 171, baseType: !634, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !654, file: !391, line: 172, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !572, line: 53, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !391, line: 359, size: 128, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !663, file: !391, line: 360, baseType: !564, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !663, file: !391, line: 361, baseType: !667, size: 64, offset: 64)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 64, elements: !668)
!668 = !{!669}
!669 = !DISubrange(count: 1)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !654, file: !391, line: 173, baseType: !5, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !654, file: !391, line: 174, baseType: !672, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !391, line: 133, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !391, line: 115, size: 32, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !680, !681, !682}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !673, file: !391, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !673, file: !391, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !673, file: !391, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !673, file: !391, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !673, file: !391, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !673, file: !391, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !673, file: !391, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !673, file: !391, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !654, file: !391, line: 175, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !391, line: 175, flags: DIFlagFwdDecl)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !654, file: !391, line: 176, baseType: !573, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !654, file: !391, line: 177, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !572, line: 56, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !691)
!691 = !{!692, !725, !731, !742, !761, !772, !777, !784, !790, !803, !815, !853, !858, !886, !894, !895, !900, !909, !915, !920, !924, !928, !1240, !1289, !1295, !1302, !1309, !1332, !1357, !1374, !1386, !1408, !1423, !1595}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !690, file: !164, line: 3372, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !694)
!694 = !{!695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !693, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !693, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !693, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !693, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !693, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !693, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !693, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !693, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !693, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !693, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !693, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !693, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !693, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !693, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !693, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !693, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !693, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !693, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !693, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !693, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !693, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !693, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !693, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !693, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !693, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !693, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !693, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !693, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !693, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !693, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !690, file: !164, line: 3373, baseType: !726, size: 192)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !726, file: !164, line: 403, baseType: !693, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !726, file: !164, line: 404, baseType: !688, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !726, file: !164, line: 405, baseType: !688, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !690, file: !164, line: 3374, baseType: !732, size: 320)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !732, file: !164, line: 1385, baseType: !726, size: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !732, file: !164, line: 1386, baseType: !736, size: 128, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !737, line: 58, baseType: !738)
!737 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !737, line: 54, size: 128, elements: !739)
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !738, file: !737, line: 56, baseType: !589, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !738, file: !737, line: 57, baseType: !606, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !690, file: !164, line: 3375, baseType: !743, size: 256)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !164, line: 1398, baseType: !726, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !743, file: !164, line: 1399, baseType: !747, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !749, line: 52, size: 256, elements: !750)
!749 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!750 = !{!751, !752, !753, !754, !755, !756, !757}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !748, file: !749, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !748, file: !749, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !748, file: !749, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !748, file: !749, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !748, file: !749, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !748, file: !749, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !748, file: !749, line: 62, baseType: !758, size: 192, offset: 64)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 192, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 3)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !690, file: !164, line: 3376, baseType: !762, size: 256)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !164, line: 1409, baseType: !726, size: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !762, file: !164, line: 1410, baseType: !766, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !768, line: 27, size: 192, elements: !769)
!768 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !767, file: !768, line: 29, baseType: !736, size: 128)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !767, file: !768, line: 30, baseType: !5, size: 32, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !690, file: !164, line: 3377, baseType: !773, size: 256)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !164, line: 1438, baseType: !726, size: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !773, file: !164, line: 1439, baseType: !688, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !690, file: !164, line: 3378, baseType: !778, size: 256)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !164, line: 1419, baseType: !726, size: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !778, file: !164, line: 1420, baseType: !564, size: 32, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !778, file: !164, line: 1421, baseType: !783, size: 8, offset: 224)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 8, elements: !668)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !690, file: !164, line: 3379, baseType: !785, size: 320)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !786)
!786 = !{!787, !788, !789}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !785, file: !164, line: 1429, baseType: !726, size: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !785, file: !164, line: 1430, baseType: !688, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !785, file: !164, line: 1431, baseType: !688, size: 64, offset: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !690, file: !164, line: 3380, baseType: !791, size: 320)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !791, file: !164, line: 1461, baseType: !726, size: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !791, file: !164, line: 1462, baseType: !795, size: 128, offset: 192)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !796, line: 31, size: 128, elements: !797)
!796 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!797 = !{!798, !801, !802}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !795, file: !796, line: 32, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !795, file: !796, line: 33, baseType: !7, size: 32, offset: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !795, file: !796, line: 34, baseType: !7, size: 32, offset: 96)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !690, file: !164, line: 3381, baseType: !804, size: 384)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !805)
!805 = !{!806, !807, !812, !813, !814}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !804, file: !164, line: 2508, baseType: !726, size: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !804, file: !164, line: 2509, baseType: !808, size: 32, offset: 192)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !809, line: 58, baseType: !810)
!809 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !811, line: 44, baseType: !7)
!811 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!812 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !804, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !804, file: !164, line: 2511, baseType: !688, size: 64, offset: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !804, file: !164, line: 2512, baseType: !688, size: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !690, file: !164, line: 3382, baseType: !816, size: 896)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !817)
!817 = !{!818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !164, line: 2653, baseType: !804, size: 384)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !816, file: !164, line: 2654, baseType: !688, size: 64, offset: 384)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !816, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !816, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !816, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !816, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !816, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !816, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !816, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !816, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !816, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !816, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !816, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !816, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !816, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !816, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !816, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !816, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !816, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !816, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !816, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !816, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !816, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !816, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !816, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !816, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !816, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !816, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !816, file: !164, line: 2705, baseType: !688, size: 64, offset: 576)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !816, file: !164, line: 2706, baseType: !688, size: 64, offset: 640)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !816, file: !164, line: 2707, baseType: !688, size: 64, offset: 704)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !816, file: !164, line: 2708, baseType: !688, size: 64, offset: 768)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !816, file: !164, line: 2711, baseType: !851, size: 64, offset: 832)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !690, file: !164, line: 3383, baseType: !854, size: 960)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !854, file: !164, line: 2757, baseType: !816, size: 896)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !854, file: !164, line: 2758, baseType: !634, size: 64, offset: 896)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !690, file: !164, line: 3384, baseType: !859, size: 1472)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !860)
!860 = !{!861, !882, !883, !884, !885}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !859, file: !164, line: 3115, baseType: !862, size: 1216)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !863)
!863 = !{!864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !862, file: !164, line: 2985, baseType: !854, size: 960)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !862, file: !164, line: 2986, baseType: !688, size: 64, offset: 960)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !862, file: !164, line: 2987, baseType: !688, size: 64, offset: 1024)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !862, file: !164, line: 2988, baseType: !688, size: 64, offset: 1088)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !862, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !862, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !862, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !862, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !862, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !862, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !862, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !862, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !862, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !862, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !862, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !862, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !862, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !862, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !859, file: !164, line: 3117, baseType: !688, size: 64, offset: 1216)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !859, file: !164, line: 3119, baseType: !688, size: 64, offset: 1280)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !859, file: !164, line: 3121, baseType: !688, size: 64, offset: 1344)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !859, file: !164, line: 3123, baseType: !688, size: 64, offset: 1408)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !690, file: !164, line: 3385, baseType: !887, size: 1088)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !164, line: 2875, baseType: !854, size: 960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !887, file: !164, line: 2876, baseType: !634, size: 64, offset: 960)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !887, file: !164, line: 2877, baseType: !892, size: 64, offset: 1024)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !690, file: !164, line: 3386, baseType: !862, size: 1216)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !690, file: !164, line: 3387, baseType: !896, size: 1280)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !896, file: !164, line: 3094, baseType: !862, size: 1216)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !896, file: !164, line: 3095, baseType: !892, size: 64, offset: 1216)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !690, file: !164, line: 3388, baseType: !901, size: 1216)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !902)
!902 = !{!903, !904, !905, !906, !907, !908}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !901, file: !164, line: 2825, baseType: !816, size: 896)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !901, file: !164, line: 2827, baseType: !688, size: 64, offset: 896)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !901, file: !164, line: 2828, baseType: !688, size: 64, offset: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !901, file: !164, line: 2829, baseType: !688, size: 64, offset: 1024)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !901, file: !164, line: 2830, baseType: !688, size: 64, offset: 1088)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !901, file: !164, line: 2831, baseType: !688, size: 64, offset: 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !690, file: !164, line: 3389, baseType: !910, size: 1024)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !910, file: !164, line: 2851, baseType: !854, size: 960)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !910, file: !164, line: 2852, baseType: !564, size: 32, offset: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !910, file: !164, line: 2853, baseType: !564, size: 32, offset: 992)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !690, file: !164, line: 3390, baseType: !916, size: 1024)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !916, file: !164, line: 2858, baseType: !854, size: 960)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !916, file: !164, line: 2859, baseType: !892, size: 64, offset: 960)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !690, file: !164, line: 3391, baseType: !921, size: 960)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !922)
!922 = !{!923}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !921, file: !164, line: 2863, baseType: !854, size: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !690, file: !164, line: 3392, baseType: !925, size: 1472)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !926)
!926 = !{!927}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !164, line: 3305, baseType: !859, size: 1472)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !690, file: !164, line: 3393, baseType: !929, size: 1792)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !930)
!930 = !{!931, !932, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !164, line: 3249, baseType: !859, size: 1472)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !929, file: !164, line: 3251, baseType: !933, size: 64, offset: 1472)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !935, line: 463, size: 1152, elements: !936)
!935 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!936 = !{!937, !940, !1100, !1101, !1104, !1163, !1164, !1165, !1166, !1167, !1168, !1192, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !934, file: !935, line: 464, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !935, line: 464, flags: DIFlagFwdDecl)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !934, file: !935, line: 467, baseType: !941, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !148, line: 374, size: 640, elements: !943)
!943 = !{!944, !1075, !1076, !1089, !1090, !1091, !1092, !1093, !1094, !1096, !1098, !1099}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !942, file: !148, line: 377, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !572, line: 111, baseType: !946)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !148, line: 217, size: 832, elements: !948)
!948 = !{!949, !984, !985, !986, !1045, !1049, !1050, !1051, !1069, !1070, !1071, !1072, !1073, !1074}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !947, file: !148, line: 219, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !148, line: 151, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !148, line: 151, size: 128, elements: !953)
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !952, file: !148, line: 151, baseType: !955, size: 128)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !148, line: 150, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !148, line: 150, size: 128, elements: !957)
!957 = !{!958, !959, !960}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !956, file: !148, line: 150, baseType: !7, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !956, file: !148, line: 150, baseType: !7, size: 32, offset: 32)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !956, file: !148, line: 150, baseType: !961, size: 64, offset: 64)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 64, elements: !668)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !572, line: 108, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !148, line: 122, size: 512, elements: !965)
!965 = !{!966, !967, !968, !976, !977, !978, !979, !980, !981, !982}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !964, file: !148, line: 124, baseType: !946, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !964, file: !148, line: 125, baseType: !946, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !964, file: !148, line: 131, baseType: !969, size: 64, offset: 128)
!969 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !148, line: 128, size: 64, elements: !970)
!970 = !{!971, !975}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !969, file: !148, line: 129, baseType: !972, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !572, line: 66, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !572, line: 65, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !969, file: !148, line: 130, baseType: !634, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !964, file: !148, line: 134, baseType: !568, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !964, file: !148, line: 137, baseType: !688, size: 64, offset: 256)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !964, file: !148, line: 138, baseType: !808, size: 32, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !964, file: !148, line: 142, baseType: !7, size: 32, offset: 352)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !148, line: 144, baseType: !564, size: 32, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !964, file: !148, line: 145, baseType: !564, size: 32, offset: 416)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !964, file: !148, line: 146, baseType: !983, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !148, line: 119, baseType: !606)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !947, file: !148, line: 220, baseType: !950, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !947, file: !148, line: 223, baseType: !568, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !947, file: !148, line: 226, baseType: !987, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 100, size: 1216, elements: !989)
!989 = !{!990, !991, !992, !993, !994, !999, !1000, !1001, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1035, !1043, !1044}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !988, file: !135, line: 102, baseType: !564, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !988, file: !135, line: 105, baseType: !7, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !988, file: !135, line: 108, baseType: !946, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !988, file: !135, line: 111, baseType: !946, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !988, file: !135, line: 114, baseType: !995, size: 64, offset: 192)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !135, line: 41, size: 64, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !995, file: !135, line: 42, baseType: !134, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !995, file: !135, line: 43, baseType: !7, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !988, file: !135, line: 117, baseType: !7, size: 32, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !988, file: !135, line: 120, baseType: !7, size: 32, offset: 288)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !988, file: !135, line: 123, baseType: !1002, size: 64, offset: 320)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !135, line: 87, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !135, line: 87, size: 128, elements: !1005)
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1004, file: !135, line: 87, baseType: !1007, size: 128)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !135, line: 85, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !135, line: 85, size: 128, elements: !1009)
!1009 = !{!1010, !1011, !1012}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1008, file: !135, line: 85, baseType: !7, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1008, file: !135, line: 85, baseType: !7, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1008, file: !135, line: 85, baseType: !1013, size: 64, offset: 64)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1014, size: 64, elements: !668)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !135, line: 84, baseType: !987)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !988, file: !135, line: 126, baseType: !987, size: 64, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !988, file: !135, line: 129, baseType: !987, size: 64, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !988, file: !135, line: 132, baseType: !568, size: 64, offset: 512)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !988, file: !135, line: 139, baseType: !688, size: 64, offset: 576)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !988, file: !135, line: 143, baseType: !736, size: 128, offset: 640)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !988, file: !135, line: 146, baseType: !736, size: 128, offset: 768)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !988, file: !135, line: 148, baseType: !563, size: 8, offset: 896)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !988, file: !135, line: 149, baseType: !563, size: 8, offset: 904)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !988, file: !135, line: 153, baseType: !143, size: 32, offset: 928)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !988, file: !135, line: 156, baseType: !1025, size: 64, offset: 960)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !135, line: 48, size: 320, elements: !1027)
!1027 = !{!1028, !1032, !1033, !1034}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1026, file: !135, line: 50, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !572, line: 58, baseType: !1030)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !572, line: 57, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1026, file: !135, line: 59, baseType: !736, size: 128, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1026, file: !135, line: 64, baseType: !563, size: 8, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1026, file: !135, line: 67, baseType: !1025, size: 64, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !988, file: !135, line: 159, baseType: !1036, size: 64, offset: 1024)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !135, line: 72, size: 256, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1037, file: !135, line: 74, baseType: !963, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1037, file: !135, line: 77, baseType: !1036, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1037, file: !135, line: 78, baseType: !1036, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1037, file: !135, line: 81, baseType: !1036, size: 64, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !988, file: !135, line: 162, baseType: !563, size: 8, offset: 1088)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !988, file: !135, line: 166, baseType: !688, size: 64, offset: 1152)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !947, file: !148, line: 229, baseType: !1046, size: 128, offset: 256)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1047, size: 128, elements: !590)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !148, line: 229, flags: DIFlagFwdDecl)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !947, file: !148, line: 232, baseType: !946, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !947, file: !148, line: 233, baseType: !946, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !947, file: !148, line: 238, baseType: !1052, size: 64, offset: 512)
!1052 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !148, line: 235, size: 64, elements: !1053)
!1053 = !{!1054, !1060}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1052, file: !148, line: 236, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !148, line: 273, size: 128, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1056, file: !148, line: 275, baseType: !972, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1056, file: !148, line: 278, baseType: !972, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1052, file: !148, line: 237, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !148, line: 259, size: 320, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1062, file: !148, line: 261, baseType: !634, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1062, file: !148, line: 262, baseType: !634, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1062, file: !148, line: 266, baseType: !634, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1062, file: !148, line: 267, baseType: !634, size: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1062, file: !148, line: 270, baseType: !564, size: 32, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !947, file: !148, line: 241, baseType: !983, size: 64, offset: 576)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !947, file: !148, line: 244, baseType: !564, size: 32, offset: 640)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !947, file: !148, line: 247, baseType: !564, size: 32, offset: 672)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !947, file: !148, line: 250, baseType: !564, size: 32, offset: 704)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !947, file: !148, line: 253, baseType: !564, size: 32, offset: 736)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !947, file: !148, line: 256, baseType: !564, size: 32, offset: 768)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !942, file: !148, line: 378, baseType: !945, size: 64, offset: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !942, file: !148, line: 381, baseType: !1077, size: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !148, line: 282, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !148, line: 282, size: 128, elements: !1080)
!1080 = !{!1081}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1079, file: !148, line: 282, baseType: !1082, size: 128)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !148, line: 281, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !148, line: 281, size: 128, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1083, file: !148, line: 281, baseType: !7, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1083, file: !148, line: 281, baseType: !7, size: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1083, file: !148, line: 281, baseType: !1088, size: 64, offset: 64)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !945, size: 64, elements: !668)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !942, file: !148, line: 384, baseType: !564, size: 32, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !942, file: !148, line: 387, baseType: !564, size: 32, offset: 224)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !942, file: !148, line: 390, baseType: !564, size: 32, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !942, file: !148, line: 394, baseType: !1077, size: 64, offset: 320)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !942, file: !148, line: 396, baseType: !147, size: 32, offset: 384)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !942, file: !148, line: 399, baseType: !1095, size: 64, offset: 416)
!1095 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !590)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !942, file: !148, line: 402, baseType: !1097, size: 64, offset: 480)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !590)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !942, file: !148, line: 406, baseType: !564, size: 32, offset: 544)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !942, file: !148, line: 409, baseType: !564, size: 32, offset: 576)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !934, file: !935, line: 470, baseType: !973, size: 64, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !934, file: !935, line: 473, baseType: !1102, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !935, line: 166, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !934, file: !935, line: 476, baseType: !1105, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !135, line: 187, size: 256, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1162}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1106, file: !135, line: 189, baseType: !564, size: 32)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1106, file: !135, line: 192, baseType: !1002, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1106, file: !135, line: 197, baseType: !1111, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1112, line: 144, baseType: !1113)
!1112 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1112, line: 100, size: 896, elements: !1115)
!1115 = !{!1116, !1124, !1129, !1134, !1136, !1139, !1140, !1141, !1142, !1143, !1148, !1150, !1151, !1156, !1161}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1114, file: !1112, line: 102, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1112, line: 52, baseType: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1112, line: 47, baseType: !7)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1114, file: !1112, line: 105, baseType: !1125, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1112, line: 59, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!564, !1122, !1122}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1114, file: !1112, line: 108, baseType: !1130, size: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1112, line: 63, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !568}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1114, file: !1112, line: 111, baseType: !1135, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !1112, line: 114, baseType: !1137, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1138, line: 46, baseType: !589)
!1138 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1114, file: !1112, line: 117, baseType: !1137, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1114, file: !1112, line: 120, baseType: !1137, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1114, file: !1112, line: 124, baseType: !7, size: 32, offset: 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1114, file: !1112, line: 128, baseType: !7, size: 32, offset: 480)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1114, file: !1112, line: 131, baseType: !1144, size: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1112, line: 75, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!568, !1137, !1137}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1114, file: !1112, line: 132, baseType: !1149, size: 64, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1112, line: 78, baseType: !1131)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1114, file: !1112, line: 135, baseType: !568, size: 64, offset: 640)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1114, file: !1112, line: 136, baseType: !1152, size: 64, offset: 704)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1112, line: 82, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!568, !568, !1137, !1137}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1114, file: !1112, line: 137, baseType: !1157, size: 64, offset: 768)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1112, line: 83, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !568, !568}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1114, file: !1112, line: 141, baseType: !7, size: 32, offset: 832)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1106, file: !135, line: 200, baseType: !987, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !934, file: !935, line: 479, baseType: !1111, size: 64, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !934, file: !935, line: 484, baseType: !688, size: 64, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !934, file: !935, line: 488, baseType: !688, size: 64, offset: 448)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !934, file: !935, line: 493, baseType: !688, size: 64, offset: 512)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !934, file: !935, line: 496, baseType: !688, size: 64, offset: 576)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !934, file: !935, line: 501, baseType: !1169, size: 64, offset: 640)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1171)
!1171 = !{!1172, !1175, !1176, !1177, !1178, !1180, !1181, !1186, !1187, !1188, !1189, !1190, !1191}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1170, file: !159, line: 2356, baseType: !1173, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1170, file: !159, line: 2357, baseType: !569, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1170, file: !159, line: 2358, baseType: !564, size: 32, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1170, file: !159, line: 2359, baseType: !564, size: 32, offset: 160)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1170, file: !159, line: 2360, baseType: !1179, size: 128, offset: 192)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 128, elements: !615)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1170, file: !159, line: 2364, baseType: !564, size: 32, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1170, file: !159, line: 2367, baseType: !1182, size: 128, offset: 384)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1183)
!1183 = !{!1184, !1185}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1182, file: !159, line: 2351, baseType: !634, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1182, file: !159, line: 2352, baseType: !606, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1170, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1170, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1170, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1170, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1170, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1170, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !934, file: !935, line: 504, baseType: !1193, size: 64, offset: 704)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !935, line: 504, flags: DIFlagFwdDecl)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !934, file: !935, line: 507, baseType: !1111, size: 64, offset: 768)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !934, file: !935, line: 510, baseType: !564, size: 32, offset: 832)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !934, file: !935, line: 513, baseType: !564, size: 32, offset: 864)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !934, file: !935, line: 516, baseType: !808, size: 32, offset: 896)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !934, file: !935, line: 519, baseType: !808, size: 32, offset: 928)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !934, file: !935, line: 522, baseType: !7, size: 32, offset: 960)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !934, file: !935, line: 523, baseType: !7, size: 32, offset: 992)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !934, file: !935, line: 528, baseType: !569, size: 64, offset: 1024)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !934, file: !935, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !934, file: !935, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !934, file: !935, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !934, file: !935, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !934, file: !935, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !934, file: !935, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !934, file: !935, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !934, file: !935, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !934, file: !935, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !934, file: !935, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !934, file: !935, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !934, file: !935, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !934, file: !935, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !934, file: !935, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !934, file: !935, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !934, file: !935, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !929, file: !164, line: 3254, baseType: !688, size: 64, offset: 1536)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !929, file: !164, line: 3257, baseType: !688, size: 64, offset: 1600)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !929, file: !164, line: 3258, baseType: !688, size: 64, offset: 1664)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !929, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !929, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !929, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !929, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !929, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !929, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !929, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !929, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !929, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !929, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !929, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !929, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !929, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !929, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !929, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !929, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !929, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !929, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !690, file: !164, line: 3394, baseType: !1241, size: 1344)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1268, !1269, !1270, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1241, file: !164, line: 2280, baseType: !726, size: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1241, file: !164, line: 2281, baseType: !688, size: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1241, file: !164, line: 2282, baseType: !688, size: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1241, file: !164, line: 2283, baseType: !688, size: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1241, file: !164, line: 2284, baseType: !688, size: 64, offset: 384)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1241, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1241, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1241, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1241, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1241, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1241, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1241, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1241, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1241, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1241, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1241, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1241, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1241, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1241, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1241, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1241, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1241, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1241, file: !164, line: 2306, baseType: !1266, size: 32, offset: 544)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1267, line: 31, baseType: !564)
!1267 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1241, file: !164, line: 2307, baseType: !688, size: 64, offset: 576)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1241, file: !164, line: 2308, baseType: !688, size: 64, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1241, file: !164, line: 2314, baseType: !1271, size: 64, offset: 704)
!1271 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1272)
!1272 = !{!1273, !1274, !1275}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1271, file: !164, line: 2310, baseType: !564, size: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1271, file: !164, line: 2311, baseType: !569, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1271, file: !164, line: 2312, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1241, file: !164, line: 2315, baseType: !688, size: 64, offset: 768)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1241, file: !164, line: 2316, baseType: !688, size: 64, offset: 832)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1241, file: !164, line: 2317, baseType: !688, size: 64, offset: 896)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1241, file: !164, line: 2318, baseType: !688, size: 64, offset: 960)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1241, file: !164, line: 2319, baseType: !688, size: 64, offset: 1024)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1241, file: !164, line: 2320, baseType: !688, size: 64, offset: 1088)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1241, file: !164, line: 2321, baseType: !688, size: 64, offset: 1152)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1241, file: !164, line: 2322, baseType: !688, size: 64, offset: 1216)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1241, file: !164, line: 2324, baseType: !1287, size: 64, offset: 1280)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !164, line: 2324, flags: DIFlagFwdDecl)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !690, file: !164, line: 3395, baseType: !1290, size: 320)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !164, line: 1469, size: 320, elements: !1291)
!1291 = !{!1292, !1293, !1294}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1290, file: !164, line: 1470, baseType: !726, size: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1290, file: !164, line: 1471, baseType: !688, size: 64, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1290, file: !164, line: 1472, baseType: !688, size: 64, offset: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !690, file: !164, line: 3396, baseType: !1296, size: 320)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !164, line: 1482, size: 320, elements: !1297)
!1297 = !{!1298, !1299, !1300}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1296, file: !164, line: 1483, baseType: !726, size: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1296, file: !164, line: 1484, baseType: !564, size: 32, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1296, file: !164, line: 1485, baseType: !1301, size: 64, offset: 256)
!1301 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 64, elements: !668)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !690, file: !164, line: 3397, baseType: !1303, size: 384)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !164, line: 1829, size: 384, elements: !1304)
!1304 = !{!1305, !1306, !1307, !1308}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1303, file: !164, line: 1830, baseType: !726, size: 192)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1303, file: !164, line: 1831, baseType: !808, size: 32, offset: 192)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1303, file: !164, line: 1832, baseType: !688, size: 64, offset: 256)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1303, file: !164, line: 1835, baseType: !1301, size: 64, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !690, file: !164, line: 3398, baseType: !1310, size: 704)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !164, line: 1898, size: 704, elements: !1311)
!1311 = !{!1312, !1313, !1314, !1315, !1316, !1319}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1310, file: !164, line: 1899, baseType: !726, size: 192)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1310, file: !164, line: 1902, baseType: !688, size: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1310, file: !164, line: 1905, baseType: !1029, size: 64, offset: 256)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1310, file: !164, line: 1908, baseType: !7, size: 32, offset: 320)
