; ModuleID = 'loop-invariant.bc'
source_filename = "loop-invariant.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.loop = type { i32, i32, %struct.basic_block_def*, %struct.basic_block_def*, %struct.lpt_decision, i32, i32, %struct.VEC_loop_p_gc*, %struct.loop*, %struct.loop*, i8*, %union.tree_node*, %struct.double_int, %struct.double_int, i8, i8, i32, %struct.nb_iter_bound*, %struct.loop_exit*, i8, %union.tree_node* }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.gimple_seq_d = type opaque
%struct.et_node = type opaque

!546 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!547 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!548 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!549 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!550 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!551 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!552 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!553 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!554 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!555 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!556 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!557 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!558 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!559 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!560 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!561 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!562 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!563 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!564 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!565 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!566 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!567 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!568 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!569 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!570 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!571 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!572 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!573 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!574 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !153, line: 1188, baseType: !7, size: 32, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!576 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!577 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!578 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!579 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!580 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!581 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!582 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!583 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!584 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!585 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!586 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!587 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!588 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!589 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!590 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!591 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!592 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!593 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!594 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!595 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!596 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!597 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!598 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!599 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!600 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!601 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!602 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!603 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!604 = !{!605, !606, !607, !608, !611, !612, !7, !614, !397, !540, !5, !1852, !1861, !1863, !1236, !1875, !1857, !1918, !655, !1896, !1888, !1900, !1919, !1887, !1927}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!607 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_data", file: !3, line: 62, size: 1472, elements: !616)
!616 = !{!617, !1844, !1845, !1849, !1851}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "outermost_exit", scope: !615, file: !3, line: 64, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !385, line: 100, size: 1216, elements: !620)
!620 = !{!621, !622, !623, !1808, !1809, !1814, !1815, !1816, !1817, !1818, !1819, !1820, !1821, !1822, !1823, !1824, !1825, !1826, !1834, !1842, !1843}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !619, file: !385, line: 102, baseType: !607, size: 32)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !619, file: !385, line: 105, baseType: !7, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !619, file: !385, line: 108, baseType: !624, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !626)
!626 = !{!627, !1775, !1776, !1777, !1778, !1782, !1783, !1784, !1802, !1803, !1804, !1805, !1806, !1807}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !625, file: !142, line: 219, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !630)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !631)
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !630, file: !142, line: 151, baseType: !633, size: 128)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !634)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !635)
!635 = !{!636, !637, !638}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !634, file: !142, line: 150, baseType: !7, size: 32)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !634, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !634, file: !142, line: 150, baseType: !639, size: 64, offset: 64)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !640, size: 64, elements: !689)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !641, line: 108, baseType: !642)
!641 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !644)
!644 = !{!645, !646, !647, !1767, !1768, !1769, !1770, !1771, !1772, !1773}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !643, file: !142, line: 124, baseType: !624, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !643, file: !142, line: 125, baseType: !624, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !643, file: !142, line: 131, baseType: !648, size: 64, offset: 128)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !649)
!649 = !{!650, !654}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !648, file: !142, line: 129, baseType: !651, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !641, line: 66, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !641, line: 65, flags: DIFlagFwdDecl)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !648, file: !142, line: 130, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !641, line: 50, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !398, line: 240, size: 384, elements: !658)
!658 = !{!659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !657, file: !398, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !657, file: !398, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !657, file: !398, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !657, file: !398, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !657, file: !398, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !657, file: !398, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !657, file: !398, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !657, file: !398, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !657, file: !398, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !657, file: !398, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !657, file: !398, line: 321, baseType: !670, size: 320, offset: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !398, line: 315, size: 320, elements: !671)
!671 = !{!672, !1702, !1704, !1765, !1766}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !670, file: !398, line: 316, baseType: !673, size: 64)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 64, elements: !689)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !398, line: 183, baseType: !675)
!675 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !398, line: 166, size: 64, elements: !676)
!676 = !{!677, !678, !679, !680, !681, !691, !692, !704, !707, !769, !1680, !1681, !1692, !1699}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !675, file: !398, line: 168, baseType: !607, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !675, file: !398, line: 169, baseType: !7, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !675, file: !398, line: 170, baseType: !612, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !675, file: !398, line: 171, baseType: !655, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !675, file: !398, line: 172, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !641, line: 53, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !398, line: 359, size: 128, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !684, file: !398, line: 360, baseType: !607, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !684, file: !398, line: 361, baseType: !688, size: 64, offset: 64)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 64, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 1)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !675, file: !398, line: 173, baseType: !5, size: 32)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !675, file: !398, line: 174, baseType: !693, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !398, line: 133, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 115, size: 32, elements: !695)
!695 = !{!696, !697, !698, !699, !700, !701, !702, !703}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !694, file: !398, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !694, file: !398, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !694, file: !398, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !694, file: !398, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !694, file: !398, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !694, file: !398, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !694, file: !398, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !694, file: !398, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !675, file: !398, line: 175, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !398, line: 175, flags: DIFlagFwdDecl)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !675, file: !398, line: 176, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !710, line: 75, size: 256, elements: !711)
!710 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!711 = !{!712, !727, !728, !729}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !709, file: !710, line: 76, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !710, line: 68, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !710, line: 63, size: 320, elements: !716)
!716 = !{!717, !719, !720, !721}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !710, line: 64, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !715, file: !710, line: 65, baseType: !718, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !715, file: !710, line: 66, baseType: !7, size: 32, offset: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !715, file: !710, line: 67, baseType: !722, size: 128, offset: 192)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 128, elements: !725)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !710, line: 29, baseType: !724)
!724 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!725 = !{!726}
!726 = !DISubrange(count: 2)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !709, file: !710, line: 77, baseType: !713, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !709, file: !710, line: 78, baseType: !7, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !709, file: !710, line: 79, baseType: !730, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !710, line: 49, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !710, line: 45, size: 832, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !732, file: !710, line: 46, baseType: !718, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !732, file: !710, line: 47, baseType: !708, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !732, file: !710, line: 48, baseType: !737, size: 704, offset: 128)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !738, line: 164, size: 704, elements: !739)
!738 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!739 = !{!740, !742, !752, !753, !754, !755, !756, !757, !761, !765, !766, !767, !768}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !737, file: !738, line: 166, baseType: !741, size: 64)
!741 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !737, file: !738, line: 167, baseType: !743, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !738, line: 157, size: 192, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !744, file: !738, line: 159, baseType: !609, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !744, file: !738, line: 160, baseType: !743, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !744, file: !738, line: 161, baseType: !749, size: 32, offset: 128)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 32, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 4)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !737, file: !738, line: 168, baseType: !609, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !737, file: !738, line: 169, baseType: !609, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !737, file: !738, line: 170, baseType: !609, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !737, file: !738, line: 171, baseType: !741, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !737, file: !738, line: 172, baseType: !607, size: 32, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !737, file: !738, line: 176, baseType: !758, size: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!743, !611, !741}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !737, file: !738, line: 177, baseType: !762, size: 64, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !611, !743}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !737, file: !738, line: 178, baseType: !611, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !737, file: !738, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !737, file: !738, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !737, file: !738, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !675, file: !398, line: 177, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !641, line: 56, baseType: !771)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !773)
!773 = !{!774, !807, !813, !824, !843, !854, !859, !866, !872, !885, !897, !935, !940, !968, !976, !977, !982, !991, !997, !1002, !1006, !1010, !1316, !1365, !1371, !1377, !1384, !1410, !1424, !1441, !1453, !1475, !1490, !1662}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !772, file: !158, line: 3372, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !776)
!776 = !{!777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !775, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !775, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !775, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !775, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !775, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !775, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !775, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !775, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !775, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !775, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !775, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !775, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !775, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !775, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !775, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !775, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !775, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !775, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !775, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !775, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !775, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !775, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !775, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !775, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !775, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !775, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !775, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !775, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !775, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !775, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !158, line: 3373, baseType: !808, size: 192)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !808, file: !158, line: 403, baseType: !775, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !808, file: !158, line: 404, baseType: !770, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !808, file: !158, line: 405, baseType: !770, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !772, file: !158, line: 3374, baseType: !814, size: 320)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !158, line: 1385, baseType: !808, size: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !814, file: !158, line: 1386, baseType: !818, size: 128, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !819, line: 58, baseType: !820)
!819 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !819, line: 54, size: 128, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !820, file: !819, line: 56, baseType: !724, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !820, file: !819, line: 57, baseType: !741, size: 64, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !772, file: !158, line: 3375, baseType: !825, size: 256)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !158, line: 1398, baseType: !808, size: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !825, file: !158, line: 1399, baseType: !829, size: 64, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !831, line: 52, size: 256, elements: !832)
!831 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!832 = !{!833, !834, !835, !836, !837, !838, !839}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !830, file: !831, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !830, file: !831, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !830, file: !831, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !830, file: !831, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !830, file: !831, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !830, file: !831, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !830, file: !831, line: 62, baseType: !840, size: 192, offset: 64)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 192, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 3)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !772, file: !158, line: 3376, baseType: !844, size: 256)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !158, line: 1409, baseType: !808, size: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !844, file: !158, line: 1410, baseType: !848, size: 64, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !850, line: 27, size: 192, elements: !851)
!850 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !849, file: !850, line: 29, baseType: !818, size: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !849, file: !850, line: 30, baseType: !5, size: 32, offset: 128)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !772, file: !158, line: 3377, baseType: !855, size: 256)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !158, line: 1438, baseType: !808, size: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !855, file: !158, line: 1439, baseType: !770, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !772, file: !158, line: 3378, baseType: !860, size: 256)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !860, file: !158, line: 1419, baseType: !808, size: 192)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !860, file: !158, line: 1420, baseType: !607, size: 32, offset: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !860, file: !158, line: 1421, baseType: !865, size: 8, offset: 224)
!865 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 8, elements: !689)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !772, file: !158, line: 3379, baseType: !867, size: 320)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !158, line: 1429, baseType: !808, size: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !867, file: !158, line: 1430, baseType: !770, size: 64, offset: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !867, file: !158, line: 1431, baseType: !770, size: 64, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !772, file: !158, line: 3380, baseType: !873, size: 320)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !873, file: !158, line: 1461, baseType: !808, size: 192)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !873, file: !158, line: 1462, baseType: !877, size: 128, offset: 192)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !878, line: 31, size: 128, elements: !879)
!878 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!879 = !{!880, !883, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !877, file: !878, line: 32, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !877, file: !878, line: 33, baseType: !7, size: 32, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !877, file: !878, line: 34, baseType: !7, size: 32, offset: 96)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !772, file: !158, line: 3381, baseType: !886, size: 384)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !887)
!887 = !{!888, !889, !894, !895, !896}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !886, file: !158, line: 2508, baseType: !808, size: 192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !886, file: !158, line: 2509, baseType: !890, size: 32, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !891, line: 58, baseType: !892)
!891 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!892 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !893, line: 44, baseType: !7)
!893 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!894 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !886, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !886, file: !158, line: 2511, baseType: !770, size: 64, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !886, file: !158, line: 2512, baseType: !770, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !772, file: !158, line: 3382, baseType: !898, size: 896)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !158, line: 2653, baseType: !886, size: 384)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !898, file: !158, line: 2654, baseType: !770, size: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !898, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !898, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !898, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !898, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !898, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !898, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !898, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !898, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !898, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !898, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !898, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !898, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !898, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !898, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !898, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !898, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !898, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !898, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !898, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !898, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !898, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !898, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !898, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !898, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !898, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !898, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !898, file: !158, line: 2705, baseType: !770, size: 64, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !898, file: !158, line: 2706, baseType: !770, size: 64, offset: 640)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !898, file: !158, line: 2707, baseType: !770, size: 64, offset: 704)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !898, file: !158, line: 2708, baseType: !770, size: 64, offset: 768)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !898, file: !158, line: 2711, baseType: !933, size: 64, offset: 832)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !772, file: !158, line: 3383, baseType: !936, size: 960)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !158, line: 2757, baseType: !898, size: 896)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !936, file: !158, line: 2758, baseType: !655, size: 64, offset: 896)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !772, file: !158, line: 3384, baseType: !941, size: 1472)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !942)
!942 = !{!943, !964, !965, !966, !967}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !941, file: !158, line: 3115, baseType: !944, size: 1216)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !945)
!945 = !{!946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !158, line: 2985, baseType: !936, size: 960)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !944, file: !158, line: 2986, baseType: !770, size: 64, offset: 960)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !944, file: !158, line: 2987, baseType: !770, size: 64, offset: 1024)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !944, file: !158, line: 2988, baseType: !770, size: 64, offset: 1088)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !944, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !944, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !944, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !944, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !944, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !944, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !944, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !944, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !944, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !944, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !944, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !944, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !944, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !944, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !941, file: !158, line: 3117, baseType: !770, size: 64, offset: 1216)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !941, file: !158, line: 3119, baseType: !770, size: 64, offset: 1280)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !941, file: !158, line: 3121, baseType: !770, size: 64, offset: 1344)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !941, file: !158, line: 3123, baseType: !770, size: 64, offset: 1408)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !772, file: !158, line: 3385, baseType: !969, size: 1088)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !158, line: 2875, baseType: !936, size: 960)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !969, file: !158, line: 2876, baseType: !655, size: 64, offset: 960)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !969, file: !158, line: 2877, baseType: !974, size: 64, offset: 1024)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !772, file: !158, line: 3386, baseType: !944, size: 1216)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !772, file: !158, line: 3387, baseType: !978, size: 1280)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !978, file: !158, line: 3094, baseType: !944, size: 1216)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !978, file: !158, line: 3095, baseType: !974, size: 64, offset: 1216)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !772, file: !158, line: 3388, baseType: !983, size: 1216)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !984)
!984 = !{!985, !986, !987, !988, !989, !990}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !983, file: !158, line: 2825, baseType: !898, size: 896)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !983, file: !158, line: 2827, baseType: !770, size: 64, offset: 896)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !983, file: !158, line: 2828, baseType: !770, size: 64, offset: 960)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !983, file: !158, line: 2829, baseType: !770, size: 64, offset: 1024)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !983, file: !158, line: 2830, baseType: !770, size: 64, offset: 1088)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !983, file: !158, line: 2831, baseType: !770, size: 64, offset: 1152)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !772, file: !158, line: 3389, baseType: !992, size: 1024)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !992, file: !158, line: 2851, baseType: !936, size: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !992, file: !158, line: 2852, baseType: !607, size: 32, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !992, file: !158, line: 2853, baseType: !607, size: 32, offset: 992)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !772, file: !158, line: 3390, baseType: !998, size: 1024)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !998, file: !158, line: 2858, baseType: !936, size: 960)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !998, file: !158, line: 2859, baseType: !974, size: 64, offset: 960)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !772, file: !158, line: 3391, baseType: !1003, size: 960)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1004)
!1004 = !{!1005}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1003, file: !158, line: 2863, baseType: !936, size: 960)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !772, file: !158, line: 3392, baseType: !1007, size: 1472)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1008)
!1008 = !{!1009}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !158, line: 3305, baseType: !941, size: 1472)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !772, file: !158, line: 3393, baseType: !1011, size: 1792)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1012)
!1012 = !{!1013, !1014, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1011, file: !158, line: 3249, baseType: !941, size: 1472)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1011, file: !158, line: 3251, baseType: !1015, size: 64, offset: 1472)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1017, line: 463, size: 1152, elements: !1018)
!1017 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1018 = !{!1019, !1183, !1214, !1215, !1218, !1239, !1240, !1241, !1242, !1243, !1244, !1268, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1016, file: !1017, line: 464, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1022)
!1022 = !{!1023, !1072, !1085, !1099, !1151, !1164}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1021, file: !135, line: 197, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1025)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1060, !1069, !1070, !1071}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1026, file: !135, line: 119, baseType: !1025, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1026, file: !135, line: 122, baseType: !1025, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1026, file: !135, line: 123, baseType: !1025, size: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1026, file: !135, line: 126, baseType: !607, size: 32, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1026, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1026, file: !135, line: 165, baseType: !1034, size: 192, offset: 256)
!1034 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1035)
!1035 = !{!1036, !1049, !1055}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1034, file: !135, line: 137, baseType: !1037, size: 128)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1038)
!1038 = !{!1039, !1048}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1037, file: !135, line: 135, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1042)
!1042 = !{!1043, !1044, !1045, !1046, !1047}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1041, file: !135, line: 96, baseType: !1040, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1041, file: !135, line: 97, baseType: !1040, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1041, file: !135, line: 101, baseType: !770, size: 64, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1041, file: !135, line: 106, baseType: !770, size: 64, offset: 192)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1041, file: !135, line: 111, baseType: !770, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1037, file: !135, line: 136, baseType: !1040, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1034, file: !135, line: 151, baseType: !1050, size: 192)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1051)
!1051 = !{!1052, !1053, !1054}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1050, file: !135, line: 141, baseType: !770, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1050, file: !135, line: 145, baseType: !770, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1050, file: !135, line: 150, baseType: !607, size: 32, offset: 128)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1034, file: !135, line: 164, baseType: !1056, size: 128)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1056, file: !135, line: 161, baseType: !770, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1056, file: !135, line: 163, baseType: !890, size: 32, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1026, file: !135, line: 168, baseType: !1061, size: 64, offset: 448)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067, !1068}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1062, file: !135, line: 70, baseType: !1061, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1062, file: !135, line: 73, baseType: !1025, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1062, file: !135, line: 78, baseType: !770, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1062, file: !135, line: 85, baseType: !655, size: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1062, file: !135, line: 88, baseType: !607, size: 32, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1026, file: !135, line: 173, baseType: !655, size: 64, offset: 512)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1026, file: !135, line: 173, baseType: !655, size: 64, offset: 576)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1026, file: !135, line: 177, baseType: !606, size: 8, offset: 640)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1021, file: !135, line: 200, baseType: !1073, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1076)
!1076 = !{!1077}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1075, file: !135, line: 185, baseType: !1078, size: 128)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1080)
!1080 = !{!1081, !1082, !1083}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1079, file: !135, line: 184, baseType: !7, size: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1079, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1079, file: !135, line: 184, baseType: !1084, size: 64, offset: 64)
!1084 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1024, size: 64, elements: !689)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1021, file: !135, line: 203, baseType: !1086, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1089)
!1089 = !{!1090}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1088, file: !135, line: 189, baseType: !1091, size: 128)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1092)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1092, file: !135, line: 188, baseType: !7, size: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1092, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1092, file: !135, line: 188, baseType: !1097, size: 64, offset: 64)
!1097 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1098, size: 64, elements: !689)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1061)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1021, file: !135, line: 207, baseType: !1100, size: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1101, line: 144, baseType: !1102)
!1101 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1101, line: 100, size: 896, elements: !1104)
!1104 = !{!1105, !1113, !1118, !1123, !1125, !1128, !1129, !1130, !1131, !1132, !1137, !1139, !1140, !1145, !1150}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1103, file: !1101, line: 102, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1101, line: 52, baseType: !1107)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DISubroutineType(types: !1109)
!1109 = !{!1110, !1111}
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1101, line: 47, baseType: !7)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1103, file: !1101, line: 105, baseType: !1114, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1101, line: 59, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!607, !1111, !1111}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1103, file: !1101, line: 108, baseType: !1119, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1101, line: 63, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{null, !611}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1103, file: !1101, line: 111, baseType: !1124, size: 64, offset: 192)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1103, file: !1101, line: 114, baseType: !1126, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1127, line: 46, baseType: !724)
!1127 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1103, file: !1101, line: 117, baseType: !1126, size: 64, offset: 320)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1103, file: !1101, line: 120, baseType: !1126, size: 64, offset: 384)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1103, file: !1101, line: 124, baseType: !7, size: 32, offset: 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1103, file: !1101, line: 128, baseType: !7, size: 32, offset: 480)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1103, file: !1101, line: 131, baseType: !1133, size: 64, offset: 512)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1101, line: 75, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!611, !1126, !1126}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1103, file: !1101, line: 132, baseType: !1138, size: 64, offset: 576)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1101, line: 78, baseType: !1120)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1103, file: !1101, line: 135, baseType: !611, size: 64, offset: 640)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1103, file: !1101, line: 136, baseType: !1141, size: 64, offset: 704)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1101, line: 82, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{!611, !611, !1126, !1126}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1103, file: !1101, line: 137, baseType: !1146, size: 64, offset: 768)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1101, line: 83, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DISubroutineType(types: !1149)
!1149 = !{null, !611, !611}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1103, file: !1101, line: 141, baseType: !7, size: 32, offset: 832)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1021, file: !135, line: 211, baseType: !1152, size: 64, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1155)
!1155 = !{!1156}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1154, file: !158, line: 183, baseType: !1157, size: 128)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1158)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1159)
!1159 = !{!1160, !1161, !1162}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1158, file: !158, line: 182, baseType: !7, size: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1158, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1158, file: !158, line: 182, baseType: !1163, size: 64, offset: 64)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 64, elements: !689)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1021, file: !135, line: 220, baseType: !1165, size: 64, offset: 320)
!1165 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1166)
!1166 = !{!1167, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1165, file: !135, line: 218, baseType: !1152, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1165, file: !135, line: 219, baseType: !1169, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1171, line: 29, baseType: !1172)
!1171 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1171, line: 29, size: 96, elements: !1173)
!1173 = !{!1174}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1172, file: !1171, line: 29, baseType: !1175, size: 96)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1171, line: 27, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1171, line: 27, size: 96, elements: !1177)
!1177 = !{!1178, !1179, !1180}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1176, file: !1171, line: 27, baseType: !7, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1176, file: !1171, line: 27, baseType: !7, size: 32, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1176, file: !1171, line: 27, baseType: !1181, size: 8, offset: 64)
!1181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 8, elements: !689)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1171, line: 26, baseType: !606)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1016, file: !1017, line: 467, baseType: !1184, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1186)
!1186 = !{!1187, !1189, !1190, !1203, !1204, !1205, !1206, !1207, !1208, !1210, !1212, !1213}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1185, file: !142, line: 377, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !641, line: 111, baseType: !624)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1185, file: !142, line: 378, baseType: !1188, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1185, file: !142, line: 381, baseType: !1191, size: 64, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1194)
!1194 = !{!1195}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1193, file: !142, line: 282, baseType: !1196, size: 128)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1197)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1197, file: !142, line: 281, baseType: !7, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1197, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1197, file: !142, line: 281, baseType: !1202, size: 64, offset: 64)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1188, size: 64, elements: !689)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1185, file: !142, line: 384, baseType: !607, size: 32, offset: 192)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1185, file: !142, line: 387, baseType: !607, size: 32, offset: 224)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1185, file: !142, line: 390, baseType: !607, size: 32, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1185, file: !142, line: 394, baseType: !1191, size: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1185, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1185, file: !142, line: 399, baseType: !1209, size: 64, offset: 416)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !725)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1185, file: !142, line: 402, baseType: !1211, size: 64, offset: 480)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !725)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1185, file: !142, line: 406, baseType: !607, size: 32, offset: 544)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1185, file: !142, line: 409, baseType: !607, size: 32, offset: 576)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1016, file: !1017, line: 470, baseType: !652, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1016, file: !1017, line: 473, baseType: !1216, size: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1017, line: 166, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1016, file: !1017, line: 476, baseType: !1219, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !385, line: 187, size: 256, elements: !1221)
!1221 = !{!1222, !1223, !1237, !1238}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1220, file: !385, line: 189, baseType: !607, size: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1220, file: !385, line: 192, baseType: !1224, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !385, line: 87, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !385, line: 87, size: 128, elements: !1227)
!1227 = !{!1228}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1226, file: !385, line: 87, baseType: !1229, size: 128)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !385, line: 85, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !385, line: 85, size: 128, elements: !1231)
!1231 = !{!1232, !1233, !1234}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1230, file: !385, line: 85, baseType: !7, size: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1230, file: !385, line: 85, baseType: !7, size: 32, offset: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1230, file: !385, line: 85, baseType: !1235, size: 64, offset: 64)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1236, size: 64, elements: !689)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !385, line: 84, baseType: !618)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1220, file: !385, line: 197, baseType: !1100, size: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1220, file: !385, line: 200, baseType: !618, size: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1016, file: !1017, line: 479, baseType: !1100, size: 64, offset: 320)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1016, file: !1017, line: 484, baseType: !770, size: 64, offset: 384)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1016, file: !1017, line: 488, baseType: !770, size: 64, offset: 448)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1016, file: !1017, line: 493, baseType: !770, size: 64, offset: 512)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1016, file: !1017, line: 496, baseType: !770, size: 64, offset: 576)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1016, file: !1017, line: 501, baseType: !1245, size: 64, offset: 640)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1247)
!1247 = !{!1248, !1251, !1252, !1253, !1254, !1256, !1257, !1262, !1263, !1264, !1265, !1266, !1267}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1246, file: !153, line: 2356, baseType: !1249, size: 64)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1246, file: !153, line: 2357, baseType: !612, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1246, file: !153, line: 2358, baseType: !607, size: 32, offset: 128)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1246, file: !153, line: 2359, baseType: !607, size: 32, offset: 160)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1246, file: !153, line: 2360, baseType: !1255, size: 128, offset: 192)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 128, elements: !750)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1246, file: !153, line: 2364, baseType: !607, size: 32, offset: 320)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1246, file: !153, line: 2367, baseType: !1258, size: 128, offset: 384)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1259)
!1259 = !{!1260, !1261}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1258, file: !153, line: 2351, baseType: !655, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1258, file: !153, line: 2352, baseType: !741, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1246, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1246, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1246, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1246, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1246, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1246, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1016, file: !1017, line: 504, baseType: !1269, size: 64, offset: 704)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1017, line: 504, flags: DIFlagFwdDecl)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1016, file: !1017, line: 507, baseType: !1100, size: 64, offset: 768)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1016, file: !1017, line: 510, baseType: !607, size: 32, offset: 832)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1016, file: !1017, line: 513, baseType: !607, size: 32, offset: 864)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1016, file: !1017, line: 516, baseType: !890, size: 32, offset: 896)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1016, file: !1017, line: 519, baseType: !890, size: 32, offset: 928)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1016, file: !1017, line: 522, baseType: !7, size: 32, offset: 960)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1016, file: !1017, line: 523, baseType: !7, size: 32, offset: 992)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1016, file: !1017, line: 528, baseType: !612, size: 64, offset: 1024)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1016, file: !1017, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1016, file: !1017, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1016, file: !1017, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1016, file: !1017, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1016, file: !1017, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1016, file: !1017, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1016, file: !1017, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1016, file: !1017, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1016, file: !1017, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1016, file: !1017, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1016, file: !1017, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1016, file: !1017, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1016, file: !1017, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1016, file: !1017, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1016, file: !1017, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1016, file: !1017, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1011, file: !158, line: 3254, baseType: !770, size: 64, offset: 1536)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1011, file: !158, line: 3257, baseType: !770, size: 64, offset: 1600)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1011, file: !158, line: 3258, baseType: !770, size: 64, offset: 1664)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1011, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1011, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1011, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1011, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1011, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1011, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1011, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1011, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1011, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1011, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1011, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1011, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1011, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1011, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1011, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1011, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1011, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1011, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !772, file: !158, line: 3394, baseType: !1317, size: 1344)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1344, !1345, !1346, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1317, file: !158, line: 2280, baseType: !808, size: 192)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1317, file: !158, line: 2281, baseType: !770, size: 64, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1317, file: !158, line: 2282, baseType: !770, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1317, file: !158, line: 2283, baseType: !770, size: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1317, file: !158, line: 2284, baseType: !770, size: 64, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1317, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1317, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1317, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1317, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1317, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1317, file: !158, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1317, file: !158, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1317, file: !158, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1317, file: !158, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1317, file: !158, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1317, file: !158, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1317, file: !158, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1317, file: !158, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1317, file: !158, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1317, file: !158, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1317, file: !158, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1317, file: !158, line: 2305, baseType: !7, size: 32, offset: 512)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1317, file: !158, line: 2306, baseType: !1342, size: 32, offset: 544)
!1342 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1343, line: 31, baseType: !607)
!1343 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1317, file: !158, line: 2307, baseType: !770, size: 64, offset: 576)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1317, file: !158, line: 2308, baseType: !770, size: 64, offset: 640)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1317, file: !158, line: 2314, baseType: !1347, size: 64, offset: 704)
!1347 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !158, line: 2309, size: 64, elements: !1348)
!1348 = !{!1349, !1350, !1351}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1347, file: !158, line: 2310, baseType: !607, size: 32)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1347, file: !158, line: 2311, baseType: !612, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1347, file: !158, line: 2312, baseType: !1352, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !158, line: 2277, flags: DIFlagFwdDecl)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1317, file: !158, line: 2315, baseType: !770, size: 64, offset: 768)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1317, file: !158, line: 2316, baseType: !770, size: 64, offset: 832)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1317, file: !158, line: 2317, baseType: !770, size: 64, offset: 896)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1317, file: !158, line: 2318, baseType: !770, size: 64, offset: 960)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1317, file: !158, line: 2319, baseType: !770, size: 64, offset: 1024)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1317, file: !158, line: 2320, baseType: !770, size: 64, offset: 1088)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1317, file: !158, line: 2321, baseType: !770, size: 64, offset: 1152)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1317, file: !158, line: 2322, baseType: !770, size: 64, offset: 1216)
