; ModuleID = 'loop-unswitch.bc'
source_filename = "loop-unswitch.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!491 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!492 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!493 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!494 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!495 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!496 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!497 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!498 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!499 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!500 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!501 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!502 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!503 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!504 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!505 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!506 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!507 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!508 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!509 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!510 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!511 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!512 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!513 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!514 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!515 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!516 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!517 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!518 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!519 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!520 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!521 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!522 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!523 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!524 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!525 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!526 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!527 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!528 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!529 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!530 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !532, line: 36, baseType: !5, size: 32, elements: !533)
!532 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!534 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!535 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!536 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!537 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!538 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!539 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!540 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!541 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!542 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!543 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!544 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!545 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!546 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!547 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!548 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!549 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!550 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!551 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!552 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!553 = !{!554, !555, !556, !557, !560, !561, !3, !531, !388, !563, !1691, !1005}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!556 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!563 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !564, line: 50, baseType: !565)
!564 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !389, line: 240, size: 384, elements: !567)
!567 = !{!568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !566, file: !389, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !566, file: !389, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !566, file: !389, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !566, file: !389, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !566, file: !389, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !566, file: !389, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !566, file: !389, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !566, file: !389, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !566, file: !389, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !566, file: !389, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !566, file: !389, line: 321, baseType: !579, size: 320, offset: 64)
!579 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !389, line: 315, size: 320, elements: !580)
!580 = !{!581, !1626, !1628, !1689, !1690}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !579, file: !389, line: 316, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_array_type, baseType: !583, size: 64, elements: !598)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !389, line: 183, baseType: !584)
!584 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !389, line: 166, size: 64, elements: !585)
!585 = !{!586, !587, !588, !589, !590, !600, !601, !613, !616, !678, !1604, !1605, !1616, !1623}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !584, file: !389, line: 168, baseType: !556, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !584, file: !389, line: 169, baseType: !5, size: 32)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !584, file: !389, line: 170, baseType: !561, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !584, file: !389, line: 171, baseType: !563, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !584, file: !389, line: 172, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !564, line: 53, baseType: !592)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !389, line: 359, size: 128, elements: !594)
!594 = !{!595, !596}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !593, file: !389, line: 360, baseType: !556, size: 32)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !593, file: !389, line: 361, baseType: !597, size: 64, offset: 64)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 64, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 1)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !584, file: !389, line: 173, baseType: !3, size: 32)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !584, file: !389, line: 174, baseType: !602, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !389, line: 133, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 115, size: 32, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !603, file: !389, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !603, file: !389, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !603, file: !389, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !603, file: !389, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !603, file: !389, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !603, file: !389, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !603, file: !389, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !603, file: !389, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !584, file: !389, line: 175, baseType: !614, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !389, line: 175, flags: DIFlagFwdDecl)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !584, file: !389, line: 176, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !619, line: 75, size: 256, elements: !620)
!619 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!620 = !{!621, !636, !637, !638}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !618, file: !619, line: 76, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !619, line: 68, baseType: !624)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !619, line: 63, size: 320, elements: !625)
!625 = !{!626, !628, !629, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !624, file: !619, line: 64, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !624, file: !619, line: 65, baseType: !627, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !624, file: !619, line: 66, baseType: !5, size: 32, offset: 128)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !624, file: !619, line: 67, baseType: !631, size: 128, offset: 192)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 128, elements: !634)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !619, line: 29, baseType: !633)
!633 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!634 = !{!635}
!635 = !DISubrange(count: 2)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !618, file: !619, line: 77, baseType: !622, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !618, file: !619, line: 78, baseType: !5, size: 32, offset: 128)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !618, file: !619, line: 79, baseType: !639, size: 64, offset: 192)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !619, line: 49, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !619, line: 45, size: 832, elements: !642)
!642 = !{!643, !644, !645}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !641, file: !619, line: 46, baseType: !627, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !641, file: !619, line: 47, baseType: !617, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !641, file: !619, line: 48, baseType: !646, size: 704, offset: 128)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !647, line: 164, size: 704, elements: !648)
!647 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!648 = !{!649, !651, !661, !662, !663, !664, !665, !666, !670, !674, !675, !676, !677}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !646, file: !647, line: 166, baseType: !650, size: 64)
!650 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !646, file: !647, line: 167, baseType: !652, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !647, line: 157, size: 192, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !653, file: !647, line: 159, baseType: !558, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !653, file: !647, line: 160, baseType: !652, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !653, file: !647, line: 161, baseType: !658, size: 32, offset: 128)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 32, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 4)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !646, file: !647, line: 168, baseType: !558, size: 64, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !646, file: !647, line: 169, baseType: !558, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !646, file: !647, line: 170, baseType: !558, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !646, file: !647, line: 171, baseType: !650, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !646, file: !647, line: 172, baseType: !556, size: 32, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !646, file: !647, line: 176, baseType: !667, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DISubroutineType(types: !669)
!669 = !{!652, !560, !650}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !646, file: !647, line: 177, baseType: !671, size: 64, offset: 512)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DISubroutineType(types: !673)
!673 = !{null, !560, !652}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !646, file: !647, line: 178, baseType: !560, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !646, file: !647, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !646, file: !647, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !646, file: !647, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !584, file: !389, line: 177, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !564, line: 56, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !162, line: 3371, size: 1792, elements: !682)
!682 = !{!683, !716, !722, !733, !752, !763, !768, !775, !781, !794, !806, !844, !849, !877, !885, !886, !891, !900, !906, !911, !915, !919, !1231, !1280, !1286, !1293, !1300, !1323, !1348, !1365, !1377, !1399, !1414, !1586}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !681, file: !162, line: 3372, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !162, line: 360, size: 64, elements: !685)
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !684, file: !162, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !684, file: !162, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !684, file: !162, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !684, file: !162, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !684, file: !162, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !684, file: !162, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !684, file: !162, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !684, file: !162, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !684, file: !162, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !684, file: !162, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !684, file: !162, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !684, file: !162, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !684, file: !162, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !684, file: !162, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !684, file: !162, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !684, file: !162, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !684, file: !162, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !684, file: !162, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !684, file: !162, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !684, file: !162, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !684, file: !162, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !684, file: !162, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !684, file: !162, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !684, file: !162, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !684, file: !162, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !684, file: !162, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !684, file: !162, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !684, file: !162, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !684, file: !162, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !684, file: !162, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !681, file: !162, line: 3373, baseType: !717, size: 192)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !162, line: 402, size: 192, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !717, file: !162, line: 403, baseType: !684, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !717, file: !162, line: 404, baseType: !679, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !717, file: !162, line: 405, baseType: !679, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !681, file: !162, line: 3374, baseType: !723, size: 320)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !162, line: 1384, size: 320, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !723, file: !162, line: 1385, baseType: !717, size: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !723, file: !162, line: 1386, baseType: !727, size: 128, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !728, line: 58, baseType: !729)
!728 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !728, line: 54, size: 128, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !729, file: !728, line: 56, baseType: !633, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !729, file: !728, line: 57, baseType: !650, size: 64, offset: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !681, file: !162, line: 3375, baseType: !734, size: 256)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !162, line: 1397, size: 256, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !734, file: !162, line: 1398, baseType: !717, size: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !734, file: !162, line: 1399, baseType: !738, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !740, line: 52, size: 256, elements: !741)
!740 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!741 = !{!742, !743, !744, !745, !746, !747, !748}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !739, file: !740, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !739, file: !740, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !739, file: !740, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !739, file: !740, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !739, file: !740, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !739, file: !740, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !739, file: !740, line: 62, baseType: !749, size: 192, offset: 64)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 192, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 3)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !681, file: !162, line: 3376, baseType: !753, size: 256)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !162, line: 1408, size: 256, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !162, line: 1409, baseType: !717, size: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !753, file: !162, line: 1410, baseType: !757, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !759, line: 27, size: 192, elements: !760)
!759 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !758, file: !759, line: 29, baseType: !727, size: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !758, file: !759, line: 30, baseType: !3, size: 32, offset: 128)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !681, file: !162, line: 3377, baseType: !764, size: 256)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !162, line: 1437, size: 256, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !764, file: !162, line: 1438, baseType: !717, size: 192)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !764, file: !162, line: 1439, baseType: !679, size: 64, offset: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !681, file: !162, line: 3378, baseType: !769, size: 256)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !162, line: 1418, size: 256, elements: !770)
!770 = !{!771, !772, !773}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !769, file: !162, line: 1419, baseType: !717, size: 192)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !769, file: !162, line: 1420, baseType: !556, size: 32, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !769, file: !162, line: 1421, baseType: !774, size: 8, offset: 224)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 8, elements: !598)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !681, file: !162, line: 3379, baseType: !776, size: 320)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !162, line: 1428, size: 320, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !162, line: 1429, baseType: !717, size: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !776, file: !162, line: 1430, baseType: !679, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !776, file: !162, line: 1431, baseType: !679, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !681, file: !162, line: 3380, baseType: !782, size: 320)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !162, line: 1460, size: 320, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !782, file: !162, line: 1461, baseType: !717, size: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !782, file: !162, line: 1462, baseType: !786, size: 128, offset: 192)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !787, line: 31, size: 128, elements: !788)
!787 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!788 = !{!789, !792, !793}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !786, file: !787, line: 32, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !786, file: !787, line: 33, baseType: !5, size: 32, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !786, file: !787, line: 34, baseType: !5, size: 32, offset: 96)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !681, file: !162, line: 3381, baseType: !795, size: 384)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !162, line: 2507, size: 384, elements: !796)
!796 = !{!797, !798, !803, !804, !805}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !795, file: !162, line: 2508, baseType: !717, size: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !795, file: !162, line: 2509, baseType: !799, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !800, line: 58, baseType: !801)
!800 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !802, line: 44, baseType: !5)
!802 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!803 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !795, file: !162, line: 2510, baseType: !5, size: 32, offset: 224)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !795, file: !162, line: 2511, baseType: !679, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !795, file: !162, line: 2512, baseType: !679, size: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !681, file: !162, line: 3382, baseType: !807, size: 896)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !162, line: 2652, size: 896, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !807, file: !162, line: 2653, baseType: !795, size: 384)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !807, file: !162, line: 2654, baseType: !679, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !807, file: !162, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !807, file: !162, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !807, file: !162, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !807, file: !162, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !807, file: !162, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !807, file: !162, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !807, file: !162, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !807, file: !162, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !807, file: !162, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !807, file: !162, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !807, file: !162, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !807, file: !162, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !807, file: !162, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !807, file: !162, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !807, file: !162, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !807, file: !162, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !807, file: !162, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !807, file: !162, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !807, file: !162, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !807, file: !162, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !807, file: !162, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !807, file: !162, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !807, file: !162, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !807, file: !162, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !807, file: !162, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !807, file: !162, line: 2703, baseType: !5, size: 32, offset: 512)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !807, file: !162, line: 2705, baseType: !679, size: 64, offset: 576)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !807, file: !162, line: 2706, baseType: !679, size: 64, offset: 640)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !807, file: !162, line: 2707, baseType: !679, size: 64, offset: 704)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !807, file: !162, line: 2708, baseType: !679, size: 64, offset: 768)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !807, file: !162, line: 2711, baseType: !842, size: 64, offset: 832)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !162, line: 2711, flags: DIFlagFwdDecl)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !681, file: !162, line: 3383, baseType: !845, size: 960)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !162, line: 2756, size: 960, elements: !846)
!846 = !{!847, !848}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !845, file: !162, line: 2757, baseType: !807, size: 896)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !845, file: !162, line: 2758, baseType: !563, size: 64, offset: 896)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !681, file: !162, line: 3384, baseType: !850, size: 1472)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !162, line: 3114, size: 1472, elements: !851)
!851 = !{!852, !873, !874, !875, !876}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !850, file: !162, line: 3115, baseType: !853, size: 1216)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !162, line: 2984, size: 1216, elements: !854)
!854 = !{!855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !162, line: 2985, baseType: !845, size: 960)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !853, file: !162, line: 2986, baseType: !679, size: 64, offset: 960)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !853, file: !162, line: 2987, baseType: !679, size: 64, offset: 1024)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !853, file: !162, line: 2988, baseType: !679, size: 64, offset: 1088)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !853, file: !162, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !853, file: !162, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !853, file: !162, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !853, file: !162, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !853, file: !162, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !853, file: !162, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !853, file: !162, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !853, file: !162, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !853, file: !162, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !853, file: !162, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !853, file: !162, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !853, file: !162, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !853, file: !162, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !853, file: !162, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !850, file: !162, line: 3117, baseType: !679, size: 64, offset: 1216)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !850, file: !162, line: 3119, baseType: !679, size: 64, offset: 1280)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !850, file: !162, line: 3121, baseType: !679, size: 64, offset: 1344)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !850, file: !162, line: 3123, baseType: !679, size: 64, offset: 1408)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !681, file: !162, line: 3385, baseType: !878, size: 1088)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !162, line: 2874, size: 1088, elements: !879)
!879 = !{!880, !881, !882}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !878, file: !162, line: 2875, baseType: !845, size: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !878, file: !162, line: 2876, baseType: !563, size: 64, offset: 960)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !878, file: !162, line: 2877, baseType: !883, size: 64, offset: 1024)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !162, line: 2856, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !681, file: !162, line: 3386, baseType: !853, size: 1216)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !681, file: !162, line: 3387, baseType: !887, size: 1280)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !162, line: 3093, size: 1280, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !162, line: 3094, baseType: !853, size: 1216)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !887, file: !162, line: 3095, baseType: !883, size: 64, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !681, file: !162, line: 3388, baseType: !892, size: 1216)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !162, line: 2824, size: 1216, elements: !893)
!893 = !{!894, !895, !896, !897, !898, !899}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !162, line: 2825, baseType: !807, size: 896)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !892, file: !162, line: 2827, baseType: !679, size: 64, offset: 896)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !892, file: !162, line: 2828, baseType: !679, size: 64, offset: 960)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !892, file: !162, line: 2829, baseType: !679, size: 64, offset: 1024)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !892, file: !162, line: 2830, baseType: !679, size: 64, offset: 1088)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !892, file: !162, line: 2831, baseType: !679, size: 64, offset: 1152)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !681, file: !162, line: 3389, baseType: !901, size: 1024)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !162, line: 2850, size: 1024, elements: !902)
!902 = !{!903, !904, !905}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !901, file: !162, line: 2851, baseType: !845, size: 960)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !901, file: !162, line: 2852, baseType: !556, size: 32, offset: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !901, file: !162, line: 2853, baseType: !556, size: 32, offset: 992)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !681, file: !162, line: 3390, baseType: !907, size: 1024)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !162, line: 2857, size: 1024, elements: !908)
!908 = !{!909, !910}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !907, file: !162, line: 2858, baseType: !845, size: 960)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !907, file: !162, line: 2859, baseType: !883, size: 64, offset: 960)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !681, file: !162, line: 3391, baseType: !912, size: 960)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !162, line: 2862, size: 960, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !912, file: !162, line: 2863, baseType: !845, size: 960)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !681, file: !162, line: 3392, baseType: !916, size: 1472)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !162, line: 3304, size: 1472, elements: !917)
!917 = !{!918}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !916, file: !162, line: 3305, baseType: !850, size: 1472)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !681, file: !162, line: 3393, baseType: !920, size: 1792)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !162, line: 3248, size: 1792, elements: !921)
!921 = !{!922, !923, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !162, line: 3249, baseType: !850, size: 1472)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !920, file: !162, line: 3251, baseType: !924, size: 64, offset: 1472)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !926, line: 463, size: 1152, elements: !927)
!926 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!927 = !{!928, !931, !1091, !1092, !1095, !1154, !1155, !1156, !1157, !1158, !1159, !1183, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !925, file: !926, line: 464, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !930, size: 64)
!930 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !926, line: 464, flags: DIFlagFwdDecl)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !925, file: !926, line: 467, baseType: !932, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !146, line: 374, size: 640, elements: !934)
!934 = !{!935, !1066, !1067, !1080, !1081, !1082, !1083, !1084, !1085, !1087, !1089, !1090}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !933, file: !146, line: 377, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !564, line: 111, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !146, line: 217, size: 832, elements: !939)
!939 = !{!940, !975, !976, !977, !1036, !1040, !1041, !1042, !1060, !1061, !1062, !1063, !1064, !1065}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !938, file: !146, line: 219, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !146, line: 151, baseType: !943)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !146, line: 151, size: 128, elements: !944)
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !943, file: !146, line: 151, baseType: !946, size: 128)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !146, line: 150, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !146, line: 150, size: 128, elements: !948)
!948 = !{!949, !950, !951}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !947, file: !146, line: 150, baseType: !5, size: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !947, file: !146, line: 150, baseType: !5, size: 32, offset: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !947, file: !146, line: 150, baseType: !952, size: 64, offset: 64)
!952 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 64, elements: !598)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !564, line: 108, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !146, line: 122, size: 512, elements: !956)
!956 = !{!957, !958, !959, !967, !968, !969, !970, !971, !972, !973}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !955, file: !146, line: 124, baseType: !937, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !955, file: !146, line: 125, baseType: !937, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !955, file: !146, line: 131, baseType: !960, size: 64, offset: 128)
!960 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !146, line: 128, size: 64, elements: !961)
!961 = !{!962, !966}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !960, file: !146, line: 129, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !564, line: 66, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !564, line: 65, flags: DIFlagFwdDecl)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !960, file: !146, line: 130, baseType: !563, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !955, file: !146, line: 134, baseType: !560, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !955, file: !146, line: 137, baseType: !679, size: 64, offset: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !955, file: !146, line: 138, baseType: !799, size: 32, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !955, file: !146, line: 142, baseType: !5, size: 32, offset: 352)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !955, file: !146, line: 144, baseType: !556, size: 32, offset: 384)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !955, file: !146, line: 145, baseType: !556, size: 32, offset: 416)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !955, file: !146, line: 146, baseType: !974, size: 64, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !146, line: 119, baseType: !650)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !938, file: !146, line: 220, baseType: !941, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !938, file: !146, line: 223, baseType: !560, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !938, file: !146, line: 226, baseType: !978, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !133, line: 100, size: 1216, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !990, !991, !992, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1026, !1034, !1035}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !979, file: !133, line: 102, baseType: !556, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !979, file: !133, line: 105, baseType: !5, size: 32, offset: 32)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !979, file: !133, line: 108, baseType: !937, size: 64, offset: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !979, file: !133, line: 111, baseType: !937, size: 64, offset: 128)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !979, file: !133, line: 114, baseType: !986, size: 64, offset: 192)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !133, line: 41, size: 64, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !986, file: !133, line: 42, baseType: !132, size: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !986, file: !133, line: 43, baseType: !5, size: 32, offset: 32)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !979, file: !133, line: 117, baseType: !5, size: 32, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !979, file: !133, line: 120, baseType: !5, size: 32, offset: 288)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !979, file: !133, line: 123, baseType: !993, size: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !133, line: 87, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !133, line: 87, size: 128, elements: !996)
!996 = !{!997}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !995, file: !133, line: 87, baseType: !998, size: 128)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !133, line: 85, baseType: !999)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !133, line: 85, size: 128, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !999, file: !133, line: 85, baseType: !5, size: 32)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !999, file: !133, line: 85, baseType: !5, size: 32, offset: 32)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !999, file: !133, line: 85, baseType: !1004, size: 64, offset: 64)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 64, elements: !598)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !133, line: 84, baseType: !978)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !979, file: !133, line: 126, baseType: !978, size: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !979, file: !133, line: 129, baseType: !978, size: 64, offset: 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !979, file: !133, line: 132, baseType: !560, size: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !979, file: !133, line: 139, baseType: !679, size: 64, offset: 576)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !979, file: !133, line: 143, baseType: !727, size: 128, offset: 640)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !979, file: !133, line: 146, baseType: !727, size: 128, offset: 768)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !979, file: !133, line: 148, baseType: !555, size: 8, offset: 896)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !979, file: !133, line: 149, baseType: !555, size: 8, offset: 904)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !979, file: !133, line: 153, baseType: !141, size: 32, offset: 928)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !979, file: !133, line: 156, baseType: !1016, size: 64, offset: 960)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !133, line: 48, size: 320, elements: !1018)
!1018 = !{!1019, !1023, !1024, !1025}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1017, file: !133, line: 50, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !564, line: 58, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !564, line: 57, flags: DIFlagFwdDecl)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1017, file: !133, line: 59, baseType: !727, size: 128, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1017, file: !133, line: 64, baseType: !555, size: 8, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !133, line: 67, baseType: !1016, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !979, file: !133, line: 159, baseType: !1027, size: 64, offset: 1024)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !133, line: 72, size: 256, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1028, file: !133, line: 74, baseType: !954, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1028, file: !133, line: 77, baseType: !1027, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1028, file: !133, line: 78, baseType: !1027, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1028, file: !133, line: 81, baseType: !1027, size: 64, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !979, file: !133, line: 162, baseType: !555, size: 8, offset: 1088)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !979, file: !133, line: 166, baseType: !679, size: 64, offset: 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !938, file: !146, line: 229, baseType: !1037, size: 128, offset: 256)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1038, size: 128, elements: !634)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !146, line: 229, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !938, file: !146, line: 232, baseType: !937, size: 64, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !938, file: !146, line: 233, baseType: !937, size: 64, offset: 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !938, file: !146, line: 238, baseType: !1043, size: 64, offset: 512)
!1043 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !146, line: 235, size: 64, elements: !1044)
!1044 = !{!1045, !1051}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1043, file: !146, line: 236, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !146, line: 273, size: 128, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1047, file: !146, line: 275, baseType: !963, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1047, file: !146, line: 278, baseType: !963, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1043, file: !146, line: 237, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !146, line: 259, size: 320, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1053, file: !146, line: 261, baseType: !563, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1053, file: !146, line: 262, baseType: !563, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1053, file: !146, line: 266, baseType: !563, size: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1053, file: !146, line: 267, baseType: !563, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1053, file: !146, line: 270, baseType: !556, size: 32, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !938, file: !146, line: 241, baseType: !974, size: 64, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !938, file: !146, line: 244, baseType: !556, size: 32, offset: 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !938, file: !146, line: 247, baseType: !556, size: 32, offset: 672)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !938, file: !146, line: 250, baseType: !556, size: 32, offset: 704)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !938, file: !146, line: 253, baseType: !556, size: 32, offset: 736)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !938, file: !146, line: 256, baseType: !556, size: 32, offset: 768)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !933, file: !146, line: 378, baseType: !936, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !933, file: !146, line: 381, baseType: !1068, size: 64, offset: 128)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !146, line: 282, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !146, line: 282, size: 128, elements: !1071)
!1071 = !{!1072}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1070, file: !146, line: 282, baseType: !1073, size: 128)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !146, line: 281, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !146, line: 281, size: 128, elements: !1075)
!1075 = !{!1076, !1077, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1074, file: !146, line: 281, baseType: !5, size: 32)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1074, file: !146, line: 281, baseType: !5, size: 32, offset: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1074, file: !146, line: 281, baseType: !1079, size: 64, offset: 64)
!1079 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 64, elements: !598)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !933, file: !146, line: 384, baseType: !556, size: 32, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !933, file: !146, line: 387, baseType: !556, size: 32, offset: 224)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !933, file: !146, line: 390, baseType: !556, size: 32, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !933, file: !146, line: 394, baseType: !1068, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !933, file: !146, line: 396, baseType: !145, size: 32, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !933, file: !146, line: 399, baseType: !1086, size: 64, offset: 416)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !151, size: 64, elements: !634)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !933, file: !146, line: 402, baseType: !1088, size: 64, offset: 480)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !634)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !933, file: !146, line: 406, baseType: !556, size: 32, offset: 544)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !933, file: !146, line: 409, baseType: !556, size: 32, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !925, file: !926, line: 470, baseType: !964, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !925, file: !926, line: 473, baseType: !1093, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !926, line: 166, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !925, file: !926, line: 476, baseType: !1096, size: 64, offset: 256)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !133, line: 187, size: 256, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1153}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1097, file: !133, line: 189, baseType: !556, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1097, file: !133, line: 192, baseType: !993, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1097, file: !133, line: 197, baseType: !1102, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1103, line: 144, baseType: !1104)
!1103 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1103, line: 100, size: 896, elements: !1106)
!1106 = !{!1107, !1115, !1120, !1125, !1127, !1130, !1131, !1132, !1133, !1134, !1139, !1141, !1142, !1147, !1152}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1105, file: !1103, line: 102, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1103, line: 52, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1103, line: 47, baseType: !5)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1105, file: !1103, line: 105, baseType: !1116, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1103, line: 59, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!556, !1113, !1113}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1105, file: !1103, line: 108, baseType: !1121, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1103, line: 63, baseType: !1122)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DISubroutineType(types: !1124)
!1124 = !{null, !560}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1105, file: !1103, line: 111, baseType: !1126, size: 64, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1105, file: !1103, line: 114, baseType: !1128, size: 64, offset: 256)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1129, line: 46, baseType: !633)
!1129 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1105, file: !1103, line: 117, baseType: !1128, size: 64, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1105, file: !1103, line: 120, baseType: !1128, size: 64, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1105, file: !1103, line: 124, baseType: !5, size: 32, offset: 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1105, file: !1103, line: 128, baseType: !5, size: 32, offset: 480)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1105, file: !1103, line: 131, baseType: !1135, size: 64, offset: 512)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1103, line: 75, baseType: !1136)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DISubroutineType(types: !1138)
!1138 = !{!560, !1128, !1128}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1105, file: !1103, line: 132, baseType: !1140, size: 64, offset: 576)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1103, line: 78, baseType: !1122)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1105, file: !1103, line: 135, baseType: !560, size: 64, offset: 640)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1105, file: !1103, line: 136, baseType: !1143, size: 64, offset: 704)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1103, line: 82, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{!560, !560, !1128, !1128}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1105, file: !1103, line: 137, baseType: !1148, size: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1103, line: 83, baseType: !1149)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{null, !560, !560}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1105, file: !1103, line: 141, baseType: !5, size: 32, offset: 832)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1097, file: !133, line: 200, baseType: !978, size: 64, offset: 192)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !925, file: !926, line: 479, baseType: !1102, size: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !925, file: !926, line: 484, baseType: !679, size: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !925, file: !926, line: 488, baseType: !679, size: 64, offset: 448)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !925, file: !926, line: 493, baseType: !679, size: 64, offset: 512)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !925, file: !926, line: 496, baseType: !679, size: 64, offset: 576)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !925, file: !926, line: 501, baseType: !1160, size: 64, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !157, line: 2355, size: 576, elements: !1162)
!1162 = !{!1163, !1166, !1167, !1168, !1169, !1171, !1172, !1177, !1178, !1179, !1180, !1181, !1182}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1161, file: !157, line: 2356, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !157, line: 2356, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1161, file: !157, line: 2357, baseType: !561, size: 64, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1161, file: !157, line: 2358, baseType: !556, size: 32, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1161, file: !157, line: 2359, baseType: !556, size: 32, offset: 160)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1161, file: !157, line: 2360, baseType: !1170, size: 128, offset: 192)
!1170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 128, elements: !659)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1161, file: !157, line: 2364, baseType: !556, size: 32, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1161, file: !157, line: 2367, baseType: !1173, size: 128, offset: 384)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !157, line: 2349, size: 128, elements: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1173, file: !157, line: 2351, baseType: !563, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1173, file: !157, line: 2352, baseType: !650, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1161, file: !157, line: 2371, baseType: !156, size: 32, offset: 512)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1161, file: !157, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1161, file: !157, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1161, file: !157, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1161, file: !157, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1161, file: !157, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !925, file: !926, line: 504, baseType: !1184, size: 64, offset: 704)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !926, line: 504, flags: DIFlagFwdDecl)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !925, file: !926, line: 507, baseType: !1102, size: 64, offset: 768)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !925, file: !926, line: 510, baseType: !556, size: 32, offset: 832)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !925, file: !926, line: 513, baseType: !556, size: 32, offset: 864)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !925, file: !926, line: 516, baseType: !799, size: 32, offset: 896)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !925, file: !926, line: 519, baseType: !799, size: 32, offset: 928)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !925, file: !926, line: 522, baseType: !5, size: 32, offset: 960)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !925, file: !926, line: 523, baseType: !5, size: 32, offset: 992)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !925, file: !926, line: 528, baseType: !561, size: 64, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !925, file: !926, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !925, file: !926, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !925, file: !926, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !925, file: !926, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !925, file: !926, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !925, file: !926, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !925, file: !926, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !925, file: !926, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !925, file: !926, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !925, file: !926, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !925, file: !926, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !925, file: !926, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !925, file: !926, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !925, file: !926, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !925, file: !926, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !925, file: !926, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !920, file: !162, line: 3254, baseType: !679, size: 64, offset: 1536)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !920, file: !162, line: 3257, baseType: !679, size: 64, offset: 1600)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !920, file: !162, line: 3258, baseType: !679, size: 64, offset: 1664)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !920, file: !162, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !920, file: !162, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !920, file: !162, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !920, file: !162, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !920, file: !162, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !920, file: !162, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !920, file: !162, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !920, file: !162, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !920, file: !162, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !920, file: !162, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !920, file: !162, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !920, file: !162, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !920, file: !162, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !920, file: !162, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !920, file: !162, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !920, file: !162, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !920, file: !162, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !920, file: !162, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !681, file: !162, line: 3394, baseType: !1232, size: 1344)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !162, line: 2279, size: 1344, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1259, !1260, !1261, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1232, file: !162, line: 2280, baseType: !717, size: 192)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1232, file: !162, line: 2281, baseType: !679, size: 64, offset: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1232, file: !162, line: 2282, baseType: !679, size: 64, offset: 256)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1232, file: !162, line: 2283, baseType: !679, size: 64, offset: 320)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1232, file: !162, line: 2284, baseType: !679, size: 64, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1232, file: !162, line: 2285, baseType: !5, size: 32, offset: 448)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1232, file: !162, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1232, file: !162, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1232, file: !162, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1232, file: !162, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1232, file: !162, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1232, file: !162, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1232, file: !162, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1232, file: !162, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1232, file: !162, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1232, file: !162, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1232, file: !162, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1232, file: !162, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1232, file: !162, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1232, file: !162, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1232, file: !162, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1232, file: !162, line: 2305, baseType: !5, size: 32, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1232, file: !162, line: 2306, baseType: !1257, size: 32, offset: 544)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1258, line: 31, baseType: !556)
!1258 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1232, file: !162, line: 2307, baseType: !679, size: 64, offset: 576)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1232, file: !162, line: 2308, baseType: !679, size: 64, offset: 640)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1232, file: !162, line: 2314, baseType: !1262, size: 64, offset: 704)
!1262 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !162, line: 2309, size: 64, elements: !1263)
!1263 = !{!1264, !1265, !1266}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1262, file: !162, line: 2310, baseType: !556, size: 32)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1262, file: !162, line: 2311, baseType: !561, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1262, file: !162, line: 2312, baseType: !1267, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !162, line: 2277, flags: DIFlagFwdDecl)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1232, file: !162, line: 2315, baseType: !679, size: 64, offset: 768)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1232, file: !162, line: 2316, baseType: !679, size: 64, offset: 832)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1232, file: !162, line: 2317, baseType: !679, size: 64, offset: 896)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1232, file: !162, line: 2318, baseType: !679, size: 64, offset: 960)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1232, file: !162, line: 2319, baseType: !679, size: 64, offset: 1024)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1232, file: !162, line: 2320, baseType: !679, size: 64, offset: 1088)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1232, file: !162, line: 2321, baseType: !679, size: 64, offset: 1152)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1232, file: !162, line: 2322, baseType: !679, size: 64, offset: 1216)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1232, file: !162, line: 2324, baseType: !1278, size: 64, offset: 1280)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !162, line: 2324, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !681, file: !162, line: 3395, baseType: !1281, size: 320)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !162, line: 1469, size: 320, elements: !1282)
!1282 = !{!1283, !1284, !1285}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1281, file: !162, line: 1470, baseType: !717, size: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1281, file: !162, line: 1471, baseType: !679, size: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1281, file: !162, line: 1472, baseType: !679, size: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !681, file: !162, line: 3396, baseType: !1287, size: 320)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !162, line: 1482, size: 320, elements: !1288)
!1288 = !{!1289, !1290, !1291}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1287, file: !162, line: 1483, baseType: !717, size: 192)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1287, file: !162, line: 1484, baseType: !556, size: 32, offset: 192)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1287, file: !162, line: 1485, baseType: !1292, size: 64, offset: 256)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !679, size: 64, elements: !598)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !681, file: !162, line: 3397, baseType: !1294, size: 384)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !162, line: 1829, size: 384, elements: !1295)
!1295 = !{!1296, !1297, !1298, !1299}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1294, file: !162, line: 1830, baseType: !717, size: 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1294, file: !162, line: 1831, baseType: !799, size: 32, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1294, file: !162, line: 1832, baseType: !679, size: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1294, file: !162, line: 1835, baseType: !1292, size: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !681, file: !162, line: 3398, baseType: !1301, size: 704)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !162, line: 1898, size: 704, elements: !1302)
!1302 = !{!1303, !1304, !1305, !1306, !1307, !1310}
