; ModuleID = 'loop-init.bc'
source_filename = "loop-init.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!506 = !DIEnumerator(name: "TV_TREE_COPY_RENAME", value: 106, isUnsigned: true)
!507 = !DIEnumerator(name: "TV_TREE_SSA_VERIFY", value: 107, isUnsigned: true)
!508 = !DIEnumerator(name: "TV_TREE_STMT_VERIFY", value: 108, isUnsigned: true)
!509 = !DIEnumerator(name: "TV_TREE_SWITCH_CONVERSION", value: 109, isUnsigned: true)
!510 = !DIEnumerator(name: "TV_CGRAPH_VERIFY", value: 110, isUnsigned: true)
!511 = !DIEnumerator(name: "TV_DOM_FRONTIERS", value: 111, isUnsigned: true)
!512 = !DIEnumerator(name: "TV_DOMINANCE", value: 112, isUnsigned: true)
!513 = !DIEnumerator(name: "TV_CONTROL_DEPENDENCES", value: 113, isUnsigned: true)
!514 = !DIEnumerator(name: "TV_OVERLOAD", value: 114, isUnsigned: true)
!515 = !DIEnumerator(name: "TV_TEMPLATE_INSTANTIATION", value: 115, isUnsigned: true)
!516 = !DIEnumerator(name: "TV_EXPAND", value: 116, isUnsigned: true)
!517 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!518 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!519 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!520 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!521 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!522 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!523 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!524 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!525 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!526 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!527 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!528 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!529 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!530 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!531 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!532 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!533 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!534 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!535 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!536 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!537 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!538 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!539 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!540 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!541 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!542 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!543 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!544 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!545 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!546 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!547 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!548 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!549 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!550 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!551 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!552 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!553 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!554 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!555 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!556 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!557 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!558 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!559 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!560 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!561 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!562 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!563 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!564 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!565 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!566 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!567 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!568 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!569 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!570 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!571 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!572 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!573 = !{!574, !575, !576, !577, !580, !581, !583, !1680, !600}
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!576 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !579)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !378, line: 187, size: 256, elements: !585)
!585 = !{!586, !587, !1678, !1679}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !584, file: !378, line: 189, baseType: !576, size: 32)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !584, file: !378, line: 192, baseType: !588, size: 64, offset: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !378, line: 87, baseType: !590)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !378, line: 87, size: 128, elements: !591)
!591 = !{!592}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !590, file: !378, line: 87, baseType: !593, size: 128)
!593 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !378, line: 85, baseType: !594)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !378, line: 85, size: 128, elements: !595)
!595 = !{!596, !597, !598}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !594, file: !378, line: 85, baseType: !7, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !594, file: !378, line: 85, baseType: !7, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !594, file: !378, line: 85, baseType: !599, size: 64, offset: 64)
!599 = !DICompositeType(tag: DW_TAG_array_type, baseType: !600, size: 64, elements: !673)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !378, line: 84, baseType: !601)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !378, line: 100, size: 1216, elements: !603)
!603 = !{!604, !605, !606, !1642, !1643, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1668, !1676, !1677}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !602, file: !378, line: 102, baseType: !576, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !602, file: !378, line: 105, baseType: !7, size: 32, offset: 32)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !602, file: !378, line: 108, baseType: !607, size: 64, offset: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !609)
!609 = !{!610, !1609, !1610, !1611, !1612, !1616, !1617, !1618, !1636, !1637, !1638, !1639, !1640, !1641}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !608, file: !135, line: 219, baseType: !611, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !613, file: !135, line: 151, baseType: !616, size: 128)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !618)
!618 = !{!619, !620, !621}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !617, file: !135, line: 150, baseType: !7, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !617, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !617, file: !135, line: 150, baseType: !622, size: 64, offset: 64)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !623, size: 64, elements: !673)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !624, line: 108, baseType: !625)
!624 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !627)
!627 = !{!628, !629, !630, !1601, !1602, !1603, !1604, !1605, !1606, !1607}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !626, file: !135, line: 124, baseType: !607, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !626, file: !135, line: 125, baseType: !607, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !626, file: !135, line: 131, baseType: !631, size: 64, offset: 128)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !632)
!632 = !{!633, !637}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !631, file: !135, line: 129, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !624, line: 66, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !624, line: 65, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !631, file: !135, line: 130, baseType: !638, size: 64)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !624, line: 50, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !641, line: 240, size: 384, elements: !642)
!641 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !640, file: !641, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !640, file: !641, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !640, file: !641, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !640, file: !641, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !640, file: !641, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !640, file: !641, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !640, file: !641, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !640, file: !641, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !640, file: !641, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !640, file: !641, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !640, file: !641, line: 321, baseType: !654, size: 320, offset: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !641, line: 315, size: 320, elements: !655)
!655 = !{!656, !1568, !1570, !1599, !1600}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !654, file: !641, line: 316, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 64, elements: !673)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !641, line: 183, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !641, line: 166, size: 64, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !675, !676, !688, !691, !753, !1546, !1547, !1558, !1565}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !659, file: !641, line: 168, baseType: !576, size: 32)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !659, file: !641, line: 169, baseType: !7, size: 32)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !659, file: !641, line: 170, baseType: !581, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !659, file: !641, line: 171, baseType: !638, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !659, file: !641, line: 172, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !624, line: 53, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !641, line: 359, size: 128, elements: !669)
!669 = !{!670, !671}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !668, file: !641, line: 360, baseType: !576, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !668, file: !641, line: 361, baseType: !672, size: 64, offset: 64)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 64, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 1)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !659, file: !641, line: 173, baseType: !5, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !659, file: !641, line: 174, baseType: !677, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !641, line: 133, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !641, line: 115, size: 32, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !685, !686, !687}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !678, file: !641, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !678, file: !641, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !678, file: !641, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !678, file: !641, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !678, file: !641, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !678, file: !641, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !678, file: !641, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !678, file: !641, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !659, file: !641, line: 175, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !641, line: 175, flags: DIFlagFwdDecl)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !659, file: !641, line: 176, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !694, line: 75, size: 256, elements: !695)
!694 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!695 = !{!696, !711, !712, !713}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !693, file: !694, line: 76, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !694, line: 68, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !694, line: 63, size: 320, elements: !700)
!700 = !{!701, !703, !704, !705}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !699, file: !694, line: 64, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !699, file: !694, line: 65, baseType: !702, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !699, file: !694, line: 66, baseType: !7, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !699, file: !694, line: 67, baseType: !706, size: 128, offset: 192)
!706 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 128, elements: !709)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !694, line: 29, baseType: !708)
!708 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!709 = !{!710}
!710 = !DISubrange(count: 2)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !693, file: !694, line: 77, baseType: !697, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !693, file: !694, line: 78, baseType: !7, size: 32, offset: 128)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !693, file: !694, line: 79, baseType: !714, size: 64, offset: 192)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !694, line: 49, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !694, line: 45, size: 832, elements: !717)
!717 = !{!718, !719, !720}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !716, file: !694, line: 46, baseType: !702, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !716, file: !694, line: 47, baseType: !692, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !716, file: !694, line: 48, baseType: !721, size: 704, offset: 128)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !722, line: 164, size: 704, elements: !723)
!722 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!723 = !{!724, !726, !736, !737, !738, !739, !740, !741, !745, !749, !750, !751, !752}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !721, file: !722, line: 166, baseType: !725, size: 64)
!725 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !721, file: !722, line: 167, baseType: !727, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !722, line: 157, size: 192, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !728, file: !722, line: 159, baseType: !578, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !728, file: !722, line: 160, baseType: !727, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !728, file: !722, line: 161, baseType: !733, size: 32, offset: 128)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 32, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 4)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !721, file: !722, line: 168, baseType: !578, size: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !721, file: !722, line: 169, baseType: !578, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !721, file: !722, line: 170, baseType: !578, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !721, file: !722, line: 171, baseType: !725, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !721, file: !722, line: 172, baseType: !576, size: 32, offset: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !721, file: !722, line: 176, baseType: !742, size: 64, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DISubroutineType(types: !744)
!744 = !{!727, !580, !725}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !721, file: !722, line: 177, baseType: !746, size: 64, offset: 512)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !580, !727}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !721, file: !722, line: 178, baseType: !580, size: 64, offset: 576)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !721, file: !722, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !721, file: !722, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !721, file: !722, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !659, file: !641, line: 177, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !624, line: 56, baseType: !755)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !757)
!757 = !{!758, !791, !797, !808, !827, !838, !843, !850, !856, !869, !881, !919, !924, !952, !960, !961, !966, !975, !981, !986, !990, !994, !1170, !1219, !1225, !1232, !1239, !1265, !1290, !1307, !1319, !1341, !1356, !1528}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !756, file: !151, line: 3372, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !759, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !759, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !759, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !759, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !759, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !759, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !759, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !759, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !759, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !759, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !759, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !759, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !759, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !759, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !759, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !759, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !759, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !759, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !759, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !759, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !759, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !759, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !759, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !759, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !759, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !759, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !759, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !759, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !759, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !759, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !151, line: 3373, baseType: !792, size: 192)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !793)
!793 = !{!794, !795, !796}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !792, file: !151, line: 403, baseType: !759, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !792, file: !151, line: 404, baseType: !754, size: 64, offset: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !792, file: !151, line: 405, baseType: !754, size: 64, offset: 128)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !756, file: !151, line: 3374, baseType: !798, size: 320)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !799)
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !798, file: !151, line: 1385, baseType: !792, size: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !798, file: !151, line: 1386, baseType: !802, size: 128, offset: 192)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !803, line: 58, baseType: !804)
!803 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !803, line: 54, size: 128, elements: !805)
!805 = !{!806, !807}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !804, file: !803, line: 56, baseType: !708, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !804, file: !803, line: 57, baseType: !725, size: 64, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !756, file: !151, line: 3375, baseType: !809, size: 256)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !810)
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !809, file: !151, line: 1398, baseType: !792, size: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !809, file: !151, line: 1399, baseType: !813, size: 64, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !815, line: 52, size: 256, elements: !816)
!815 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!816 = !{!817, !818, !819, !820, !821, !822, !823}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !814, file: !815, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !814, file: !815, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !814, file: !815, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !814, file: !815, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !814, file: !815, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !814, file: !815, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !814, file: !815, line: 62, baseType: !824, size: 192, offset: 64)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 192, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 3)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !756, file: !151, line: 3376, baseType: !828, size: 256)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !829)
!829 = !{!830, !831}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !151, line: 1409, baseType: !792, size: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !828, file: !151, line: 1410, baseType: !832, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !834, line: 27, size: 192, elements: !835)
!834 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !833, file: !834, line: 29, baseType: !802, size: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !833, file: !834, line: 30, baseType: !5, size: 32, offset: 128)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !756, file: !151, line: 3377, baseType: !839, size: 256)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !151, line: 1438, baseType: !792, size: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !839, file: !151, line: 1439, baseType: !754, size: 64, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !756, file: !151, line: 3378, baseType: !844, size: 256)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !844, file: !151, line: 1419, baseType: !792, size: 192)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !844, file: !151, line: 1420, baseType: !576, size: 32, offset: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !844, file: !151, line: 1421, baseType: !849, size: 8, offset: 224)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 8, elements: !673)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !756, file: !151, line: 3379, baseType: !851, size: 320)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !851, file: !151, line: 1429, baseType: !792, size: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !851, file: !151, line: 1430, baseType: !754, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !851, file: !151, line: 1431, baseType: !754, size: 64, offset: 256)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !756, file: !151, line: 3380, baseType: !857, size: 320)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !858)
!858 = !{!859, !860}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !857, file: !151, line: 1461, baseType: !792, size: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !857, file: !151, line: 1462, baseType: !861, size: 128, offset: 192)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !862, line: 31, size: 128, elements: !863)
!862 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!863 = !{!864, !867, !868}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !861, file: !862, line: 32, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !861, file: !862, line: 33, baseType: !7, size: 32, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !861, file: !862, line: 34, baseType: !7, size: 32, offset: 96)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !756, file: !151, line: 3381, baseType: !870, size: 384)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !871)
!871 = !{!872, !873, !878, !879, !880}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !151, line: 2508, baseType: !792, size: 192)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !870, file: !151, line: 2509, baseType: !874, size: 32, offset: 192)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !875, line: 58, baseType: !876)
!875 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !877, line: 44, baseType: !7)
!877 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!878 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !870, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !151, line: 2511, baseType: !754, size: 64, offset: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !870, file: !151, line: 2512, baseType: !754, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !756, file: !151, line: 3382, baseType: !882, size: 896)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !882, file: !151, line: 2653, baseType: !870, size: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !882, file: !151, line: 2654, baseType: !754, size: 64, offset: 384)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !882, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !882, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !882, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !882, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !882, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !882, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !882, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !882, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !882, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !882, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !882, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !882, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !882, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !882, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !882, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !882, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !882, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !882, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !882, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !882, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !882, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !882, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !882, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !882, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !882, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !882, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !882, file: !151, line: 2705, baseType: !754, size: 64, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !882, file: !151, line: 2706, baseType: !754, size: 64, offset: 640)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !882, file: !151, line: 2707, baseType: !754, size: 64, offset: 704)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !882, file: !151, line: 2708, baseType: !754, size: 64, offset: 768)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !882, file: !151, line: 2711, baseType: !917, size: 64, offset: 832)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !756, file: !151, line: 3383, baseType: !920, size: 960)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !151, line: 2757, baseType: !882, size: 896)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !920, file: !151, line: 2758, baseType: !638, size: 64, offset: 896)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !756, file: !151, line: 3384, baseType: !925, size: 1472)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !926)
!926 = !{!927, !948, !949, !950, !951}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !151, line: 3115, baseType: !928, size: 1216)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !151, line: 2985, baseType: !920, size: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !928, file: !151, line: 2986, baseType: !754, size: 64, offset: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !928, file: !151, line: 2987, baseType: !754, size: 64, offset: 1024)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !928, file: !151, line: 2988, baseType: !754, size: 64, offset: 1088)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !928, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !928, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !928, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !928, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !928, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !928, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !928, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !928, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !928, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !928, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !928, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !928, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !928, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !928, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !925, file: !151, line: 3117, baseType: !754, size: 64, offset: 1216)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !925, file: !151, line: 3119, baseType: !754, size: 64, offset: 1280)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !925, file: !151, line: 3121, baseType: !754, size: 64, offset: 1344)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !925, file: !151, line: 3123, baseType: !754, size: 64, offset: 1408)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !756, file: !151, line: 3385, baseType: !953, size: 1088)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !953, file: !151, line: 2875, baseType: !920, size: 960)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !953, file: !151, line: 2876, baseType: !638, size: 64, offset: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !953, file: !151, line: 2877, baseType: !958, size: 64, offset: 1024)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !756, file: !151, line: 3386, baseType: !928, size: 1216)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !756, file: !151, line: 3387, baseType: !962, size: 1280)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !151, line: 3094, baseType: !928, size: 1216)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !962, file: !151, line: 3095, baseType: !958, size: 64, offset: 1216)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !756, file: !151, line: 3388, baseType: !967, size: 1216)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !151, line: 2825, baseType: !882, size: 896)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !967, file: !151, line: 2827, baseType: !754, size: 64, offset: 896)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !967, file: !151, line: 2828, baseType: !754, size: 64, offset: 960)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !967, file: !151, line: 2829, baseType: !754, size: 64, offset: 1024)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !967, file: !151, line: 2830, baseType: !754, size: 64, offset: 1088)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !967, file: !151, line: 2831, baseType: !754, size: 64, offset: 1152)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !756, file: !151, line: 3389, baseType: !976, size: 1024)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !977)
!977 = !{!978, !979, !980}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !976, file: !151, line: 2851, baseType: !920, size: 960)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !976, file: !151, line: 2852, baseType: !576, size: 32, offset: 960)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !976, file: !151, line: 2853, baseType: !576, size: 32, offset: 992)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !756, file: !151, line: 3390, baseType: !982, size: 1024)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !982, file: !151, line: 2858, baseType: !920, size: 960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !982, file: !151, line: 2859, baseType: !958, size: 64, offset: 960)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !756, file: !151, line: 3391, baseType: !987, size: 960)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !988)
!988 = !{!989}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !151, line: 2863, baseType: !920, size: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !756, file: !151, line: 3392, baseType: !991, size: 1472)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !992)
!992 = !{!993}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !991, file: !151, line: 3305, baseType: !925, size: 1472)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !756, file: !151, line: 3393, baseType: !995, size: 1792)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !996)
!996 = !{!997, !998, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !995, file: !151, line: 3249, baseType: !925, size: 1472)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !995, file: !151, line: 3251, baseType: !999, size: 64, offset: 1472)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1001, line: 463, size: 1152, elements: !1002)
!1001 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1002 = !{!1003, !1006, !1037, !1038, !1041, !1042, !1094, !1095, !1096, !1097, !1098, !1122, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1000, file: !1001, line: 464, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1001, line: 464, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1000, file: !1001, line: 467, baseType: !1007, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1009)
!1009 = !{!1010, !1012, !1013, !1026, !1027, !1028, !1029, !1030, !1031, !1033, !1035, !1036}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1008, file: !135, line: 377, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !624, line: 111, baseType: !607)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1008, file: !135, line: 378, baseType: !1011, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1008, file: !135, line: 381, baseType: !1014, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1017)
!1017 = !{!1018}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1016, file: !135, line: 282, baseType: !1019, size: 128)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1021)
!1021 = !{!1022, !1023, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1020, file: !135, line: 281, baseType: !7, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1020, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1020, file: !135, line: 281, baseType: !1025, size: 64, offset: 64)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1011, size: 64, elements: !673)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1008, file: !135, line: 384, baseType: !576, size: 32, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1008, file: !135, line: 387, baseType: !576, size: 32, offset: 224)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1008, file: !135, line: 390, baseType: !576, size: 32, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1008, file: !135, line: 394, baseType: !1014, size: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1008, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1008, file: !135, line: 399, baseType: !1032, size: 64, offset: 416)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !709)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1008, file: !135, line: 402, baseType: !1034, size: 64, offset: 480)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !709)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1008, file: !135, line: 406, baseType: !576, size: 32, offset: 544)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1008, file: !135, line: 409, baseType: !576, size: 32, offset: 576)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1000, file: !1001, line: 470, baseType: !635, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1000, file: !1001, line: 473, baseType: !1039, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1001, line: 166, flags: DIFlagFwdDecl)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1000, file: !1001, line: 476, baseType: !583, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1000, file: !1001, line: 479, baseType: !1043, size: 64, offset: 320)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1044, line: 144, baseType: !1045)
!1044 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1044, line: 100, size: 896, elements: !1047)
!1047 = !{!1048, !1056, !1061, !1066, !1068, !1071, !1072, !1073, !1074, !1075, !1080, !1082, !1083, !1088, !1093}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1046, file: !1044, line: 102, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1044, line: 52, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1044, line: 47, baseType: !7)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1046, file: !1044, line: 105, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1044, line: 59, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!576, !1054, !1054}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1046, file: !1044, line: 108, baseType: !1062, size: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1044, line: 63, baseType: !1063)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{null, !580}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1046, file: !1044, line: 111, baseType: !1067, size: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1046, file: !1044, line: 114, baseType: !1069, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1070, line: 46, baseType: !708)
!1070 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1046, file: !1044, line: 117, baseType: !1069, size: 64, offset: 320)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1046, file: !1044, line: 120, baseType: !1069, size: 64, offset: 384)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1046, file: !1044, line: 124, baseType: !7, size: 32, offset: 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1046, file: !1044, line: 128, baseType: !7, size: 32, offset: 480)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1046, file: !1044, line: 131, baseType: !1076, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1044, line: 75, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!580, !1069, !1069}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1046, file: !1044, line: 132, baseType: !1081, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1044, line: 78, baseType: !1063)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1046, file: !1044, line: 135, baseType: !580, size: 64, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1046, file: !1044, line: 136, baseType: !1084, size: 64, offset: 704)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1044, line: 82, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!580, !580, !1069, !1069}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1046, file: !1044, line: 137, baseType: !1089, size: 64, offset: 768)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1044, line: 83, baseType: !1090)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1091, size: 64)
!1091 = !DISubroutineType(types: !1092)
!1092 = !{null, !580, !580}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1046, file: !1044, line: 141, baseType: !7, size: 32, offset: 832)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1000, file: !1001, line: 484, baseType: !754, size: 64, offset: 384)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1000, file: !1001, line: 488, baseType: !754, size: 64, offset: 448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1000, file: !1001, line: 493, baseType: !754, size: 64, offset: 512)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1000, file: !1001, line: 496, baseType: !754, size: 64, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1000, file: !1001, line: 501, baseType: !1099, size: 64, offset: 640)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1101)
!1101 = !{!1102, !1105, !1106, !1107, !1108, !1110, !1111, !1116, !1117, !1118, !1119, !1120, !1121}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1100, file: !146, line: 2356, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1100, file: !146, line: 2357, baseType: !581, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1100, file: !146, line: 2358, baseType: !576, size: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1100, file: !146, line: 2359, baseType: !576, size: 32, offset: 160)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1100, file: !146, line: 2360, baseType: !1109, size: 128, offset: 192)
!1109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 128, elements: !734)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1100, file: !146, line: 2364, baseType: !576, size: 32, offset: 320)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1100, file: !146, line: 2367, baseType: !1112, size: 128, offset: 384)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1112, file: !146, line: 2351, baseType: !638, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1112, file: !146, line: 2352, baseType: !725, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1100, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1100, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1100, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1100, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1100, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1100, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1000, file: !1001, line: 504, baseType: !1123, size: 64, offset: 704)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1001, line: 504, flags: DIFlagFwdDecl)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1000, file: !1001, line: 507, baseType: !1043, size: 64, offset: 768)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1000, file: !1001, line: 510, baseType: !576, size: 32, offset: 832)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1000, file: !1001, line: 513, baseType: !576, size: 32, offset: 864)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1000, file: !1001, line: 516, baseType: !874, size: 32, offset: 896)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1000, file: !1001, line: 519, baseType: !874, size: 32, offset: 928)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1000, file: !1001, line: 522, baseType: !7, size: 32, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1000, file: !1001, line: 523, baseType: !7, size: 32, offset: 992)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1000, file: !1001, line: 528, baseType: !581, size: 64, offset: 1024)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1000, file: !1001, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1000, file: !1001, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1000, file: !1001, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1000, file: !1001, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1000, file: !1001, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1000, file: !1001, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1000, file: !1001, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1000, file: !1001, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1000, file: !1001, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1000, file: !1001, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1000, file: !1001, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1000, file: !1001, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1000, file: !1001, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1000, file: !1001, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1000, file: !1001, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1000, file: !1001, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !995, file: !151, line: 3254, baseType: !754, size: 64, offset: 1536)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !995, file: !151, line: 3257, baseType: !754, size: 64, offset: 1600)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !995, file: !151, line: 3258, baseType: !754, size: 64, offset: 1664)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !995, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !995, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !995, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !995, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !995, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !995, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !995, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !995, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !995, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !995, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !995, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !995, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !995, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !995, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !995, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !995, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !995, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !995, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !151, line: 3394, baseType: !1171, size: 1344)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1172)
!1172 = !{!1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1198, !1199, !1200, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1171, file: !151, line: 2280, baseType: !792, size: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1171, file: !151, line: 2281, baseType: !754, size: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1171, file: !151, line: 2282, baseType: !754, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1171, file: !151, line: 2283, baseType: !754, size: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1171, file: !151, line: 2284, baseType: !754, size: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1171, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1171, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1171, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1171, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1171, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1171, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1171, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1171, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1171, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1171, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1171, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1171, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1171, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1171, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1171, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1171, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1171, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1171, file: !151, line: 2306, baseType: !1196, size: 32, offset: 544)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1197, line: 31, baseType: !576)
!1197 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1171, file: !151, line: 2307, baseType: !754, size: 64, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1171, file: !151, line: 2308, baseType: !754, size: 64, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1171, file: !151, line: 2314, baseType: !1201, size: 64, offset: 704)
!1201 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1202)
!1202 = !{!1203, !1204, !1205}
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1201, file: !151, line: 2310, baseType: !576, size: 32)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1201, file: !151, line: 2311, baseType: !581, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1201, file: !151, line: 2312, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1171, file: !151, line: 2315, baseType: !754, size: 64, offset: 768)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1171, file: !151, line: 2316, baseType: !754, size: 64, offset: 832)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1171, file: !151, line: 2317, baseType: !754, size: 64, offset: 896)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1171, file: !151, line: 2318, baseType: !754, size: 64, offset: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1171, file: !151, line: 2319, baseType: !754, size: 64, offset: 1024)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1171, file: !151, line: 2320, baseType: !754, size: 64, offset: 1088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1171, file: !151, line: 2321, baseType: !754, size: 64, offset: 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1171, file: !151, line: 2322, baseType: !754, size: 64, offset: 1216)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1171, file: !151, line: 2324, baseType: !1217, size: 64, offset: 1280)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !756, file: !151, line: 3395, baseType: !1220, size: 320)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1221)
!1221 = !{!1222, !1223, !1224}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1220, file: !151, line: 1470, baseType: !792, size: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1220, file: !151, line: 1471, baseType: !754, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1220, file: !151, line: 1472, baseType: !754, size: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !756, file: !151, line: 3396, baseType: !1226, size: 320)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1227)
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1226, file: !151, line: 1483, baseType: !792, size: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1226, file: !151, line: 1484, baseType: !576, size: 32, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1226, file: !151, line: 1485, baseType: !1231, size: 64, offset: 256)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !754, size: 64, elements: !673)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !756, file: !151, line: 3397, baseType: !1233, size: 384)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1233, file: !151, line: 1830, baseType: !792, size: 192)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1233, file: !151, line: 1831, baseType: !874, size: 32, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1233, file: !151, line: 1832, baseType: !754, size: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1233, file: !151, line: 1835, baseType: !1231, size: 64, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !756, file: !151, line: 3398, baseType: !1240, size: 704)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1248, !1249, !1252}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1240, file: !151, line: 1899, baseType: !792, size: 192)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1240, file: !151, line: 1902, baseType: !754, size: 64, offset: 192)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1240, file: !151, line: 1905, baseType: !1245, size: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !624, line: 58, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !624, line: 57, flags: DIFlagFwdDecl)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1240, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1240, file: !151, line: 1911, baseType: !1250, size: 64, offset: 384)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1240, file: !151, line: 1914, baseType: !1253, size: 256, offset: 448)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1254)
!1254 = !{!1255, !1257, !1258, !1263}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1253, file: !151, line: 1884, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1253, file: !151, line: 1885, baseType: !1256, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1253, file: !151, line: 1891, baseType: !1259, size: 64, offset: 128)
!1259 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1253, file: !151, line: 1891, size: 64, elements: !1260)
!1260 = !{!1261, !1262}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1259, file: !151, line: 1891, baseType: !1245, size: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1259, file: !151, line: 1891, baseType: !754, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1253, file: !151, line: 1892, baseType: !1264, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !756, file: !151, line: 3399, baseType: !1266, size: 704)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1272, !1273, !1285, !1286, !1287, !1288, !1289}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1266, file: !151, line: 2009, baseType: !792, size: 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1266, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1266, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1266, file: !151, line: 2014, baseType: !874, size: 32, offset: 224)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1266, file: !151, line: 2016, baseType: !754, size: 64, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1266, file: !151, line: 2017, baseType: !1274, size: 64, offset: 320)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1277)
!1277 = !{!1278}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1276, file: !151, line: 183, baseType: !1279, size: 128)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1280)
!1280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1281)
!1281 = !{!1282, !1283, !1284}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1280, file: !151, line: 182, baseType: !7, size: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1280, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1280, file: !151, line: 182, baseType: !1231, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1266, file: !151, line: 2019, baseType: !754, size: 64, offset: 384)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1266, file: !151, line: 2020, baseType: !754, size: 64, offset: 448)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1266, file: !151, line: 2021, baseType: !754, size: 64, offset: 512)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1266, file: !151, line: 2022, baseType: !754, size: 64, offset: 576)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1266, file: !151, line: 2023, baseType: !754, size: 64, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !756, file: !151, line: 3400, baseType: !1291, size: 832)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1292)
!1292 = !{!1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1291, file: !151, line: 2431, baseType: !792, size: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1291, file: !151, line: 2433, baseType: !754, size: 64, offset: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1291, file: !151, line: 2434, baseType: !754, size: 64, offset: 256)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1291, file: !151, line: 2435, baseType: !754, size: 64, offset: 320)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1291, file: !151, line: 2436, baseType: !754, size: 64, offset: 384)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1291, file: !151, line: 2437, baseType: !1274, size: 64, offset: 448)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1291, file: !151, line: 2438, baseType: !754, size: 64, offset: 512)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1291, file: !151, line: 2440, baseType: !754, size: 64, offset: 576)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1291, file: !151, line: 2441, baseType: !754, size: 64, offset: 640)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1291, file: !151, line: 2443, baseType: !1303, size: 128, offset: 704)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !151, line: 182, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !151, line: 182, size: 128, elements: !1305)
!1305 = !{!1306}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1304, file: !151, line: 182, baseType: !1279, size: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !756, file: !151, line: 3401, baseType: !1308, size: 320)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !151, line: 3327, size: 320, elements: !1309)
!1309 = !{!1310, !1311, !1318}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1308, file: !151, line: 3329, baseType: !792, size: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1308, file: !151, line: 3330, baseType: !1312, size: 64, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !151, line: 3320, size: 192, elements: !1314)
!1314 = !{!1315, !1316, !1317}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1313, file: !151, line: 3322, baseType: !1312, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1313, file: !151, line: 3323, baseType: !1312, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1313, file: !151, line: 3324, baseType: !754, size: 64, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1308, file: !151, line: 3331, baseType: !1312, size: 64, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !756, file: !151, line: 3402, baseType: !1320, size: 256)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !151, line: 1540, size: 256, elements: !1321)
!1321 = !{!1322, !1323}
