; ModuleID = 'loop-unroll.bc'
source_filename = "loop-unroll.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!496 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!497 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!498 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!499 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!500 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!501 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!502 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!503 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!504 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!505 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!506 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!507 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!508 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!509 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!510 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!511 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!512 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!513 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!514 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!515 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!516 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!517 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!518 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!519 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!520 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!521 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!522 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!523 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!524 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!525 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!526 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!527 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!528 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!529 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!530 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!531 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !532, line: 36, baseType: !5, size: 32, elements: !533)
!532 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552}
!534 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!535 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!536 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!537 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!538 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!539 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!540 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!541 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!542 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!543 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!544 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!545 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!546 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!547 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!548 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!549 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!550 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!551 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!552 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!553 = !{!554, !555, !556, !557, !560, !561, !563, !578, !5, !683, !1704, !388, !1045, !1744, !1746, !616, !1709, !3, !531, !1723, !1729, !1061, !601, !700, !986, !1748}
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!556 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_heap", file: !565, line: 32, baseType: !566)
!565 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_heap", file: !565, line: 32, size: 96, elements: !567)
!567 = !{!568}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !566, file: !565, line: 32, baseType: !569, size: 96)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_base", file: !565, line: 31, baseType: !570)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_base", file: !565, line: 31, size: 96, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !570, file: !565, line: 31, baseType: !5, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !570, file: !565, line: 31, baseType: !5, size: 32, offset: 32)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !570, file: !565, line: 31, baseType: !575, size: 32, offset: 64)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 32, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 1)
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !376, line: 84, baseType: !579)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !376, line: 100, size: 1216, elements: !581)
!581 = !{!582, !583, !584, !1668, !1669, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684, !1685, !1686, !1694, !1702, !1703}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !580, file: !376, line: 102, baseType: !556, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !580, file: !376, line: 105, baseType: !5, size: 32, offset: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !580, file: !376, line: 108, baseType: !585, size: 64, offset: 64)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !587)
!587 = !{!588, !1635, !1636, !1637, !1638, !1642, !1643, !1644, !1662, !1663, !1664, !1665, !1666, !1667}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !586, file: !133, line: 219, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !592)
!592 = !{!593}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !591, file: !133, line: 151, baseType: !594, size: 128)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !596)
!596 = !{!597, !598, !599}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !595, file: !133, line: 150, baseType: !5, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !595, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !595, file: !133, line: 150, baseType: !600, size: 64, offset: 64)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !601, size: 64, elements: !576)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !602, line: 108, baseType: !603)
!602 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !605)
!605 = !{!606, !607, !608, !1627, !1628, !1629, !1630, !1631, !1632, !1633}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !604, file: !133, line: 124, baseType: !585, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !604, file: !133, line: 125, baseType: !585, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !604, file: !133, line: 131, baseType: !609, size: 64, offset: 128)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !610)
!610 = !{!611, !615}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !609, file: !133, line: 129, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !602, line: 66, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !602, line: 65, flags: DIFlagFwdDecl)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !609, file: !133, line: 130, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !602, line: 50, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !389, line: 240, size: 384, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !618, file: !389, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !618, file: !389, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !618, file: !389, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !618, file: !389, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !618, file: !389, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !618, file: !389, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !618, file: !389, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !618, file: !389, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !618, file: !389, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !618, file: !389, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !618, file: !389, line: 321, baseType: !631, size: 320, offset: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !389, line: 315, size: 320, elements: !632)
!632 = !{!633, !1562, !1564, !1625, !1626}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !631, file: !389, line: 316, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 64, elements: !576)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !389, line: 183, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !389, line: 166, size: 64, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !650, !651, !663, !666, !728, !1540, !1541, !1552, !1559}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !636, file: !389, line: 168, baseType: !556, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !636, file: !389, line: 169, baseType: !5, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !636, file: !389, line: 170, baseType: !561, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !636, file: !389, line: 171, baseType: !616, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !636, file: !389, line: 172, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !602, line: 53, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !389, line: 359, size: 128, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !645, file: !389, line: 360, baseType: !556, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !645, file: !389, line: 361, baseType: !649, size: 64, offset: 64)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !616, size: 64, elements: !576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !636, file: !389, line: 173, baseType: !3, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !636, file: !389, line: 174, baseType: !652, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !389, line: 133, baseType: !653)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !389, line: 115, size: 32, elements: !654)
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !653, file: !389, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !653, file: !389, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !653, file: !389, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !653, file: !389, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !653, file: !389, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !653, file: !389, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !653, file: !389, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !653, file: !389, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !636, file: !389, line: 175, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !389, line: 175, flags: DIFlagFwdDecl)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !636, file: !389, line: 176, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !669, line: 75, size: 256, elements: !670)
!669 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!670 = !{!671, !686, !687, !688}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !668, file: !669, line: 76, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !669, line: 68, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !669, line: 63, size: 320, elements: !675)
!675 = !{!676, !678, !679, !680}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !674, file: !669, line: 64, baseType: !677, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !674, file: !669, line: 65, baseType: !677, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !674, file: !669, line: 66, baseType: !5, size: 32, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !674, file: !669, line: 67, baseType: !681, size: 128, offset: 192)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 128, elements: !684)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !669, line: 29, baseType: !683)
!683 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!684 = !{!685}
!685 = !DISubrange(count: 2)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !668, file: !669, line: 77, baseType: !672, size: 64, offset: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !668, file: !669, line: 78, baseType: !5, size: 32, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !668, file: !669, line: 79, baseType: !689, size: 64, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !669, line: 49, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !669, line: 45, size: 832, elements: !692)
!692 = !{!693, !694, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !691, file: !669, line: 46, baseType: !677, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !691, file: !669, line: 47, baseType: !667, size: 64, offset: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !691, file: !669, line: 48, baseType: !696, size: 704, offset: 128)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !697, line: 164, size: 704, elements: !698)
!697 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!698 = !{!699, !701, !711, !712, !713, !714, !715, !716, !720, !724, !725, !726, !727}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !696, file: !697, line: 166, baseType: !700, size: 64)
!700 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !696, file: !697, line: 167, baseType: !702, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !697, line: 157, size: 192, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !703, file: !697, line: 159, baseType: !558, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !703, file: !697, line: 160, baseType: !702, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !703, file: !697, line: 161, baseType: !708, size: 32, offset: 128)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 32, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 4)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !696, file: !697, line: 168, baseType: !558, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !696, file: !697, line: 169, baseType: !558, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !696, file: !697, line: 170, baseType: !558, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !696, file: !697, line: 171, baseType: !700, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !696, file: !697, line: 172, baseType: !556, size: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !696, file: !697, line: 176, baseType: !717, size: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!702, !560, !700}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !696, file: !697, line: 177, baseType: !721, size: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !560, !702}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !696, file: !697, line: 178, baseType: !560, size: 64, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !696, file: !697, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !696, file: !697, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !696, file: !697, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !636, file: !389, line: 177, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !602, line: 56, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !732)
!732 = !{!733, !766, !772, !783, !802, !813, !818, !825, !831, !844, !856, !894, !899, !927, !935, !936, !941, !950, !956, !961, !965, !969, !1164, !1213, !1219, !1226, !1233, !1259, !1284, !1301, !1313, !1335, !1350, !1522}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !731, file: !149, line: 3372, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !734, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !734, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !734, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !734, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !734, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !734, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !734, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !734, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !734, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !734, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !734, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !734, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !734, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !734, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !734, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !734, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !734, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !734, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !734, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !734, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !734, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !734, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !734, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !734, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !734, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !734, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !734, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !734, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !734, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !734, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !731, file: !149, line: 3373, baseType: !767, size: 192)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !767, file: !149, line: 403, baseType: !734, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !767, file: !149, line: 404, baseType: !729, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !149, line: 405, baseType: !729, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !731, file: !149, line: 3374, baseType: !773, size: 320)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !149, line: 1385, baseType: !767, size: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !773, file: !149, line: 1386, baseType: !777, size: 128, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !778, line: 58, baseType: !779)
!778 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !778, line: 54, size: 128, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !779, file: !778, line: 56, baseType: !683, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !779, file: !778, line: 57, baseType: !700, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !731, file: !149, line: 3375, baseType: !784, size: 256)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !149, line: 1398, baseType: !767, size: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !784, file: !149, line: 1399, baseType: !788, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !790, line: 52, size: 256, elements: !791)
!790 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !{!792, !793, !794, !795, !796, !797, !798}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !789, file: !790, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !789, file: !790, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !789, file: !790, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !789, file: !790, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !789, file: !790, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !789, file: !790, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !789, file: !790, line: 62, baseType: !799, size: 192, offset: 64)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 192, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 3)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !731, file: !149, line: 3376, baseType: !803, size: 256)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !149, line: 1409, baseType: !767, size: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !803, file: !149, line: 1410, baseType: !807, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !809, line: 27, size: 192, elements: !810)
!809 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !808, file: !809, line: 29, baseType: !777, size: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !808, file: !809, line: 30, baseType: !3, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !731, file: !149, line: 3377, baseType: !814, size: 256)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !149, line: 1438, baseType: !767, size: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !814, file: !149, line: 1439, baseType: !729, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !731, file: !149, line: 3378, baseType: !819, size: 256)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !149, line: 1419, baseType: !767, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !819, file: !149, line: 1420, baseType: !556, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !819, file: !149, line: 1421, baseType: !824, size: 8, offset: 224)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 8, elements: !576)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !731, file: !149, line: 3379, baseType: !826, size: 320)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !827)
!827 = !{!828, !829, !830}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !826, file: !149, line: 1429, baseType: !767, size: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !826, file: !149, line: 1430, baseType: !729, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !826, file: !149, line: 1431, baseType: !729, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !731, file: !149, line: 3380, baseType: !832, size: 320)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !833)
!833 = !{!834, !835}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !832, file: !149, line: 1461, baseType: !767, size: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !832, file: !149, line: 1462, baseType: !836, size: 128, offset: 192)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !837, line: 31, size: 128, elements: !838)
!837 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!838 = !{!839, !842, !843}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !836, file: !837, line: 32, baseType: !840, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !836, file: !837, line: 33, baseType: !5, size: 32, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !836, file: !837, line: 34, baseType: !5, size: 32, offset: 96)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !731, file: !149, line: 3381, baseType: !845, size: 384)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !846)
!846 = !{!847, !848, !853, !854, !855}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !845, file: !149, line: 2508, baseType: !767, size: 192)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !845, file: !149, line: 2509, baseType: !849, size: 32, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !850, line: 58, baseType: !851)
!850 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !852, line: 44, baseType: !5)
!852 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!853 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !845, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !845, file: !149, line: 2511, baseType: !729, size: 64, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !845, file: !149, line: 2512, baseType: !729, size: 64, offset: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !731, file: !149, line: 3382, baseType: !857, size: 896)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !858)
!858 = !{!859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !857, file: !149, line: 2653, baseType: !845, size: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !857, file: !149, line: 2654, baseType: !729, size: 64, offset: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !857, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !857, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !857, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !857, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !857, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !857, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !857, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !857, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !857, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !857, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !857, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !857, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !857, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !857, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !857, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !857, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !857, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !857, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !857, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !857, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !857, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !857, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !857, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !857, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !857, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !857, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !857, file: !149, line: 2705, baseType: !729, size: 64, offset: 576)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !857, file: !149, line: 2706, baseType: !729, size: 64, offset: 640)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !857, file: !149, line: 2707, baseType: !729, size: 64, offset: 704)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !857, file: !149, line: 2708, baseType: !729, size: 64, offset: 768)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !857, file: !149, line: 2711, baseType: !892, size: 64, offset: 832)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !731, file: !149, line: 3383, baseType: !895, size: 960)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !896)
!896 = !{!897, !898}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !895, file: !149, line: 2757, baseType: !857, size: 896)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !895, file: !149, line: 2758, baseType: !616, size: 64, offset: 896)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !731, file: !149, line: 3384, baseType: !900, size: 1472)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !901)
!901 = !{!902, !923, !924, !925, !926}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !900, file: !149, line: 3115, baseType: !903, size: 1216)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !149, line: 2985, baseType: !895, size: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !903, file: !149, line: 2986, baseType: !729, size: 64, offset: 960)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !903, file: !149, line: 2987, baseType: !729, size: 64, offset: 1024)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !903, file: !149, line: 2988, baseType: !729, size: 64, offset: 1088)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !903, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !903, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !903, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !903, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !903, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !903, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !903, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !903, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !903, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !903, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !903, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !903, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !903, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !903, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !900, file: !149, line: 3117, baseType: !729, size: 64, offset: 1216)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !900, file: !149, line: 3119, baseType: !729, size: 64, offset: 1280)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !900, file: !149, line: 3121, baseType: !729, size: 64, offset: 1344)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !900, file: !149, line: 3123, baseType: !729, size: 64, offset: 1408)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !731, file: !149, line: 3385, baseType: !928, size: 1088)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !929)
!929 = !{!930, !931, !932}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !928, file: !149, line: 2875, baseType: !895, size: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !928, file: !149, line: 2876, baseType: !616, size: 64, offset: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !928, file: !149, line: 2877, baseType: !933, size: 64, offset: 1024)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !149, line: 2856, flags: DIFlagFwdDecl)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !731, file: !149, line: 3386, baseType: !903, size: 1216)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !731, file: !149, line: 3387, baseType: !937, size: 1280)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !149, line: 3094, baseType: !903, size: 1216)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !937, file: !149, line: 3095, baseType: !933, size: 64, offset: 1216)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !731, file: !149, line: 3388, baseType: !942, size: 1216)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !943)
!943 = !{!944, !945, !946, !947, !948, !949}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !942, file: !149, line: 2825, baseType: !857, size: 896)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !942, file: !149, line: 2827, baseType: !729, size: 64, offset: 896)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !942, file: !149, line: 2828, baseType: !729, size: 64, offset: 960)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !942, file: !149, line: 2829, baseType: !729, size: 64, offset: 1024)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !942, file: !149, line: 2830, baseType: !729, size: 64, offset: 1088)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !942, file: !149, line: 2831, baseType: !729, size: 64, offset: 1152)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !731, file: !149, line: 3389, baseType: !951, size: 1024)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !952)
!952 = !{!953, !954, !955}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !149, line: 2851, baseType: !895, size: 960)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !951, file: !149, line: 2852, baseType: !556, size: 32, offset: 960)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !951, file: !149, line: 2853, baseType: !556, size: 32, offset: 992)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !731, file: !149, line: 3390, baseType: !957, size: 1024)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !149, line: 2858, baseType: !895, size: 960)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !957, file: !149, line: 2859, baseType: !933, size: 64, offset: 960)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !731, file: !149, line: 3391, baseType: !962, size: 960)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !963)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !149, line: 2863, baseType: !895, size: 960)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !731, file: !149, line: 3392, baseType: !966, size: 1472)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !967)
!967 = !{!968}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !149, line: 3305, baseType: !900, size: 1472)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !731, file: !149, line: 3393, baseType: !970, size: 1792)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !971)
!971 = !{!972, !973, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !149, line: 3249, baseType: !900, size: 1472)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !970, file: !149, line: 3251, baseType: !974, size: 64, offset: 1472)
!974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !975, size: 64)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !976, line: 463, size: 1152, elements: !977)
!976 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!977 = !{!978, !981, !1012, !1013, !1016, !1087, !1088, !1089, !1090, !1091, !1092, !1116, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !975, file: !976, line: 464, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !976, line: 464, flags: DIFlagFwdDecl)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !975, file: !976, line: 467, baseType: !982, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !984)
!984 = !{!985, !987, !988, !1001, !1002, !1003, !1004, !1005, !1006, !1008, !1010, !1011}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !983, file: !133, line: 377, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !602, line: 111, baseType: !585)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !983, file: !133, line: 378, baseType: !986, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !983, file: !133, line: 381, baseType: !989, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !991)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !992)
!992 = !{!993}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !991, file: !133, line: 282, baseType: !994, size: 128)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !995)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !996)
!996 = !{!997, !998, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !995, file: !133, line: 281, baseType: !5, size: 32)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !995, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !995, file: !133, line: 281, baseType: !1000, size: 64, offset: 64)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !986, size: 64, elements: !576)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !983, file: !133, line: 384, baseType: !556, size: 32, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !983, file: !133, line: 387, baseType: !556, size: 32, offset: 224)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !983, file: !133, line: 390, baseType: !556, size: 32, offset: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !983, file: !133, line: 394, baseType: !989, size: 64, offset: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !983, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !983, file: !133, line: 399, baseType: !1007, size: 64, offset: 416)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !684)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !983, file: !133, line: 402, baseType: !1009, size: 64, offset: 480)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !684)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !983, file: !133, line: 406, baseType: !556, size: 32, offset: 544)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !983, file: !133, line: 409, baseType: !556, size: 32, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !975, file: !976, line: 470, baseType: !613, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !975, file: !976, line: 473, baseType: !1014, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !976, line: 166, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !975, file: !976, line: 476, baseType: !1017, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !376, line: 187, size: 256, elements: !1019)
!1019 = !{!1020, !1021, !1034, !1086}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1018, file: !376, line: 189, baseType: !556, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1018, file: !376, line: 192, baseType: !1022, size: 64, offset: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !376, line: 87, baseType: !1024)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !376, line: 87, size: 128, elements: !1025)
!1025 = !{!1026}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1024, file: !376, line: 87, baseType: !1027, size: 128)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !376, line: 85, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !376, line: 85, size: 128, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1028, file: !376, line: 85, baseType: !5, size: 32)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1028, file: !376, line: 85, baseType: !5, size: 32, offset: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1028, file: !376, line: 85, baseType: !1033, size: 64, offset: 64)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 64, elements: !576)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1018, file: !376, line: 197, baseType: !1035, size: 64, offset: 128)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1036, line: 144, baseType: !1037)
!1036 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1036, line: 100, size: 896, elements: !1039)
!1039 = !{!1040, !1048, !1053, !1058, !1060, !1063, !1064, !1065, !1066, !1067, !1072, !1074, !1075, !1080, !1085}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1038, file: !1036, line: 102, baseType: !1041, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1036, line: 52, baseType: !1042)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DISubroutineType(types: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1036, line: 47, baseType: !5)
!1046 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1038, file: !1036, line: 105, baseType: !1049, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1036, line: 59, baseType: !1050)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = !DISubroutineType(types: !1052)
!1052 = !{!556, !1046, !1046}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1038, file: !1036, line: 108, baseType: !1054, size: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1036, line: 63, baseType: !1055)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DISubroutineType(types: !1057)
!1057 = !{null, !560}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1038, file: !1036, line: 111, baseType: !1059, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1038, file: !1036, line: 114, baseType: !1061, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1062, line: 46, baseType: !683)
!1062 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1038, file: !1036, line: 117, baseType: !1061, size: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1038, file: !1036, line: 120, baseType: !1061, size: 64, offset: 384)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1038, file: !1036, line: 124, baseType: !5, size: 32, offset: 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1038, file: !1036, line: 128, baseType: !5, size: 32, offset: 480)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1038, file: !1036, line: 131, baseType: !1068, size: 64, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1036, line: 75, baseType: !1069)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DISubroutineType(types: !1071)
!1071 = !{!560, !1061, !1061}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1038, file: !1036, line: 132, baseType: !1073, size: 64, offset: 576)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1036, line: 78, baseType: !1055)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1038, file: !1036, line: 135, baseType: !560, size: 64, offset: 640)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1038, file: !1036, line: 136, baseType: !1076, size: 64, offset: 704)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1036, line: 82, baseType: !1077)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DISubroutineType(types: !1079)
!1079 = !{!560, !560, !1061, !1061}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1038, file: !1036, line: 137, baseType: !1081, size: 64, offset: 768)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1036, line: 83, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{null, !560, !560}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1038, file: !1036, line: 141, baseType: !5, size: 32, offset: 832)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1018, file: !376, line: 200, baseType: !579, size: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !975, file: !976, line: 479, baseType: !1035, size: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !975, file: !976, line: 484, baseType: !729, size: 64, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !975, file: !976, line: 488, baseType: !729, size: 64, offset: 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !975, file: !976, line: 493, baseType: !729, size: 64, offset: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !975, file: !976, line: 496, baseType: !729, size: 64, offset: 576)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !975, file: !976, line: 501, baseType: !1093, size: 64, offset: 640)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1095)
!1095 = !{!1096, !1099, !1100, !1101, !1102, !1104, !1105, !1110, !1111, !1112, !1113, !1114, !1115}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1094, file: !144, line: 2356, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1094, file: !144, line: 2357, baseType: !561, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1094, file: !144, line: 2358, baseType: !556, size: 32, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1094, file: !144, line: 2359, baseType: !556, size: 32, offset: 160)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1094, file: !144, line: 2360, baseType: !1103, size: 128, offset: 192)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !556, size: 128, elements: !709)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1094, file: !144, line: 2364, baseType: !556, size: 32, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1094, file: !144, line: 2367, baseType: !1106, size: 128, offset: 384)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1106, file: !144, line: 2351, baseType: !616, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1106, file: !144, line: 2352, baseType: !700, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1094, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1094, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1094, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1094, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1094, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1094, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !975, file: !976, line: 504, baseType: !1117, size: 64, offset: 704)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !976, line: 504, flags: DIFlagFwdDecl)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !975, file: !976, line: 507, baseType: !1035, size: 64, offset: 768)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !975, file: !976, line: 510, baseType: !556, size: 32, offset: 832)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !975, file: !976, line: 513, baseType: !556, size: 32, offset: 864)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !975, file: !976, line: 516, baseType: !849, size: 32, offset: 896)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !975, file: !976, line: 519, baseType: !849, size: 32, offset: 928)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !975, file: !976, line: 522, baseType: !5, size: 32, offset: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !975, file: !976, line: 523, baseType: !5, size: 32, offset: 992)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !975, file: !976, line: 528, baseType: !561, size: 64, offset: 1024)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !975, file: !976, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !975, file: !976, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !975, file: !976, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !975, file: !976, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !975, file: !976, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !975, file: !976, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !975, file: !976, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !975, file: !976, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !975, file: !976, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !975, file: !976, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !975, file: !976, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !975, file: !976, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !975, file: !976, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !975, file: !976, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !975, file: !976, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !975, file: !976, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !970, file: !149, line: 3254, baseType: !729, size: 64, offset: 1536)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !970, file: !149, line: 3257, baseType: !729, size: 64, offset: 1600)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !970, file: !149, line: 3258, baseType: !729, size: 64, offset: 1664)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !970, file: !149, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !970, file: !149, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !970, file: !149, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !970, file: !149, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !970, file: !149, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !970, file: !149, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !970, file: !149, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !970, file: !149, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !970, file: !149, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !970, file: !149, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !970, file: !149, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !970, file: !149, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !970, file: !149, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !970, file: !149, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !970, file: !149, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !970, file: !149, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !970, file: !149, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !970, file: !149, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !731, file: !149, line: 3394, baseType: !1165, size: 1344)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !149, line: 2279, size: 1344, elements: !1166)
!1166 = !{!1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1192, !1193, !1194, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1165, file: !149, line: 2280, baseType: !767, size: 192)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1165, file: !149, line: 2281, baseType: !729, size: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1165, file: !149, line: 2282, baseType: !729, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1165, file: !149, line: 2283, baseType: !729, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1165, file: !149, line: 2284, baseType: !729, size: 64, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1165, file: !149, line: 2285, baseType: !5, size: 32, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1165, file: !149, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1165, file: !149, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1165, file: !149, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1165, file: !149, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1165, file: !149, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1165, file: !149, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1165, file: !149, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1165, file: !149, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1165, file: !149, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1165, file: !149, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1165, file: !149, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1165, file: !149, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1165, file: !149, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1165, file: !149, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1165, file: !149, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1165, file: !149, line: 2305, baseType: !5, size: 32, offset: 512)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1165, file: !149, line: 2306, baseType: !1190, size: 32, offset: 544)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1191, line: 31, baseType: !556)
!1191 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1165, file: !149, line: 2307, baseType: !729, size: 64, offset: 576)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1165, file: !149, line: 2308, baseType: !729, size: 64, offset: 640)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1165, file: !149, line: 2314, baseType: !1195, size: 64, offset: 704)
!1195 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !149, line: 2309, size: 64, elements: !1196)
!1196 = !{!1197, !1198, !1199}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1195, file: !149, line: 2310, baseType: !556, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1195, file: !149, line: 2311, baseType: !561, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1195, file: !149, line: 2312, baseType: !1200, size: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !149, line: 2277, flags: DIFlagFwdDecl)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1165, file: !149, line: 2315, baseType: !729, size: 64, offset: 768)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1165, file: !149, line: 2316, baseType: !729, size: 64, offset: 832)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1165, file: !149, line: 2317, baseType: !729, size: 64, offset: 896)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1165, file: !149, line: 2318, baseType: !729, size: 64, offset: 960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1165, file: !149, line: 2319, baseType: !729, size: 64, offset: 1024)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1165, file: !149, line: 2320, baseType: !729, size: 64, offset: 1088)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1165, file: !149, line: 2321, baseType: !729, size: 64, offset: 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1165, file: !149, line: 2322, baseType: !729, size: 64, offset: 1216)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1165, file: !149, line: 2324, baseType: !1211, size: 64, offset: 1280)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !149, line: 2324, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !731, file: !149, line: 3395, baseType: !1214, size: 320)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !149, line: 1469, size: 320, elements: !1215)
!1215 = !{!1216, !1217, !1218}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !149, line: 1470, baseType: !767, size: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1214, file: !149, line: 1471, baseType: !729, size: 64, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1214, file: !149, line: 1472, baseType: !729, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !731, file: !149, line: 3396, baseType: !1220, size: 320)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !149, line: 1482, size: 320, elements: !1221)
!1221 = !{!1222, !1223, !1224}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1220, file: !149, line: 1483, baseType: !767, size: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1220, file: !149, line: 1484, baseType: !556, size: 32, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1220, file: !149, line: 1485, baseType: !1225, size: 64, offset: 256)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 64, elements: !576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !731, file: !149, line: 3397, baseType: !1227, size: 384)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !149, line: 1829, size: 384, elements: !1228)
!1228 = !{!1229, !1230, !1231, !1232}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1227, file: !149, line: 1830, baseType: !767, size: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1227, file: !149, line: 1831, baseType: !849, size: 32, offset: 192)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1227, file: !149, line: 1832, baseType: !729, size: 64, offset: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1227, file: !149, line: 1835, baseType: !1225, size: 64, offset: 320)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !731, file: !149, line: 3398, baseType: !1234, size: 704)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !149, line: 1898, size: 704, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1242, !1243, !1246}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1234, file: !149, line: 1899, baseType: !767, size: 192)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1234, file: !149, line: 1902, baseType: !729, size: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1234, file: !149, line: 1905, baseType: !1239, size: 64, offset: 256)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !602, line: 58, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !602, line: 57, flags: DIFlagFwdDecl)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1234, file: !149, line: 1908, baseType: !5, size: 32, offset: 320)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1234, file: !149, line: 1911, baseType: !1244, size: 64, offset: 384)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !149, line: 1876, flags: DIFlagFwdDecl)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1234, file: !149, line: 1914, baseType: !1247, size: 256, offset: 448)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1248)
!1248 = !{!1249, !1251, !1252, !1257}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1247, file: !149, line: 1884, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1247, file: !149, line: 1885, baseType: !1250, size: 64, offset: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1247, file: !149, line: 1891, baseType: !1253, size: 64, offset: 128)
!1253 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1247, file: !149, line: 1891, size: 64, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1253, file: !149, line: 1891, baseType: !1239, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1253, file: !149, line: 1891, baseType: !729, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1247, file: !149, line: 1892, baseType: !1258, size: 64, offset: 192)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !731, file: !149, line: 3399, baseType: !1260, size: 704)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !149, line: 2008, size: 704, elements: !1261)
!1261 = !{!1262, !1263, !1264, !1265, !1266, !1267, !1279, !1280, !1281, !1282, !1283}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1260, file: !149, line: 2009, baseType: !767, size: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1260, file: !149, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1260, file: !149, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1260, file: !149, line: 2014, baseType: !849, size: 32, offset: 224)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1260, file: !149, line: 2016, baseType: !729, size: 64, offset: 256)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1260, file: !149, line: 2017, baseType: !1268, size: 64, offset: 320)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1271)
!1271 = !{!1272}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1270, file: !149, line: 183, baseType: !1273, size: 128)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1275)
!1275 = !{!1276, !1277, !1278}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1274, file: !149, line: 182, baseType: !5, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1274, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1274, file: !149, line: 182, baseType: !1225, size: 64, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1260, file: !149, line: 2019, baseType: !729, size: 64, offset: 384)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1260, file: !149, line: 2020, baseType: !729, size: 64, offset: 448)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1260, file: !149, line: 2021, baseType: !729, size: 64, offset: 512)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1260, file: !149, line: 2022, baseType: !729, size: 64, offset: 576)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1260, file: !149, line: 2023, baseType: !729, size: 64, offset: 640)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !731, file: !149, line: 3400, baseType: !1285, size: 832)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !149, line: 2430, size: 832, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1285, file: !149, line: 2431, baseType: !767, size: 192)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1285, file: !149, line: 2433, baseType: !729, size: 64, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1285, file: !149, line: 2434, baseType: !729, size: 64, offset: 256)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1285, file: !149, line: 2435, baseType: !729, size: 64, offset: 320)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1285, file: !149, line: 2436, baseType: !729, size: 64, offset: 384)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1285, file: !149, line: 2437, baseType: !1268, size: 64, offset: 448)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1285, file: !149, line: 2438, baseType: !729, size: 64, offset: 512)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1285, file: !149, line: 2440, baseType: !729, size: 64, offset: 576)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1285, file: !149, line: 2441, baseType: !729, size: 64, offset: 640)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1285, file: !149, line: 2443, baseType: !1297, size: 128, offset: 704)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !149, line: 182, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !149, line: 182, size: 128, elements: !1299)
!1299 = !{!1300}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1298, file: !149, line: 182, baseType: !1273, size: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !731, file: !149, line: 3401, baseType: !1302, size: 320)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !149, line: 3327, size: 320, elements: !1303)
!1303 = !{!1304, !1305, !1312}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1302, file: !149, line: 3329, baseType: !767, size: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1302, file: !149, line: 3330, baseType: !1306, size: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !149, line: 3320, size: 192, elements: !1308)
!1308 = !{!1309, !1310, !1311}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1307, file: !149, line: 3322, baseType: !1306, size: 64)
