; ModuleID = 'lower-subreg.bc'
source_filename = "lower-subreg.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }

!715 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !716, line: 36, baseType: !7, size: 32, elements: !717)
!716 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!718 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!719 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!720 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!721 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!722 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!723 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!724 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!725 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!726 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!727 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!728 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!729 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!730 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!731 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!732 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!733 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!734 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!735 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!736 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!737 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !573, line: 836, baseType: !7, size: 32, elements: !738)
!738 = !{!739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770}
!739 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!750 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!751 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!752 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!756 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!757 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!758 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!759 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!760 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!761 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!762 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!763 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!764 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!765 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!766 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!767 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!768 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!769 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!770 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!771 = !{!772, !773, !774, !775, !778, !779, !781, !189, !572, !782, !1918, !1919, !7, !715, !1931, !852, !898, !737}
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!773 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!774 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !777)
!781 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !783, line: 50, baseType: !784)
!783 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !785, size: 64)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !573, line: 240, size: 384, elements: !786)
!786 = !{!787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !785, file: !573, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !785, file: !573, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !785, file: !573, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !785, file: !573, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !785, file: !573, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !785, file: !573, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !785, file: !573, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !785, file: !573, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !785, file: !573, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !785, file: !573, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !785, file: !573, line: 321, baseType: !798, size: 320, offset: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !573, line: 315, size: 320, elements: !799)
!799 = !{!800, !1885, !1887, !1916, !1917}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !798, file: !573, line: 316, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !802, size: 64, elements: !817)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !573, line: 183, baseType: !803)
!803 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !573, line: 166, size: 64, elements: !804)
!804 = !{!805, !806, !807, !808, !809, !819, !820, !832, !835, !897, !1863, !1864, !1875, !1882}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !803, file: !573, line: 168, baseType: !774, size: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !803, file: !573, line: 169, baseType: !7, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !803, file: !573, line: 170, baseType: !779, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !803, file: !573, line: 171, baseType: !782, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !803, file: !573, line: 172, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !783, line: 53, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !573, line: 359, size: 128, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !812, file: !573, line: 360, baseType: !774, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !812, file: !573, line: 361, baseType: !816, size: 64, offset: 64)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 64, elements: !817)
!817 = !{!818}
!818 = !DISubrange(count: 1)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !803, file: !573, line: 173, baseType: !189, size: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !803, file: !573, line: 174, baseType: !821, size: 32)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !573, line: 133, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !573, line: 115, size: 32, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !822, file: !573, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !822, file: !573, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !822, file: !573, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !822, file: !573, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !822, file: !573, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !822, file: !573, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !822, file: !573, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !822, file: !573, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !803, file: !573, line: 175, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !573, line: 175, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !803, file: !573, line: 176, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !838, line: 75, size: 256, elements: !839)
!838 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!839 = !{!840, !855, !856, !857}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !837, file: !838, line: 76, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !838, line: 68, baseType: !843)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !838, line: 63, size: 320, elements: !844)
!844 = !{!845, !847, !848, !849}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !843, file: !838, line: 64, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !843, file: !838, line: 65, baseType: !846, size: 64, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !843, file: !838, line: 66, baseType: !7, size: 32, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !843, file: !838, line: 67, baseType: !850, size: 128, offset: 192)
!850 = !DICompositeType(tag: DW_TAG_array_type, baseType: !851, size: 128, elements: !853)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !838, line: 29, baseType: !852)
!852 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!853 = !{!854}
!854 = !DISubrange(count: 2)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !837, file: !838, line: 77, baseType: !841, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !837, file: !838, line: 78, baseType: !7, size: 32, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !837, file: !838, line: 79, baseType: !858, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !838, line: 49, baseType: !860)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !838, line: 45, size: 832, elements: !861)
!861 = !{!862, !863, !864}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !860, file: !838, line: 46, baseType: !846, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !860, file: !838, line: 47, baseType: !836, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !860, file: !838, line: 48, baseType: !865, size: 704, offset: 128)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !866, line: 164, size: 704, elements: !867)
!866 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!867 = !{!868, !870, !880, !881, !882, !883, !884, !885, !889, !893, !894, !895, !896}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !865, file: !866, line: 166, baseType: !869, size: 64)
!869 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !865, file: !866, line: 167, baseType: !871, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !866, line: 157, size: 192, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !872, file: !866, line: 159, baseType: !776, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !872, file: !866, line: 160, baseType: !871, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !872, file: !866, line: 161, baseType: !877, size: 32, offset: 128)
!877 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 32, elements: !878)
!878 = !{!879}
!879 = !DISubrange(count: 4)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !865, file: !866, line: 168, baseType: !776, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !865, file: !866, line: 169, baseType: !776, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !865, file: !866, line: 170, baseType: !776, size: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !865, file: !866, line: 171, baseType: !869, size: 64, offset: 320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !865, file: !866, line: 172, baseType: !774, size: 32, offset: 384)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !865, file: !866, line: 176, baseType: !886, size: 64, offset: 448)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DISubroutineType(types: !888)
!888 = !{!871, !778, !869}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !865, file: !866, line: 177, baseType: !890, size: 64, offset: 512)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{null, !778, !871}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !865, file: !866, line: 178, baseType: !778, size: 64, offset: 576)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !865, file: !866, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !865, file: !866, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !865, file: !866, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !803, file: !573, line: 177, baseType: !898, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !783, line: 56, baseType: !899)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !900, size: 64)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !341, line: 3371, size: 1792, elements: !901)
!901 = !{!902, !935, !941, !952, !971, !982, !987, !994, !1000, !1013, !1025, !1063, !1068, !1096, !1104, !1105, !1110, !1119, !1125, !1130, !1134, !1138, !1499, !1548, !1554, !1560, !1567, !1593, !1607, !1624, !1636, !1658, !1673, !1845}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !900, file: !341, line: 3372, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !341, line: 360, size: 64, elements: !904)
!904 = !{!905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !903, file: !341, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !903, file: !341, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !903, file: !341, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !903, file: !341, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !903, file: !341, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !903, file: !341, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !903, file: !341, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !903, file: !341, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !903, file: !341, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !903, file: !341, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !903, file: !341, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !903, file: !341, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !903, file: !341, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !903, file: !341, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !903, file: !341, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !903, file: !341, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !903, file: !341, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !903, file: !341, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !903, file: !341, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !903, file: !341, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !903, file: !341, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !903, file: !341, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !903, file: !341, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !903, file: !341, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !903, file: !341, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !903, file: !341, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !903, file: !341, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !903, file: !341, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !903, file: !341, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !903, file: !341, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !900, file: !341, line: 3373, baseType: !936, size: 192)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !341, line: 402, size: 192, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !936, file: !341, line: 403, baseType: !903, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !936, file: !341, line: 404, baseType: !898, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !936, file: !341, line: 405, baseType: !898, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !900, file: !341, line: 3374, baseType: !942, size: 320)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !341, line: 1384, size: 320, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !942, file: !341, line: 1385, baseType: !936, size: 192)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !942, file: !341, line: 1386, baseType: !946, size: 128, offset: 192)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !947, line: 58, baseType: !948)
!947 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !947, line: 54, size: 128, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !948, file: !947, line: 56, baseType: !852, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !948, file: !947, line: 57, baseType: !869, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !900, file: !341, line: 3375, baseType: !953, size: 256)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !341, line: 1397, size: 256, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !953, file: !341, line: 1398, baseType: !936, size: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !953, file: !341, line: 1399, baseType: !957, size: 64, offset: 192)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !959, line: 52, size: 256, elements: !960)
!959 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!960 = !{!961, !962, !963, !964, !965, !966, !967}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !958, file: !959, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !958, file: !959, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !958, file: !959, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !958, file: !959, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !958, file: !959, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !958, file: !959, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !958, file: !959, line: 62, baseType: !968, size: 192, offset: 64)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !852, size: 192, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 3)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !900, file: !341, line: 3376, baseType: !972, size: 256)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !341, line: 1408, size: 256, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !972, file: !341, line: 1409, baseType: !936, size: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !972, file: !341, line: 1410, baseType: !976, size: 64, offset: 192)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !978, line: 27, size: 192, elements: !979)
!978 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !977, file: !978, line: 29, baseType: !946, size: 128)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !977, file: !978, line: 30, baseType: !189, size: 32, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !900, file: !341, line: 3377, baseType: !983, size: 256)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !341, line: 1437, size: 256, elements: !984)
!984 = !{!985, !986}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !983, file: !341, line: 1438, baseType: !936, size: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !983, file: !341, line: 1439, baseType: !898, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !900, file: !341, line: 3378, baseType: !988, size: 256)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !341, line: 1418, size: 256, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !341, line: 1419, baseType: !936, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !988, file: !341, line: 1420, baseType: !774, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !988, file: !341, line: 1421, baseType: !993, size: 8, offset: 224)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 8, elements: !817)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !900, file: !341, line: 3379, baseType: !995, size: 320)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !341, line: 1428, size: 320, elements: !996)
!996 = !{!997, !998, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !995, file: !341, line: 1429, baseType: !936, size: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !995, file: !341, line: 1430, baseType: !898, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !995, file: !341, line: 1431, baseType: !898, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !900, file: !341, line: 3380, baseType: !1001, size: 320)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !341, line: 1460, size: 320, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1001, file: !341, line: 1461, baseType: !936, size: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1001, file: !341, line: 1462, baseType: !1005, size: 128, offset: 192)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1006, line: 31, size: 128, elements: !1007)
!1006 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1007 = !{!1008, !1011, !1012}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1005, file: !1006, line: 32, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !773)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1005, file: !1006, line: 33, baseType: !7, size: 32, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1005, file: !1006, line: 34, baseType: !7, size: 32, offset: 96)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !900, file: !341, line: 3381, baseType: !1014, size: 384)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !341, line: 2507, size: 384, elements: !1015)
!1015 = !{!1016, !1017, !1022, !1023, !1024}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !341, line: 2508, baseType: !936, size: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1014, file: !341, line: 2509, baseType: !1018, size: 32, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1019, line: 58, baseType: !1020)
!1019 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1021, line: 44, baseType: !7)
!1021 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1014, file: !341, line: 2510, baseType: !7, size: 32, offset: 224)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1014, file: !341, line: 2511, baseType: !898, size: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1014, file: !341, line: 2512, baseType: !898, size: 64, offset: 320)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !900, file: !341, line: 3382, baseType: !1026, size: 896)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !341, line: 2652, size: 896, elements: !1027)
!1027 = !{!1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1026, file: !341, line: 2653, baseType: !1014, size: 384)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1026, file: !341, line: 2654, baseType: !898, size: 64, offset: 384)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1026, file: !341, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1026, file: !341, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1026, file: !341, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1026, file: !341, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1026, file: !341, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1026, file: !341, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1026, file: !341, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1026, file: !341, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1026, file: !341, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1026, file: !341, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1026, file: !341, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1026, file: !341, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1026, file: !341, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1026, file: !341, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1026, file: !341, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1026, file: !341, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1026, file: !341, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1026, file: !341, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1026, file: !341, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1026, file: !341, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1026, file: !341, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1026, file: !341, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1026, file: !341, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1026, file: !341, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1026, file: !341, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1026, file: !341, line: 2703, baseType: !7, size: 32, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1026, file: !341, line: 2705, baseType: !898, size: 64, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1026, file: !341, line: 2706, baseType: !898, size: 64, offset: 640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1026, file: !341, line: 2707, baseType: !898, size: 64, offset: 704)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1026, file: !341, line: 2708, baseType: !898, size: 64, offset: 768)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1026, file: !341, line: 2711, baseType: !1061, size: 64, offset: 832)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !341, line: 2711, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !900, file: !341, line: 3383, baseType: !1064, size: 960)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !341, line: 2756, size: 960, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1064, file: !341, line: 2757, baseType: !1026, size: 896)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1064, file: !341, line: 2758, baseType: !782, size: 64, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !900, file: !341, line: 3384, baseType: !1069, size: 1472)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !341, line: 3114, size: 1472, elements: !1070)
!1070 = !{!1071, !1092, !1093, !1094, !1095}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1069, file: !341, line: 3115, baseType: !1072, size: 1216)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !341, line: 2984, size: 1216, elements: !1073)
!1073 = !{!1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1072, file: !341, line: 2985, baseType: !1064, size: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1072, file: !341, line: 2986, baseType: !898, size: 64, offset: 960)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1072, file: !341, line: 2987, baseType: !898, size: 64, offset: 1024)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1072, file: !341, line: 2988, baseType: !898, size: 64, offset: 1088)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1072, file: !341, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1072, file: !341, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1072, file: !341, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1072, file: !341, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1072, file: !341, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1072, file: !341, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1072, file: !341, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1072, file: !341, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1072, file: !341, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1072, file: !341, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1072, file: !341, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1072, file: !341, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1072, file: !341, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1072, file: !341, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1069, file: !341, line: 3117, baseType: !898, size: 64, offset: 1216)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1069, file: !341, line: 3119, baseType: !898, size: 64, offset: 1280)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1069, file: !341, line: 3121, baseType: !898, size: 64, offset: 1344)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1069, file: !341, line: 3123, baseType: !898, size: 64, offset: 1408)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !900, file: !341, line: 3385, baseType: !1097, size: 1088)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !341, line: 2874, size: 1088, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1097, file: !341, line: 2875, baseType: !1064, size: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1097, file: !341, line: 2876, baseType: !782, size: 64, offset: 960)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1097, file: !341, line: 2877, baseType: !1102, size: 64, offset: 1024)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !341, line: 2856, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !900, file: !341, line: 3386, baseType: !1072, size: 1216)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !900, file: !341, line: 3387, baseType: !1106, size: 1280)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !341, line: 3093, size: 1280, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1106, file: !341, line: 3094, baseType: !1072, size: 1216)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1106, file: !341, line: 3095, baseType: !1102, size: 64, offset: 1216)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !900, file: !341, line: 3388, baseType: !1111, size: 1216)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !341, line: 2824, size: 1216, elements: !1112)
!1112 = !{!1113, !1114, !1115, !1116, !1117, !1118}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1111, file: !341, line: 2825, baseType: !1026, size: 896)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1111, file: !341, line: 2827, baseType: !898, size: 64, offset: 896)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1111, file: !341, line: 2828, baseType: !898, size: 64, offset: 960)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1111, file: !341, line: 2829, baseType: !898, size: 64, offset: 1024)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1111, file: !341, line: 2830, baseType: !898, size: 64, offset: 1088)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1111, file: !341, line: 2831, baseType: !898, size: 64, offset: 1152)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !900, file: !341, line: 3389, baseType: !1120, size: 1024)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !341, line: 2850, size: 1024, elements: !1121)
!1121 = !{!1122, !1123, !1124}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1120, file: !341, line: 2851, baseType: !1064, size: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1120, file: !341, line: 2852, baseType: !774, size: 32, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1120, file: !341, line: 2853, baseType: !774, size: 32, offset: 992)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !900, file: !341, line: 3390, baseType: !1126, size: 1024)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !341, line: 2857, size: 1024, elements: !1127)
!1127 = !{!1128, !1129}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1126, file: !341, line: 2858, baseType: !1064, size: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1126, file: !341, line: 2859, baseType: !1102, size: 64, offset: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !900, file: !341, line: 3391, baseType: !1131, size: 960)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !341, line: 2862, size: 960, elements: !1132)
!1132 = !{!1133}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1131, file: !341, line: 2863, baseType: !1064, size: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !900, file: !341, line: 3392, baseType: !1135, size: 1472)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !341, line: 3304, size: 1472, elements: !1136)
!1136 = !{!1137}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !341, line: 3305, baseType: !1069, size: 1472)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !900, file: !341, line: 3393, baseType: !1139, size: 1792)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !341, line: 3248, size: 1792, elements: !1140)
!1140 = !{!1141, !1142, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !341, line: 3249, baseType: !1069, size: 1472)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1139, file: !341, line: 3251, baseType: !1143, size: 64, offset: 1472)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1145, line: 463, size: 1152, elements: !1146)
!1145 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1146 = !{!1147, !1311, !1415, !1416, !1419, !1422, !1423, !1424, !1425, !1426, !1427, !1451, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1144, file: !1145, line: 464, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !318, line: 194, size: 384, elements: !1150)
!1150 = !{!1151, !1200, !1213, !1227, !1279, !1292}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1149, file: !318, line: 197, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !318, line: 182, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !318, line: 116, size: 704, elements: !1155)
!1155 = !{!1156, !1157, !1158, !1159, !1160, !1161, !1188, !1197, !1198, !1199}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1154, file: !318, line: 119, baseType: !1153, size: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1154, file: !318, line: 122, baseType: !1153, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1154, file: !318, line: 123, baseType: !1153, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1154, file: !318, line: 126, baseType: !774, size: 32, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1154, file: !318, line: 129, baseType: !317, size: 32, offset: 224)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1154, file: !318, line: 165, baseType: !1162, size: 192, offset: 256)
!1162 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !318, line: 132, size: 192, elements: !1163)
!1163 = !{!1164, !1177, !1183}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1162, file: !318, line: 137, baseType: !1165, size: 128)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !318, line: 133, size: 128, elements: !1166)
!1166 = !{!1167, !1176}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1165, file: !318, line: 135, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !318, line: 93, size: 320, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174, !1175}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1169, file: !318, line: 96, baseType: !1168, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1169, file: !318, line: 97, baseType: !1168, size: 64, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1169, file: !318, line: 101, baseType: !898, size: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1169, file: !318, line: 106, baseType: !898, size: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1169, file: !318, line: 111, baseType: !898, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1165, file: !318, line: 136, baseType: !1168, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1162, file: !318, line: 151, baseType: !1178, size: 192)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !318, line: 139, size: 192, elements: !1179)
!1179 = !{!1180, !1181, !1182}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1178, file: !318, line: 141, baseType: !898, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1178, file: !318, line: 145, baseType: !898, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1178, file: !318, line: 150, baseType: !774, size: 32, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1162, file: !318, line: 164, baseType: !1184, size: 128)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !318, line: 153, size: 128, elements: !1185)
!1185 = !{!1186, !1187}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1184, file: !318, line: 161, baseType: !898, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1184, file: !318, line: 163, baseType: !1018, size: 32, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1154, file: !318, line: 168, baseType: !1189, size: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !318, line: 67, size: 320, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1190, file: !318, line: 70, baseType: !1189, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1190, file: !318, line: 73, baseType: !1153, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1190, file: !318, line: 78, baseType: !898, size: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1190, file: !318, line: 85, baseType: !782, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1190, file: !318, line: 88, baseType: !774, size: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1154, file: !318, line: 173, baseType: !782, size: 64, offset: 512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1154, file: !318, line: 173, baseType: !782, size: 64, offset: 576)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1154, file: !318, line: 177, baseType: !773, size: 8, offset: 640)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1149, file: !318, line: 200, baseType: !1201, size: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !318, line: 185, baseType: !1203)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !318, line: 185, size: 128, elements: !1204)
!1204 = !{!1205}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1203, file: !318, line: 185, baseType: !1206, size: 128)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !318, line: 184, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !318, line: 184, size: 128, elements: !1208)
!1208 = !{!1209, !1210, !1211}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1207, file: !318, line: 184, baseType: !7, size: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1207, file: !318, line: 184, baseType: !7, size: 32, offset: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1207, file: !318, line: 184, baseType: !1212, size: 64, offset: 64)
!1212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1152, size: 64, elements: !817)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1149, file: !318, line: 203, baseType: !1214, size: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, size: 128, elements: !1217)
!1217 = !{!1218}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1216, file: !318, line: 189, baseType: !1219, size: 128)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !318, line: 188, baseType: !1220)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !318, line: 188, size: 128, elements: !1221)
!1221 = !{!1222, !1223, !1224}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1220, file: !318, line: 188, baseType: !7, size: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1220, file: !318, line: 188, baseType: !7, size: 32, offset: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1220, file: !318, line: 188, baseType: !1225, size: 64, offset: 64)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1226, size: 64, elements: !817)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !318, line: 180, baseType: !1189)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1149, file: !318, line: 207, baseType: !1228, size: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1229, line: 144, baseType: !1230)
!1229 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1229, line: 100, size: 896, elements: !1232)
!1232 = !{!1233, !1241, !1246, !1251, !1253, !1256, !1257, !1258, !1259, !1260, !1265, !1267, !1268, !1273, !1278}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1231, file: !1229, line: 102, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1229, line: 52, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!1238, !1239}
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1229, line: 47, baseType: !7)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1231, file: !1229, line: 105, baseType: !1242, size: 64, offset: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1229, line: 59, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!774, !1239, !1239}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1231, file: !1229, line: 108, baseType: !1247, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1229, line: 63, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{null, !778}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1231, file: !1229, line: 111, baseType: !1252, size: 64, offset: 192)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1231, file: !1229, line: 114, baseType: !1254, size: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1255, line: 46, baseType: !852)
!1255 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1231, file: !1229, line: 117, baseType: !1254, size: 64, offset: 320)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1231, file: !1229, line: 120, baseType: !1254, size: 64, offset: 384)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1231, file: !1229, line: 124, baseType: !7, size: 32, offset: 448)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1231, file: !1229, line: 128, baseType: !7, size: 32, offset: 480)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1231, file: !1229, line: 131, baseType: !1261, size: 64, offset: 512)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1229, line: 75, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{!778, !1254, !1254}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1231, file: !1229, line: 132, baseType: !1266, size: 64, offset: 576)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1229, line: 78, baseType: !1248)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1231, file: !1229, line: 135, baseType: !778, size: 64, offset: 640)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1231, file: !1229, line: 136, baseType: !1269, size: 64, offset: 704)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1229, line: 82, baseType: !1270)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!778, !778, !1254, !1254}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1231, file: !1229, line: 137, baseType: !1274, size: 64, offset: 768)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1229, line: 83, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{null, !778, !778}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1231, file: !1229, line: 141, baseType: !7, size: 32, offset: 832)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1149, file: !318, line: 211, baseType: !1280, size: 64, offset: 256)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !341, line: 183, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !341, line: 183, size: 128, elements: !1283)
!1283 = !{!1284}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1282, file: !341, line: 183, baseType: !1285, size: 128)
!1285 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !341, line: 182, baseType: !1286)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !341, line: 182, size: 128, elements: !1287)
!1287 = !{!1288, !1289, !1290}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1286, file: !341, line: 182, baseType: !7, size: 32)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1286, file: !341, line: 182, baseType: !7, size: 32, offset: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1286, file: !341, line: 182, baseType: !1291, size: 64, offset: 64)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !898, size: 64, elements: !817)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1149, file: !318, line: 220, baseType: !1293, size: 64, offset: 320)
!1293 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !318, line: 217, size: 64, elements: !1294)
!1294 = !{!1295, !1296}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1293, file: !318, line: 218, baseType: !1280, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1293, file: !318, line: 219, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1299, line: 29, baseType: !1300)
!1299 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1299, line: 29, size: 96, elements: !1301)
!1301 = !{!1302}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1300, file: !1299, line: 29, baseType: !1303, size: 96)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1299, line: 27, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1299, line: 27, size: 96, elements: !1305)
!1305 = !{!1306, !1307, !1308}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1304, file: !1299, line: 27, baseType: !7, size: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1304, file: !1299, line: 27, baseType: !7, size: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1304, file: !1299, line: 27, baseType: !1309, size: 8, offset: 64)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1310, size: 8, elements: !817)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1299, line: 26, baseType: !773)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1144, file: !1145, line: 467, baseType: !1312, size: 64, offset: 64)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !325, line: 374, size: 640, elements: !1314)
!1314 = !{!1315, !1390, !1391, !1404, !1405, !1406, !1407, !1408, !1409, !1411, !1413, !1414}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1313, file: !325, line: 377, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !783, line: 111, baseType: !1317)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !1319)
!1319 = !{!1320, !1355, !1356, !1357, !1360, !1364, !1365, !1366, !1384, !1385, !1386, !1387, !1388, !1389}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1318, file: !325, line: 219, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !1323)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !1324)
!1324 = !{!1325}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1323, file: !325, line: 151, baseType: !1326, size: 128)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !1327)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !1328)
!1328 = !{!1329, !1330, !1331}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1327, file: !325, line: 150, baseType: !7, size: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1327, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1327, file: !325, line: 150, baseType: !1332, size: 64, offset: 64)
!1332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1333, size: 64, elements: !817)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !783, line: 108, baseType: !1334)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !1336)
!1336 = !{!1337, !1338, !1339, !1347, !1348, !1349, !1350, !1351, !1352, !1353}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1335, file: !325, line: 124, baseType: !1317, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1335, file: !325, line: 125, baseType: !1317, size: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1335, file: !325, line: 131, baseType: !1340, size: 64, offset: 128)
!1340 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !1341)
!1341 = !{!1342, !1346}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1340, file: !325, line: 129, baseType: !1343, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !783, line: 66, baseType: !1344)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !783, line: 65, flags: DIFlagFwdDecl)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1340, file: !325, line: 130, baseType: !782, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1335, file: !325, line: 134, baseType: !778, size: 64, offset: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1335, file: !325, line: 137, baseType: !898, size: 64, offset: 256)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1335, file: !325, line: 138, baseType: !1018, size: 32, offset: 320)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1335, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1335, file: !325, line: 144, baseType: !774, size: 32, offset: 384)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1335, file: !325, line: 145, baseType: !774, size: 32, offset: 416)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1335, file: !325, line: 146, baseType: !1354, size: 64, offset: 448)
!1354 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !869)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1318, file: !325, line: 220, baseType: !1321, size: 64, offset: 64)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1318, file: !325, line: 223, baseType: !778, size: 64, offset: 128)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1318, file: !325, line: 226, baseType: !1358, size: 64, offset: 192)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !325, line: 185, flags: DIFlagFwdDecl)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1318, file: !325, line: 229, baseType: !1361, size: 128, offset: 256)
!1361 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1362, size: 128, elements: !853)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1318, file: !325, line: 232, baseType: !1317, size: 64, offset: 384)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1318, file: !325, line: 233, baseType: !1317, size: 64, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1318, file: !325, line: 238, baseType: !1367, size: 64, offset: 512)
!1367 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1368)
!1368 = !{!1369, !1375}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1367, file: !325, line: 236, baseType: !1370, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1371, size: 64)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1372)
!1372 = !{!1373, !1374}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1371, file: !325, line: 275, baseType: !1343, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1371, file: !325, line: 278, baseType: !1343, size: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1367, file: !325, line: 237, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1383}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1377, file: !325, line: 261, baseType: !782, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1377, file: !325, line: 262, baseType: !782, size: 64, offset: 64)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1377, file: !325, line: 266, baseType: !782, size: 64, offset: 128)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1377, file: !325, line: 267, baseType: !782, size: 64, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1377, file: !325, line: 270, baseType: !774, size: 32, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1318, file: !325, line: 241, baseType: !1354, size: 64, offset: 576)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1318, file: !325, line: 244, baseType: !774, size: 32, offset: 640)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1318, file: !325, line: 247, baseType: !774, size: 32, offset: 672)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1318, file: !325, line: 250, baseType: !774, size: 32, offset: 704)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1318, file: !325, line: 253, baseType: !774, size: 32, offset: 736)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1318, file: !325, line: 256, baseType: !774, size: 32, offset: 768)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1313, file: !325, line: 378, baseType: !1316, size: 64, offset: 64)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1313, file: !325, line: 381, baseType: !1392, size: 64, offset: 128)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !325, line: 282, baseType: !1394)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !325, line: 282, size: 128, elements: !1395)
!1395 = !{!1396}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1394, file: !325, line: 282, baseType: !1397, size: 128)
!1397 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !325, line: 281, baseType: !1398)
!1398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !325, line: 281, size: 128, elements: !1399)
!1399 = !{!1400, !1401, !1402}
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1398, file: !325, line: 281, baseType: !7, size: 32)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1398, file: !325, line: 281, baseType: !7, size: 32, offset: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1398, file: !325, line: 281, baseType: !1403, size: 64, offset: 64)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1316, size: 64, elements: !817)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1313, file: !325, line: 384, baseType: !774, size: 32, offset: 192)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1313, file: !325, line: 387, baseType: !774, size: 32, offset: 224)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1313, file: !325, line: 390, baseType: !774, size: 32, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1313, file: !325, line: 394, baseType: !1392, size: 64, offset: 320)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1313, file: !325, line: 396, baseType: !324, size: 32, offset: 384)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1313, file: !325, line: 399, baseType: !1410, size: 64, offset: 416)
!1410 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !853)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1313, file: !325, line: 402, baseType: !1412, size: 64, offset: 480)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !853)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1313, file: !325, line: 406, baseType: !774, size: 32, offset: 544)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1313, file: !325, line: 409, baseType: !774, size: 32, offset: 576)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1144, file: !1145, line: 470, baseType: !1344, size: 64, offset: 128)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1144, file: !1145, line: 473, baseType: !1417, size: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1145, line: 166, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1144, file: !1145, line: 476, baseType: !1420, size: 64, offset: 256)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1145, line: 476, flags: DIFlagFwdDecl)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1144, file: !1145, line: 479, baseType: !1228, size: 64, offset: 320)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1144, file: !1145, line: 484, baseType: !898, size: 64, offset: 384)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1144, file: !1145, line: 488, baseType: !898, size: 64, offset: 448)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1144, file: !1145, line: 493, baseType: !898, size: 64, offset: 512)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1144, file: !1145, line: 496, baseType: !898, size: 64, offset: 576)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1144, file: !1145, line: 501, baseType: !1428, size: 64, offset: 640)
!1428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1429, size: 64)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !336, line: 2355, size: 576, elements: !1430)
!1430 = !{!1431, !1434, !1435, !1436, !1437, !1439, !1440, !1445, !1446, !1447, !1448, !1449, !1450}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1429, file: !336, line: 2356, baseType: !1432, size: 64)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !336, line: 2356, flags: DIFlagFwdDecl)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1429, file: !336, line: 2357, baseType: !779, size: 64, offset: 64)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1429, file: !336, line: 2358, baseType: !774, size: 32, offset: 128)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1429, file: !336, line: 2359, baseType: !774, size: 32, offset: 160)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1429, file: !336, line: 2360, baseType: !1438, size: 128, offset: 192)
!1438 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 128, elements: !878)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1429, file: !336, line: 2364, baseType: !774, size: 32, offset: 320)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1429, file: !336, line: 2367, baseType: !1441, size: 128, offset: 384)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !336, line: 2349, size: 128, elements: !1442)
!1442 = !{!1443, !1444}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1441, file: !336, line: 2351, baseType: !782, size: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1441, file: !336, line: 2352, baseType: !869, size: 64, offset: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1429, file: !336, line: 2371, baseType: !335, size: 32, offset: 512)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1429, file: !336, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1429, file: !336, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1429, file: !336, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1429, file: !336, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1429, file: !336, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1144, file: !1145, line: 504, baseType: !1452, size: 64, offset: 704)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1145, line: 504, flags: DIFlagFwdDecl)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1144, file: !1145, line: 507, baseType: !1228, size: 64, offset: 768)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1144, file: !1145, line: 510, baseType: !774, size: 32, offset: 832)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1144, file: !1145, line: 513, baseType: !774, size: 32, offset: 864)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1144, file: !1145, line: 516, baseType: !1018, size: 32, offset: 896)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1144, file: !1145, line: 519, baseType: !1018, size: 32, offset: 928)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1144, file: !1145, line: 522, baseType: !7, size: 32, offset: 960)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1144, file: !1145, line: 523, baseType: !7, size: 32, offset: 992)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1144, file: !1145, line: 528, baseType: !779, size: 64, offset: 1024)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1144, file: !1145, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1144, file: !1145, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1144, file: !1145, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1144, file: !1145, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1144, file: !1145, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1144, file: !1145, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1144, file: !1145, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1144, file: !1145, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1144, file: !1145, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1144, file: !1145, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1144, file: !1145, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1144, file: !1145, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1144, file: !1145, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1144, file: !1145, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1144, file: !1145, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1144, file: !1145, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1139, file: !341, line: 3254, baseType: !898, size: 64, offset: 1536)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1139, file: !341, line: 3257, baseType: !898, size: 64, offset: 1600)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1139, file: !341, line: 3258, baseType: !898, size: 64, offset: 1664)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1139, file: !341, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1139, file: !341, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1139, file: !341, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1139, file: !341, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1139, file: !341, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1139, file: !341, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1139, file: !341, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1139, file: !341, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1139, file: !341, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1139, file: !341, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1139, file: !341, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1139, file: !341, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1139, file: !341, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1139, file: !341, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1139, file: !341, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1139, file: !341, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1139, file: !341, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1139, file: !341, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !900, file: !341, line: 3394, baseType: !1500, size: 1344)
!1500 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !341, line: 2279, size: 1344, elements: !1501)
!1501 = !{!1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1527, !1528, !1529, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545}
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1500, file: !341, line: 2280, baseType: !936, size: 192)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1500, file: !341, line: 2281, baseType: !898, size: 64, offset: 192)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1500, file: !341, line: 2282, baseType: !898, size: 64, offset: 256)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1500, file: !341, line: 2283, baseType: !898, size: 64, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1500, file: !341, line: 2284, baseType: !898, size: 64, offset: 384)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1500, file: !341, line: 2285, baseType: !7, size: 32, offset: 448)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1500, file: !341, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1500, file: !341, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1500, file: !341, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1500, file: !341, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1500, file: !341, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1500, file: !341, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1500, file: !341, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1500, file: !341, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1500, file: !341, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1500, file: !341, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1500, file: !341, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1500, file: !341, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1500, file: !341, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1500, file: !341, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1500, file: !341, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1500, file: !341, line: 2305, baseType: !7, size: 32, offset: 512)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1500, file: !341, line: 2306, baseType: !1525, size: 32, offset: 544)
