; ModuleID = 'lto-streamer-out.bc'
source_filename = "lto-streamer-out.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ipa_opt_pass_d = type { %struct.opt_pass, void ()*, void (%struct.cgraph_node_set_def*)*, void ()*, void (%struct.cgraph_node*)*, void (%struct.cgraph_node*, %union.gimple_statement_d**)*, i32, i32 (%struct.cgraph_node*)*, void (%struct.varpool_node*)* }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.cgraph_node_set_def = type { %struct.htab*, %struct.VEC_cgraph_node_ptr_gc*, i8* }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_cgraph_node_ptr_gc = type { %struct.VEC_cgraph_node_ptr_base }
%struct.VEC_cgraph_node_ptr_base = type { i32, i32, [1 x %struct.cgraph_node*] }

!663 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!664 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!665 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!666 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!667 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!668 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!669 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!670 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!671 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!672 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !634, line: 727, baseType: !7, size: 32, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!674 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!675 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!676 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!677 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!678 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!679 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!680 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!681 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!682 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!683 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!684 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!685 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!686 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!687 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!688 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!689 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!690 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!691 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!692 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!693 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!694 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!695 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!696 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!697 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!698 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 272, baseType: !7, size: 32, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707}
!700 = !DIEnumerator(name: "LTO_DECL_STREAM_TYPE", value: 0, isUnsigned: true)
!701 = !DIEnumerator(name: "LTO_DECL_STREAM_FIELD_DECL", value: 1, isUnsigned: true)
!702 = !DIEnumerator(name: "LTO_DECL_STREAM_FN_DECL", value: 2, isUnsigned: true)
!703 = !DIEnumerator(name: "LTO_DECL_STREAM_VAR_DECL", value: 3, isUnsigned: true)
!704 = !DIEnumerator(name: "LTO_DECL_STREAM_TYPE_DECL", value: 4, isUnsigned: true)
!705 = !DIEnumerator(name: "LTO_DECL_STREAM_NAMESPACE_DECL", value: 5, isUnsigned: true)
!706 = !DIEnumerator(name: "LTO_DECL_STREAM_LABEL_DECL", value: 6, isUnsigned: true)
!707 = !DIEnumerator(name: "LTO_N_DECL_STREAMS", value: 7, isUnsigned: true)
!708 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gcc_plugin_symbol_kind", file: !709, line: 24, baseType: !7, size: 32, elements: !710)
!709 = !DIFile(filename: "./include/lto-symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!710 = !{!711, !712, !713, !714, !715}
!711 = !DIEnumerator(name: "GCCPK_DEF", value: 0, isUnsigned: true)
!712 = !DIEnumerator(name: "GCCPK_WEAKDEF", value: 1, isUnsigned: true)
!713 = !DIEnumerator(name: "GCCPK_UNDEF", value: 2, isUnsigned: true)
!714 = !DIEnumerator(name: "GCCPK_WEAKUNDEF", value: 3, isUnsigned: true)
!715 = !DIEnumerator(name: "GCCPK_COMMON", value: 4, isUnsigned: true)
!716 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gcc_plugin_symbol_visibility", file: !709, line: 33, baseType: !7, size: 32, elements: !717)
!717 = !{!718, !719, !720, !721}
!718 = !DIEnumerator(name: "GCCPV_DEFAULT", value: 0, isUnsigned: true)
!719 = !DIEnumerator(name: "GCCPV_PROTECTED", value: 1, isUnsigned: true)
!720 = !DIEnumerator(name: "GCCPV_INTERNAL", value: 2, isUnsigned: true)
!721 = !DIEnumerator(name: "GCCPV_HIDDEN", value: 3, isUnsigned: true)
!722 = !{!723, !724, !725, !726, !729, !730, !732, !2409, !811, !148, !2450, !755, !2457, !756, !2458, !604, !7, !937, !727, !2459, !773, !1528, !1602, !1628, !1135, !2460, !1169, !799, !2462}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!725 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !728)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !733, size: 64)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "output_block", file: !6, line: 625, size: 704, elements: !734)
!734 = !{!735, !736, !2408, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "section_type", scope: !733, file: !6, line: 627, baseType: !5, size: 32)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "decl_state", scope: !733, file: !6, line: 628, baseType: !737, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_out_decl_state", file: !6, line: 517, size: 1472, elements: !739)
!739 = !{!740, !2147, !2407}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !738, file: !6, line: 521, baseType: !741, size: 1344)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 1344, elements: !2145)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_tree_ref_encoder", file: !6, line: 493, size: 192, elements: !743)
!743 = !{!744, !797, !798}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "tree_hash_table", scope: !742, file: !6, line: 495, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !746, line: 144, baseType: !747)
!746 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !746, line: 100, size: 896, elements: !749)
!749 = !{!750, !758, !763, !768, !770, !774, !775, !776, !777, !778, !783, !785, !786, !791, !796}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !748, file: !746, line: 102, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !746, line: 52, baseType: !752)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !746, line: 47, baseType: !7)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !748, file: !746, line: 105, baseType: !759, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !746, line: 59, baseType: !760)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DISubroutineType(types: !762)
!762 = !{!725, !756, !756}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !748, file: !746, line: 108, baseType: !764, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !746, line: 63, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !729}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !748, file: !746, line: 111, baseType: !769, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !748, file: !746, line: 114, baseType: !771, size: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !772, line: 46, baseType: !773)
!772 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!773 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !748, file: !746, line: 117, baseType: !771, size: 64, offset: 320)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !748, file: !746, line: 120, baseType: !771, size: 64, offset: 384)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !748, file: !746, line: 124, baseType: !7, size: 32, offset: 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !748, file: !746, line: 128, baseType: !7, size: 32, offset: 480)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !748, file: !746, line: 131, baseType: !779, size: 64, offset: 512)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !746, line: 75, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DISubroutineType(types: !782)
!782 = !{!729, !771, !771}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !748, file: !746, line: 132, baseType: !784, size: 64, offset: 576)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !746, line: 78, baseType: !765)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !748, file: !746, line: 135, baseType: !729, size: 64, offset: 640)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !748, file: !746, line: 136, baseType: !787, size: 64, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !746, line: 82, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DISubroutineType(types: !790)
!790 = !{!729, !729, !771, !771}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !748, file: !746, line: 137, baseType: !792, size: 64, offset: 768)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !746, line: 83, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DISubroutineType(types: !795)
!795 = !{null, !729, !729}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !748, file: !746, line: 141, baseType: !7, size: 32, offset: 832)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "next_index", scope: !742, file: !6, line: 496, baseType: !7, size: 32, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "trees", scope: !742, file: !6, line: 497, baseType: !799, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_heap", file: !149, line: 184, baseType: !801)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_heap", file: !149, line: 184, size: 128, elements: !802)
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !801, file: !149, line: 184, baseType: !804, size: 128)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !805, file: !149, line: 182, baseType: !7, size: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !805, file: !149, line: 182, baseType: !7, size: 32, offset: 32)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !805, file: !149, line: 182, baseType: !810, size: 64, offset: 64)
!810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !811, size: 64, elements: !909)
!811 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !812, line: 56, baseType: !813)
!812 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !815)
!815 = !{!816, !849, !855, !867, !886, !897, !902, !911, !917, !930, !942, !980, !1435, !1463, !1480, !1481, !1486, !1495, !1501, !1506, !1510, !1514, !1796, !1843, !1849, !1855, !1862, !1875, !1889, !1906, !1918, !1940, !1955, !2127}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !814, file: !149, line: 3372, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !817, file: !149, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !817, file: !149, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !817, file: !149, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !817, file: !149, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !817, file: !149, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !817, file: !149, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !817, file: !149, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !817, file: !149, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !817, file: !149, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !817, file: !149, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !817, file: !149, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !817, file: !149, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !817, file: !149, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !817, file: !149, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !817, file: !149, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !817, file: !149, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !817, file: !149, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !817, file: !149, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !817, file: !149, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !817, file: !149, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !817, file: !149, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !817, file: !149, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !817, file: !149, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !817, file: !149, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !817, file: !149, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !817, file: !149, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !817, file: !149, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !817, file: !149, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !817, file: !149, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !817, file: !149, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !149, line: 3373, baseType: !850, size: 192)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !850, file: !149, line: 403, baseType: !817, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !850, file: !149, line: 404, baseType: !811, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !850, file: !149, line: 405, baseType: !811, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !814, file: !149, line: 3374, baseType: !856, size: 320)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !856, file: !149, line: 1385, baseType: !850, size: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !856, file: !149, line: 1386, baseType: !860, size: 128, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !861, line: 58, baseType: !862)
!861 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !861, line: 54, size: 128, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !862, file: !861, line: 56, baseType: !773, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !862, file: !861, line: 57, baseType: !866, size: 64, offset: 64)
!866 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !814, file: !149, line: 3375, baseType: !868, size: 256)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !868, file: !149, line: 1398, baseType: !850, size: 192)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !868, file: !149, line: 1399, baseType: !872, size: 64, offset: 192)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !874, line: 52, size: 256, elements: !875)
!874 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!875 = !{!876, !877, !878, !879, !880, !881, !882}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !873, file: !874, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !873, file: !874, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !873, file: !874, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !873, file: !874, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !873, file: !874, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !873, file: !874, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !873, file: !874, line: 62, baseType: !883, size: 192, offset: 64)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 192, elements: !884)
!884 = !{!885}
!885 = !DISubrange(count: 3)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !814, file: !149, line: 3376, baseType: !887, size: 256)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !149, line: 1409, baseType: !850, size: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !887, file: !149, line: 1410, baseType: !891, size: 64, offset: 192)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !893, line: 27, size: 192, elements: !894)
!893 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !892, file: !893, line: 29, baseType: !860, size: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !892, file: !893, line: 30, baseType: !20, size: 32, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !814, file: !149, line: 3377, baseType: !898, size: 256)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !899)
!899 = !{!900, !901}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !149, line: 1438, baseType: !850, size: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !898, file: !149, line: 1439, baseType: !811, size: 64, offset: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !814, file: !149, line: 3378, baseType: !903, size: 256)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !903, file: !149, line: 1419, baseType: !850, size: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !903, file: !149, line: 1420, baseType: !725, size: 32, offset: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !903, file: !149, line: 1421, baseType: !908, size: 8, offset: 224)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 8, elements: !909)
!909 = !{!910}
!910 = !DISubrange(count: 1)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !814, file: !149, line: 3379, baseType: !912, size: 320)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !913)
!913 = !{!914, !915, !916}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !912, file: !149, line: 1429, baseType: !850, size: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !912, file: !149, line: 1430, baseType: !811, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !912, file: !149, line: 1431, baseType: !811, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !814, file: !149, line: 3380, baseType: !918, size: 320)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !149, line: 1461, baseType: !850, size: 192)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !918, file: !149, line: 1462, baseType: !922, size: 128, offset: 192)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !923, line: 31, size: 128, elements: !924)
!923 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!924 = !{!925, !928, !929}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !922, file: !923, line: 32, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !724)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !922, file: !923, line: 33, baseType: !7, size: 32, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !922, file: !923, line: 34, baseType: !7, size: 32, offset: 96)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !814, file: !149, line: 3381, baseType: !931, size: 384)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !932)
!932 = !{!933, !934, !939, !940, !941}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !931, file: !149, line: 2508, baseType: !850, size: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !931, file: !149, line: 2509, baseType: !935, size: 32, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !936, line: 58, baseType: !937)
!936 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !938, line: 44, baseType: !7)
!938 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!939 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !931, file: !149, line: 2510, baseType: !7, size: 32, offset: 224)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !931, file: !149, line: 2511, baseType: !811, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !931, file: !149, line: 2512, baseType: !811, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !814, file: !149, line: 3382, baseType: !943, size: 896)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !944)
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !943, file: !149, line: 2653, baseType: !931, size: 384)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !943, file: !149, line: 2654, baseType: !811, size: 64, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !943, file: !149, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !943, file: !149, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !943, file: !149, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !943, file: !149, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !943, file: !149, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !943, file: !149, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !943, file: !149, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !943, file: !149, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !943, file: !149, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !943, file: !149, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !943, file: !149, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !943, file: !149, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !943, file: !149, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !943, file: !149, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !943, file: !149, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !943, file: !149, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !943, file: !149, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !943, file: !149, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !943, file: !149, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !943, file: !149, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !943, file: !149, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !943, file: !149, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !943, file: !149, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !943, file: !149, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !943, file: !149, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !943, file: !149, line: 2703, baseType: !7, size: 32, offset: 512)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !943, file: !149, line: 2705, baseType: !811, size: 64, offset: 576)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !943, file: !149, line: 2706, baseType: !811, size: 64, offset: 640)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !943, file: !149, line: 2707, baseType: !811, size: 64, offset: 704)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !943, file: !149, line: 2708, baseType: !811, size: 64, offset: 768)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !943, file: !149, line: 2711, baseType: !978, size: 64, offset: 832)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !814, file: !149, line: 3383, baseType: !981, size: 960)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !981, file: !149, line: 2757, baseType: !943, size: 896)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !981, file: !149, line: 2758, baseType: !985, size: 64, offset: 896)
!985 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !812, line: 50, baseType: !986)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !988, line: 240, size: 384, elements: !989)
!988 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!989 = !{!990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !987, file: !988, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !987, file: !988, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !987, file: !988, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !987, file: !988, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !987, file: !988, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !987, file: !988, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !987, file: !988, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !987, file: !988, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !987, file: !988, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !987, file: !988, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !987, file: !988, line: 321, baseType: !1001, size: 320, offset: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !988, line: 315, size: 320, elements: !1002)
!1002 = !{!1003, !1402, !1404, !1433, !1434}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1001, file: !988, line: 316, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 64, elements: !909)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !988, line: 183, baseType: !1006)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !988, line: 166, size: 64, elements: !1007)
!1007 = !{!1008, !1009, !1010, !1011, !1012, !1020, !1021, !1033, !1036, !1096, !1097, !1379, !1392, !1399}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1006, file: !988, line: 168, baseType: !725, size: 32)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1006, file: !988, line: 169, baseType: !7, size: 32)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1006, file: !988, line: 170, baseType: !730, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1006, file: !988, line: 171, baseType: !985, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1006, file: !988, line: 172, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !812, line: 53, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !988, line: 359, size: 128, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1015, file: !988, line: 360, baseType: !725, size: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1015, file: !988, line: 361, baseType: !1019, size: 64, offset: 64)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 64, elements: !909)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1006, file: !988, line: 173, baseType: !20, size: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1006, file: !988, line: 174, baseType: !1022, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !988, line: 133, baseType: !1023)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !988, line: 115, size: 32, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1023, file: !988, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1023, file: !988, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1023, file: !988, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1023, file: !988, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1023, file: !988, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1023, file: !988, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1023, file: !988, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1023, file: !988, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1006, file: !988, line: 175, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !988, line: 175, flags: DIFlagFwdDecl)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1006, file: !988, line: 176, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1039, line: 75, size: 256, elements: !1040)
!1039 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1040 = !{!1041, !1055, !1056, !1057}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1038, file: !1039, line: 76, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1043, size: 64)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1039, line: 68, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1039, line: 63, size: 320, elements: !1045)
!1045 = !{!1046, !1048, !1049, !1050}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1044, file: !1039, line: 64, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1044, file: !1039, line: 65, baseType: !1047, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1044, file: !1039, line: 66, baseType: !7, size: 32, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1044, file: !1039, line: 67, baseType: !1051, size: 128, offset: 192)
!1051 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1052, size: 128, elements: !1053)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1039, line: 29, baseType: !773)
!1053 = !{!1054}
!1054 = !DISubrange(count: 2)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1038, file: !1039, line: 77, baseType: !1042, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1038, file: !1039, line: 78, baseType: !7, size: 32, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1038, file: !1039, line: 79, baseType: !1058, size: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1039, line: 49, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1039, line: 45, size: 832, elements: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1060, file: !1039, line: 46, baseType: !1047, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1060, file: !1039, line: 47, baseType: !1037, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1060, file: !1039, line: 48, baseType: !1065, size: 704, offset: 128)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1066, line: 164, size: 704, elements: !1067)
!1066 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1067 = !{!1068, !1069, !1079, !1080, !1081, !1082, !1083, !1084, !1088, !1092, !1093, !1094, !1095}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1065, file: !1066, line: 166, baseType: !866, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1065, file: !1066, line: 167, baseType: !1070, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1066, line: 157, size: 192, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1071, file: !1066, line: 159, baseType: !727, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1071, file: !1066, line: 160, baseType: !1070, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1071, file: !1066, line: 161, baseType: !1076, size: 32, offset: 128)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 32, elements: !1077)
!1077 = !{!1078}
!1078 = !DISubrange(count: 4)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1065, file: !1066, line: 168, baseType: !727, size: 64, offset: 128)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1065, file: !1066, line: 169, baseType: !727, size: 64, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1065, file: !1066, line: 170, baseType: !727, size: 64, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1065, file: !1066, line: 171, baseType: !866, size: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1065, file: !1066, line: 172, baseType: !725, size: 32, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1065, file: !1066, line: 176, baseType: !1085, size: 64, offset: 448)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!1070, !729, !866}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1065, file: !1066, line: 177, baseType: !1089, size: 64, offset: 512)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !729, !1070}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1065, file: !1066, line: 178, baseType: !729, size: 64, offset: 576)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1065, file: !1066, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1065, file: !1066, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1065, file: !1066, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1006, file: !988, line: 177, baseType: !811, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1006, file: !988, line: 178, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !351, line: 217, size: 832, elements: !1100)
!1100 = !{!1101, !1344, !1345, !1346, !1349, !1353, !1354, !1355, !1373, !1374, !1375, !1376, !1377, !1378}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1099, file: !351, line: 219, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !351, line: 151, baseType: !1104)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !351, line: 151, size: 128, elements: !1105)
!1105 = !{!1106}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1104, file: !351, line: 151, baseType: !1107, size: 128)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !351, line: 150, baseType: !1108)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !351, line: 150, size: 128, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1108, file: !351, line: 150, baseType: !7, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1108, file: !351, line: 150, baseType: !7, size: 32, offset: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1108, file: !351, line: 150, baseType: !1113, size: 64, offset: 64)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 64, elements: !909)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !812, line: 108, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !351, line: 122, size: 512, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1336, !1337, !1338, !1339, !1340, !1341, !1342}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1116, file: !351, line: 124, baseType: !1098, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1116, file: !351, line: 125, baseType: !1098, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1116, file: !351, line: 131, baseType: !1121, size: 64, offset: 128)
!1121 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !351, line: 128, size: 64, elements: !1122)
!1122 = !{!1123, !1335}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1121, file: !351, line: 129, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !812, line: 66, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !634, line: 143, size: 192, elements: !1127)
!1127 = !{!1128, !1333, !1334}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1126, file: !634, line: 145, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !812, line: 69, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !634, line: 136, size: 192, elements: !1132)
!1132 = !{!1133, !1331, !1332}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1131, file: !634, line: 137, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !812, line: 58, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !634, line: 737, size: 768, elements: !1137)
!1137 = !{!1138, !1155, !1188, !1194, !1199, !1204, !1211, !1217, !1223, !1228, !1242, !1247, !1253, !1258, !1268, !1273, !1289, !1296, !1303, !1309, !1314, !1320, !1326}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1136, file: !634, line: 738, baseType: !1139, size: 256)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !634, line: 271, size: 256, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1139, file: !634, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1139, file: !634, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1139, file: !634, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1139, file: !634, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1139, file: !634, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1139, file: !634, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1139, file: !634, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1139, file: !634, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1139, file: !634, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1139, file: !634, line: 312, baseType: !7, size: 32, offset: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1139, file: !634, line: 316, baseType: !935, size: 32, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1139, file: !634, line: 319, baseType: !7, size: 32, offset: 96)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1139, file: !634, line: 323, baseType: !1098, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1139, file: !634, line: 327, baseType: !811, size: 64, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1136, file: !634, line: 739, baseType: !1156, size: 448)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !634, line: 350, size: 448, elements: !1157)
!1157 = !{!1158, !1187}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1156, file: !634, line: 353, baseType: !1159, size: 384)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !634, line: 333, size: 384, elements: !1160)
!1160 = !{!1161, !1162, !1170}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1159, file: !634, line: 336, baseType: !1139, size: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1159, file: !634, line: 343, baseType: !1163, size: 64, offset: 256)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1165, line: 37, size: 128, elements: !1166)
!1165 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1166 = !{!1167, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1164, file: !1165, line: 39, baseType: !1163, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1164, file: !1165, line: 40, baseType: !1169, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1159, file: !634, line: 344, baseType: !1171, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1165, line: 45, size: 320, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1172, file: !1165, line: 47, baseType: !1171, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1172, file: !1165, line: 48, baseType: !1176, size: 256, offset: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1177)
!1177 = !{!1178, !1180, !1181, !1186}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1176, file: !149, line: 1884, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1176, file: !149, line: 1885, baseType: !1179, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1176, file: !149, line: 1891, baseType: !1182, size: 64, offset: 128)
!1182 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1176, file: !149, line: 1891, size: 64, elements: !1183)
!1183 = !{!1184, !1185}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1182, file: !149, line: 1891, baseType: !1134, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1182, file: !149, line: 1891, baseType: !811, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1176, file: !149, line: 1892, baseType: !1169, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1156, file: !634, line: 359, baseType: !810, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1136, file: !634, line: 740, baseType: !1189, size: 512)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !634, line: 365, size: 512, elements: !1190)
!1190 = !{!1191, !1192, !1193}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1189, file: !634, line: 368, baseType: !1159, size: 384)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1189, file: !634, line: 373, baseType: !811, size: 64, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1189, file: !634, line: 374, baseType: !811, size: 64, offset: 448)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1136, file: !634, line: 741, baseType: !1195, size: 576)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !634, line: 380, size: 576, elements: !1196)
!1196 = !{!1197, !1198}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1195, file: !634, line: 383, baseType: !1189, size: 512)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1195, file: !634, line: 389, baseType: !810, size: 64, offset: 512)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1136, file: !634, line: 742, baseType: !1200, size: 320)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !634, line: 395, size: 320, elements: !1201)
!1201 = !{!1202, !1203}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1200, file: !634, line: 397, baseType: !1139, size: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1200, file: !634, line: 400, baseType: !1124, size: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1136, file: !634, line: 743, baseType: !1205, size: 448)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !634, line: 406, size: 448, elements: !1206)
!1206 = !{!1207, !1208, !1209, !1210}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1205, file: !634, line: 408, baseType: !1139, size: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1205, file: !634, line: 412, baseType: !811, size: 64, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1205, file: !634, line: 420, baseType: !811, size: 64, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1205, file: !634, line: 423, baseType: !1124, size: 64, offset: 384)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1136, file: !634, line: 744, baseType: !1212, size: 384)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !634, line: 429, size: 384, elements: !1213)
!1213 = !{!1214, !1215, !1216}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1212, file: !634, line: 431, baseType: !1139, size: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1212, file: !634, line: 434, baseType: !811, size: 64, offset: 256)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1212, file: !634, line: 437, baseType: !1124, size: 64, offset: 320)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1136, file: !634, line: 745, baseType: !1218, size: 384)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !634, line: 443, size: 384, elements: !1219)
!1219 = !{!1220, !1221, !1222}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1218, file: !634, line: 445, baseType: !1139, size: 256)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1218, file: !634, line: 449, baseType: !811, size: 64, offset: 256)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1218, file: !634, line: 453, baseType: !1124, size: 64, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1136, file: !634, line: 746, baseType: !1224, size: 320)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !634, line: 459, size: 320, elements: !1225)
!1225 = !{!1226, !1227}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1224, file: !634, line: 461, baseType: !1139, size: 256)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1224, file: !634, line: 464, baseType: !811, size: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1136, file: !634, line: 747, baseType: !1229, size: 768)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !634, line: 469, size: 768, elements: !1230)
!1230 = !{!1231, !1232, !1233, !1234, !1235}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1229, file: !634, line: 471, baseType: !1139, size: 256)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1229, file: !634, line: 474, baseType: !7, size: 32, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1229, file: !634, line: 475, baseType: !7, size: 32, offset: 288)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1229, file: !634, line: 478, baseType: !811, size: 64, offset: 320)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1229, file: !634, line: 481, baseType: !1236, size: 384, offset: 384)
!1236 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1237, size: 384, elements: !909)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !149, line: 1917, size: 384, elements: !1238)
!1238 = !{!1239, !1240, !1241}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1237, file: !149, line: 1920, baseType: !1176, size: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1237, file: !149, line: 1921, baseType: !811, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1237, file: !149, line: 1922, baseType: !935, size: 32, offset: 320)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1136, file: !634, line: 748, baseType: !1243, size: 320)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !634, line: 487, size: 320, elements: !1244)
!1244 = !{!1245, !1246}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1243, file: !634, line: 490, baseType: !1139, size: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1243, file: !634, line: 494, baseType: !725, size: 32, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1136, file: !634, line: 749, baseType: !1248, size: 384)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !634, line: 500, size: 384, elements: !1249)
!1249 = !{!1250, !1251, !1252}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1248, file: !634, line: 502, baseType: !1139, size: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1248, file: !634, line: 506, baseType: !1124, size: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1248, file: !634, line: 510, baseType: !1124, size: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1136, file: !634, line: 750, baseType: !1254, size: 320)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !634, line: 529, size: 320, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1254, file: !634, line: 531, baseType: !1139, size: 256)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1254, file: !634, line: 540, baseType: !1124, size: 64, offset: 256)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1136, file: !634, line: 751, baseType: !1259, size: 704)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !634, line: 546, size: 704, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264, !1265, !1266, !1267}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1259, file: !634, line: 549, baseType: !1189, size: 512)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1259, file: !634, line: 553, baseType: !730, size: 64, offset: 512)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1259, file: !634, line: 557, baseType: !724, size: 8, offset: 576)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1259, file: !634, line: 558, baseType: !724, size: 8, offset: 584)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1259, file: !634, line: 559, baseType: !724, size: 8, offset: 592)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1259, file: !634, line: 560, baseType: !724, size: 8, offset: 600)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1259, file: !634, line: 566, baseType: !810, size: 64, offset: 640)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1136, file: !634, line: 752, baseType: !1269, size: 384)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !634, line: 571, size: 384, elements: !1270)
!1270 = !{!1271, !1272}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1269, file: !634, line: 573, baseType: !1200, size: 320)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1269, file: !634, line: 577, baseType: !811, size: 64, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1136, file: !634, line: 753, baseType: !1274, size: 576)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !634, line: 600, size: 576, elements: !1275)
!1275 = !{!1276, !1277, !1278, !1279, !1288}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1274, file: !634, line: 602, baseType: !1200, size: 320)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1274, file: !634, line: 605, baseType: !811, size: 64, offset: 320)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1274, file: !634, line: 609, baseType: !771, size: 64, offset: 384)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1274, file: !634, line: 612, baseType: !1280, size: 64, offset: 448)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !634, line: 581, size: 320, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286, !1287}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1281, file: !634, line: 583, baseType: !148, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1281, file: !634, line: 586, baseType: !811, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1281, file: !634, line: 589, baseType: !811, size: 64, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1281, file: !634, line: 592, baseType: !811, size: 64, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1281, file: !634, line: 595, baseType: !811, size: 64, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1274, file: !634, line: 616, baseType: !1124, size: 64, offset: 512)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1136, file: !634, line: 754, baseType: !1290, size: 512)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !634, line: 622, size: 512, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1290, file: !634, line: 624, baseType: !1200, size: 320)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1290, file: !634, line: 628, baseType: !811, size: 64, offset: 320)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1290, file: !634, line: 632, baseType: !811, size: 64, offset: 384)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1290, file: !634, line: 636, baseType: !811, size: 64, offset: 448)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1136, file: !634, line: 755, baseType: !1297, size: 704)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !634, line: 642, size: 704, elements: !1298)
!1298 = !{!1299, !1300, !1301, !1302}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1297, file: !634, line: 644, baseType: !1290, size: 512)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1297, file: !634, line: 648, baseType: !811, size: 64, offset: 512)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1297, file: !634, line: 652, baseType: !811, size: 64, offset: 576)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1297, file: !634, line: 653, baseType: !811, size: 64, offset: 640)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1136, file: !634, line: 756, baseType: !1304, size: 448)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !634, line: 663, size: 448, elements: !1305)
!1305 = !{!1306, !1307, !1308}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1304, file: !634, line: 665, baseType: !1200, size: 320)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1304, file: !634, line: 668, baseType: !811, size: 64, offset: 320)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1304, file: !634, line: 673, baseType: !811, size: 64, offset: 384)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1136, file: !634, line: 757, baseType: !1310, size: 384)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !634, line: 694, size: 384, elements: !1311)
!1311 = !{!1312, !1313}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1310, file: !634, line: 696, baseType: !1200, size: 320)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1310, file: !634, line: 699, baseType: !811, size: 64, offset: 320)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1136, file: !634, line: 758, baseType: !1315, size: 384)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !634, line: 681, size: 384, elements: !1316)
!1316 = !{!1317, !1318, !1319}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1315, file: !634, line: 683, baseType: !1139, size: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1315, file: !634, line: 686, baseType: !811, size: 64, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1315, file: !634, line: 689, baseType: !811, size: 64, offset: 320)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1136, file: !634, line: 759, baseType: !1321, size: 384)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !634, line: 707, size: 384, elements: !1322)
!1322 = !{!1323, !1324, !1325}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1321, file: !634, line: 709, baseType: !1139, size: 256)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1321, file: !634, line: 712, baseType: !811, size: 64, offset: 256)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1321, file: !634, line: 712, baseType: !811, size: 64, offset: 320)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1136, file: !634, line: 760, baseType: !1327, size: 320)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !634, line: 718, size: 320, elements: !1328)
!1328 = !{!1329, !1330}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1327, file: !634, line: 720, baseType: !1139, size: 256)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1327, file: !634, line: 723, baseType: !811, size: 64, offset: 256)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1131, file: !634, line: 138, baseType: !1130, size: 64, offset: 64)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1131, file: !634, line: 139, baseType: !1130, size: 64, offset: 128)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1126, file: !634, line: 146, baseType: !1129, size: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1126, file: !634, line: 152, baseType: !1124, size: 64, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1121, file: !351, line: 130, baseType: !985, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1116, file: !351, line: 134, baseType: !729, size: 64, offset: 192)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1116, file: !351, line: 137, baseType: !811, size: 64, offset: 256)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1116, file: !351, line: 138, baseType: !935, size: 32, offset: 320)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1116, file: !351, line: 142, baseType: !7, size: 32, offset: 352)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1116, file: !351, line: 144, baseType: !725, size: 32, offset: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1116, file: !351, line: 145, baseType: !725, size: 32, offset: 416)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1116, file: !351, line: 146, baseType: !1343, size: 64, offset: 448)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !351, line: 119, baseType: !866)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1099, file: !351, line: 220, baseType: !1102, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1099, file: !351, line: 223, baseType: !729, size: 64, offset: 128)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1099, file: !351, line: 226, baseType: !1347, size: 64, offset: 192)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !351, line: 185, flags: DIFlagFwdDecl)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1099, file: !351, line: 229, baseType: !1350, size: 128, offset: 256)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1351, size: 128, elements: !1053)
!1351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1352, size: 64)
!1352 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !351, line: 229, flags: DIFlagFwdDecl)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1099, file: !351, line: 232, baseType: !1098, size: 64, offset: 384)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1099, file: !351, line: 233, baseType: !1098, size: 64, offset: 448)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1099, file: !351, line: 238, baseType: !1356, size: 64, offset: 512)
!1356 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !351, line: 235, size: 64, elements: !1357)
!1357 = !{!1358, !1364}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1356, file: !351, line: 236, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1360, size: 64)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !351, line: 273, size: 128, elements: !1361)
!1361 = !{!1362, !1363}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1360, file: !351, line: 275, baseType: !1124, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1360, file: !351, line: 278, baseType: !1124, size: 64, offset: 64)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1356, file: !351, line: 237, baseType: !1365, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !351, line: 259, size: 320, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1372}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1366, file: !351, line: 261, baseType: !985, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1366, file: !351, line: 262, baseType: !985, size: 64, offset: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1366, file: !351, line: 266, baseType: !985, size: 64, offset: 128)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1366, file: !351, line: 267, baseType: !985, size: 64, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1366, file: !351, line: 270, baseType: !725, size: 32, offset: 256)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1099, file: !351, line: 241, baseType: !1343, size: 64, offset: 576)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1099, file: !351, line: 244, baseType: !725, size: 32, offset: 640)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1099, file: !351, line: 247, baseType: !725, size: 32, offset: 672)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1099, file: !351, line: 250, baseType: !725, size: 32, offset: 704)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1099, file: !351, line: 253, baseType: !725, size: 32, offset: 736)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1099, file: !351, line: 256, baseType: !725, size: 32, offset: 768)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1006, file: !988, line: 179, baseType: !1380, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !988, line: 150, baseType: !1382)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !988, line: 142, size: 320, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1390, !1391}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1382, file: !988, line: 144, baseType: !811, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1382, file: !988, line: 145, baseType: !985, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1382, file: !988, line: 146, baseType: !985, size: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1382, file: !988, line: 147, baseType: !1388, size: 32, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1389, line: 31, baseType: !725)
!1389 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1382, file: !988, line: 148, baseType: !7, size: 32, offset: 224)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1382, file: !988, line: 149, baseType: !724, size: 8, offset: 256)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1006, file: !988, line: 180, baseType: !1393, size: 64)
!1393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1394, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !988, line: 162, baseType: !1395)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !988, line: 159, size: 128, elements: !1396)
!1396 = !{!1397, !1398}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1395, file: !988, line: 160, baseType: !811, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1395, file: !988, line: 161, baseType: !866, size: 64, offset: 64)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1006, file: !988, line: 181, baseType: !1400, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1401, size: 64)
!1401 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !988, line: 181, flags: DIFlagFwdDecl)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1001, file: !988, line: 317, baseType: !1403, size: 64)
!1403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !866, size: 64, elements: !909)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1001, file: !988, line: 318, baseType: !1405, size: 320)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !988, line: 188, size: 320, elements: !1406)
!1406 = !{!1407, !1409, !1432}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1405, file: !988, line: 190, baseType: !1408, size: 192)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1005, size: 192, elements: !884)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1405, file: !988, line: 193, baseType: !1410, size: 64, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !988, line: 206, size: 320, elements: !1412)
!1412 = !{!1413, !1417, !1418, !1419, !1431}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1411, file: !988, line: 208, baseType: !1414, size: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !812, line: 62, baseType: !1416)
!1416 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !812, line: 61, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1411, file: !988, line: 211, baseType: !7, size: 32, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1411, file: !988, line: 214, baseType: !866, size: 64, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1411, file: !988, line: 224, baseType: !1420, size: 64, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !988, line: 202, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !988, line: 202, size: 128, elements: !1423)
!1423 = !{!1424}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1422, file: !988, line: 202, baseType: !1425, size: 128)
!1425 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !988, line: 200, baseType: !1426)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !988, line: 200, size: 128, elements: !1427)
!1427 = !{!1428, !1429, !1430}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1426, file: !988, line: 200, baseType: !7, size: 32)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1426, file: !988, line: 200, baseType: !7, size: 32, offset: 32)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1426, file: !988, line: 200, baseType: !1019, size: 64, offset: 64)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1411, file: !988, line: 234, baseType: !1420, size: 64, offset: 256)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1405, file: !988, line: 197, baseType: !866, size: 64, offset: 256)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1001, file: !988, line: 319, baseType: !873, size: 256)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1001, file: !988, line: 320, baseType: !892, size: 192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !814, file: !149, line: 3384, baseType: !1436, size: 1472)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !1437)
!1437 = !{!1438, !1459, !1460, !1461, !1462}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1436, file: !149, line: 3115, baseType: !1439, size: 1216)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !1440)
!1440 = !{!1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1439, file: !149, line: 2985, baseType: !981, size: 960)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1439, file: !149, line: 2986, baseType: !811, size: 64, offset: 960)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1439, file: !149, line: 2987, baseType: !811, size: 64, offset: 1024)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1439, file: !149, line: 2988, baseType: !811, size: 64, offset: 1088)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1439, file: !149, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1439, file: !149, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1439, file: !149, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1439, file: !149, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1439, file: !149, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1439, file: !149, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1439, file: !149, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1439, file: !149, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1439, file: !149, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1439, file: !149, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1439, file: !149, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1439, file: !149, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1439, file: !149, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1439, file: !149, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1436, file: !149, line: 3117, baseType: !811, size: 64, offset: 1216)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1436, file: !149, line: 3119, baseType: !811, size: 64, offset: 1280)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1436, file: !149, line: 3121, baseType: !811, size: 64, offset: 1344)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1436, file: !149, line: 3123, baseType: !811, size: 64, offset: 1408)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !814, file: !149, line: 3385, baseType: !1464, size: 1088)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !1465)
!1465 = !{!1466, !1467, !1468}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1464, file: !149, line: 2875, baseType: !981, size: 960)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1464, file: !149, line: 2876, baseType: !985, size: 64, offset: 960)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1464, file: !149, line: 2877, baseType: !1469, size: 64, offset: 1024)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64)
!1470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1471, line: 172, size: 128, elements: !1472)
!1471 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1472 = !{!1473, !1474, !1475, !1476, !1477, !1478, !1479}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1470, file: !1471, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1470, file: !1471, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1470, file: !1471, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1470, file: !1471, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1470, file: !1471, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1470, file: !1471, line: 195, baseType: !7, size: 32, offset: 32)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1470, file: !1471, line: 199, baseType: !811, size: 64, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !814, file: !149, line: 3386, baseType: !1439, size: 1216)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !814, file: !149, line: 3387, baseType: !1482, size: 1280)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !1483)
!1483 = !{!1484, !1485}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1482, file: !149, line: 3094, baseType: !1439, size: 1216)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1482, file: !149, line: 3095, baseType: !1469, size: 64, offset: 1216)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !814, file: !149, line: 3388, baseType: !1487, size: 1216)
!1487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !1488)
!1488 = !{!1489, !1490, !1491, !1492, !1493, !1494}
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1487, file: !149, line: 2825, baseType: !943, size: 896)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1487, file: !149, line: 2827, baseType: !811, size: 64, offset: 896)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1487, file: !149, line: 2828, baseType: !811, size: 64, offset: 960)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1487, file: !149, line: 2829, baseType: !811, size: 64, offset: 1024)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1487, file: !149, line: 2830, baseType: !811, size: 64, offset: 1088)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1487, file: !149, line: 2831, baseType: !811, size: 64, offset: 1152)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !814, file: !149, line: 3389, baseType: !1496, size: 1024)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !1497)
!1497 = !{!1498, !1499, !1500}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1496, file: !149, line: 2851, baseType: !981, size: 960)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1496, file: !149, line: 2852, baseType: !725, size: 32, offset: 960)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1496, file: !149, line: 2853, baseType: !725, size: 32, offset: 992)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !814, file: !149, line: 3390, baseType: !1502, size: 1024)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !1503)
!1503 = !{!1504, !1505}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1502, file: !149, line: 2858, baseType: !981, size: 960)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1502, file: !149, line: 2859, baseType: !1469, size: 64, offset: 960)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !814, file: !149, line: 3391, baseType: !1507, size: 960)
!1507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !1508)
!1508 = !{!1509}
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1507, file: !149, line: 2863, baseType: !981, size: 960)
