; ModuleID = 'lto-streamer.bc'
source_filename = "lto-streamer.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.lto_stats_d = type { i64, i64, i64, i64, i64, [10 x i64], i64, [188 x i64], i64, i64, i64, i64 }

!271 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!272 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !37, line: 1805, baseType: !7, size: 32, elements: !273)
!273 = !{!274, !275, !276, !277, !278}
!274 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!275 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!276 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!277 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!278 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!279 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_code", file: !280, line: 51, baseType: !7, size: 32, elements: !281)
!280 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!281 = !{!282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317}
!282 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!283 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!284 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!285 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!286 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!287 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!288 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!289 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!290 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!291 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!292 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!293 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!294 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!295 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!296 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!297 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!298 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!299 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!300 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!301 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!302 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!303 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!304 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!305 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!306 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!307 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!308 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!309 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!310 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!311 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!312 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!313 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!314 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!315 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!316 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!317 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!318 = !{!319, !320, !321, !322, !325, !326, !328, !391, !392, !412, !415, !7, !422, !1530, !36, !279, !400, !1052, !1537, !528, !1550}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!321 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64)
!324 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !324)
!328 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !329, line: 47, baseType: !330)
!329 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !332, line: 75, size: 256, elements: !333)
!332 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!333 = !{!334, !349, !350, !351}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !331, file: !332, line: 76, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !332, line: 68, baseType: !337)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !332, line: 63, size: 320, elements: !338)
!338 = !{!339, !341, !342, !343}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !332, line: 64, baseType: !340, size: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !337, file: !332, line: 65, baseType: !340, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !337, file: !332, line: 66, baseType: !7, size: 32, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !337, file: !332, line: 67, baseType: !344, size: 128, offset: 192)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !345, size: 128, elements: !347)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !332, line: 29, baseType: !346)
!346 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!347 = !{!348}
!348 = !DISubrange(count: 2)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !331, file: !332, line: 77, baseType: !335, size: 64, offset: 64)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !331, file: !332, line: 78, baseType: !7, size: 32, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !331, file: !332, line: 79, baseType: !352, size: 64, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !332, line: 49, baseType: !354)
!354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !332, line: 45, size: 832, elements: !355)
!355 = !{!356, !357, !358}
!356 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !354, file: !332, line: 46, baseType: !340, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !354, file: !332, line: 47, baseType: !330, size: 64, offset: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !354, file: !332, line: 48, baseType: !359, size: 704, offset: 128)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !360, line: 164, size: 704, elements: !361)
!360 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!361 = !{!362, !364, !374, !375, !376, !377, !378, !379, !383, !387, !388, !389, !390}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !359, file: !360, line: 166, baseType: !363, size: 64)
!363 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !359, file: !360, line: 167, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !366, size: 64)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !360, line: 157, size: 192, elements: !367)
!367 = !{!368, !369, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !366, file: !360, line: 159, baseType: !323, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !366, file: !360, line: 160, baseType: !365, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !366, file: !360, line: 161, baseType: !371, size: 32, offset: 128)
!371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 32, elements: !372)
!372 = !{!373}
!373 = !DISubrange(count: 4)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !359, file: !360, line: 168, baseType: !323, size: 64, offset: 128)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !359, file: !360, line: 169, baseType: !323, size: 64, offset: 192)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !359, file: !360, line: 170, baseType: !323, size: 64, offset: 256)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !359, file: !360, line: 171, baseType: !363, size: 64, offset: 320)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !359, file: !360, line: 172, baseType: !321, size: 32, offset: 384)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !359, file: !360, line: 176, baseType: !380, size: 64, offset: 448)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!381 = !DISubroutineType(types: !382)
!382 = !{!365, !325, !363}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !359, file: !360, line: 177, baseType: !384, size: 64, offset: 512)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !325, !365}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !359, file: !360, line: 178, baseType: !325, size: 64, offset: 576)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !359, file: !360, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !359, file: !360, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !359, file: !360, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!391 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitpack_d", file: !6, line: 156, size: 192, elements: !394)
!394 = !{!395, !398, !399}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "num_bits", scope: !393, file: !6, line: 159, baseType: !396, size: 64)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !397, line: 46, baseType: !346)
!397 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!398 = !DIDerivedType(tag: DW_TAG_member, name: "first_unused_bit", scope: !393, file: !6, line: 165, baseType: !396, size: 64, offset: 64)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !393, file: !6, line: 168, baseType: !400, size: 64, offset: 128)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_bitpack_word_t_heap", file: !6, line: 154, baseType: !402)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_bitpack_word_t_heap", file: !6, line: 154, size: 128, elements: !403)
!403 = !{!404}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !402, file: !6, line: 154, baseType: !405, size: 128)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_bitpack_word_t_base", file: !6, line: 153, baseType: !406)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_bitpack_word_t_base", file: !6, line: 153, size: 128, elements: !407)
!407 = !{!408, !409, !410}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !406, file: !6, line: 153, baseType: !7, size: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !406, file: !6, line: 153, baseType: !7, size: 32, offset: 32)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !406, file: !6, line: 153, baseType: !411, size: 64, offset: 64)
!411 = !DICompositeType(tag: DW_TAG_array_type, baseType: !412, size: 64, elements: !413)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitpack_word_t", file: !6, line: 152, baseType: !346)
!413 = !{!414}
!414 = !DISubrange(count: 1)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_map", file: !37, line: 5290, size: 128, elements: !417)
!417 = !{!418, !1529}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !416, file: !37, line: 5291, baseType: !419, size: 64)
!419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_map_base", file: !37, line: 5267, size: 64, elements: !420)
!420 = !{!421}
!421 = !DIDerivedType(tag: DW_TAG_member, name: "from", scope: !419, file: !37, line: 5268, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !329, line: 56, baseType: !423)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !37, line: 3371, size: 1792, elements: !425)
!425 = !{!426, !459, !465, !476, !483, !490, !495, !502, !508, !521, !533, !571, !579, !607, !624, !625, !630, !639, !645, !650, !654, !658, !1178, !1227, !1233, !1239, !1246, !1259, !1273, !1290, !1302, !1324, !1339, !1511}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !424, file: !37, line: 3372, baseType: !427, size: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !37, line: 360, size: 64, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !427, file: !37, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !427, file: !37, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !427, file: !37, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !427, file: !37, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !427, file: !37, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !427, file: !37, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !427, file: !37, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !427, file: !37, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !427, file: !37, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !427, file: !37, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !427, file: !37, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !427, file: !37, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !427, file: !37, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !427, file: !37, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !427, file: !37, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !427, file: !37, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !427, file: !37, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !427, file: !37, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !427, file: !37, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !427, file: !37, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !427, file: !37, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !427, file: !37, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !427, file: !37, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !427, file: !37, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !427, file: !37, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !427, file: !37, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !427, file: !37, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !427, file: !37, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !427, file: !37, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !427, file: !37, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !424, file: !37, line: 3373, baseType: !460, size: 192)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !37, line: 402, size: 192, elements: !461)
!461 = !{!462, !463, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !460, file: !37, line: 403, baseType: !427, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !460, file: !37, line: 404, baseType: !422, size: 64, offset: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !460, file: !37, line: 405, baseType: !422, size: 64, offset: 128)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !424, file: !37, line: 3374, baseType: !466, size: 320)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !37, line: 1384, size: 320, elements: !467)
!467 = !{!468, !469}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !466, file: !37, line: 1385, baseType: !460, size: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !466, file: !37, line: 1386, baseType: !470, size: 128, offset: 192)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !471, line: 58, baseType: !472)
!471 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !471, line: 54, size: 128, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !472, file: !471, line: 56, baseType: !346, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !472, file: !471, line: 57, baseType: !363, size: 64, offset: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !424, file: !37, line: 3375, baseType: !477, size: 256)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !37, line: 1397, size: 256, elements: !478)
!478 = !{!479, !480}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !477, file: !37, line: 1398, baseType: !460, size: 192)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !477, file: !37, line: 1399, baseType: !481, size: 64, offset: 192)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !37, line: 1392, flags: DIFlagFwdDecl)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !424, file: !37, line: 3376, baseType: !484, size: 256)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !37, line: 1408, size: 256, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !484, file: !37, line: 1409, baseType: !460, size: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !484, file: !37, line: 1410, baseType: !488, size: 64, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !489, size: 64)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !37, line: 1403, flags: DIFlagFwdDecl)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !424, file: !37, line: 3377, baseType: !491, size: 256)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !37, line: 1437, size: 256, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !37, line: 1438, baseType: !460, size: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !491, file: !37, line: 1439, baseType: !422, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !424, file: !37, line: 3378, baseType: !496, size: 256)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !37, line: 1418, size: 256, elements: !497)
!497 = !{!498, !499, !500}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !496, file: !37, line: 1419, baseType: !460, size: 192)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !496, file: !37, line: 1420, baseType: !321, size: 32, offset: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !496, file: !37, line: 1421, baseType: !501, size: 8, offset: 224)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !324, size: 8, elements: !413)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !424, file: !37, line: 3379, baseType: !503, size: 320)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !37, line: 1428, size: 320, elements: !504)
!504 = !{!505, !506, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !503, file: !37, line: 1429, baseType: !460, size: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !503, file: !37, line: 1430, baseType: !422, size: 64, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !503, file: !37, line: 1431, baseType: !422, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !424, file: !37, line: 3380, baseType: !509, size: 320)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !37, line: 1460, size: 320, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !509, file: !37, line: 1461, baseType: !460, size: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !509, file: !37, line: 1462, baseType: !513, size: 128, offset: 192)
!513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !514, line: 31, size: 128, elements: !515)
!514 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!515 = !{!516, !519, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !513, file: !514, line: 32, baseType: !517, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !518, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !320)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !513, file: !514, line: 33, baseType: !7, size: 32, offset: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !513, file: !514, line: 34, baseType: !7, size: 32, offset: 96)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !424, file: !37, line: 3381, baseType: !522, size: 384)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !37, line: 2507, size: 384, elements: !523)
!523 = !{!524, !525, !530, !531, !532}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !522, file: !37, line: 2508, baseType: !460, size: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !522, file: !37, line: 2509, baseType: !526, size: 32, offset: 192)
!526 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !527, line: 58, baseType: !528)
!527 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!528 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !529, line: 44, baseType: !7)
!529 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!530 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !522, file: !37, line: 2510, baseType: !7, size: 32, offset: 224)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !522, file: !37, line: 2511, baseType: !422, size: 64, offset: 256)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !522, file: !37, line: 2512, baseType: !422, size: 64, offset: 320)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !424, file: !37, line: 3382, baseType: !534, size: 896)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !37, line: 2652, size: 896, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !534, file: !37, line: 2653, baseType: !522, size: 384)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !534, file: !37, line: 2654, baseType: !422, size: 64, offset: 384)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !534, file: !37, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !534, file: !37, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !534, file: !37, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !534, file: !37, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !534, file: !37, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !534, file: !37, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !534, file: !37, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !534, file: !37, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !534, file: !37, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !534, file: !37, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !534, file: !37, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !534, file: !37, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !534, file: !37, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !534, file: !37, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !534, file: !37, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !534, file: !37, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !534, file: !37, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !534, file: !37, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !534, file: !37, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !534, file: !37, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !534, file: !37, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !534, file: !37, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !534, file: !37, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !534, file: !37, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !534, file: !37, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !534, file: !37, line: 2703, baseType: !7, size: 32, offset: 512)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !534, file: !37, line: 2705, baseType: !422, size: 64, offset: 576)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !534, file: !37, line: 2706, baseType: !422, size: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !534, file: !37, line: 2707, baseType: !422, size: 64, offset: 704)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !534, file: !37, line: 2708, baseType: !422, size: 64, offset: 768)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !534, file: !37, line: 2711, baseType: !569, size: 64, offset: 832)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !37, line: 2711, flags: DIFlagFwdDecl)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !424, file: !37, line: 3383, baseType: !572, size: 960)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !37, line: 2756, size: 960, elements: !573)
!573 = !{!574, !575}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !572, file: !37, line: 2757, baseType: !534, size: 896)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !572, file: !37, line: 2758, baseType: !576, size: 64, offset: 896)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !329, line: 50, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !329, line: 49, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !424, file: !37, line: 3384, baseType: !580, size: 1472)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !37, line: 3114, size: 1472, elements: !581)
!581 = !{!582, !603, !604, !605, !606}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !37, line: 3115, baseType: !583, size: 1216)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !37, line: 2984, size: 1216, elements: !584)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !37, line: 2985, baseType: !572, size: 960)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !583, file: !37, line: 2986, baseType: !422, size: 64, offset: 960)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !583, file: !37, line: 2987, baseType: !422, size: 64, offset: 1024)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !583, file: !37, line: 2988, baseType: !422, size: 64, offset: 1088)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !583, file: !37, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !583, file: !37, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !583, file: !37, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !583, file: !37, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !583, file: !37, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !583, file: !37, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !583, file: !37, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !583, file: !37, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !583, file: !37, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !583, file: !37, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !583, file: !37, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !583, file: !37, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !583, file: !37, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !583, file: !37, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !580, file: !37, line: 3117, baseType: !422, size: 64, offset: 1216)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !580, file: !37, line: 3119, baseType: !422, size: 64, offset: 1280)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !580, file: !37, line: 3121, baseType: !422, size: 64, offset: 1344)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !580, file: !37, line: 3123, baseType: !422, size: 64, offset: 1408)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !424, file: !37, line: 3385, baseType: !608, size: 1088)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !37, line: 2874, size: 1088, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !37, line: 2875, baseType: !572, size: 960)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !608, file: !37, line: 2876, baseType: !576, size: 64, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !608, file: !37, line: 2877, baseType: !613, size: 64, offset: 1024)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !615, line: 172, size: 128, elements: !616)
!615 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!616 = !{!617, !618, !619, !620, !621, !622, !623}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !614, file: !615, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !614, file: !615, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !614, file: !615, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !614, file: !615, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !614, file: !615, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !614, file: !615, line: 195, baseType: !7, size: 32, offset: 32)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !614, file: !615, line: 199, baseType: !422, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !424, file: !37, line: 3386, baseType: !583, size: 1216)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !424, file: !37, line: 3387, baseType: !626, size: 1280)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !37, line: 3093, size: 1280, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !626, file: !37, line: 3094, baseType: !583, size: 1216)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !626, file: !37, line: 3095, baseType: !613, size: 64, offset: 1216)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !424, file: !37, line: 3388, baseType: !631, size: 1216)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !37, line: 2824, size: 1216, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !631, file: !37, line: 2825, baseType: !534, size: 896)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !631, file: !37, line: 2827, baseType: !422, size: 64, offset: 896)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !631, file: !37, line: 2828, baseType: !422, size: 64, offset: 960)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !631, file: !37, line: 2829, baseType: !422, size: 64, offset: 1024)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !631, file: !37, line: 2830, baseType: !422, size: 64, offset: 1088)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !631, file: !37, line: 2831, baseType: !422, size: 64, offset: 1152)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !424, file: !37, line: 3389, baseType: !640, size: 1024)
!640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !37, line: 2850, size: 1024, elements: !641)
!641 = !{!642, !643, !644}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !640, file: !37, line: 2851, baseType: !572, size: 960)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !640, file: !37, line: 2852, baseType: !321, size: 32, offset: 960)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !640, file: !37, line: 2853, baseType: !321, size: 32, offset: 992)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !424, file: !37, line: 3390, baseType: !646, size: 1024)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !37, line: 2857, size: 1024, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !646, file: !37, line: 2858, baseType: !572, size: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !646, file: !37, line: 2859, baseType: !613, size: 64, offset: 960)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !424, file: !37, line: 3391, baseType: !651, size: 960)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !37, line: 2862, size: 960, elements: !652)
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !651, file: !37, line: 2863, baseType: !572, size: 960)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !424, file: !37, line: 3392, baseType: !655, size: 1472)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !37, line: 3304, size: 1472, elements: !656)
!656 = !{!657}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !655, file: !37, line: 3305, baseType: !580, size: 1472)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !424, file: !37, line: 3393, baseType: !659, size: 1792)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !37, line: 3248, size: 1792, elements: !660)
!660 = !{!661, !662, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !659, file: !37, line: 3249, baseType: !580, size: 1472)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !659, file: !37, line: 3251, baseType: !663, size: 64, offset: 1472)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !665, line: 463, size: 1152, elements: !666)
!665 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!666 = !{!667, !670, !983, !984, !1098, !1101, !1102, !1103, !1104, !1105, !1106, !1130, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !664, file: !665, line: 464, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !665, line: 464, flags: DIFlagFwdDecl)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !664, file: !665, line: 467, baseType: !671, size: 64, offset: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !232, line: 374, size: 640, elements: !673)
!673 = !{!674, !958, !959, !972, !973, !974, !975, !976, !977, !979, !981, !982}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !672, file: !232, line: 377, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !329, line: 111, baseType: !676)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !232, line: 217, size: 832, elements: !678)
!678 = !{!679, !923, !924, !925, !928, !932, !933, !934, !952, !953, !954, !955, !956, !957}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !677, file: !232, line: 219, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !232, line: 151, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !232, line: 151, size: 128, elements: !683)
!683 = !{!684}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !682, file: !232, line: 151, baseType: !685, size: 128)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !232, line: 150, baseType: !686)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !232, line: 150, size: 128, elements: !687)
!687 = !{!688, !689, !690}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !686, file: !232, line: 150, baseType: !7, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !686, file: !232, line: 150, baseType: !7, size: 32, offset: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !686, file: !232, line: 150, baseType: !691, size: 64, offset: 64)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !692, size: 64, elements: !413)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !329, line: 108, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !232, line: 122, size: 512, elements: !695)
!695 = !{!696, !697, !698, !915, !916, !917, !918, !919, !920, !921}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !694, file: !232, line: 124, baseType: !676, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !694, file: !232, line: 125, baseType: !676, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !694, file: !232, line: 131, baseType: !699, size: 64, offset: 128)
!699 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !232, line: 128, size: 64, elements: !700)
!700 = !{!701, !914}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !699, file: !232, line: 129, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !329, line: 66, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !280, line: 143, size: 192, elements: !705)
!705 = !{!706, !912, !913}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !704, file: !280, line: 145, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !329, line: 69, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !280, line: 136, size: 192, elements: !710)
!710 = !{!711, !910, !911}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !709, file: !280, line: 137, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !329, line: 58, baseType: !713)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !280, line: 737, size: 768, elements: !715)
!715 = !{!716, !733, !767, !773, !778, !783, !790, !796, !802, !807, !821, !826, !832, !837, !847, !852, !868, !875, !882, !888, !893, !899, !905}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !714, file: !280, line: 738, baseType: !717, size: 256)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !280, line: 271, size: 256, elements: !718)
!718 = !{!719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !717, file: !280, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !717, file: !280, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !717, file: !280, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !717, file: !280, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !717, file: !280, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !717, file: !280, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !717, file: !280, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !717, file: !280, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !717, file: !280, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !717, file: !280, line: 312, baseType: !7, size: 32, offset: 32)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !717, file: !280, line: 316, baseType: !526, size: 32, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !717, file: !280, line: 319, baseType: !7, size: 32, offset: 96)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !717, file: !280, line: 323, baseType: !676, size: 64, offset: 128)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !717, file: !280, line: 327, baseType: !422, size: 64, offset: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !714, file: !280, line: 739, baseType: !734, size: 448)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !280, line: 350, size: 448, elements: !735)
!735 = !{!736, !765}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !734, file: !280, line: 353, baseType: !737, size: 384)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !280, line: 333, size: 384, elements: !738)
!738 = !{!739, !740, !748}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !737, file: !280, line: 336, baseType: !717, size: 256)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !737, file: !280, line: 343, baseType: !741, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !743, line: 37, size: 128, elements: !744)
!743 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !742, file: !743, line: 39, baseType: !741, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !742, file: !743, line: 40, baseType: !747, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !737, file: !280, line: 344, baseType: !749, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !743, line: 45, size: 320, elements: !751)
!751 = !{!752, !753}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !750, file: !743, line: 47, baseType: !749, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !750, file: !743, line: 48, baseType: !754, size: 256, offset: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !37, line: 1883, size: 256, elements: !755)
!755 = !{!756, !758, !759, !764}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !754, file: !37, line: 1884, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !754, file: !37, line: 1885, baseType: !757, size: 64, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !754, file: !37, line: 1891, baseType: !760, size: 64, offset: 128)
!760 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !754, file: !37, line: 1891, size: 64, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !760, file: !37, line: 1891, baseType: !712, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !760, file: !37, line: 1891, baseType: !422, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !754, file: !37, line: 1892, baseType: !747, size: 64, offset: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !734, file: !280, line: 359, baseType: !766, size: 64, offset: 384)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 64, elements: !413)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !714, file: !280, line: 740, baseType: !768, size: 512)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !280, line: 365, size: 512, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !768, file: !280, line: 368, baseType: !737, size: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !768, file: !280, line: 373, baseType: !422, size: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !768, file: !280, line: 374, baseType: !422, size: 64, offset: 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !714, file: !280, line: 741, baseType: !774, size: 576)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !280, line: 380, size: 576, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !774, file: !280, line: 383, baseType: !768, size: 512)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !774, file: !280, line: 389, baseType: !766, size: 64, offset: 512)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !714, file: !280, line: 742, baseType: !779, size: 320)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !280, line: 395, size: 320, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !779, file: !280, line: 397, baseType: !717, size: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !779, file: !280, line: 400, baseType: !702, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !714, file: !280, line: 743, baseType: !784, size: 448)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !280, line: 406, size: 448, elements: !785)
!785 = !{!786, !787, !788, !789}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !784, file: !280, line: 408, baseType: !717, size: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !784, file: !280, line: 412, baseType: !422, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !784, file: !280, line: 420, baseType: !422, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !784, file: !280, line: 423, baseType: !702, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !714, file: !280, line: 744, baseType: !791, size: 384)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !280, line: 429, size: 384, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !791, file: !280, line: 431, baseType: !717, size: 256)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !791, file: !280, line: 434, baseType: !422, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !791, file: !280, line: 437, baseType: !702, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !714, file: !280, line: 745, baseType: !797, size: 384)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !280, line: 443, size: 384, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !797, file: !280, line: 445, baseType: !717, size: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !797, file: !280, line: 449, baseType: !422, size: 64, offset: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !797, file: !280, line: 453, baseType: !702, size: 64, offset: 320)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !714, file: !280, line: 746, baseType: !803, size: 320)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !280, line: 459, size: 320, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !803, file: !280, line: 461, baseType: !717, size: 256)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !803, file: !280, line: 464, baseType: !422, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !714, file: !280, line: 747, baseType: !808, size: 768)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !280, line: 469, size: 768, elements: !809)
!809 = !{!810, !811, !812, !813, !814}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !808, file: !280, line: 471, baseType: !717, size: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !808, file: !280, line: 474, baseType: !7, size: 32, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !808, file: !280, line: 475, baseType: !7, size: 32, offset: 288)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !808, file: !280, line: 478, baseType: !422, size: 64, offset: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !808, file: !280, line: 481, baseType: !815, size: 384, offset: 384)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !816, size: 384, elements: !413)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !37, line: 1917, size: 384, elements: !817)
!817 = !{!818, !819, !820}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !816, file: !37, line: 1920, baseType: !754, size: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !816, file: !37, line: 1921, baseType: !422, size: 64, offset: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !816, file: !37, line: 1922, baseType: !526, size: 32, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !714, file: !280, line: 748, baseType: !822, size: 320)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !280, line: 487, size: 320, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !822, file: !280, line: 490, baseType: !717, size: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !822, file: !280, line: 494, baseType: !321, size: 32, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !714, file: !280, line: 749, baseType: !827, size: 384)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !280, line: 500, size: 384, elements: !828)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !827, file: !280, line: 502, baseType: !717, size: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !827, file: !280, line: 506, baseType: !702, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !827, file: !280, line: 510, baseType: !702, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !714, file: !280, line: 750, baseType: !833, size: 320)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !280, line: 529, size: 320, elements: !834)
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !833, file: !280, line: 531, baseType: !717, size: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !833, file: !280, line: 540, baseType: !702, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !714, file: !280, line: 751, baseType: !838, size: 704)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !280, line: 546, size: 704, elements: !839)
!839 = !{!840, !841, !842, !843, !844, !845, !846}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !838, file: !280, line: 549, baseType: !768, size: 512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !838, file: !280, line: 553, baseType: !326, size: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !838, file: !280, line: 557, baseType: !320, size: 8, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !838, file: !280, line: 558, baseType: !320, size: 8, offset: 584)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !838, file: !280, line: 559, baseType: !320, size: 8, offset: 592)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !838, file: !280, line: 560, baseType: !320, size: 8, offset: 600)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !838, file: !280, line: 566, baseType: !766, size: 64, offset: 640)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !714, file: !280, line: 752, baseType: !848, size: 384)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !280, line: 571, size: 384, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !848, file: !280, line: 573, baseType: !779, size: 320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !848, file: !280, line: 577, baseType: !422, size: 64, offset: 320)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !714, file: !280, line: 753, baseType: !853, size: 576)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !280, line: 600, size: 576, elements: !854)
!854 = !{!855, !856, !857, !858, !867}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !853, file: !280, line: 602, baseType: !779, size: 320)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !853, file: !280, line: 605, baseType: !422, size: 64, offset: 320)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !853, file: !280, line: 609, baseType: !396, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !853, file: !280, line: 612, baseType: !859, size: 64, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !280, line: 581, size: 320, elements: !861)
!861 = !{!862, !863, !864, !865, !866}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !860, file: !280, line: 583, baseType: !36, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !860, file: !280, line: 586, baseType: !422, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !860, file: !280, line: 589, baseType: !422, size: 64, offset: 128)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !860, file: !280, line: 592, baseType: !422, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !860, file: !280, line: 595, baseType: !422, size: 64, offset: 256)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !853, file: !280, line: 616, baseType: !702, size: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !714, file: !280, line: 754, baseType: !869, size: 512)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !280, line: 622, size: 512, elements: !870)
!870 = !{!871, !872, !873, !874}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !869, file: !280, line: 624, baseType: !779, size: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !869, file: !280, line: 628, baseType: !422, size: 64, offset: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !869, file: !280, line: 632, baseType: !422, size: 64, offset: 384)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !869, file: !280, line: 636, baseType: !422, size: 64, offset: 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !714, file: !280, line: 755, baseType: !876, size: 704)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !280, line: 642, size: 704, elements: !877)
!877 = !{!878, !879, !880, !881}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !876, file: !280, line: 644, baseType: !869, size: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !876, file: !280, line: 648, baseType: !422, size: 64, offset: 512)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !876, file: !280, line: 652, baseType: !422, size: 64, offset: 576)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !876, file: !280, line: 653, baseType: !422, size: 64, offset: 640)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !714, file: !280, line: 756, baseType: !883, size: 448)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !280, line: 663, size: 448, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !883, file: !280, line: 665, baseType: !779, size: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !883, file: !280, line: 668, baseType: !422, size: 64, offset: 320)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !883, file: !280, line: 673, baseType: !422, size: 64, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !714, file: !280, line: 757, baseType: !889, size: 384)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !280, line: 694, size: 384, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !889, file: !280, line: 696, baseType: !779, size: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !889, file: !280, line: 699, baseType: !422, size: 64, offset: 320)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !714, file: !280, line: 758, baseType: !894, size: 384)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !280, line: 681, size: 384, elements: !895)
!895 = !{!896, !897, !898}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !894, file: !280, line: 683, baseType: !717, size: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !894, file: !280, line: 686, baseType: !422, size: 64, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !894, file: !280, line: 689, baseType: !422, size: 64, offset: 320)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !714, file: !280, line: 759, baseType: !900, size: 384)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !280, line: 707, size: 384, elements: !901)
!901 = !{!902, !903, !904}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !900, file: !280, line: 709, baseType: !717, size: 256)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !900, file: !280, line: 712, baseType: !422, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !900, file: !280, line: 712, baseType: !422, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !714, file: !280, line: 760, baseType: !906, size: 320)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !280, line: 718, size: 320, elements: !907)
!907 = !{!908, !909}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !906, file: !280, line: 720, baseType: !717, size: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !906, file: !280, line: 723, baseType: !422, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !709, file: !280, line: 138, baseType: !708, size: 64, offset: 64)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !280, line: 139, baseType: !708, size: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !704, file: !280, line: 146, baseType: !707, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !704, file: !280, line: 152, baseType: !702, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !699, file: !232, line: 130, baseType: !576, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !694, file: !232, line: 134, baseType: !325, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !694, file: !232, line: 137, baseType: !422, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !694, file: !232, line: 138, baseType: !526, size: 32, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !694, file: !232, line: 142, baseType: !7, size: 32, offset: 352)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !694, file: !232, line: 144, baseType: !321, size: 32, offset: 384)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !694, file: !232, line: 145, baseType: !321, size: 32, offset: 416)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !694, file: !232, line: 146, baseType: !922, size: 64, offset: 448)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !232, line: 119, baseType: !363)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !677, file: !232, line: 220, baseType: !680, size: 64, offset: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !677, file: !232, line: 223, baseType: !325, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !677, file: !232, line: 226, baseType: !926, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !232, line: 185, flags: DIFlagFwdDecl)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !677, file: !232, line: 229, baseType: !929, size: 128, offset: 256)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 128, elements: !347)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !232, line: 229, flags: DIFlagFwdDecl)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !677, file: !232, line: 232, baseType: !676, size: 64, offset: 384)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !677, file: !232, line: 233, baseType: !676, size: 64, offset: 448)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !677, file: !232, line: 238, baseType: !935, size: 64, offset: 512)
!935 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !232, line: 235, size: 64, elements: !936)
!936 = !{!937, !943}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !935, file: !232, line: 236, baseType: !938, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !232, line: 273, size: 128, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !939, file: !232, line: 275, baseType: !702, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !939, file: !232, line: 278, baseType: !702, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !935, file: !232, line: 237, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !232, line: 259, size: 320, elements: !946)
!946 = !{!947, !948, !949, !950, !951}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !945, file: !232, line: 261, baseType: !576, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !945, file: !232, line: 262, baseType: !576, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !945, file: !232, line: 266, baseType: !576, size: 64, offset: 128)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !945, file: !232, line: 267, baseType: !576, size: 64, offset: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !945, file: !232, line: 270, baseType: !321, size: 32, offset: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !677, file: !232, line: 241, baseType: !922, size: 64, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !677, file: !232, line: 244, baseType: !321, size: 32, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !677, file: !232, line: 247, baseType: !321, size: 32, offset: 672)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !677, file: !232, line: 250, baseType: !321, size: 32, offset: 704)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !677, file: !232, line: 253, baseType: !321, size: 32, offset: 736)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !677, file: !232, line: 256, baseType: !321, size: 32, offset: 768)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !672, file: !232, line: 378, baseType: !675, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !672, file: !232, line: 381, baseType: !960, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !232, line: 282, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !232, line: 282, size: 128, elements: !963)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !962, file: !232, line: 282, baseType: !965, size: 128)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !232, line: 281, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !232, line: 281, size: 128, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !966, file: !232, line: 281, baseType: !7, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !966, file: !232, line: 281, baseType: !7, size: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !966, file: !232, line: 281, baseType: !971, size: 64, offset: 64)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 64, elements: !413)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !672, file: !232, line: 384, baseType: !321, size: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !672, file: !232, line: 387, baseType: !321, size: 32, offset: 224)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !672, file: !232, line: 390, baseType: !321, size: 32, offset: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !672, file: !232, line: 394, baseType: !960, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !672, file: !232, line: 396, baseType: !231, size: 32, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !672, file: !232, line: 399, baseType: !978, size: 64, offset: 416)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 64, elements: !347)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !672, file: !232, line: 402, baseType: !980, size: 64, offset: 480)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !347)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !672, file: !232, line: 406, baseType: !321, size: 32, offset: 544)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !672, file: !232, line: 409, baseType: !321, size: 32, offset: 576)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !664, file: !665, line: 470, baseType: !703, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !664, file: !665, line: 473, baseType: !985, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !615, line: 39, size: 1152, elements: !987)
!987 = !{!988, !1038, !1051, !1063, !1064, !1075, !1076, !1080, !1081, !1082, !1083, !1084}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !986, file: !615, line: 41, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !990, line: 144, baseType: !991)
!990 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !990, line: 100, size: 896, elements: !993)
!993 = !{!994, !1002, !1007, !1012, !1014, !1015, !1016, !1017, !1018, !1019, !1024, !1026, !1027, !1032, !1037}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !992, file: !990, line: 102, baseType: !995, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !990, line: 52, baseType: !996)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DISubroutineType(types: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !990, line: 47, baseType: !7)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !992, file: !990, line: 105, baseType: !1003, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !990, line: 59, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!321, !1000, !1000}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !992, file: !990, line: 108, baseType: !1008, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !990, line: 63, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !325}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !992, file: !990, line: 111, baseType: !1013, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !992, file: !990, line: 114, baseType: !396, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !992, file: !990, line: 117, baseType: !396, size: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !992, file: !990, line: 120, baseType: !396, size: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !992, file: !990, line: 124, baseType: !7, size: 32, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !992, file: !990, line: 128, baseType: !7, size: 32, offset: 480)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !992, file: !990, line: 131, baseType: !1020, size: 64, offset: 512)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !990, line: 75, baseType: !1021)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DISubroutineType(types: !1023)
!1023 = !{!325, !396, !396}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !992, file: !990, line: 132, baseType: !1025, size: 64, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !990, line: 78, baseType: !1009)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !992, file: !990, line: 135, baseType: !325, size: 64, offset: 640)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !992, file: !990, line: 136, baseType: !1028, size: 64, offset: 704)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !990, line: 82, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DISubroutineType(types: !1031)
!1031 = !{!325, !325, !396, !396}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !992, file: !990, line: 137, baseType: !1033, size: 64, offset: 768)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !990, line: 83, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = !DISubroutineType(types: !1036)
!1036 = !{null, !325, !325}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !992, file: !990, line: 141, baseType: !7, size: 32, offset: 832)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !986, file: !615, line: 48, baseType: !1039, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !280, line: 35, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !280, line: 35, size: 128, elements: !1042)
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1041, file: !280, line: 35, baseType: !1044, size: 128)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !280, line: 33, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !280, line: 33, size: 128, elements: !1046)
!1046 = !{!1047, !1048, !1049}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1045, file: !280, line: 33, baseType: !7, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1045, file: !280, line: 33, baseType: !7, size: 32, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1045, file: !280, line: 33, baseType: !1050, size: 64, offset: 64)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 64, elements: !413)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !986, file: !615, line: 51, baseType: !1052, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !37, line: 183, baseType: !1054)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !37, line: 183, size: 128, elements: !1055)
!1055 = !{!1056}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1054, file: !37, line: 183, baseType: !1057, size: 128)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !37, line: 182, baseType: !1058)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !37, line: 182, size: 128, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1058, file: !37, line: 182, baseType: !7, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1058, file: !37, line: 182, baseType: !7, size: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1058, file: !37, line: 182, baseType: !766, size: 64, offset: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !986, file: !615, line: 54, baseType: !422, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !986, file: !615, line: 57, baseType: !1065, size: 128, offset: 256)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1066, line: 31, size: 128, elements: !1067)
!1066 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1067 = !{!1068, !1069, !1070, !1071, !1072, !1073, !1074}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1065, file: !1066, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1065, file: !1066, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1065, file: !1066, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1065, file: !1066, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1065, file: !1066, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1065, file: !1066, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1065, file: !1066, line: 56, baseType: !328, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !986, file: !615, line: 60, baseType: !1065, size: 128, offset: 384)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !986, file: !615, line: 64, baseType: !1077, size: 64, offset: 512)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1079, line: 33, flags: DIFlagFwdDecl)
!1079 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !986, file: !615, line: 67, baseType: !422, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !986, file: !615, line: 73, baseType: !989, size: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !986, file: !615, line: 77, baseType: !328, size: 64, offset: 704)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !986, file: !615, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !986, file: !615, line: 82, baseType: !1085, size: 320, offset: 832)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !743, line: 62, size: 320, elements: !1086)
!1086 = !{!1087, !1093, !1094, !1095, !1096, !1097}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1085, file: !743, line: 63, baseType: !1088, size: 64)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !743, line: 56, size: 128, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1089, file: !743, line: 57, baseType: !1088, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1089, file: !743, line: 58, baseType: !501, size: 8, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1085, file: !743, line: 64, baseType: !7, size: 32, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1085, file: !743, line: 66, baseType: !7, size: 32, offset: 96)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1085, file: !743, line: 68, baseType: !320, size: 8, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1085, file: !743, line: 70, baseType: !741, size: 64, offset: 192)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1085, file: !743, line: 71, baseType: !749, size: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !664, file: !665, line: 476, baseType: !1099, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !665, line: 476, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !664, file: !665, line: 479, baseType: !989, size: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !664, file: !665, line: 484, baseType: !422, size: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !664, file: !665, line: 488, baseType: !422, size: 64, offset: 448)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !664, file: !665, line: 493, baseType: !422, size: 64, offset: 512)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !664, file: !665, line: 496, baseType: !422, size: 64, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !664, file: !665, line: 501, baseType: !1107, size: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !243, line: 2355, size: 576, elements: !1109)
!1109 = !{!1110, !1113, !1114, !1115, !1116, !1118, !1119, !1124, !1125, !1126, !1127, !1128, !1129}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1108, file: !243, line: 2356, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !243, line: 2356, flags: DIFlagFwdDecl)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1108, file: !243, line: 2357, baseType: !326, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1108, file: !243, line: 2358, baseType: !321, size: 32, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1108, file: !243, line: 2359, baseType: !321, size: 32, offset: 160)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1108, file: !243, line: 2360, baseType: !1117, size: 128, offset: 192)
!1117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !321, size: 128, elements: !372)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1108, file: !243, line: 2364, baseType: !321, size: 32, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1108, file: !243, line: 2367, baseType: !1120, size: 128, offset: 384)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !243, line: 2349, size: 128, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1120, file: !243, line: 2351, baseType: !576, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1120, file: !243, line: 2352, baseType: !363, size: 64, offset: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1108, file: !243, line: 2371, baseType: !242, size: 32, offset: 512)
