; ModuleID = 'lto-section-out.bc'
source_filename = "lto-section-out.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }

!559 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!560 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!561 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!562 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!563 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!564 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!565 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!566 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!567 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!568 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!569 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!570 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!571 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!572 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!573 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!574 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!575 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!576 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!577 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!578 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!579 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!580 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!581 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!582 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!583 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!584 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!585 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!586 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!587 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!588 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!589 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!590 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !591, line: 256, baseType: !7, size: 32, elements: !592)
!591 = !DIFile(filename: "./lto-streamer.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!593 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!594 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!595 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!596 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!597 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!598 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!599 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!600 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!601 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!602 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!603 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!604 = !{!605, !606, !607, !608, !611, !612, !614, !1427, !1090, !609, !2014, !2018, !2019, !2303, !2024, !2034, !7, !2312}
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!607 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_decl_slot", file: !591, line: 484, size: 128, elements: !617)
!617 = !{!618, !2013}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !616, file: !591, line: 486, baseType: !619, size: 64)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !620, line: 56, baseType: !621)
!620 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !623)
!623 = !{!624, !657, !663, !676, !695, !706, !711, !720, !726, !739, !751, !789, !1248, !1276, !1293, !1294, !1299, !1308, !1314, !1319, !1323, !1327, !1664, !1711, !1717, !1723, !1730, !1743, !1757, !1774, !1786, !1808, !1823, !1995}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !622, file: !135, line: 3372, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !625, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !625, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !625, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !625, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !625, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !625, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !625, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !625, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !625, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !625, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !625, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !625, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !625, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !625, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !625, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !625, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !625, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !625, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !625, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !625, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !625, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !625, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !625, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !625, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !625, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !625, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !625, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !625, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !625, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !625, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !135, line: 3373, baseType: !658, size: 192)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !135, line: 403, baseType: !625, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !658, file: !135, line: 404, baseType: !619, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !658, file: !135, line: 405, baseType: !619, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !622, file: !135, line: 3374, baseType: !664, size: 320)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !664, file: !135, line: 1385, baseType: !658, size: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !664, file: !135, line: 1386, baseType: !668, size: 128, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !669, line: 58, baseType: !670)
!669 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 54, size: 128, elements: !671)
!671 = !{!672, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !670, file: !669, line: 56, baseType: !673, size: 64)
!673 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !670, file: !669, line: 57, baseType: !675, size: 64, offset: 64)
!675 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !622, file: !135, line: 3375, baseType: !677, size: 256)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !135, line: 1398, baseType: !658, size: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !677, file: !135, line: 1399, baseType: !681, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !683, line: 52, size: 256, elements: !684)
!683 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!684 = !{!685, !686, !687, !688, !689, !690, !691}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !682, file: !683, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !682, file: !683, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !682, file: !683, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !682, file: !683, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !682, file: !683, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !682, file: !683, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !682, file: !683, line: 62, baseType: !692, size: 192, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 192, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 3)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !622, file: !135, line: 3376, baseType: !696, size: 256)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !696, file: !135, line: 1409, baseType: !658, size: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !696, file: !135, line: 1410, baseType: !700, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !702, line: 27, size: 192, elements: !703)
!702 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !701, file: !702, line: 29, baseType: !668, size: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !701, file: !702, line: 30, baseType: !5, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !622, file: !135, line: 3377, baseType: !707, size: 256)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !707, file: !135, line: 1438, baseType: !658, size: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !707, file: !135, line: 1439, baseType: !619, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !622, file: !135, line: 3378, baseType: !712, size: 256)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !135, line: 1419, baseType: !658, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !712, file: !135, line: 1420, baseType: !607, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !712, file: !135, line: 1421, baseType: !717, size: 8, offset: 224)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 8, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 1)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !622, file: !135, line: 3379, baseType: !721, size: 320)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !721, file: !135, line: 1429, baseType: !658, size: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !721, file: !135, line: 1430, baseType: !619, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !721, file: !135, line: 1431, baseType: !619, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !622, file: !135, line: 3380, baseType: !727, size: 320)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !727, file: !135, line: 1461, baseType: !658, size: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !727, file: !135, line: 1462, baseType: !731, size: 128, offset: 192)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !732, line: 31, size: 128, elements: !733)
!732 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!733 = !{!734, !737, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !731, file: !732, line: 32, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !731, file: !732, line: 33, baseType: !7, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !731, file: !732, line: 34, baseType: !7, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !622, file: !135, line: 3381, baseType: !740, size: 384)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !741)
!741 = !{!742, !743, !748, !749, !750}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !740, file: !135, line: 2508, baseType: !658, size: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !740, file: !135, line: 2509, baseType: !744, size: 32, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !745, line: 58, baseType: !746)
!745 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !747, line: 44, baseType: !7)
!747 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!748 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !740, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !740, file: !135, line: 2511, baseType: !619, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !740, file: !135, line: 2512, baseType: !619, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !622, file: !135, line: 3382, baseType: !752, size: 896)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !752, file: !135, line: 2653, baseType: !740, size: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !752, file: !135, line: 2654, baseType: !619, size: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !752, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !752, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !752, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !752, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !752, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !752, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !752, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !752, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !752, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !752, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !752, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !752, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !752, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !752, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !752, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !752, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !752, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !752, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !752, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !752, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !752, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !752, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !752, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !752, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !752, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !752, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !752, file: !135, line: 2705, baseType: !619, size: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !752, file: !135, line: 2706, baseType: !619, size: 64, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !752, file: !135, line: 2707, baseType: !619, size: 64, offset: 704)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !752, file: !135, line: 2708, baseType: !619, size: 64, offset: 768)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !752, file: !135, line: 2711, baseType: !787, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !622, file: !135, line: 3383, baseType: !790, size: 960)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !135, line: 2757, baseType: !752, size: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !790, file: !135, line: 2758, baseType: !794, size: 64, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !620, line: 50, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !797, line: 240, size: 384, elements: !798)
!797 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !796, file: !797, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !796, file: !797, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !796, file: !797, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !796, file: !797, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !796, file: !797, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !796, file: !797, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !796, file: !797, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !796, file: !797, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !796, file: !797, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !796, file: !797, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !796, file: !797, line: 321, baseType: !810, size: 320, offset: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !797, line: 315, size: 320, elements: !811)
!811 = !{!812, !1215, !1217, !1246, !1247}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !810, file: !797, line: 316, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 64, elements: !718)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !797, line: 183, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !797, line: 166, size: 64, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !829, !830, !842, !845, !905, !906, !1192, !1205, !1212}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !815, file: !797, line: 168, baseType: !607, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !815, file: !797, line: 169, baseType: !7, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !815, file: !797, line: 170, baseType: !612, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !815, file: !797, line: 171, baseType: !794, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !815, file: !797, line: 172, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !620, line: 53, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !797, line: 359, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !824, file: !797, line: 360, baseType: !607, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !824, file: !797, line: 361, baseType: !828, size: 64, offset: 64)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 64, elements: !718)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !815, file: !797, line: 173, baseType: !5, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !815, file: !797, line: 174, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !797, line: 133, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !797, line: 115, size: 32, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !832, file: !797, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !832, file: !797, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !832, file: !797, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !832, file: !797, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !832, file: !797, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !832, file: !797, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !832, file: !797, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !832, file: !797, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !815, file: !797, line: 175, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !797, line: 175, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !815, file: !797, line: 176, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !848, line: 75, size: 256, elements: !849)
!848 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!849 = !{!850, !864, !865, !866}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !847, file: !848, line: 76, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !848, line: 68, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !848, line: 63, size: 320, elements: !854)
!854 = !{!855, !857, !858, !859}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !848, line: 64, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !853, file: !848, line: 65, baseType: !856, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !853, file: !848, line: 66, baseType: !7, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !853, file: !848, line: 67, baseType: !860, size: 128, offset: 192)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 128, elements: !862)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !848, line: 29, baseType: !673)
!862 = !{!863}
!863 = !DISubrange(count: 2)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !847, file: !848, line: 77, baseType: !851, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !847, file: !848, line: 78, baseType: !7, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !847, file: !848, line: 79, baseType: !867, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !848, line: 49, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !848, line: 45, size: 832, elements: !870)
!870 = !{!871, !872, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !869, file: !848, line: 46, baseType: !856, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !869, file: !848, line: 47, baseType: !846, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !869, file: !848, line: 48, baseType: !874, size: 704, offset: 128)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !875, line: 164, size: 704, elements: !876)
!875 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!876 = !{!877, !878, !888, !889, !890, !891, !892, !893, !897, !901, !902, !903, !904}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !874, file: !875, line: 166, baseType: !675, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !874, file: !875, line: 167, baseType: !879, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !875, line: 157, size: 192, elements: !881)
!881 = !{!882, !883, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !880, file: !875, line: 159, baseType: !609, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !875, line: 160, baseType: !879, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !880, file: !875, line: 161, baseType: !885, size: 32, offset: 128)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 32, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 4)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !874, file: !875, line: 168, baseType: !609, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !874, file: !875, line: 169, baseType: !609, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !874, file: !875, line: 170, baseType: !609, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !874, file: !875, line: 171, baseType: !675, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !874, file: !875, line: 172, baseType: !607, size: 32, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !874, file: !875, line: 176, baseType: !894, size: 64, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!879, !611, !675}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !874, file: !875, line: 177, baseType: !898, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !611, !879}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !874, file: !875, line: 178, baseType: !611, size: 64, offset: 576)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !874, file: !875, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !874, file: !875, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !874, file: !875, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !815, file: !797, line: 177, baseType: !619, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !815, file: !797, line: 178, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !909)
!909 = !{!910, !1157, !1158, !1159, !1162, !1166, !1167, !1168, !1186, !1187, !1188, !1189, !1190, !1191}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !908, file: !337, line: 219, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !914)
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !913, file: !337, line: 151, baseType: !916, size: 128)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !917, file: !337, line: 150, baseType: !7, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !917, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !917, file: !337, line: 150, baseType: !922, size: 64, offset: 64)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 64, elements: !718)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !620, line: 108, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !926)
!926 = !{!927, !928, !929, !1149, !1150, !1151, !1152, !1153, !1154, !1155}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !925, file: !337, line: 124, baseType: !907, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !925, file: !337, line: 125, baseType: !907, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !925, file: !337, line: 131, baseType: !930, size: 64, offset: 128)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !931)
!931 = !{!932, !1148}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !930, file: !337, line: 129, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !620, line: 66, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !936, line: 143, size: 192, elements: !937)
!936 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!937 = !{!938, !1146, !1147}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !935, file: !936, line: 145, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !620, line: 69, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !936, line: 136, size: 192, elements: !942)
!942 = !{!943, !1144, !1145}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !941, file: !936, line: 137, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !620, line: 58, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !936, line: 737, size: 768, elements: !947)
!947 = !{!948, !965, !999, !1005, !1010, !1015, !1022, !1028, !1034, !1039, !1053, !1058, !1064, !1069, !1079, !1084, !1102, !1109, !1116, !1122, !1127, !1133, !1139}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !946, file: !936, line: 738, baseType: !949, size: 256)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !936, line: 271, size: 256, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !949, file: !936, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !949, file: !936, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !949, file: !936, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !949, file: !936, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !949, file: !936, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !949, file: !936, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !949, file: !936, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !949, file: !936, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !949, file: !936, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !949, file: !936, line: 312, baseType: !7, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !949, file: !936, line: 316, baseType: !744, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !949, file: !936, line: 319, baseType: !7, size: 32, offset: 96)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !949, file: !936, line: 323, baseType: !907, size: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !949, file: !936, line: 327, baseType: !619, size: 64, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !946, file: !936, line: 739, baseType: !966, size: 448)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !936, line: 350, size: 448, elements: !967)
!967 = !{!968, !997}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !966, file: !936, line: 353, baseType: !969, size: 384)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !936, line: 333, size: 384, elements: !970)
!970 = !{!971, !972, !980}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !969, file: !936, line: 336, baseType: !949, size: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !969, file: !936, line: 343, baseType: !973, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !975, line: 37, size: 128, elements: !976)
!975 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !974, file: !975, line: 39, baseType: !973, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !974, file: !975, line: 40, baseType: !979, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !969, file: !936, line: 344, baseType: !981, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !975, line: 45, size: 320, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !975, line: 47, baseType: !981, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !982, file: !975, line: 48, baseType: !986, size: 256, offset: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !987)
!987 = !{!988, !990, !991, !996}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !986, file: !135, line: 1884, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !135, line: 1885, baseType: !989, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !986, file: !135, line: 1891, baseType: !992, size: 64, offset: 128)
!992 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !135, line: 1891, size: 64, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !992, file: !135, line: 1891, baseType: !944, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !992, file: !135, line: 1891, baseType: !619, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !986, file: !135, line: 1892, baseType: !979, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !966, file: !936, line: 359, baseType: !998, size: 64, offset: 384)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 64, elements: !718)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !946, file: !936, line: 740, baseType: !1000, size: 512)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !936, line: 365, size: 512, elements: !1001)
!1001 = !{!1002, !1003, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1000, file: !936, line: 368, baseType: !969, size: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1000, file: !936, line: 373, baseType: !619, size: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1000, file: !936, line: 374, baseType: !619, size: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !946, file: !936, line: 741, baseType: !1006, size: 576)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !936, line: 380, size: 576, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1006, file: !936, line: 383, baseType: !1000, size: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1006, file: !936, line: 389, baseType: !998, size: 64, offset: 512)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !946, file: !936, line: 742, baseType: !1011, size: 320)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !936, line: 395, size: 320, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1011, file: !936, line: 397, baseType: !949, size: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1011, file: !936, line: 400, baseType: !933, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !946, file: !936, line: 743, baseType: !1016, size: 448)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !936, line: 406, size: 448, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1016, file: !936, line: 408, baseType: !949, size: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1016, file: !936, line: 412, baseType: !619, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1016, file: !936, line: 420, baseType: !619, size: 64, offset: 320)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1016, file: !936, line: 423, baseType: !933, size: 64, offset: 384)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !946, file: !936, line: 744, baseType: !1023, size: 384)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !936, line: 429, size: 384, elements: !1024)
!1024 = !{!1025, !1026, !1027}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1023, file: !936, line: 431, baseType: !949, size: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1023, file: !936, line: 434, baseType: !619, size: 64, offset: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1023, file: !936, line: 437, baseType: !933, size: 64, offset: 320)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !946, file: !936, line: 745, baseType: !1029, size: 384)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !936, line: 443, size: 384, elements: !1030)
!1030 = !{!1031, !1032, !1033}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1029, file: !936, line: 445, baseType: !949, size: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1029, file: !936, line: 449, baseType: !619, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1029, file: !936, line: 453, baseType: !933, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !946, file: !936, line: 746, baseType: !1035, size: 320)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !936, line: 459, size: 320, elements: !1036)
!1036 = !{!1037, !1038}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1035, file: !936, line: 461, baseType: !949, size: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1035, file: !936, line: 464, baseType: !619, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !946, file: !936, line: 747, baseType: !1040, size: 768)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !936, line: 469, size: 768, elements: !1041)
!1041 = !{!1042, !1043, !1044, !1045, !1046}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1040, file: !936, line: 471, baseType: !949, size: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1040, file: !936, line: 474, baseType: !7, size: 32, offset: 256)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1040, file: !936, line: 475, baseType: !7, size: 32, offset: 288)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1040, file: !936, line: 478, baseType: !619, size: 64, offset: 320)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1040, file: !936, line: 481, baseType: !1047, size: 384, offset: 384)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 384, elements: !718)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1049)
!1049 = !{!1050, !1051, !1052}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1048, file: !135, line: 1920, baseType: !986, size: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1048, file: !135, line: 1921, baseType: !619, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1048, file: !135, line: 1922, baseType: !744, size: 32, offset: 320)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !946, file: !936, line: 748, baseType: !1054, size: 320)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !936, line: 487, size: 320, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1054, file: !936, line: 490, baseType: !949, size: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1054, file: !936, line: 494, baseType: !607, size: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !946, file: !936, line: 749, baseType: !1059, size: 384)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !936, line: 500, size: 384, elements: !1060)
!1060 = !{!1061, !1062, !1063}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1059, file: !936, line: 502, baseType: !949, size: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1059, file: !936, line: 506, baseType: !933, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1059, file: !936, line: 510, baseType: !933, size: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !946, file: !936, line: 750, baseType: !1065, size: 320)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !936, line: 529, size: 320, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1065, file: !936, line: 531, baseType: !949, size: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1065, file: !936, line: 540, baseType: !933, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !946, file: !936, line: 751, baseType: !1070, size: 704)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !936, line: 546, size: 704, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1070, file: !936, line: 549, baseType: !1000, size: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1070, file: !936, line: 553, baseType: !612, size: 64, offset: 512)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1070, file: !936, line: 557, baseType: !606, size: 8, offset: 576)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1070, file: !936, line: 558, baseType: !606, size: 8, offset: 584)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1070, file: !936, line: 559, baseType: !606, size: 8, offset: 592)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1070, file: !936, line: 560, baseType: !606, size: 8, offset: 600)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1070, file: !936, line: 566, baseType: !998, size: 64, offset: 640)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !946, file: !936, line: 752, baseType: !1080, size: 384)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !936, line: 571, size: 384, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1080, file: !936, line: 573, baseType: !1011, size: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1080, file: !936, line: 577, baseType: !619, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !946, file: !936, line: 753, baseType: !1085, size: 576)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !936, line: 600, size: 576, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1092, !1101}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1085, file: !936, line: 602, baseType: !1011, size: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1085, file: !936, line: 605, baseType: !619, size: 64, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1085, file: !936, line: 609, baseType: !1090, size: 64, offset: 384)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1091, line: 46, baseType: !673)
!1091 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1085, file: !936, line: 612, baseType: !1093, size: 64, offset: 448)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !936, line: 581, size: 320, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1094, file: !936, line: 583, baseType: !134, size: 32)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1094, file: !936, line: 586, baseType: !619, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1094, file: !936, line: 589, baseType: !619, size: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1094, file: !936, line: 592, baseType: !619, size: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1094, file: !936, line: 595, baseType: !619, size: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1085, file: !936, line: 616, baseType: !933, size: 64, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !946, file: !936, line: 754, baseType: !1103, size: 512)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !936, line: 622, size: 512, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1103, file: !936, line: 624, baseType: !1011, size: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1103, file: !936, line: 628, baseType: !619, size: 64, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1103, file: !936, line: 632, baseType: !619, size: 64, offset: 384)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1103, file: !936, line: 636, baseType: !619, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !946, file: !936, line: 755, baseType: !1110, size: 704)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !936, line: 642, size: 704, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1110, file: !936, line: 644, baseType: !1103, size: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1110, file: !936, line: 648, baseType: !619, size: 64, offset: 512)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1110, file: !936, line: 652, baseType: !619, size: 64, offset: 576)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1110, file: !936, line: 653, baseType: !619, size: 64, offset: 640)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !946, file: !936, line: 756, baseType: !1117, size: 448)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !936, line: 663, size: 448, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1117, file: !936, line: 665, baseType: !1011, size: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1117, file: !936, line: 668, baseType: !619, size: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1117, file: !936, line: 673, baseType: !619, size: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !946, file: !936, line: 757, baseType: !1123, size: 384)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !936, line: 694, size: 384, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1123, file: !936, line: 696, baseType: !1011, size: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1123, file: !936, line: 699, baseType: !619, size: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !946, file: !936, line: 758, baseType: !1128, size: 384)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !936, line: 681, size: 384, elements: !1129)
!1129 = !{!1130, !1131, !1132}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1128, file: !936, line: 683, baseType: !949, size: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1128, file: !936, line: 686, baseType: !619, size: 64, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1128, file: !936, line: 689, baseType: !619, size: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !946, file: !936, line: 759, baseType: !1134, size: 384)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !936, line: 707, size: 384, elements: !1135)
!1135 = !{!1136, !1137, !1138}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1134, file: !936, line: 709, baseType: !949, size: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1134, file: !936, line: 712, baseType: !619, size: 64, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1134, file: !936, line: 712, baseType: !619, size: 64, offset: 320)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !946, file: !936, line: 760, baseType: !1140, size: 320)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !936, line: 718, size: 320, elements: !1141)
!1141 = !{!1142, !1143}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1140, file: !936, line: 720, baseType: !949, size: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1140, file: !936, line: 723, baseType: !619, size: 64, offset: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !941, file: !936, line: 138, baseType: !940, size: 64, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !941, file: !936, line: 139, baseType: !940, size: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !935, file: !936, line: 146, baseType: !939, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !935, file: !936, line: 152, baseType: !933, size: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !930, file: !337, line: 130, baseType: !794, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !925, file: !337, line: 134, baseType: !611, size: 64, offset: 192)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !925, file: !337, line: 137, baseType: !619, size: 64, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !925, file: !337, line: 138, baseType: !744, size: 32, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !925, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !925, file: !337, line: 144, baseType: !607, size: 32, offset: 384)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !925, file: !337, line: 145, baseType: !607, size: 32, offset: 416)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !925, file: !337, line: 146, baseType: !1156, size: 64, offset: 448)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !675)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !908, file: !337, line: 220, baseType: !911, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !908, file: !337, line: 223, baseType: !611, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !908, file: !337, line: 226, baseType: !1160, size: 64, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !908, file: !337, line: 229, baseType: !1163, size: 128, offset: 256)
!1163 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 128, elements: !862)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !908, file: !337, line: 232, baseType: !907, size: 64, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !908, file: !337, line: 233, baseType: !907, size: 64, offset: 448)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !908, file: !337, line: 238, baseType: !1169, size: 64, offset: 512)
!1169 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !1170)
!1170 = !{!1171, !1177}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1169, file: !337, line: 236, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !1174)
!1174 = !{!1175, !1176}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1173, file: !337, line: 275, baseType: !933, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1173, file: !337, line: 278, baseType: !933, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1169, file: !337, line: 237, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !1180)
!1180 = !{!1181, !1182, !1183, !1184, !1185}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1179, file: !337, line: 261, baseType: !794, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1179, file: !337, line: 262, baseType: !794, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1179, file: !337, line: 266, baseType: !794, size: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1179, file: !337, line: 267, baseType: !794, size: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1179, file: !337, line: 270, baseType: !607, size: 32, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !908, file: !337, line: 241, baseType: !1156, size: 64, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !908, file: !337, line: 244, baseType: !607, size: 32, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !908, file: !337, line: 247, baseType: !607, size: 32, offset: 672)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !908, file: !337, line: 250, baseType: !607, size: 32, offset: 704)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !908, file: !337, line: 253, baseType: !607, size: 32, offset: 736)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !908, file: !337, line: 256, baseType: !607, size: 32, offset: 768)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !815, file: !797, line: 179, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !797, line: 150, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !797, line: 142, size: 320, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1203, !1204}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1195, file: !797, line: 144, baseType: !619, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1195, file: !797, line: 145, baseType: !794, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1195, file: !797, line: 146, baseType: !794, size: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1195, file: !797, line: 147, baseType: !1201, size: 32, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1202, line: 31, baseType: !607)
!1202 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1195, file: !797, line: 148, baseType: !7, size: 32, offset: 224)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1195, file: !797, line: 149, baseType: !606, size: 8, offset: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !815, file: !797, line: 180, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !797, line: 162, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !797, line: 159, size: 128, elements: !1209)
!1209 = !{!1210, !1211}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1208, file: !797, line: 160, baseType: !619, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1208, file: !797, line: 161, baseType: !675, size: 64, offset: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !815, file: !797, line: 181, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !797, line: 181, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !810, file: !797, line: 317, baseType: !1216, size: 64)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 64, elements: !718)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !810, file: !797, line: 318, baseType: !1218, size: 320)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !797, line: 188, size: 320, elements: !1219)
!1219 = !{!1220, !1222, !1245}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1218, file: !797, line: 190, baseType: !1221, size: 192)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 192, elements: !693)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1218, file: !797, line: 193, baseType: !1223, size: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !797, line: 206, size: 320, elements: !1225)
!1225 = !{!1226, !1230, !1231, !1232, !1244}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1224, file: !797, line: 208, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !620, line: 62, baseType: !1229)
!1229 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !620, line: 61, flags: DIFlagFwdDecl)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1224, file: !797, line: 211, baseType: !7, size: 32, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1224, file: !797, line: 214, baseType: !675, size: 64, offset: 128)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1224, file: !797, line: 224, baseType: !1233, size: 64, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !797, line: 202, baseType: !1235)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !797, line: 202, size: 128, elements: !1236)
!1236 = !{!1237}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1235, file: !797, line: 202, baseType: !1238, size: 128)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !797, line: 200, baseType: !1239)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !797, line: 200, size: 128, elements: !1240)
!1240 = !{!1241, !1242, !1243}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1239, file: !797, line: 200, baseType: !7, size: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1239, file: !797, line: 200, baseType: !7, size: 32, offset: 32)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1239, file: !797, line: 200, baseType: !828, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1224, file: !797, line: 234, baseType: !1233, size: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1218, file: !797, line: 197, baseType: !675, size: 64, offset: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !810, file: !797, line: 319, baseType: !682, size: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !810, file: !797, line: 320, baseType: !701, size: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !622, file: !135, line: 3384, baseType: !1249, size: 1472)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1250)
!1250 = !{!1251, !1272, !1273, !1274, !1275}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1249, file: !135, line: 3115, baseType: !1252, size: 1216)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1253)
!1253 = !{!1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1252, file: !135, line: 2985, baseType: !790, size: 960)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1252, file: !135, line: 2986, baseType: !619, size: 64, offset: 960)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1252, file: !135, line: 2987, baseType: !619, size: 64, offset: 1024)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1252, file: !135, line: 2988, baseType: !619, size: 64, offset: 1088)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1252, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1252, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1252, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1252, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1252, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1252, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1252, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1252, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1252, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1252, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1252, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1252, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1252, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1252, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1249, file: !135, line: 3117, baseType: !619, size: 64, offset: 1216)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1249, file: !135, line: 3119, baseType: !619, size: 64, offset: 1280)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1249, file: !135, line: 3121, baseType: !619, size: 64, offset: 1344)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1249, file: !135, line: 3123, baseType: !619, size: 64, offset: 1408)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !622, file: !135, line: 3385, baseType: !1277, size: 1088)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1278)
!1278 = !{!1279, !1280, !1281}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1277, file: !135, line: 2875, baseType: !790, size: 960)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1277, file: !135, line: 2876, baseType: !794, size: 64, offset: 960)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1277, file: !135, line: 2877, baseType: !1282, size: 64, offset: 1024)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1284, line: 172, size: 128, elements: !1285)
!1284 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1285 = !{!1286, !1287, !1288, !1289, !1290, !1291, !1292}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1283, file: !1284, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1283, file: !1284, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1283, file: !1284, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1283, file: !1284, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1283, file: !1284, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1283, file: !1284, line: 195, baseType: !7, size: 32, offset: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1283, file: !1284, line: 199, baseType: !619, size: 64, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !622, file: !135, line: 3386, baseType: !1252, size: 1216)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !622, file: !135, line: 3387, baseType: !1295, size: 1280)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1296)
!1296 = !{!1297, !1298}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1295, file: !135, line: 3094, baseType: !1252, size: 1216)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1295, file: !135, line: 3095, baseType: !1282, size: 64, offset: 1216)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !622, file: !135, line: 3388, baseType: !1300, size: 1216)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1300, file: !135, line: 2825, baseType: !752, size: 896)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1300, file: !135, line: 2827, baseType: !619, size: 64, offset: 896)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1300, file: !135, line: 2828, baseType: !619, size: 64, offset: 960)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1300, file: !135, line: 2829, baseType: !619, size: 64, offset: 1024)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1300, file: !135, line: 2830, baseType: !619, size: 64, offset: 1088)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1300, file: !135, line: 2831, baseType: !619, size: 64, offset: 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !622, file: !135, line: 3389, baseType: !1309, size: 1024)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1310)
!1310 = !{!1311, !1312, !1313}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1309, file: !135, line: 2851, baseType: !790, size: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1309, file: !135, line: 2852, baseType: !607, size: 32, offset: 960)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1309, file: !135, line: 2853, baseType: !607, size: 32, offset: 992)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !622, file: !135, line: 3390, baseType: !1315, size: 1024)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1316)
!1316 = !{!1317, !1318}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1315, file: !135, line: 2858, baseType: !790, size: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1315, file: !135, line: 2859, baseType: !1282, size: 64, offset: 960)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !622, file: !135, line: 3391, baseType: !1320, size: 960)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1321)
!1321 = !{!1322}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1320, file: !135, line: 2863, baseType: !790, size: 960)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !622, file: !135, line: 3392, baseType: !1324, size: 1472)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1325)
!1325 = !{!1326}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1324, file: !135, line: 3305, baseType: !1249, size: 1472)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !622, file: !135, line: 3393, baseType: !1328, size: 1792)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1329)
!1329 = !{!1330, !1331, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1328, file: !135, line: 3249, baseType: !1249, size: 1472)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1328, file: !135, line: 3251, baseType: !1332, size: 64, offset: 1472)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1334, line: 463, size: 1152, elements: !1335)
!1334 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1335 = !{!1336, !1497, !1528, !1529, !1584, !1587, !1588, !1589, !1590, !1591, !1592, !1616, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1333, file: !1334, line: 464, baseType: !1337, size: 64)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !1339)
!1339 = !{!1340, !1389, !1402, !1416, !1466, !1478}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1338, file: !330, line: 197, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !1342)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !1344)
!1344 = !{!1345, !1346, !1347, !1348, !1349, !1350, !1377, !1386, !1387, !1388}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1343, file: !330, line: 119, baseType: !1342, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1343, file: !330, line: 122, baseType: !1342, size: 64, offset: 64)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1343, file: !330, line: 123, baseType: !1342, size: 64, offset: 128)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1343, file: !330, line: 126, baseType: !607, size: 32, offset: 192)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1343, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1343, file: !330, line: 165, baseType: !1351, size: 192, offset: 256)
!1351 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !1352)
!1352 = !{!1353, !1366, !1372}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1351, file: !330, line: 137, baseType: !1354, size: 128)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !1355)
!1355 = !{!1356, !1365}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1354, file: !330, line: 135, baseType: !1357, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363, !1364}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1358, file: !330, line: 96, baseType: !1357, size: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1358, file: !330, line: 97, baseType: !1357, size: 64, offset: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1358, file: !330, line: 101, baseType: !619, size: 64, offset: 128)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1358, file: !330, line: 106, baseType: !619, size: 64, offset: 192)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1358, file: !330, line: 111, baseType: !619, size: 64, offset: 256)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1354, file: !330, line: 136, baseType: !1357, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1351, file: !330, line: 151, baseType: !1367, size: 192)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !330, line: 139, size: 192, elements: !1368)
!1368 = !{!1369, !1370, !1371}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1367, file: !330, line: 141, baseType: !619, size: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1367, file: !330, line: 145, baseType: !619, size: 64, offset: 64)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1367, file: !330, line: 150, baseType: !607, size: 32, offset: 128)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1351, file: !330, line: 164, baseType: !1373, size: 128)
!1373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !330, line: 153, size: 128, elements: !1374)
!1374 = !{!1375, !1376}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1373, file: !330, line: 161, baseType: !619, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1373, file: !330, line: 163, baseType: !744, size: 32, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1343, file: !330, line: 168, baseType: !1378, size: 64, offset: 448)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !330, line: 67, size: 320, elements: !1380)
!1380 = !{!1381, !1382, !1383, !1384, !1385}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1379, file: !330, line: 70, baseType: !1378, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1379, file: !330, line: 73, baseType: !1342, size: 64, offset: 64)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1379, file: !330, line: 78, baseType: !619, size: 64, offset: 128)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1379, file: !330, line: 85, baseType: !794, size: 64, offset: 192)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1379, file: !330, line: 88, baseType: !607, size: 32, offset: 256)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1343, file: !330, line: 173, baseType: !794, size: 64, offset: 512)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1343, file: !330, line: 173, baseType: !794, size: 64, offset: 576)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1343, file: !330, line: 177, baseType: !606, size: 8, offset: 640)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1338, file: !330, line: 200, baseType: !1390, size: 64, offset: 64)
!1390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1391, size: 64)
!1391 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !330, line: 185, baseType: !1392)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !330, line: 185, size: 128, elements: !1393)
!1393 = !{!1394}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1392, file: !330, line: 185, baseType: !1395, size: 128)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !330, line: 184, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !330, line: 184, size: 128, elements: !1397)
!1397 = !{!1398, !1399, !1400}
