; ModuleID = 'lto-streamer-in.bc'
source_filename = "lto-streamer-in.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!1415 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_NEXT", value: 691, isUnsigned: true)
!1416 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_NEXT", value: 692, isUnsigned: true)
!1417 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_NEXT", value: 693, isUnsigned: true)
!1418 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_STATIC_START", value: 694, isUnsigned: true)
!1419 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_DYNAMIC_START", value: 695, isUnsigned: true)
!1420 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_GUIDED_START", value: 696, isUnsigned: true)
!1421 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_RUNTIME_START", value: 697, isUnsigned: true)
!1422 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END", value: 698, isUnsigned: true)
!1423 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END_NOWAIT", value: 699, isUnsigned: true)
!1424 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_START", value: 700, isUnsigned: true)
!1425 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_END", value: 701, isUnsigned: true)
!1426 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_START", value: 702, isUnsigned: true)
!1427 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_END", value: 703, isUnsigned: true)
!1428 = !DIEnumerator(name: "BUILT_IN_GOMP_TASK", value: 704, isUnsigned: true)
!1429 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_START", value: 705, isUnsigned: true)
!1430 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_NEXT", value: 706, isUnsigned: true)
!1431 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_SECTIONS_START", value: 707, isUnsigned: true)
!1432 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END", value: 708, isUnsigned: true)
!1433 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END_NOWAIT", value: 709, isUnsigned: true)
!1434 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_START", value: 710, isUnsigned: true)
!1435 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_START", value: 711, isUnsigned: true)
!1436 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_END", value: 712, isUnsigned: true)
!1437 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MIN", value: 713, isUnsigned: true)
!1438 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MAX", value: 716, isUnsigned: true)
!1439 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MIN", value: 717, isUnsigned: true)
!1440 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MAX", value: 720, isUnsigned: true)
!1441 = !DIEnumerator(name: "END_BUILTINS", value: 721, isUnsigned: true)
!1442 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "symbol_visibility", file: !135, line: 2465, baseType: !7, size: 32, elements: !1443)
!1443 = !{!1444, !1445, !1446, !1447}
!1444 = !DIEnumerator(name: "VISIBILITY_DEFAULT", value: 0, isUnsigned: true)
!1445 = !DIEnumerator(name: "VISIBILITY_PROTECTED", value: 1, isUnsigned: true)
!1446 = !DIEnumerator(name: "VISIBILITY_HIDDEN", value: 2, isUnsigned: true)
!1447 = !DIEnumerator(name: "VISIBILITY_INTERNAL", value: 3, isUnsigned: true)
!1448 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tls_model", file: !1449, line: 97, baseType: !7, size: 32, elements: !1450)
!1449 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1450 = !{!1451, !1452, !1453, !1454, !1455, !1456, !1457}
!1451 = !DIEnumerator(name: "TLS_MODEL_NONE", value: 0, isUnsigned: true)
!1452 = !DIEnumerator(name: "TLS_MODEL_EMULATED", value: 1, isUnsigned: true)
!1453 = !DIEnumerator(name: "TLS_MODEL_REAL", value: 2, isUnsigned: true)
!1454 = !DIEnumerator(name: "TLS_MODEL_GLOBAL_DYNAMIC", value: 2, isUnsigned: true)
!1455 = !DIEnumerator(name: "TLS_MODEL_LOCAL_DYNAMIC", value: 3, isUnsigned: true)
!1456 = !DIEnumerator(name: "TLS_MODEL_INITIAL_EXEC", value: 4, isUnsigned: true)
!1457 = !DIEnumerator(name: "TLS_MODEL_LOCAL_EXEC", value: 5, isUnsigned: true)
!1458 = !{!1459, !1460, !1461, !1462, !1465, !1466, !7, !1468, !2891, !3198, !336, !2003, !2383, !2019, !645, !3043, !2270, !2222, !2221, !3222, !2295, !2237, !1594, !1463, !3225, !2283, !2258, !2345, !2361, !1523, !134, !651, !1826, !1792, !3230, !3232, !3249, !602, !716, !722, !1521, !1529, !5, !1442, !1448, !3262, !2669, !3263, !2307}
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1460 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1461 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1464)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1449, line: 56, baseType: !1469)
!1469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1470, size: 64)
!1470 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !1471)
!1471 = !{!1472, !1505, !1511, !1524, !1543, !1554, !1559, !1568, !1574, !1587, !1599, !1637, !2129, !2157, !2174, !2175, !2180, !2189, !2195, !2200, !2204, !2208, !2542, !2589, !2595, !2601, !2608, !2621, !2635, !2652, !2664, !2686, !2701, !2873}
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1470, file: !135, line: 3372, baseType: !1473, size: 64)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !1474)
!1474 = !{!1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1473, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1473, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1473, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1473, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1473, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1473, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1473, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1473, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1473, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1473, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1473, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1473, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1473, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1473, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1473, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1473, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1473, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1473, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1473, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1473, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1473, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1473, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1473, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1473, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1473, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1473, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1473, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1473, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1473, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1473, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1470, file: !135, line: 3373, baseType: !1506, size: 192)
!1506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !1507)
!1507 = !{!1508, !1509, !1510}
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1506, file: !135, line: 403, baseType: !1473, size: 64)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1506, file: !135, line: 404, baseType: !1468, size: 64, offset: 64)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1506, file: !135, line: 405, baseType: !1468, size: 64, offset: 128)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1470, file: !135, line: 3374, baseType: !1512, size: 320)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !1513)
!1513 = !{!1514, !1515}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1512, file: !135, line: 1385, baseType: !1506, size: 192)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1512, file: !135, line: 1386, baseType: !1516, size: 128, offset: 192)
!1516 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1517, line: 58, baseType: !1518)
!1517 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1517, line: 54, size: 128, elements: !1519)
!1519 = !{!1520, !1522}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1518, file: !1517, line: 56, baseType: !1521, size: 64)
!1521 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1518, file: !1517, line: 57, baseType: !1523, size: 64, offset: 64)
!1523 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1470, file: !135, line: 3375, baseType: !1525, size: 256)
!1525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !1526)
!1526 = !{!1527, !1528}
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1525, file: !135, line: 1398, baseType: !1506, size: 192)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1525, file: !135, line: 1399, baseType: !1529, size: 64, offset: 192)
!1529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1530, size: 64)
!1530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1531, line: 52, size: 256, elements: !1532)
!1531 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1532 = !{!1533, !1534, !1535, !1536, !1537, !1538, !1539}
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1530, file: !1531, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1530, file: !1531, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1530, file: !1531, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1530, file: !1531, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1530, file: !1531, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1530, file: !1531, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1530, file: !1531, line: 62, baseType: !1540, size: 192, offset: 64)
!1540 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1521, size: 192, elements: !1541)
!1541 = !{!1542}
!1542 = !DISubrange(count: 3)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1470, file: !135, line: 3376, baseType: !1544, size: 256)
!1544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !1545)
!1545 = !{!1546, !1547}
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1544, file: !135, line: 1409, baseType: !1506, size: 192)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1544, file: !135, line: 1410, baseType: !1548, size: 64, offset: 192)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1549, size: 64)
!1549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1550, line: 27, size: 192, elements: !1551)
!1550 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1551 = !{!1552, !1553}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1549, file: !1550, line: 29, baseType: !1516, size: 128)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1549, file: !1550, line: 30, baseType: !5, size: 32, offset: 128)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1470, file: !135, line: 3377, baseType: !1555, size: 256)
!1555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !1556)
!1556 = !{!1557, !1558}
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1555, file: !135, line: 1438, baseType: !1506, size: 192)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1555, file: !135, line: 1439, baseType: !1468, size: 64, offset: 192)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1470, file: !135, line: 3378, baseType: !1560, size: 256)
!1560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !1561)
!1561 = !{!1562, !1563, !1564}
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1560, file: !135, line: 1419, baseType: !1506, size: 192)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1560, file: !135, line: 1420, baseType: !1461, size: 32, offset: 192)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1560, file: !135, line: 1421, baseType: !1565, size: 8, offset: 224)
!1565 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1464, size: 8, elements: !1566)
!1566 = !{!1567}
!1567 = !DISubrange(count: 1)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1470, file: !135, line: 3379, baseType: !1569, size: 320)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !1570)
!1570 = !{!1571, !1572, !1573}
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1569, file: !135, line: 1429, baseType: !1506, size: 192)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1569, file: !135, line: 1430, baseType: !1468, size: 64, offset: 192)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1569, file: !135, line: 1431, baseType: !1468, size: 64, offset: 256)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1470, file: !135, line: 3380, baseType: !1575, size: 320)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !1576)
!1576 = !{!1577, !1578}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1575, file: !135, line: 1461, baseType: !1506, size: 192)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1575, file: !135, line: 1462, baseType: !1579, size: 128, offset: 192)
!1579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1580, line: 31, size: 128, elements: !1581)
!1580 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1581 = !{!1582, !1585, !1586}
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1579, file: !1580, line: 32, baseType: !1583, size: 64)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64)
!1584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1460)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1579, file: !1580, line: 33, baseType: !7, size: 32, offset: 64)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1579, file: !1580, line: 34, baseType: !7, size: 32, offset: 96)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1470, file: !135, line: 3381, baseType: !1588, size: 384)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !1589)
!1589 = !{!1590, !1591, !1596, !1597, !1598}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1588, file: !135, line: 2508, baseType: !1506, size: 192)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1588, file: !135, line: 2509, baseType: !1592, size: 32, offset: 192)
!1592 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1593, line: 58, baseType: !1594)
!1593 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1595, line: 44, baseType: !7)
!1595 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1588, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1588, file: !135, line: 2511, baseType: !1468, size: 64, offset: 256)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1588, file: !135, line: 2512, baseType: !1468, size: 64, offset: 320)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1470, file: !135, line: 3382, baseType: !1600, size: 896)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1601)
!1601 = !{!1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1600, file: !135, line: 2653, baseType: !1588, size: 384)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1600, file: !135, line: 2654, baseType: !1468, size: 64, offset: 384)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1600, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1600, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1600, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1600, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1600, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1600, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1600, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1600, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1600, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1600, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1600, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1600, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1600, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1600, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1600, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1600, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1600, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1600, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1600, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1600, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1600, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1600, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1600, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1600, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1600, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1600, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1600, file: !135, line: 2705, baseType: !1468, size: 64, offset: 576)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1600, file: !135, line: 2706, baseType: !1468, size: 64, offset: 640)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1600, file: !135, line: 2707, baseType: !1468, size: 64, offset: 704)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1600, file: !135, line: 2708, baseType: !1468, size: 64, offset: 768)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1600, file: !135, line: 2711, baseType: !1635, size: 64, offset: 832)
!1635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1636, size: 64)
!1636 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1470, file: !135, line: 3383, baseType: !1638, size: 960)
!1638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1639)
!1639 = !{!1640, !1641}
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1638, file: !135, line: 2757, baseType: !1600, size: 896)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1638, file: !135, line: 2758, baseType: !1642, size: 64, offset: 896)
!1642 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1449, line: 50, baseType: !1643)
!1643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1644, size: 64)
!1644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1645, line: 240, size: 384, elements: !1646)
!1645 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1646 = !{!1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1644, file: !1645, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1644, file: !1645, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1644, file: !1645, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1644, file: !1645, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1644, file: !1645, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1644, file: !1645, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1644, file: !1645, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1644, file: !1645, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1644, file: !1645, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1644, file: !1645, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1644, file: !1645, line: 321, baseType: !1658, size: 320, offset: 64)
!1658 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1645, line: 315, size: 320, elements: !1659)
!1659 = !{!1660, !2062, !2064, !2127, !2128}
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1658, file: !1645, line: 316, baseType: !1661, size: 64)
!1661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1662, size: 64, elements: !1566)
!1662 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1645, line: 183, baseType: !1663)
!1663 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1645, line: 166, size: 64, elements: !1664)
!1664 = !{!1665, !1666, !1667, !1668, !1669, !1677, !1678, !1690, !1693, !1753, !1754, !2039, !2052, !2059}
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1663, file: !1645, line: 168, baseType: !1461, size: 32)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1663, file: !1645, line: 169, baseType: !7, size: 32)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1663, file: !1645, line: 170, baseType: !1466, size: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1663, file: !1645, line: 171, baseType: !1642, size: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1663, file: !1645, line: 172, baseType: !1670, size: 64)
!1670 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1449, line: 53, baseType: !1671)
!1671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1672, size: 64)
!1672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1645, line: 359, size: 128, elements: !1673)
!1673 = !{!1674, !1675}
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1672, file: !1645, line: 360, baseType: !1461, size: 32)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1672, file: !1645, line: 361, baseType: !1676, size: 64, offset: 64)
!1676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1642, size: 64, elements: !1566)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1663, file: !1645, line: 173, baseType: !5, size: 32)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1663, file: !1645, line: 174, baseType: !1679, size: 32)
!1679 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1645, line: 133, baseType: !1680)
!1680 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1645, line: 115, size: 32, elements: !1681)
!1681 = !{!1682, !1683, !1684, !1685, !1686, !1687, !1688, !1689}
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1680, file: !1645, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1683 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1680, file: !1645, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1680, file: !1645, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1680, file: !1645, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1680, file: !1645, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1680, file: !1645, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1680, file: !1645, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1680, file: !1645, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1663, file: !1645, line: 175, baseType: !1691, size: 64)
!1691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1692, size: 64)
!1692 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1645, line: 175, flags: DIFlagFwdDecl)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1663, file: !1645, line: 176, baseType: !1694, size: 64)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1696, line: 75, size: 256, elements: !1697)
!1696 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1697 = !{!1698, !1712, !1713, !1714}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1695, file: !1696, line: 76, baseType: !1699, size: 64)
!1699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1700, size: 64)
!1700 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1696, line: 68, baseType: !1701)
!1701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1696, line: 63, size: 320, elements: !1702)
!1702 = !{!1703, !1705, !1706, !1707}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1701, file: !1696, line: 64, baseType: !1704, size: 64)
!1704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1701, size: 64)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1701, file: !1696, line: 65, baseType: !1704, size: 64, offset: 64)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1701, file: !1696, line: 66, baseType: !7, size: 32, offset: 128)
!1707 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1701, file: !1696, line: 67, baseType: !1708, size: 128, offset: 192)
!1708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1709, size: 128, elements: !1710)
!1709 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1696, line: 29, baseType: !1521)
!1710 = !{!1711}
!1711 = !DISubrange(count: 2)
!1712 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1695, file: !1696, line: 77, baseType: !1699, size: 64, offset: 64)
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1695, file: !1696, line: 78, baseType: !7, size: 32, offset: 128)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1695, file: !1696, line: 79, baseType: !1715, size: 64, offset: 192)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1696, line: 49, baseType: !1717)
!1717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1696, line: 45, size: 832, elements: !1718)
!1718 = !{!1719, !1720, !1721}
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1717, file: !1696, line: 46, baseType: !1704, size: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1717, file: !1696, line: 47, baseType: !1694, size: 64, offset: 64)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1717, file: !1696, line: 48, baseType: !1722, size: 704, offset: 128)
!1722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1723, line: 164, size: 704, elements: !1724)
!1723 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1724 = !{!1725, !1726, !1736, !1737, !1738, !1739, !1740, !1741, !1745, !1749, !1750, !1751, !1752}
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1722, file: !1723, line: 166, baseType: !1523, size: 64)
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1722, file: !1723, line: 167, baseType: !1727, size: 64, offset: 64)
!1727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1728, size: 64)
!1728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1723, line: 157, size: 192, elements: !1729)
!1729 = !{!1730, !1731, !1732}
!1730 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1728, file: !1723, line: 159, baseType: !1463, size: 64)
!1731 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1728, file: !1723, line: 160, baseType: !1727, size: 64, offset: 64)
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1728, file: !1723, line: 161, baseType: !1733, size: 32, offset: 128)
!1733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1464, size: 32, elements: !1734)
!1734 = !{!1735}
!1735 = !DISubrange(count: 4)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1722, file: !1723, line: 168, baseType: !1463, size: 64, offset: 128)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1722, file: !1723, line: 169, baseType: !1463, size: 64, offset: 192)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1722, file: !1723, line: 170, baseType: !1463, size: 64, offset: 256)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1722, file: !1723, line: 171, baseType: !1523, size: 64, offset: 320)
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1722, file: !1723, line: 172, baseType: !1461, size: 32, offset: 384)
!1741 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1722, file: !1723, line: 176, baseType: !1742, size: 64, offset: 448)
!1742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1743, size: 64)
!1743 = !DISubroutineType(types: !1744)
!1744 = !{!1727, !1465, !1523}
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1722, file: !1723, line: 177, baseType: !1746, size: 64, offset: 512)
!1746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1747, size: 64)
!1747 = !DISubroutineType(types: !1748)
!1748 = !{null, !1465, !1727}
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1722, file: !1723, line: 178, baseType: !1465, size: 64, offset: 576)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1722, file: !1723, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1722, file: !1723, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1722, file: !1723, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1663, file: !1645, line: 177, baseType: !1468, size: 64)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1663, file: !1645, line: 178, baseType: !1755, size: 64)
!1755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1756, size: 64)
!1756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !1757)
!1757 = !{!1758, !2004, !2005, !2006, !2009, !2013, !2014, !2015, !2033, !2034, !2035, !2036, !2037, !2038}
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1756, file: !337, line: 219, baseType: !1759, size: 64)
!1759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1760, size: 64)
!1760 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !1761)
!1761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !1762)
!1762 = !{!1763}
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1761, file: !337, line: 151, baseType: !1764, size: 128)
!1764 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !1765)
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !1766)
!1766 = !{!1767, !1768, !1769}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1765, file: !337, line: 150, baseType: !7, size: 32)
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1765, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1765, file: !337, line: 150, baseType: !1770, size: 64, offset: 64)
!1770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1771, size: 64, elements: !1566)
!1771 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1449, line: 108, baseType: !1772)
!1772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1773, size: 64)
!1773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !1774)
!1774 = !{!1775, !1776, !1777, !1996, !1997, !1998, !1999, !2000, !2001, !2002}
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1773, file: !337, line: 124, baseType: !1755, size: 64)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1773, file: !337, line: 125, baseType: !1755, size: 64, offset: 64)
!1777 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1773, file: !337, line: 131, baseType: !1778, size: 64, offset: 128)
!1778 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !1779)
!1779 = !{!1780, !1995}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1778, file: !337, line: 129, baseType: !1781, size: 64)
!1781 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1449, line: 66, baseType: !1782)
!1782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1783, size: 64)
!1783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !652, line: 143, size: 192, elements: !1784)
!1784 = !{!1785, !1993, !1994}
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1783, file: !652, line: 145, baseType: !1786, size: 64)
!1786 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1449, line: 69, baseType: !1787)
!1787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1788, size: 64)
!1788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !652, line: 136, size: 192, elements: !1789)
!1789 = !{!1790, !1991, !1992}
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1788, file: !652, line: 137, baseType: !1791, size: 64)
!1791 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1449, line: 58, baseType: !1792)
!1792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1793, size: 64)
!1793 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !652, line: 737, size: 768, elements: !1794)
!1794 = !{!1795, !1812, !1846, !1852, !1857, !1862, !1869, !1875, !1881, !1886, !1900, !1905, !1911, !1916, !1926, !1931, !1949, !1956, !1963, !1969, !1974, !1980, !1986}
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1793, file: !652, line: 738, baseType: !1796, size: 256)
!1796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !652, line: 271, size: 256, elements: !1797)
!1797 = !{!1798, !1799, !1800, !1801, !1802, !1803, !1804, !1805, !1806, !1807, !1808, !1809, !1810, !1811}
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1796, file: !652, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1796, file: !652, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1796, file: !652, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1801 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1796, file: !652, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1796, file: !652, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1796, file: !652, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1796, file: !652, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1805 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1796, file: !652, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1806 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1796, file: !652, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1796, file: !652, line: 312, baseType: !7, size: 32, offset: 32)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1796, file: !652, line: 316, baseType: !1592, size: 32, offset: 64)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1796, file: !652, line: 319, baseType: !7, size: 32, offset: 96)
!1810 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1796, file: !652, line: 323, baseType: !1755, size: 64, offset: 128)
!1811 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1796, file: !652, line: 327, baseType: !1468, size: 64, offset: 192)
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1793, file: !652, line: 739, baseType: !1813, size: 448)
!1813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !652, line: 350, size: 448, elements: !1814)
!1814 = !{!1815, !1844}
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1813, file: !652, line: 353, baseType: !1816, size: 384)
!1816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !652, line: 333, size: 384, elements: !1817)
!1817 = !{!1818, !1819, !1827}
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1816, file: !652, line: 336, baseType: !1796, size: 256)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1816, file: !652, line: 343, baseType: !1820, size: 64, offset: 256)
!1820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1821, size: 64)
!1821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1822, line: 37, size: 128, elements: !1823)
!1822 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1823 = !{!1824, !1825}
!1824 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1821, file: !1822, line: 39, baseType: !1820, size: 64)
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1821, file: !1822, line: 40, baseType: !1826, size: 64, offset: 64)
!1826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1816, file: !652, line: 344, baseType: !1828, size: 64, offset: 320)
!1828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1829, size: 64)
!1829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1822, line: 45, size: 320, elements: !1830)
!1830 = !{!1831, !1832}
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1829, file: !1822, line: 47, baseType: !1828, size: 64)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1829, file: !1822, line: 48, baseType: !1833, size: 256, offset: 64)
!1833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1834)
!1834 = !{!1835, !1837, !1838, !1843}
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1833, file: !135, line: 1884, baseType: !1836, size: 64)
!1836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1833, size: 64)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1833, file: !135, line: 1885, baseType: !1836, size: 64, offset: 64)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1833, file: !135, line: 1891, baseType: !1839, size: 64, offset: 128)
!1839 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1833, file: !135, line: 1891, size: 64, elements: !1840)
!1840 = !{!1841, !1842}
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1839, file: !135, line: 1891, baseType: !1791, size: 64)
!1842 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1839, file: !135, line: 1891, baseType: !1468, size: 64)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1833, file: !135, line: 1892, baseType: !1826, size: 64, offset: 192)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1813, file: !652, line: 359, baseType: !1845, size: 64, offset: 384)
!1845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1468, size: 64, elements: !1566)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1793, file: !652, line: 740, baseType: !1847, size: 512)
!1847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !652, line: 365, size: 512, elements: !1848)
!1848 = !{!1849, !1850, !1851}
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1847, file: !652, line: 368, baseType: !1816, size: 384)
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1847, file: !652, line: 373, baseType: !1468, size: 64, offset: 384)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1847, file: !652, line: 374, baseType: !1468, size: 64, offset: 448)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1793, file: !652, line: 741, baseType: !1853, size: 576)
!1853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !652, line: 380, size: 576, elements: !1854)
!1854 = !{!1855, !1856}
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1853, file: !652, line: 383, baseType: !1847, size: 512)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1853, file: !652, line: 389, baseType: !1845, size: 64, offset: 512)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1793, file: !652, line: 742, baseType: !1858, size: 320)
!1858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !652, line: 395, size: 320, elements: !1859)
!1859 = !{!1860, !1861}
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1858, file: !652, line: 397, baseType: !1796, size: 256)
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1858, file: !652, line: 400, baseType: !1781, size: 64, offset: 256)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1793, file: !652, line: 743, baseType: !1863, size: 448)
!1863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !652, line: 406, size: 448, elements: !1864)
!1864 = !{!1865, !1866, !1867, !1868}
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1863, file: !652, line: 408, baseType: !1796, size: 256)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1863, file: !652, line: 412, baseType: !1468, size: 64, offset: 256)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1863, file: !652, line: 420, baseType: !1468, size: 64, offset: 320)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1863, file: !652, line: 423, baseType: !1781, size: 64, offset: 384)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1793, file: !652, line: 744, baseType: !1870, size: 384)
!1870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !652, line: 429, size: 384, elements: !1871)
!1871 = !{!1872, !1873, !1874}
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1870, file: !652, line: 431, baseType: !1796, size: 256)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1870, file: !652, line: 434, baseType: !1468, size: 64, offset: 256)
!1874 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1870, file: !652, line: 437, baseType: !1781, size: 64, offset: 320)
!1875 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1793, file: !652, line: 745, baseType: !1876, size: 384)
!1876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !652, line: 443, size: 384, elements: !1877)
!1877 = !{!1878, !1879, !1880}
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1876, file: !652, line: 445, baseType: !1796, size: 256)
!1879 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1876, file: !652, line: 449, baseType: !1468, size: 64, offset: 256)
!1880 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1876, file: !652, line: 453, baseType: !1781, size: 64, offset: 320)
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1793, file: !652, line: 746, baseType: !1882, size: 320)
!1882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !652, line: 459, size: 320, elements: !1883)
!1883 = !{!1884, !1885}
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1882, file: !652, line: 461, baseType: !1796, size: 256)
!1885 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1882, file: !652, line: 464, baseType: !1468, size: 64, offset: 256)
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1793, file: !652, line: 747, baseType: !1887, size: 768)
!1887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !652, line: 469, size: 768, elements: !1888)
!1888 = !{!1889, !1890, !1891, !1892, !1893}
!1889 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1887, file: !652, line: 471, baseType: !1796, size: 256)
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1887, file: !652, line: 474, baseType: !7, size: 32, offset: 256)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1887, file: !652, line: 475, baseType: !7, size: 32, offset: 288)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1887, file: !652, line: 478, baseType: !1468, size: 64, offset: 320)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1887, file: !652, line: 481, baseType: !1894, size: 384, offset: 384)
!1894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1895, size: 384, elements: !1566)
!1895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1896)
!1896 = !{!1897, !1898, !1899}
!1897 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1895, file: !135, line: 1920, baseType: !1833, size: 256)
!1898 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1895, file: !135, line: 1921, baseType: !1468, size: 64, offset: 256)
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1895, file: !135, line: 1922, baseType: !1592, size: 32, offset: 320)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1793, file: !652, line: 748, baseType: !1901, size: 320)
!1901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !652, line: 487, size: 320, elements: !1902)
!1902 = !{!1903, !1904}
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1901, file: !652, line: 490, baseType: !1796, size: 256)
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1901, file: !652, line: 494, baseType: !1461, size: 32, offset: 256)
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1793, file: !652, line: 749, baseType: !1906, size: 384)
!1906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !652, line: 500, size: 384, elements: !1907)
!1907 = !{!1908, !1909, !1910}
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1906, file: !652, line: 502, baseType: !1796, size: 256)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1906, file: !652, line: 506, baseType: !1781, size: 64, offset: 256)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1906, file: !652, line: 510, baseType: !1781, size: 64, offset: 320)
!1911 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1793, file: !652, line: 750, baseType: !1912, size: 320)
!1912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !652, line: 529, size: 320, elements: !1913)
!1913 = !{!1914, !1915}
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1912, file: !652, line: 531, baseType: !1796, size: 256)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1912, file: !652, line: 540, baseType: !1781, size: 64, offset: 256)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1793, file: !652, line: 751, baseType: !1917, size: 704)
!1917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !652, line: 546, size: 704, elements: !1918)
!1918 = !{!1919, !1920, !1921, !1922, !1923, !1924, !1925}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1917, file: !652, line: 549, baseType: !1847, size: 512)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1917, file: !652, line: 553, baseType: !1466, size: 64, offset: 512)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1917, file: !652, line: 557, baseType: !1460, size: 8, offset: 576)
!1922 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1917, file: !652, line: 558, baseType: !1460, size: 8, offset: 584)
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1917, file: !652, line: 559, baseType: !1460, size: 8, offset: 592)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1917, file: !652, line: 560, baseType: !1460, size: 8, offset: 600)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1917, file: !652, line: 566, baseType: !1845, size: 64, offset: 640)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1793, file: !652, line: 752, baseType: !1927, size: 384)
!1927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !652, line: 571, size: 384, elements: !1928)
!1928 = !{!1929, !1930}
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1927, file: !652, line: 573, baseType: !1858, size: 320)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1927, file: !652, line: 577, baseType: !1468, size: 64, offset: 320)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1793, file: !652, line: 753, baseType: !1932, size: 576)
!1932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !652, line: 600, size: 576, elements: !1933)
!1933 = !{!1934, !1935, !1936, !1939, !1948}
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1932, file: !652, line: 602, baseType: !1858, size: 320)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1932, file: !652, line: 605, baseType: !1468, size: 64, offset: 320)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1932, file: !652, line: 609, baseType: !1937, size: 64, offset: 384)
!1937 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1938, line: 46, baseType: !1521)
!1938 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1932, file: !652, line: 612, baseType: !1940, size: 64, offset: 448)
!1940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1941, size: 64)
!1941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !652, line: 581, size: 320, elements: !1942)
!1942 = !{!1943, !1944, !1945, !1946, !1947}
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1941, file: !652, line: 583, baseType: !134, size: 32)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1941, file: !652, line: 586, baseType: !1468, size: 64, offset: 64)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1941, file: !652, line: 589, baseType: !1468, size: 64, offset: 128)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1941, file: !652, line: 592, baseType: !1468, size: 64, offset: 192)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1941, file: !652, line: 595, baseType: !1468, size: 64, offset: 256)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1932, file: !652, line: 616, baseType: !1781, size: 64, offset: 512)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1793, file: !652, line: 754, baseType: !1950, size: 512)
!1950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !652, line: 622, size: 512, elements: !1951)
!1951 = !{!1952, !1953, !1954, !1955}
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1950, file: !652, line: 624, baseType: !1858, size: 320)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1950, file: !652, line: 628, baseType: !1468, size: 64, offset: 320)
!1954 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1950, file: !652, line: 632, baseType: !1468, size: 64, offset: 384)
!1955 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1950, file: !652, line: 636, baseType: !1468, size: 64, offset: 448)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1793, file: !652, line: 755, baseType: !1957, size: 704)
!1957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !652, line: 642, size: 704, elements: !1958)
!1958 = !{!1959, !1960, !1961, !1962}
!1959 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1957, file: !652, line: 644, baseType: !1950, size: 512)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1957, file: !652, line: 648, baseType: !1468, size: 64, offset: 512)
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1957, file: !652, line: 652, baseType: !1468, size: 64, offset: 576)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1957, file: !652, line: 653, baseType: !1468, size: 64, offset: 640)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1793, file: !652, line: 756, baseType: !1964, size: 448)
!1964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !652, line: 663, size: 448, elements: !1965)
!1965 = !{!1966, !1967, !1968}
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1964, file: !652, line: 665, baseType: !1858, size: 320)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1964, file: !652, line: 668, baseType: !1468, size: 64, offset: 320)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1964, file: !652, line: 673, baseType: !1468, size: 64, offset: 384)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1793, file: !652, line: 757, baseType: !1970, size: 384)
!1970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !652, line: 694, size: 384, elements: !1971)
!1971 = !{!1972, !1973}
!1972 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1970, file: !652, line: 696, baseType: !1858, size: 320)
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1970, file: !652, line: 699, baseType: !1468, size: 64, offset: 320)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1793, file: !652, line: 758, baseType: !1975, size: 384)
!1975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !652, line: 681, size: 384, elements: !1976)
!1976 = !{!1977, !1978, !1979}
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1975, file: !652, line: 683, baseType: !1796, size: 256)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1975, file: !652, line: 686, baseType: !1468, size: 64, offset: 256)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1975, file: !652, line: 689, baseType: !1468, size: 64, offset: 320)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1793, file: !652, line: 759, baseType: !1981, size: 384)
!1981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !652, line: 707, size: 384, elements: !1982)
!1982 = !{!1983, !1984, !1985}
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1981, file: !652, line: 709, baseType: !1796, size: 256)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1981, file: !652, line: 712, baseType: !1468, size: 64, offset: 256)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1981, file: !652, line: 712, baseType: !1468, size: 64, offset: 320)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1793, file: !652, line: 760, baseType: !1987, size: 320)
!1987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !652, line: 718, size: 320, elements: !1988)
!1988 = !{!1989, !1990}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1987, file: !652, line: 720, baseType: !1796, size: 256)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1987, file: !652, line: 723, baseType: !1468, size: 64, offset: 256)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1788, file: !652, line: 138, baseType: !1787, size: 64, offset: 64)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1788, file: !652, line: 139, baseType: !1787, size: 64, offset: 128)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1783, file: !652, line: 146, baseType: !1786, size: 64, offset: 64)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1783, file: !652, line: 152, baseType: !1781, size: 64, offset: 128)
!1995 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1778, file: !337, line: 130, baseType: !1642, size: 64)
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1773, file: !337, line: 134, baseType: !1465, size: 64, offset: 192)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1773, file: !337, line: 137, baseType: !1468, size: 64, offset: 256)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1773, file: !337, line: 138, baseType: !1592, size: 32, offset: 320)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1773, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!2000 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1773, file: !337, line: 144, baseType: !1461, size: 32, offset: 384)
!2001 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1773, file: !337, line: 145, baseType: !1461, size: 32, offset: 416)
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1773, file: !337, line: 146, baseType: !2003, size: 64, offset: 448)
!2003 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !1523)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1756, file: !337, line: 220, baseType: !1759, size: 64, offset: 64)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1756, file: !337, line: 223, baseType: !1465, size: 64, offset: 128)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1756, file: !337, line: 226, baseType: !2007, size: 64, offset: 192)
!2007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2008, size: 64)
!2008 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1756, file: !337, line: 229, baseType: !2010, size: 128, offset: 256)
!2010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2011, size: 128, elements: !1710)
!2011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2012, size: 64)
!2012 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1756, file: !337, line: 232, baseType: !1755, size: 64, offset: 384)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1756, file: !337, line: 233, baseType: !1755, size: 64, offset: 448)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1756, file: !337, line: 238, baseType: !2016, size: 64, offset: 512)
!2016 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !2017)
!2017 = !{!2018, !2024}
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2016, file: !337, line: 236, baseType: !2019, size: 64)
!2019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2020, size: 64)
!2020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !2021)
!2021 = !{!2022, !2023}
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2020, file: !337, line: 275, baseType: !1781, size: 64)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2020, file: !337, line: 278, baseType: !1781, size: 64, offset: 64)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2016, file: !337, line: 237, baseType: !2025, size: 64)
!2025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2026, size: 64)
!2026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !2027)
!2027 = !{!2028, !2029, !2030, !2031, !2032}
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2026, file: !337, line: 261, baseType: !1642, size: 64)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2026, file: !337, line: 262, baseType: !1642, size: 64, offset: 64)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2026, file: !337, line: 266, baseType: !1642, size: 64, offset: 128)
!2031 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2026, file: !337, line: 267, baseType: !1642, size: 64, offset: 192)
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2026, file: !337, line: 270, baseType: !1461, size: 32, offset: 256)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1756, file: !337, line: 241, baseType: !2003, size: 64, offset: 576)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1756, file: !337, line: 244, baseType: !1461, size: 32, offset: 640)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1756, file: !337, line: 247, baseType: !1461, size: 32, offset: 672)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1756, file: !337, line: 250, baseType: !1461, size: 32, offset: 704)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1756, file: !337, line: 253, baseType: !1461, size: 32, offset: 736)
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1756, file: !337, line: 256, baseType: !1461, size: 32, offset: 768)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1663, file: !1645, line: 179, baseType: !2040, size: 64)
!2040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2041, size: 64)
!2041 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1645, line: 150, baseType: !2042)
!2042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1645, line: 142, size: 320, elements: !2043)
!2043 = !{!2044, !2045, !2046, !2047, !2050, !2051}
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !2042, file: !1645, line: 144, baseType: !1468, size: 64)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2042, file: !1645, line: 145, baseType: !1642, size: 64, offset: 64)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2042, file: !1645, line: 146, baseType: !1642, size: 64, offset: 128)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !2042, file: !1645, line: 147, baseType: !2048, size: 32, offset: 192)
!2048 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2049, line: 31, baseType: !1461)
!2049 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2042, file: !1645, line: 148, baseType: !7, size: 32, offset: 224)
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !2042, file: !1645, line: 149, baseType: !1460, size: 8, offset: 256)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1663, file: !1645, line: 180, baseType: !2053, size: 64)
!2053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2054, size: 64)
!2054 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1645, line: 162, baseType: !2055)
!2055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1645, line: 159, size: 128, elements: !2056)
!2056 = !{!2057, !2058}
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2055, file: !1645, line: 160, baseType: !1468, size: 64)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2055, file: !1645, line: 161, baseType: !1523, size: 64, offset: 64)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1663, file: !1645, line: 181, baseType: !2060, size: 64)
!2060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2061, size: 64)
!2061 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1645, line: 181, flags: DIFlagFwdDecl)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1658, file: !1645, line: 317, baseType: !2063, size: 64)
!2063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1523, size: 64, elements: !1566)
!2064 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1658, file: !1645, line: 318, baseType: !2065, size: 320)
!2065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1645, line: 188, size: 320, elements: !2066)
!2066 = !{!2067, !2069, !2126}
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2065, file: !1645, line: 190, baseType: !2068, size: 192)
!2068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1662, size: 192, elements: !1541)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2065, file: !1645, line: 193, baseType: !2070, size: 64, offset: 192)
!2070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2071, size: 64)
!2071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1645, line: 206, size: 320, elements: !2072)
!2072 = !{!2073, !2111, !2112, !2113, !2125}
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2071, file: !1645, line: 208, baseType: !2074, size: 64)
!2074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2075, size: 64)
!2075 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1449, line: 62, baseType: !2076)
!2076 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2077, line: 538, size: 256, elements: !2078)
!2077 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2078 = !{!2079, !2083, !2089, !2102}
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2076, file: !2077, line: 539, baseType: !2080, size: 32)
!2080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !2077, line: 482, size: 32, elements: !2081)
!2081 = !{!2082}
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2080, file: !2077, line: 484, baseType: !7, size: 32)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !2076, file: !2077, line: 540, baseType: !2084, size: 192)
!2084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !2077, line: 488, size: 192, elements: !2085)
!2085 = !{!2086, !2087, !2088}
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2084, file: !2077, line: 489, baseType: !2080, size: 32)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2084, file: !2077, line: 492, baseType: !1466, size: 64, offset: 64)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2084, file: !2077, line: 496, baseType: !1468, size: 64, offset: 128)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !2076, file: !2077, line: 541, baseType: !2090, size: 256)
!2090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !2077, line: 504, size: 256, elements: !2091)
!2091 = !{!2092, !2093, !2100, !2101}
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2090, file: !2077, line: 505, baseType: !2080, size: 32)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2090, file: !2077, line: 509, baseType: !2094, size: 64, offset: 64)
!2094 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !2077, line: 501, baseType: !2095)
!2095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2096, size: 64)
!2096 = !DISubroutineType(types: !2097)
!2097 = !{null, !2098}
!2098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2099, size: 64)
!2099 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2090, file: !2077, line: 510, baseType: !2098, size: 64, offset: 128)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2090, file: !2077, line: 513, baseType: !2074, size: 64, offset: 192)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !2076, file: !2077, line: 542, baseType: !2103, size: 128)
!2103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !2077, line: 530, size: 128, elements: !2104)
!2104 = !{!2105, !2106}
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2103, file: !2077, line: 531, baseType: !2080, size: 32)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2103, file: !2077, line: 534, baseType: !2107, size: 64, offset: 64)
!2107 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !2077, line: 525, baseType: !2108)
!2108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2109, size: 64)
!2109 = !DISubroutineType(types: !2110)
!2110 = !{!1460, !1468, !1466, !1521, !1521}
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2071, file: !1645, line: 211, baseType: !7, size: 32, offset: 64)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2071, file: !1645, line: 214, baseType: !1523, size: 64, offset: 128)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2071, file: !1645, line: 224, baseType: !2114, size: 64, offset: 192)
!2114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2115, size: 64)
!2115 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1645, line: 202, baseType: !2116)
!2116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1645, line: 202, size: 128, elements: !2117)
!2117 = !{!2118}
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2116, file: !1645, line: 202, baseType: !2119, size: 128)
!2119 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1645, line: 200, baseType: !2120)
!2120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1645, line: 200, size: 128, elements: !2121)
!2121 = !{!2122, !2123, !2124}
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2120, file: !1645, line: 200, baseType: !7, size: 32)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2120, file: !1645, line: 200, baseType: !7, size: 32, offset: 32)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2120, file: !1645, line: 200, baseType: !1676, size: 64, offset: 64)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2071, file: !1645, line: 234, baseType: !2114, size: 64, offset: 256)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2065, file: !1645, line: 197, baseType: !1523, size: 64, offset: 256)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1658, file: !1645, line: 319, baseType: !1530, size: 256)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1658, file: !1645, line: 320, baseType: !1549, size: 192)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1470, file: !135, line: 3384, baseType: !2130, size: 1472)
!2130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !2131)
!2131 = !{!2132, !2153, !2154, !2155, !2156}
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2130, file: !135, line: 3115, baseType: !2133, size: 1216)
!2133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !2134)
!2134 = !{!2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152}
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2133, file: !135, line: 2985, baseType: !1638, size: 960)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2133, file: !135, line: 2986, baseType: !1468, size: 64, offset: 960)
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2133, file: !135, line: 2987, baseType: !1468, size: 64, offset: 1024)
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2133, file: !135, line: 2988, baseType: !1468, size: 64, offset: 1088)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2133, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2133, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2133, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2133, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2133, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2133, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2133, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2133, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2133, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2133, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2149 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2133, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2133, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2133, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2133, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2130, file: !135, line: 3117, baseType: !1468, size: 64, offset: 1216)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2130, file: !135, line: 3119, baseType: !1468, size: 64, offset: 1280)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2130, file: !135, line: 3121, baseType: !1468, size: 64, offset: 1344)
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2130, file: !135, line: 3123, baseType: !1468, size: 64, offset: 1408)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1470, file: !135, line: 3385, baseType: !2158, size: 1088)
!2158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !2159)
!2159 = !{!2160, !2161, !2162}
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2158, file: !135, line: 2875, baseType: !1638, size: 960)
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2158, file: !135, line: 2876, baseType: !1642, size: 64, offset: 960)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2158, file: !135, line: 2877, baseType: !2163, size: 64, offset: 1024)
!2163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2164, size: 64)
!2164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2165, line: 172, size: 128, elements: !2166)
!2165 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2166 = !{!2167, !2168, !2169, !2170, !2171, !2172, !2173}
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2164, file: !2165, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2164, file: !2165, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2164, file: !2165, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2164, file: !2165, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2164, file: !2165, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2172 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2164, file: !2165, line: 195, baseType: !7, size: 32, offset: 32)
!2173 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2164, file: !2165, line: 199, baseType: !1468, size: 64, offset: 64)
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1470, file: !135, line: 3386, baseType: !2133, size: 1216)
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1470, file: !135, line: 3387, baseType: !2176, size: 1280)
!2176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !2177)
!2177 = !{!2178, !2179}
!2178 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2176, file: !135, line: 3094, baseType: !2133, size: 1216)
!2179 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2176, file: !135, line: 3095, baseType: !2163, size: 64, offset: 1216)
!2180 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1470, file: !135, line: 3388, baseType: !2181, size: 1216)
!2181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !2182)
!2182 = !{!2183, !2184, !2185, !2186, !2187, !2188}
!2183 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2181, file: !135, line: 2825, baseType: !1600, size: 896)
!2184 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2181, file: !135, line: 2827, baseType: !1468, size: 64, offset: 896)
!2185 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2181, file: !135, line: 2828, baseType: !1468, size: 64, offset: 960)
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2181, file: !135, line: 2829, baseType: !1468, size: 64, offset: 1024)
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2181, file: !135, line: 2830, baseType: !1468, size: 64, offset: 1088)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2181, file: !135, line: 2831, baseType: !1468, size: 64, offset: 1152)
!2189 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1470, file: !135, line: 3389, baseType: !2190, size: 1024)
!2190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !2191)
!2191 = !{!2192, !2193, !2194}
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2190, file: !135, line: 2851, baseType: !1638, size: 960)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2190, file: !135, line: 2852, baseType: !1461, size: 32, offset: 960)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2190, file: !135, line: 2853, baseType: !1461, size: 32, offset: 992)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1470, file: !135, line: 3390, baseType: !2196, size: 1024)
!2196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !2197)
!2197 = !{!2198, !2199}
!2198 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2196, file: !135, line: 2858, baseType: !1638, size: 960)
!2199 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2196, file: !135, line: 2859, baseType: !2163, size: 64, offset: 960)
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1470, file: !135, line: 3391, baseType: !2201, size: 960)
!2201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !2202)
!2202 = !{!2203}
!2203 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2201, file: !135, line: 2863, baseType: !1638, size: 960)
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1470, file: !135, line: 3392, baseType: !2205, size: 1472)
!2205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !2206)
!2206 = !{!2207}
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2205, file: !135, line: 3305, baseType: !2130, size: 1472)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1470, file: !135, line: 3393, baseType: !2209, size: 1792)
!2209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !2210)
!2210 = !{!2211, !2212, !2521, !2522, !2523, !2524, !2525, !2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541}
!2211 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2209, file: !135, line: 3249, baseType: !2130, size: 1472)
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2209, file: !135, line: 3251, baseType: !2213, size: 64, offset: 1472)
!2213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2214, size: 64)
!2214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !646, line: 463, size: 1152, elements: !2215)
!2215 = !{!2216, !2375, !2406, !2407, !2462, !2465, !2466, !2467, !2468, !2469, !2470, !2494, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519, !2520}
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2214, file: !646, line: 464, baseType: !2217, size: 64)
!2217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2218, size: 64)
!2218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !2219)
!2219 = !{!2220, !2269, !2282, !2296, !2344, !2356}
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !2218, file: !330, line: 197, baseType: !2221, size: 64)
!2221 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !2222)
!2222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2223, size: 64)
!2223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !2224)
!2224 = !{!2225, !2226, !2227, !2228, !2229, !2230, !2257, !2266, !2267, !2268}
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !2223, file: !330, line: 119, baseType: !2222, size: 64)
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2223, file: !330, line: 122, baseType: !2222, size: 64, offset: 64)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !2223, file: !330, line: 123, baseType: !2222, size: 64, offset: 128)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2223, file: !330, line: 126, baseType: !1461, size: 32, offset: 192)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2223, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2223, file: !330, line: 165, baseType: !2231, size: 192, offset: 256)
!2231 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !2232)
!2232 = !{!2233, !2246, !2252}
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !2231, file: !330, line: 137, baseType: !2234, size: 128)
!2234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !2235)
!2235 = !{!2236, !2245}
