; ModuleID = 'lto-symtab.bc'
source_filename = "lto-symtab.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.ggc_cache_tab = type { %struct.htab**, i64, i64, void (i8*)*, void (i8*)*, i32 (i8*)* }
%struct.ggc_root_tab = type { i8*, i64, i64, void (i8*)*, void (i8*)* }
%struct.VEC_tree_gc = type { %struct.VEC_tree_base }
%struct.VEC_tree_base = type { i32, i32, [1 x %union.tree_node*] }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }

!239 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!240 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!241 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!242 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !6, line: 1805, baseType: !7, size: 32, elements: !243)
!243 = !{!244, !245, !246, !247, !248}
!244 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!245 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!246 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!247 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!248 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ld_plugin_symbol_resolution", file: !250, line: 123, baseType: !7, size: 32, elements: !251)
!250 = !DIFile(filename: "./include/plugin-api.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260}
!252 = !DIEnumerator(name: "LDPR_UNKNOWN", value: 0, isUnsigned: true)
!253 = !DIEnumerator(name: "LDPR_UNDEF", value: 1, isUnsigned: true)
!254 = !DIEnumerator(name: "LDPR_PREVAILING_DEF", value: 2, isUnsigned: true)
!255 = !DIEnumerator(name: "LDPR_PREVAILING_DEF_IRONLY", value: 3, isUnsigned: true)
!256 = !DIEnumerator(name: "LDPR_PREEMPTED_REG", value: 4, isUnsigned: true)
!257 = !DIEnumerator(name: "LDPR_PREEMPTED_IR", value: 5, isUnsigned: true)
!258 = !DIEnumerator(name: "LDPR_RESOLVED_IR", value: 6, isUnsigned: true)
!259 = !DIEnumerator(name: "LDPR_RESOLVED_EXEC", value: 7, isUnsigned: true)
!260 = !DIEnumerator(name: "LDPR_RESOLVED_DYN", value: 8, isUnsigned: true)
!261 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !262, line: 309, baseType: !7, size: 32, elements: !263)
!262 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!263 = !{!264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!264 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!265 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!266 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!267 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!268 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!269 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!270 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!271 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!272 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!273 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!274 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!275 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!276 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!277 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!278 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!279 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!280 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!281 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!282 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!283 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!284 = !{!285, !286, !287, !288, !291, !292, !5, !294, !1351, !1603, !866, !727, !1604, !1079, !7, !1606}
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!287 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !293, size: 64)
!293 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !290)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !295, line: 56, baseType: !296)
!295 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !298)
!298 = !{!299, !332, !338, !351, !358, !365, !370, !379, !385, !398, !410, !448, !456, !484, !492, !493, !498, !507, !513, !518, !522, !526, !991, !1040, !1046, !1052, !1059, !1070, !1095, !1112, !1124, !1146, !1161, !1333}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !297, file: !6, line: 3372, baseType: !300, size: 64)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !301)
!301 = !{!302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !300, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !300, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !300, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !300, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !300, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !300, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !300, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !300, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !300, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !300, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !300, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !300, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !300, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !300, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !300, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !300, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !300, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !300, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !300, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !300, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !300, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !300, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !300, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !300, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !300, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !300, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !300, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !300, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !300, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !300, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !297, file: !6, line: 3373, baseType: !333, size: 192)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !333, file: !6, line: 403, baseType: !300, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !333, file: !6, line: 404, baseType: !294, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !6, line: 405, baseType: !294, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !297, file: !6, line: 3374, baseType: !339, size: 320)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !340)
!340 = !{!341, !342}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !339, file: !6, line: 1385, baseType: !333, size: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !339, file: !6, line: 1386, baseType: !343, size: 128, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !344, line: 58, baseType: !345)
!344 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !344, line: 54, size: 128, elements: !346)
!346 = !{!347, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !345, file: !344, line: 56, baseType: !348, size: 64)
!348 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !345, file: !344, line: 57, baseType: !350, size: 64, offset: 64)
!350 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !297, file: !6, line: 3375, baseType: !352, size: 256)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !353)
!353 = !{!354, !355}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !352, file: !6, line: 1398, baseType: !333, size: 192)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !352, file: !6, line: 1399, baseType: !356, size: 64, offset: 192)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !297, file: !6, line: 3376, baseType: !359, size: 256)
!359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !360)
!360 = !{!361, !362}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !359, file: !6, line: 1409, baseType: !333, size: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !359, file: !6, line: 1410, baseType: !363, size: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !364, size: 64)
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !297, file: !6, line: 3377, baseType: !366, size: 256)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !367)
!367 = !{!368, !369}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !366, file: !6, line: 1438, baseType: !333, size: 192)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !366, file: !6, line: 1439, baseType: !294, size: 64, offset: 192)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !297, file: !6, line: 3378, baseType: !371, size: 256)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !372)
!372 = !{!373, !374, !375}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !371, file: !6, line: 1419, baseType: !333, size: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !371, file: !6, line: 1420, baseType: !287, size: 32, offset: 192)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !371, file: !6, line: 1421, baseType: !376, size: 8, offset: 224)
!376 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 8, elements: !377)
!377 = !{!378}
!378 = !DISubrange(count: 1)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !297, file: !6, line: 3379, baseType: !380, size: 320)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !381)
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !380, file: !6, line: 1429, baseType: !333, size: 192)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !380, file: !6, line: 1430, baseType: !294, size: 64, offset: 192)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !380, file: !6, line: 1431, baseType: !294, size: 64, offset: 256)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !297, file: !6, line: 3380, baseType: !386, size: 320)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !387)
!387 = !{!388, !389}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !386, file: !6, line: 1461, baseType: !333, size: 192)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !386, file: !6, line: 1462, baseType: !390, size: 128, offset: 192)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !391, line: 31, size: 128, elements: !392)
!391 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!392 = !{!393, !396, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !390, file: !391, line: 32, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !286)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !390, file: !391, line: 33, baseType: !7, size: 32, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !390, file: !391, line: 34, baseType: !7, size: 32, offset: 96)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !297, file: !6, line: 3381, baseType: !399, size: 384)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !400)
!400 = !{!401, !402, !407, !408, !409}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !399, file: !6, line: 2508, baseType: !333, size: 192)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !399, file: !6, line: 2509, baseType: !403, size: 32, offset: 192)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !404, line: 58, baseType: !405)
!404 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !406, line: 44, baseType: !7)
!406 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!407 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !399, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !399, file: !6, line: 2511, baseType: !294, size: 64, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !399, file: !6, line: 2512, baseType: !294, size: 64, offset: 320)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !297, file: !6, line: 3382, baseType: !411, size: 896)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !412)
!412 = !{!413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !411, file: !6, line: 2653, baseType: !399, size: 384)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !411, file: !6, line: 2654, baseType: !294, size: 64, offset: 384)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !411, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !411, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !411, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !411, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !411, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !411, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !411, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !411, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !411, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !411, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !411, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !411, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !411, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !411, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !411, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !411, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !411, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !411, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !411, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !411, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !411, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !411, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !411, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !411, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !411, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !411, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !411, file: !6, line: 2705, baseType: !294, size: 64, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !411, file: !6, line: 2706, baseType: !294, size: 64, offset: 640)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !411, file: !6, line: 2707, baseType: !294, size: 64, offset: 704)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !411, file: !6, line: 2708, baseType: !294, size: 64, offset: 768)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !411, file: !6, line: 2711, baseType: !446, size: 64, offset: 832)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !297, file: !6, line: 3383, baseType: !449, size: 960)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !450)
!450 = !{!451, !452}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !449, file: !6, line: 2757, baseType: !411, size: 896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !449, file: !6, line: 2758, baseType: !453, size: 64, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !295, line: 50, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !295, line: 49, flags: DIFlagFwdDecl)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !297, file: !6, line: 3384, baseType: !457, size: 1472)
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !458)
!458 = !{!459, !480, !481, !482, !483}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !457, file: !6, line: 3115, baseType: !460, size: 1216)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !461)
!461 = !{!462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !460, file: !6, line: 2985, baseType: !449, size: 960)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !460, file: !6, line: 2986, baseType: !294, size: 64, offset: 960)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !460, file: !6, line: 2987, baseType: !294, size: 64, offset: 1024)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !460, file: !6, line: 2988, baseType: !294, size: 64, offset: 1088)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !460, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !460, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !460, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !460, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !460, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !460, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !460, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !460, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !460, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !460, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !460, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !460, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !460, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !460, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !457, file: !6, line: 3117, baseType: !294, size: 64, offset: 1216)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !457, file: !6, line: 3119, baseType: !294, size: 64, offset: 1280)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !457, file: !6, line: 3121, baseType: !294, size: 64, offset: 1344)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !457, file: !6, line: 3123, baseType: !294, size: 64, offset: 1408)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !297, file: !6, line: 3385, baseType: !485, size: 1088)
!485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !486)
!486 = !{!487, !488, !489}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !485, file: !6, line: 2875, baseType: !449, size: 960)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !485, file: !6, line: 2876, baseType: !453, size: 64, offset: 960)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !485, file: !6, line: 2877, baseType: !490, size: 64, offset: 1024)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !6, line: 2856, flags: DIFlagFwdDecl)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !297, file: !6, line: 3386, baseType: !460, size: 1216)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !297, file: !6, line: 3387, baseType: !494, size: 1280)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !494, file: !6, line: 3094, baseType: !460, size: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !494, file: !6, line: 3095, baseType: !490, size: 64, offset: 1216)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !297, file: !6, line: 3388, baseType: !499, size: 1216)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !500)
!500 = !{!501, !502, !503, !504, !505, !506}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !499, file: !6, line: 2825, baseType: !411, size: 896)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !499, file: !6, line: 2827, baseType: !294, size: 64, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !499, file: !6, line: 2828, baseType: !294, size: 64, offset: 960)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !499, file: !6, line: 2829, baseType: !294, size: 64, offset: 1024)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !499, file: !6, line: 2830, baseType: !294, size: 64, offset: 1088)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !499, file: !6, line: 2831, baseType: !294, size: 64, offset: 1152)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !297, file: !6, line: 3389, baseType: !508, size: 1024)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !508, file: !6, line: 2851, baseType: !449, size: 960)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !508, file: !6, line: 2852, baseType: !287, size: 32, offset: 960)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !508, file: !6, line: 2853, baseType: !287, size: 32, offset: 992)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !297, file: !6, line: 3390, baseType: !514, size: 1024)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !6, line: 2858, baseType: !449, size: 960)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !514, file: !6, line: 2859, baseType: !490, size: 64, offset: 960)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !297, file: !6, line: 3391, baseType: !519, size: 960)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !520)
!520 = !{!521}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !519, file: !6, line: 2863, baseType: !449, size: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !297, file: !6, line: 3392, baseType: !523, size: 1472)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !523, file: !6, line: 3305, baseType: !457, size: 1472)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !297, file: !6, line: 3393, baseType: !527, size: 1792)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !528)
!528 = !{!529, !530, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !527, file: !6, line: 3249, baseType: !457, size: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !527, file: !6, line: 3251, baseType: !531, size: 64, offset: 1472)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !533, line: 463, size: 1152, elements: !534)
!533 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!534 = !{!535, !538, !856, !857, !860, !863, !913, !914, !915, !916, !917, !943, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !532, file: !533, line: 464, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !533, line: 464, flags: DIFlagFwdDecl)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !532, file: !533, line: 467, baseType: !539, size: 64, offset: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !541)
!541 = !{!542, !831, !832, !845, !846, !847, !848, !849, !850, !852, !854, !855}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !540, file: !202, line: 377, baseType: !543, size: 64)
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !295, line: 111, baseType: !544)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !546)
!546 = !{!547, !794, !795, !796, !799, !805, !806, !807, !825, !826, !827, !828, !829, !830}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !545, file: !202, line: 219, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !550)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !551)
!551 = !{!552}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !550, file: !202, line: 151, baseType: !553, size: 128)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !555)
!555 = !{!556, !557, !558}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !554, file: !202, line: 150, baseType: !7, size: 32)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !554, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !554, file: !202, line: 150, baseType: !559, size: 64, offset: 64)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 64, elements: !377)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !295, line: 108, baseType: !561)
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !563)
!563 = !{!564, !565, !566, !786, !787, !788, !789, !790, !791, !792}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !562, file: !202, line: 124, baseType: !544, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !562, file: !202, line: 125, baseType: !544, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !562, file: !202, line: 131, baseType: !567, size: 64, offset: 128)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !568)
!568 = !{!569, !785}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !567, file: !202, line: 129, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !295, line: 66, baseType: !571)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !573, line: 143, size: 192, elements: !574)
!573 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!574 = !{!575, !783, !784}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !572, file: !573, line: 145, baseType: !576, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !295, line: 69, baseType: !577)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !573, line: 136, size: 192, elements: !579)
!579 = !{!580, !781, !782}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !578, file: !573, line: 137, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !295, line: 58, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !573, line: 737, size: 768, elements: !584)
!584 = !{!585, !602, !636, !642, !647, !652, !659, !665, !671, !676, !690, !695, !701, !706, !716, !721, !739, !746, !753, !759, !764, !770, !776}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !583, file: !573, line: 738, baseType: !586, size: 256)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !573, line: 271, size: 256, elements: !587)
!587 = !{!588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !586, file: !573, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !586, file: !573, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !586, file: !573, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !586, file: !573, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !586, file: !573, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !586, file: !573, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !586, file: !573, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !586, file: !573, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !586, file: !573, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !586, file: !573, line: 312, baseType: !7, size: 32, offset: 32)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !586, file: !573, line: 316, baseType: !403, size: 32, offset: 64)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !586, file: !573, line: 319, baseType: !7, size: 32, offset: 96)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !586, file: !573, line: 323, baseType: !544, size: 64, offset: 128)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !586, file: !573, line: 327, baseType: !294, size: 64, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !583, file: !573, line: 739, baseType: !603, size: 448)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !573, line: 350, size: 448, elements: !604)
!604 = !{!605, !634}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !603, file: !573, line: 353, baseType: !606, size: 384)
!606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !573, line: 333, size: 384, elements: !607)
!607 = !{!608, !609, !617}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !606, file: !573, line: 336, baseType: !586, size: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !606, file: !573, line: 343, baseType: !610, size: 64, offset: 256)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !612, line: 37, size: 128, elements: !613)
!612 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!613 = !{!614, !615}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !611, file: !612, line: 39, baseType: !610, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !611, file: !612, line: 40, baseType: !616, size: 64, offset: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !606, file: !573, line: 344, baseType: !618, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !612, line: 45, size: 320, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !612, line: 47, baseType: !618, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !619, file: !612, line: 48, baseType: !623, size: 256, offset: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !624)
!624 = !{!625, !627, !628, !633}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !623, file: !6, line: 1884, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !623, file: !6, line: 1885, baseType: !626, size: 64, offset: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !623, file: !6, line: 1891, baseType: !629, size: 64, offset: 128)
!629 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !623, file: !6, line: 1891, size: 64, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !629, file: !6, line: 1891, baseType: !581, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !629, file: !6, line: 1891, baseType: !294, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !623, file: !6, line: 1892, baseType: !616, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !603, file: !573, line: 359, baseType: !635, size: 64, offset: 384)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !294, size: 64, elements: !377)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !583, file: !573, line: 740, baseType: !637, size: 512)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !573, line: 365, size: 512, elements: !638)
!638 = !{!639, !640, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !637, file: !573, line: 368, baseType: !606, size: 384)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !637, file: !573, line: 373, baseType: !294, size: 64, offset: 384)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !637, file: !573, line: 374, baseType: !294, size: 64, offset: 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !583, file: !573, line: 741, baseType: !643, size: 576)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !573, line: 380, size: 576, elements: !644)
!644 = !{!645, !646}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !643, file: !573, line: 383, baseType: !637, size: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !643, file: !573, line: 389, baseType: !635, size: 64, offset: 512)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !583, file: !573, line: 742, baseType: !648, size: 320)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !573, line: 395, size: 320, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !648, file: !573, line: 397, baseType: !586, size: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !648, file: !573, line: 400, baseType: !570, size: 64, offset: 256)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !583, file: !573, line: 743, baseType: !653, size: 448)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !573, line: 406, size: 448, elements: !654)
!654 = !{!655, !656, !657, !658}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !653, file: !573, line: 408, baseType: !586, size: 256)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !653, file: !573, line: 412, baseType: !294, size: 64, offset: 256)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !653, file: !573, line: 420, baseType: !294, size: 64, offset: 320)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !653, file: !573, line: 423, baseType: !570, size: 64, offset: 384)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !583, file: !573, line: 744, baseType: !660, size: 384)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !573, line: 429, size: 384, elements: !661)
!661 = !{!662, !663, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !660, file: !573, line: 431, baseType: !586, size: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !660, file: !573, line: 434, baseType: !294, size: 64, offset: 256)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !660, file: !573, line: 437, baseType: !570, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !583, file: !573, line: 745, baseType: !666, size: 384)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !573, line: 443, size: 384, elements: !667)
!667 = !{!668, !669, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !666, file: !573, line: 445, baseType: !586, size: 256)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !666, file: !573, line: 449, baseType: !294, size: 64, offset: 256)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !666, file: !573, line: 453, baseType: !570, size: 64, offset: 320)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !583, file: !573, line: 746, baseType: !672, size: 320)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !573, line: 459, size: 320, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !672, file: !573, line: 461, baseType: !586, size: 256)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !672, file: !573, line: 464, baseType: !294, size: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !583, file: !573, line: 747, baseType: !677, size: 768)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !573, line: 469, size: 768, elements: !678)
!678 = !{!679, !680, !681, !682, !683}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !677, file: !573, line: 471, baseType: !586, size: 256)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !677, file: !573, line: 474, baseType: !7, size: 32, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !677, file: !573, line: 475, baseType: !7, size: 32, offset: 288)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !677, file: !573, line: 478, baseType: !294, size: 64, offset: 320)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !677, file: !573, line: 481, baseType: !684, size: 384, offset: 384)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 384, elements: !377)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !685, file: !6, line: 1920, baseType: !623, size: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !685, file: !6, line: 1921, baseType: !294, size: 64, offset: 256)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !685, file: !6, line: 1922, baseType: !403, size: 32, offset: 320)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !583, file: !573, line: 748, baseType: !691, size: 320)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !573, line: 487, size: 320, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !691, file: !573, line: 490, baseType: !586, size: 256)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !691, file: !573, line: 494, baseType: !287, size: 32, offset: 256)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !583, file: !573, line: 749, baseType: !696, size: 384)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !573, line: 500, size: 384, elements: !697)
!697 = !{!698, !699, !700}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !696, file: !573, line: 502, baseType: !586, size: 256)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !696, file: !573, line: 506, baseType: !570, size: 64, offset: 256)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !696, file: !573, line: 510, baseType: !570, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !583, file: !573, line: 750, baseType: !702, size: 320)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !573, line: 529, size: 320, elements: !703)
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !702, file: !573, line: 531, baseType: !586, size: 256)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !702, file: !573, line: 540, baseType: !570, size: 64, offset: 256)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !583, file: !573, line: 751, baseType: !707, size: 704)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !573, line: 546, size: 704, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !707, file: !573, line: 549, baseType: !637, size: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !707, file: !573, line: 553, baseType: !292, size: 64, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !707, file: !573, line: 557, baseType: !286, size: 8, offset: 576)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !707, file: !573, line: 558, baseType: !286, size: 8, offset: 584)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !707, file: !573, line: 559, baseType: !286, size: 8, offset: 592)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !707, file: !573, line: 560, baseType: !286, size: 8, offset: 600)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !707, file: !573, line: 566, baseType: !635, size: 64, offset: 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !583, file: !573, line: 752, baseType: !717, size: 384)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !573, line: 571, size: 384, elements: !718)
!718 = !{!719, !720}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !717, file: !573, line: 573, baseType: !648, size: 320)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !573, line: 577, baseType: !294, size: 64, offset: 320)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !583, file: !573, line: 753, baseType: !722, size: 576)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !573, line: 600, size: 576, elements: !723)
!723 = !{!724, !725, !726, !729, !738}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !722, file: !573, line: 602, baseType: !648, size: 320)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !722, file: !573, line: 605, baseType: !294, size: 64, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !722, file: !573, line: 609, baseType: !727, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !728, line: 46, baseType: !348)
!728 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!729 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !722, file: !573, line: 612, baseType: !730, size: 64, offset: 448)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !573, line: 581, size: 320, elements: !732)
!732 = !{!733, !734, !735, !736, !737}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !731, file: !573, line: 583, baseType: !5, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !731, file: !573, line: 586, baseType: !294, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !731, file: !573, line: 589, baseType: !294, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !731, file: !573, line: 592, baseType: !294, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !731, file: !573, line: 595, baseType: !294, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !722, file: !573, line: 616, baseType: !570, size: 64, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !583, file: !573, line: 754, baseType: !740, size: 512)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !573, line: 622, size: 512, elements: !741)
!741 = !{!742, !743, !744, !745}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !740, file: !573, line: 624, baseType: !648, size: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !740, file: !573, line: 628, baseType: !294, size: 64, offset: 320)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !740, file: !573, line: 632, baseType: !294, size: 64, offset: 384)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !740, file: !573, line: 636, baseType: !294, size: 64, offset: 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !583, file: !573, line: 755, baseType: !747, size: 704)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !573, line: 642, size: 704, elements: !748)
!748 = !{!749, !750, !751, !752}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !747, file: !573, line: 644, baseType: !740, size: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !747, file: !573, line: 648, baseType: !294, size: 64, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !747, file: !573, line: 652, baseType: !294, size: 64, offset: 576)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !747, file: !573, line: 653, baseType: !294, size: 64, offset: 640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !583, file: !573, line: 756, baseType: !754, size: 448)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !573, line: 663, size: 448, elements: !755)
!755 = !{!756, !757, !758}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !754, file: !573, line: 665, baseType: !648, size: 320)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !754, file: !573, line: 668, baseType: !294, size: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !754, file: !573, line: 673, baseType: !294, size: 64, offset: 384)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !583, file: !573, line: 757, baseType: !760, size: 384)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !573, line: 694, size: 384, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !760, file: !573, line: 696, baseType: !648, size: 320)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !760, file: !573, line: 699, baseType: !294, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !583, file: !573, line: 758, baseType: !765, size: 384)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !573, line: 681, size: 384, elements: !766)
!766 = !{!767, !768, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !765, file: !573, line: 683, baseType: !586, size: 256)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !765, file: !573, line: 686, baseType: !294, size: 64, offset: 256)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !765, file: !573, line: 689, baseType: !294, size: 64, offset: 320)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !583, file: !573, line: 759, baseType: !771, size: 384)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !573, line: 707, size: 384, elements: !772)
!772 = !{!773, !774, !775}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !771, file: !573, line: 709, baseType: !586, size: 256)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !771, file: !573, line: 712, baseType: !294, size: 64, offset: 256)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !771, file: !573, line: 712, baseType: !294, size: 64, offset: 320)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !583, file: !573, line: 760, baseType: !777, size: 320)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !573, line: 718, size: 320, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !777, file: !573, line: 720, baseType: !586, size: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !777, file: !573, line: 723, baseType: !294, size: 64, offset: 256)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !578, file: !573, line: 138, baseType: !577, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !578, file: !573, line: 139, baseType: !577, size: 64, offset: 128)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !572, file: !573, line: 146, baseType: !576, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !572, file: !573, line: 152, baseType: !570, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !567, file: !202, line: 130, baseType: !453, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !562, file: !202, line: 134, baseType: !291, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !562, file: !202, line: 137, baseType: !294, size: 64, offset: 256)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !562, file: !202, line: 138, baseType: !403, size: 32, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !562, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !562, file: !202, line: 144, baseType: !287, size: 32, offset: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !562, file: !202, line: 145, baseType: !287, size: 32, offset: 416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !562, file: !202, line: 146, baseType: !793, size: 64, offset: 448)
!793 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !350)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !545, file: !202, line: 220, baseType: !548, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !545, file: !202, line: 223, baseType: !291, size: 64, offset: 128)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !545, file: !202, line: 226, baseType: !797, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !545, file: !202, line: 229, baseType: !800, size: 128, offset: 256)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 128, elements: !803)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!803 = !{!804}
!804 = !DISubrange(count: 2)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !545, file: !202, line: 232, baseType: !544, size: 64, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !545, file: !202, line: 233, baseType: !544, size: 64, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !545, file: !202, line: 238, baseType: !808, size: 64, offset: 512)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !809)
!809 = !{!810, !816}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !808, file: !202, line: 236, baseType: !811, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !812, file: !202, line: 275, baseType: !570, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !812, file: !202, line: 278, baseType: !570, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !808, file: !202, line: 237, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !819)
!819 = !{!820, !821, !822, !823, !824}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !818, file: !202, line: 261, baseType: !453, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !818, file: !202, line: 262, baseType: !453, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !818, file: !202, line: 266, baseType: !453, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !818, file: !202, line: 267, baseType: !453, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !818, file: !202, line: 270, baseType: !287, size: 32, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !545, file: !202, line: 241, baseType: !793, size: 64, offset: 576)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !545, file: !202, line: 244, baseType: !287, size: 32, offset: 640)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !545, file: !202, line: 247, baseType: !287, size: 32, offset: 672)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !545, file: !202, line: 250, baseType: !287, size: 32, offset: 704)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !545, file: !202, line: 253, baseType: !287, size: 32, offset: 736)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !545, file: !202, line: 256, baseType: !287, size: 32, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !540, file: !202, line: 378, baseType: !543, size: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !540, file: !202, line: 381, baseType: !833, size: 64, offset: 128)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !835)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !836)
!836 = !{!837}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !835, file: !202, line: 282, baseType: !838, size: 128)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !840)
!840 = !{!841, !842, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !839, file: !202, line: 281, baseType: !7, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !839, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !839, file: !202, line: 281, baseType: !844, size: 64, offset: 64)
!844 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 64, elements: !377)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !540, file: !202, line: 384, baseType: !287, size: 32, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !540, file: !202, line: 387, baseType: !287, size: 32, offset: 224)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !540, file: !202, line: 390, baseType: !287, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !540, file: !202, line: 394, baseType: !833, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !540, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !540, file: !202, line: 399, baseType: !851, size: 64, offset: 416)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !803)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !540, file: !202, line: 402, baseType: !853, size: 64, offset: 480)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !803)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !540, file: !202, line: 406, baseType: !287, size: 32, offset: 544)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !540, file: !202, line: 409, baseType: !287, size: 32, offset: 576)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !532, file: !533, line: 470, baseType: !571, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !532, file: !533, line: 473, baseType: !858, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !533, line: 166, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !532, file: !533, line: 476, baseType: !861, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !533, line: 476, flags: DIFlagFwdDecl)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !532, file: !533, line: 479, baseType: !864, size: 64, offset: 320)
!864 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !865, line: 144, baseType: !866)
!865 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !865, line: 100, size: 896, elements: !868)
!868 = !{!869, !877, !882, !887, !889, !890, !891, !892, !893, !894, !899, !901, !902, !907, !912}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !867, file: !865, line: 102, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !865, line: 52, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !865, line: 47, baseType: !7)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !867, file: !865, line: 105, baseType: !878, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !865, line: 59, baseType: !879)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DISubroutineType(types: !881)
!881 = !{!287, !875, !875}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !867, file: !865, line: 108, baseType: !883, size: 64, offset: 128)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !865, line: 63, baseType: !884)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DISubroutineType(types: !886)
!886 = !{null, !291}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !867, file: !865, line: 111, baseType: !888, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !291, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !867, file: !865, line: 114, baseType: !727, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !867, file: !865, line: 117, baseType: !727, size: 64, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !867, file: !865, line: 120, baseType: !727, size: 64, offset: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !867, file: !865, line: 124, baseType: !7, size: 32, offset: 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !867, file: !865, line: 128, baseType: !7, size: 32, offset: 480)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !867, file: !865, line: 131, baseType: !895, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !865, line: 75, baseType: !896)
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !897, size: 64)
!897 = !DISubroutineType(types: !898)
!898 = !{!291, !727, !727}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !867, file: !865, line: 132, baseType: !900, size: 64, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !865, line: 78, baseType: !884)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !867, file: !865, line: 135, baseType: !291, size: 64, offset: 640)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !867, file: !865, line: 136, baseType: !903, size: 64, offset: 704)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !865, line: 82, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!291, !291, !727, !727}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !867, file: !865, line: 137, baseType: !908, size: 64, offset: 768)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !865, line: 83, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{null, !291, !291}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !867, file: !865, line: 141, baseType: !7, size: 32, offset: 832)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !532, file: !533, line: 484, baseType: !294, size: 64, offset: 384)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !532, file: !533, line: 488, baseType: !294, size: 64, offset: 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !532, file: !533, line: 493, baseType: !294, size: 64, offset: 512)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !532, file: !533, line: 496, baseType: !294, size: 64, offset: 576)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !532, file: !533, line: 501, baseType: !918, size: 64, offset: 640)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !920)
!920 = !{!921, !924, !925, !926, !927, !931, !932, !937, !938, !939, !940, !941, !942}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !919, file: !213, line: 2356, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !919, file: !213, line: 2357, baseType: !292, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !919, file: !213, line: 2358, baseType: !287, size: 32, offset: 128)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !919, file: !213, line: 2359, baseType: !287, size: 32, offset: 160)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !919, file: !213, line: 2360, baseType: !928, size: 128, offset: 192)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !287, size: 128, elements: !929)
!929 = !{!930}
!930 = !DISubrange(count: 4)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !919, file: !213, line: 2364, baseType: !287, size: 32, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !919, file: !213, line: 2367, baseType: !933, size: 128, offset: 384)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !933, file: !213, line: 2351, baseType: !453, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !933, file: !213, line: 2352, baseType: !350, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !919, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !919, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !919, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !919, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !919, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !919, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !532, file: !533, line: 504, baseType: !944, size: 64, offset: 704)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !533, line: 504, flags: DIFlagFwdDecl)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !532, file: !533, line: 507, baseType: !864, size: 64, offset: 768)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !532, file: !533, line: 510, baseType: !287, size: 32, offset: 832)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !532, file: !533, line: 513, baseType: !287, size: 32, offset: 864)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !532, file: !533, line: 516, baseType: !403, size: 32, offset: 896)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !532, file: !533, line: 519, baseType: !403, size: 32, offset: 928)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !532, file: !533, line: 522, baseType: !7, size: 32, offset: 960)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !532, file: !533, line: 523, baseType: !7, size: 32, offset: 992)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !532, file: !533, line: 528, baseType: !292, size: 64, offset: 1024)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !532, file: !533, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !532, file: !533, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !532, file: !533, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !532, file: !533, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !532, file: !533, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !532, file: !533, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !532, file: !533, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !532, file: !533, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !532, file: !533, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !532, file: !533, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !532, file: !533, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !532, file: !533, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !532, file: !533, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !532, file: !533, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !532, file: !533, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !532, file: !533, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !527, file: !6, line: 3254, baseType: !294, size: 64, offset: 1536)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !527, file: !6, line: 3257, baseType: !294, size: 64, offset: 1600)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !527, file: !6, line: 3258, baseType: !294, size: 64, offset: 1664)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !527, file: !6, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !527, file: !6, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !527, file: !6, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !527, file: !6, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !527, file: !6, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !527, file: !6, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !527, file: !6, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !527, file: !6, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !527, file: !6, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !527, file: !6, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !527, file: !6, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !527, file: !6, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !527, file: !6, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !527, file: !6, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !527, file: !6, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !527, file: !6, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !527, file: !6, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !527, file: !6, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !297, file: !6, line: 3394, baseType: !992, size: 1344)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !6, line: 2279, size: 1344, elements: !993)
!993 = !{!994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1019, !1020, !1021, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !992, file: !6, line: 2280, baseType: !333, size: 192)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !992, file: !6, line: 2281, baseType: !294, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !992, file: !6, line: 2282, baseType: !294, size: 64, offset: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !992, file: !6, line: 2283, baseType: !294, size: 64, offset: 320)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !992, file: !6, line: 2284, baseType: !294, size: 64, offset: 384)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !992, file: !6, line: 2285, baseType: !7, size: 32, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !992, file: !6, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !992, file: !6, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !992, file: !6, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !992, file: !6, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !992, file: !6, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !992, file: !6, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !992, file: !6, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !992, file: !6, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !992, file: !6, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !992, file: !6, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !992, file: !6, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !992, file: !6, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !992, file: !6, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !992, file: !6, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !992, file: !6, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !992, file: !6, line: 2305, baseType: !7, size: 32, offset: 512)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !992, file: !6, line: 2306, baseType: !1017, size: 32, offset: 544)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1018, line: 31, baseType: !287)
!1018 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !992, file: !6, line: 2307, baseType: !294, size: 64, offset: 576)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !992, file: !6, line: 2308, baseType: !294, size: 64, offset: 640)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !992, file: !6, line: 2314, baseType: !1022, size: 64, offset: 704)
!1022 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !6, line: 2309, size: 64, elements: !1023)
!1023 = !{!1024, !1025, !1026}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1022, file: !6, line: 2310, baseType: !287, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1022, file: !6, line: 2311, baseType: !292, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1022, file: !6, line: 2312, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !6, line: 2277, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !992, file: !6, line: 2315, baseType: !294, size: 64, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !992, file: !6, line: 2316, baseType: !294, size: 64, offset: 832)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !992, file: !6, line: 2317, baseType: !294, size: 64, offset: 896)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !992, file: !6, line: 2318, baseType: !294, size: 64, offset: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !992, file: !6, line: 2319, baseType: !294, size: 64, offset: 1024)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !992, file: !6, line: 2320, baseType: !294, size: 64, offset: 1088)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !992, file: !6, line: 2321, baseType: !294, size: 64, offset: 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !992, file: !6, line: 2322, baseType: !294, size: 64, offset: 1216)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !992, file: !6, line: 2324, baseType: !1038, size: 64, offset: 1280)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !6, line: 2324, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !297, file: !6, line: 3395, baseType: !1041, size: 320)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !6, line: 1469, size: 320, elements: !1042)
!1042 = !{!1043, !1044, !1045}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1041, file: !6, line: 1470, baseType: !333, size: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1041, file: !6, line: 1471, baseType: !294, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1041, file: !6, line: 1472, baseType: !294, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !297, file: !6, line: 3396, baseType: !1047, size: 320)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !6, line: 1482, size: 320, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1047, file: !6, line: 1483, baseType: !333, size: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1047, file: !6, line: 1484, baseType: !287, size: 32, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1047, file: !6, line: 1485, baseType: !635, size: 64, offset: 256)
