; ModuleID = 'lto-opts.bc'
source_filename = "lto-opts.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.VEC_opt_t_heap = type { %struct.VEC_opt_t_base }
%struct.VEC_opt_t_base = type { i32, i32, [1 x %struct.opt_d] }
%struct.opt_d = type { i32, i64, i8*, i32 }
%struct.cl_option = type { i8*, i8*, i16, i8, i32, i32, i8*, i32, i32 }

!241 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!242 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!243 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!244 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!245 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!246 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!247 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!248 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!249 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !21, line: 1817, baseType: !7, size: 32, elements: !250)
!250 = !{!251, !252, !253, !254, !255}
!251 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!252 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!253 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!254 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!255 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!256 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !21, line: 1805, baseType: !7, size: 32, elements: !257)
!257 = !{!258, !259, !260, !261, !262}
!258 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!259 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!260 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!261 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!262 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!263 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !264, line: 309, baseType: !7, size: 32, elements: !265)
!264 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!265 = !{!266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285}
!266 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!267 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!268 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!269 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!270 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!271 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!272 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!273 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!274 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!275 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!276 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!277 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!278 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!279 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!280 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!281 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!282 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!283 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!284 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!285 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!286 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cl_var_type", file: !287, line: 25, baseType: !7, size: 32, elements: !288)
!287 = !DIFile(filename: "./opts.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!288 = !{!289, !290, !291, !292, !293}
!289 = !DIEnumerator(name: "CLVC_BOOLEAN", value: 0, isUnsigned: true)
!290 = !DIEnumerator(name: "CLVC_EQUAL", value: 1, isUnsigned: true)
!291 = !DIEnumerator(name: "CLVC_BIT_CLEAR", value: 2, isUnsigned: true)
!292 = !DIEnumerator(name: "CLVC_BIT_SET", value: 3, isUnsigned: true)
!293 = !DIEnumerator(name: "CLVC_STRING", value: 4, isUnsigned: true)
!294 = !{!295, !296, !297, !298, !301, !302, !299, !304, !317, !336, !7}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!297 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !303, size: 64)
!303 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_output_stream", file: !6, line: 577, size: 320, elements: !306)
!306 = !{!307, !312, !313, !314, !315, !316}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "first_block", scope: !305, file: !6, line: 580, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_char_ptr_base", file: !6, line: 568, size: 64, elements: !310)
!310 = !{!311}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !309, file: !6, line: 570, baseType: !299, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "current_block", scope: !305, file: !6, line: 583, baseType: !308, size: 64, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "current_pointer", scope: !305, file: !6, line: 586, baseType: !299, size: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "left_in_block", scope: !305, file: !6, line: 589, baseType: !7, size: 32, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "block_size", scope: !305, file: !6, line: 592, baseType: !7, size: 32, offset: 224)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "total_size", scope: !305, file: !6, line: 595, baseType: !7, size: 32, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_simple_header", file: !6, line: 600, size: 128, elements: !320)
!320 = !{!321, !332, !335}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "lto_header", scope: !319, file: !6, line: 603, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_header", file: !6, line: 387, size: 64, elements: !323)
!323 = !{!324, !330, !331}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "major_version", scope: !322, file: !6, line: 389, baseType: !325, size: 16)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !326, line: 25, baseType: !327)
!326 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!327 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !328, line: 39, baseType: !329)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!329 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "minor_version", scope: !322, file: !6, line: 390, baseType: !325, size: 16, offset: 16)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "section_type", scope: !322, file: !6, line: 391, baseType: !5, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "main_size", scope: !319, file: !6, line: 606, baseType: !333, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !326, line: 26, baseType: !334)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !328, line: 41, baseType: !297)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !319, file: !6, line: 609, baseType: !333, size: 32, offset: 96)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_opt_t_heap", file: !3, line: 79, baseType: !338)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_opt_t_heap", file: !3, line: 79, size: 320, elements: !339)
!339 = !{!340}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !338, file: !3, line: 79, baseType: !341, size: 320)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_opt_t_base", file: !3, line: 78, baseType: !342)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_opt_t_base", file: !3, line: 78, size: 320, elements: !343)
!343 = !{!344, !345, !346}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !342, file: !3, line: 78, baseType: !7, size: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !342, file: !3, line: 78, baseType: !7, size: 32, offset: 32)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !342, file: !3, line: 78, baseType: !347, size: 256, offset: 64)
!347 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 256, elements: !358)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "opt_t", file: !3, line: 76, baseType: !349)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opt_d", file: !3, line: 70, size: 256, elements: !350)
!350 = !{!351, !352, !356, !357}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !349, file: !3, line: 72, baseType: !7, size: 32)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !349, file: !3, line: 73, baseType: !353, size: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !354, line: 46, baseType: !355)
!354 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!355 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "arg", scope: !349, file: !3, line: 74, baseType: !299, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !349, file: !3, line: 75, baseType: !297, size: 32, offset: 192)
!358 = !{!359}
!359 = !DISubrange(count: 1)
!360 = !{!0, !361}
!361 = !DIGlobalVariableExpression(var: !362, expr: !DIExpression())
!362 = distinct !DIGlobalVariable(name: "file_options", scope: !2, file: !3, line: 86, type: !336, isLocal: true, isDefinition: true)
!363 = !{i32 2, !"Dwarf Version", i32 4}
!364 = !{i32 2, !"Debug Info Version", i32 3}
!365 = !{i32 1, !"wchar_size", i32 4}
!366 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!367 = distinct !DISubprogram(name: "vprintf", scope: !368, file: !368, line: 39, type: !369, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !379)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!369 = !DISubroutineType(types: !370)
!370 = !{!297, !371, !372}
!371 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !302)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !374)
!374 = !{!375, !376, !377, !378}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !373, file: !3, baseType: !7, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !373, file: !3, baseType: !7, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !373, file: !3, baseType: !301, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !373, file: !3, baseType: !301, size: 64, offset: 128)
!379 = !{!380, !381}
!380 = !DILocalVariable(name: "__fmt", arg: 1, scope: !367, file: !368, line: 39, type: !371)
!381 = !DILocalVariable(name: "__arg", arg: 2, scope: !367, file: !368, line: 39, type: !372)
!382 = !DILocation(line: 0, scope: !367)
!383 = !DILocation(line: 41, column: 20, scope: !367)
!384 = !DILocation(line: 41, column: 10, scope: !367)
!385 = !DILocation(line: 41, column: 3, scope: !367)
!386 = distinct !DISubprogram(name: "getchar", scope: !368, file: !368, line: 47, type: !387, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !389)
!387 = !DISubroutineType(types: !388)
!388 = !{!297}
!389 = !{}
!390 = !DILocation(line: 49, column: 16, scope: !386)
!391 = !DILocation(line: 49, column: 10, scope: !386)
!392 = !DILocation(line: 49, column: 3, scope: !386)
!393 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !368, file: !368, line: 56, type: !394, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !449)
!394 = !DISubroutineType(types: !395)
!395 = !{!297, !396}
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !398, line: 7, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !400, line: 49, size: 1728, elements: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!401 = !{!402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !417, !419, !420, !421, !424, !426, !428, !430, !433, !435, !438, !441, !442, !443, !444, !445}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !399, file: !400, line: 51, baseType: !297, size: 32)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !399, file: !400, line: 54, baseType: !299, size: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !399, file: !400, line: 55, baseType: !299, size: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !399, file: !400, line: 56, baseType: !299, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !399, file: !400, line: 57, baseType: !299, size: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !399, file: !400, line: 58, baseType: !299, size: 64, offset: 320)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !399, file: !400, line: 59, baseType: !299, size: 64, offset: 384)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !399, file: !400, line: 60, baseType: !299, size: 64, offset: 448)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !399, file: !400, line: 61, baseType: !299, size: 64, offset: 512)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !399, file: !400, line: 64, baseType: !299, size: 64, offset: 576)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !399, file: !400, line: 65, baseType: !299, size: 64, offset: 640)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !399, file: !400, line: 66, baseType: !299, size: 64, offset: 704)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !399, file: !400, line: 68, baseType: !415, size: 64, offset: 768)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !400, line: 36, flags: DIFlagFwdDecl)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !399, file: !400, line: 70, baseType: !418, size: 64, offset: 832)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !399, file: !400, line: 72, baseType: !297, size: 32, offset: 896)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !399, file: !400, line: 73, baseType: !297, size: 32, offset: 928)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !399, file: !400, line: 74, baseType: !422, size: 64, offset: 960)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !328, line: 152, baseType: !423)
!423 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !399, file: !400, line: 77, baseType: !425, size: 16, offset: 1024)
!425 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !399, file: !400, line: 78, baseType: !427, size: 8, offset: 1040)
!427 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !399, file: !400, line: 79, baseType: !429, size: 8, offset: 1048)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 8, elements: !358)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !399, file: !400, line: 81, baseType: !431, size: 64, offset: 1088)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !400, line: 43, baseType: null)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !399, file: !400, line: 89, baseType: !434, size: 64, offset: 1152)
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !328, line: 153, baseType: !423)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !399, file: !400, line: 91, baseType: !436, size: 64, offset: 1216)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !400, line: 37, flags: DIFlagFwdDecl)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !399, file: !400, line: 92, baseType: !439, size: 64, offset: 1280)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !400, line: 38, flags: DIFlagFwdDecl)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !399, file: !400, line: 93, baseType: !418, size: 64, offset: 1344)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !399, file: !400, line: 94, baseType: !301, size: 64, offset: 1408)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !399, file: !400, line: 95, baseType: !353, size: 64, offset: 1472)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !399, file: !400, line: 96, baseType: !297, size: 32, offset: 1536)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !399, file: !400, line: 98, baseType: !446, size: 160, offset: 1568)
!446 = !DICompositeType(tag: DW_TAG_array_type, baseType: !300, size: 160, elements: !447)
!447 = !{!448}
!448 = !DISubrange(count: 20)
!449 = !{!450}
!450 = !DILocalVariable(name: "__fp", arg: 1, scope: !393, file: !368, line: 56, type: !396)
!451 = !DILocation(line: 0, scope: !393)
!452 = !DILocation(line: 58, column: 10, scope: !393)
!453 = !DILocation(line: 58, column: 3, scope: !393)
!454 = distinct !DISubprogram(name: "getc_unlocked", scope: !368, file: !368, line: 66, type: !394, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!455 = !{!456}
!456 = !DILocalVariable(name: "__fp", arg: 1, scope: !454, file: !368, line: 66, type: !396)
!457 = !DILocation(line: 0, scope: !454)
!458 = !DILocation(line: 68, column: 10, scope: !454)
!459 = !DILocation(line: 68, column: 3, scope: !454)
!460 = distinct !DISubprogram(name: "getchar_unlocked", scope: !368, file: !368, line: 73, type: !387, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !389)
!461 = !DILocation(line: 75, column: 10, scope: !460)
!462 = !DILocation(line: 75, column: 3, scope: !460)
!463 = distinct !DISubprogram(name: "putchar", scope: !368, file: !368, line: 82, type: !464, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !466)
!464 = !DISubroutineType(types: !465)
!465 = !{!297, !297}
!466 = !{!467}
!467 = !DILocalVariable(name: "__c", arg: 1, scope: !463, file: !368, line: 82, type: !297)
!468 = !DILocation(line: 0, scope: !463)
!469 = !DILocation(line: 84, column: 21, scope: !463)
!470 = !DILocation(line: 84, column: 10, scope: !463)
!471 = !DILocation(line: 84, column: 3, scope: !463)
!472 = distinct !DISubprogram(name: "fputc_unlocked", scope: !368, file: !368, line: 91, type: !473, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !475)
!473 = !DISubroutineType(types: !474)
!474 = !{!297, !297, !396}
!475 = !{!476, !477}
!476 = !DILocalVariable(name: "__c", arg: 1, scope: !472, file: !368, line: 91, type: !297)
!477 = !DILocalVariable(name: "__stream", arg: 2, scope: !472, file: !368, line: 91, type: !396)
!478 = !DILocation(line: 0, scope: !472)
!479 = !DILocation(line: 93, column: 10, scope: !472)
!480 = !DILocation(line: 93, column: 3, scope: !472)
!481 = distinct !DISubprogram(name: "putc_unlocked", scope: !368, file: !368, line: 101, type: !473, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !482)
!482 = !{!483, !484}
!483 = !DILocalVariable(name: "__c", arg: 1, scope: !481, file: !368, line: 101, type: !297)
!484 = !DILocalVariable(name: "__stream", arg: 2, scope: !481, file: !368, line: 101, type: !396)
!485 = !DILocation(line: 0, scope: !481)
!486 = !DILocation(line: 103, column: 10, scope: !481)
!487 = !DILocation(line: 103, column: 3, scope: !481)
!488 = distinct !DISubprogram(name: "putchar_unlocked", scope: !368, file: !368, line: 108, type: !464, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !489)
!489 = !{!490}
!490 = !DILocalVariable(name: "__c", arg: 1, scope: !488, file: !368, line: 108, type: !297)
!491 = !DILocation(line: 0, scope: !488)
!492 = !DILocation(line: 110, column: 10, scope: !488)
!493 = !DILocation(line: 110, column: 3, scope: !488)
!494 = distinct !DISubprogram(name: "getline", scope: !368, file: !368, line: 118, type: !495, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !499)
!495 = !DISubroutineType(types: !496)
!496 = !{!497, !298, !498, !396}
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !328, line: 193, baseType: !423)
!498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!499 = !{!500, !501, !502}
!500 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !494, file: !368, line: 118, type: !298)
!501 = !DILocalVariable(name: "__n", arg: 2, scope: !494, file: !368, line: 118, type: !498)
!502 = !DILocalVariable(name: "__stream", arg: 3, scope: !494, file: !368, line: 118, type: !396)
!503 = !DILocation(line: 0, scope: !494)
!504 = !DILocation(line: 120, column: 10, scope: !494)
!505 = !DILocation(line: 120, column: 3, scope: !494)
!506 = distinct !DISubprogram(name: "feof_unlocked", scope: !368, file: !368, line: 128, type: !394, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !507)
!507 = !{!508}
!508 = !DILocalVariable(name: "__stream", arg: 1, scope: !506, file: !368, line: 128, type: !396)
!509 = !DILocation(line: 0, scope: !506)
!510 = !DILocation(line: 130, column: 10, scope: !506)
!511 = !DILocation(line: 130, column: 3, scope: !506)
!512 = distinct !DISubprogram(name: "ferror_unlocked", scope: !368, file: !368, line: 135, type: !394, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !513)
!513 = !{!514}
!514 = !DILocalVariable(name: "__stream", arg: 1, scope: !512, file: !368, line: 135, type: !396)
!515 = !DILocation(line: 0, scope: !512)
!516 = !DILocation(line: 137, column: 10, scope: !512)
!517 = !DILocation(line: 137, column: 3, scope: !512)
!518 = distinct !DISubprogram(name: "tolower", scope: !519, file: !519, line: 207, type: !464, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !520)
!519 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!520 = !{!521}
!521 = !DILocalVariable(name: "__c", arg: 1, scope: !518, file: !519, line: 207, type: !297)
!522 = !DILocation(line: 0, scope: !518)
!523 = !DILocation(line: 209, column: 22, scope: !518)
!524 = !DILocation(line: 209, column: 39, scope: !518)
!525 = !DILocation(line: 209, column: 38, scope: !518)
!526 = !DILocation(line: 209, column: 37, scope: !518)
!527 = !DILocation(line: 209, column: 10, scope: !518)
!528 = !DILocation(line: 209, column: 3, scope: !518)
!529 = distinct !DISubprogram(name: "toupper", scope: !519, file: !519, line: 213, type: !464, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !530)
!530 = !{!531}
!531 = !DILocalVariable(name: "__c", arg: 1, scope: !529, file: !519, line: 213, type: !297)
!532 = !DILocation(line: 0, scope: !529)
!533 = !DILocation(line: 215, column: 22, scope: !529)
!534 = !DILocation(line: 215, column: 39, scope: !529)
!535 = !DILocation(line: 215, column: 38, scope: !529)
!536 = !DILocation(line: 215, column: 37, scope: !529)
!537 = !DILocation(line: 215, column: 10, scope: !529)
!538 = !DILocation(line: 215, column: 3, scope: !529)
!539 = distinct !DISubprogram(name: "atoi", scope: !540, file: !540, line: 361, type: !541, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !543)
!540 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!541 = !DISubroutineType(types: !542)
!542 = !{!297, !302}
!543 = !{!544}
!544 = !DILocalVariable(name: "__nptr", arg: 1, scope: !539, file: !540, line: 361, type: !302)
!545 = !DILocation(line: 0, scope: !539)
!546 = !DILocation(line: 363, column: 16, scope: !539)
!547 = !DILocation(line: 363, column: 10, scope: !539)
!548 = !DILocation(line: 363, column: 3, scope: !539)
!549 = distinct !DISubprogram(name: "atol", scope: !540, file: !540, line: 366, type: !550, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !552)
!550 = !DISubroutineType(types: !551)
!551 = !{!423, !302}
!552 = !{!553}
!553 = !DILocalVariable(name: "__nptr", arg: 1, scope: !549, file: !540, line: 366, type: !302)
!554 = !DILocation(line: 0, scope: !549)
!555 = !DILocation(line: 368, column: 10, scope: !549)
!556 = !DILocation(line: 368, column: 3, scope: !549)
!557 = distinct !DISubprogram(name: "atoll", scope: !540, file: !540, line: 373, type: !558, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !561)
!558 = !DISubroutineType(types: !559)
!559 = !{!560, !302}
!560 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!561 = !{!562}
!562 = !DILocalVariable(name: "__nptr", arg: 1, scope: !557, file: !540, line: 373, type: !302)
!563 = !DILocation(line: 0, scope: !557)
!564 = !DILocation(line: 375, column: 10, scope: !557)
!565 = !DILocation(line: 375, column: 3, scope: !557)
!566 = distinct !DISubprogram(name: "bsearch", scope: !567, file: !567, line: 20, type: !568, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !576)
!567 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!568 = !DISubroutineType(types: !569)
!569 = !{!301, !570, !570, !353, !353, !572}
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !540, line: 808, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!297, !570, !570}
!576 = !{!577, !578, !579, !580, !581, !582, !583, !584, !585, !586}
!577 = !DILocalVariable(name: "__key", arg: 1, scope: !566, file: !567, line: 20, type: !570)
!578 = !DILocalVariable(name: "__base", arg: 2, scope: !566, file: !567, line: 20, type: !570)
!579 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !566, file: !567, line: 20, type: !353)
!580 = !DILocalVariable(name: "__size", arg: 4, scope: !566, file: !567, line: 20, type: !353)
!581 = !DILocalVariable(name: "__compar", arg: 5, scope: !566, file: !567, line: 21, type: !572)
!582 = !DILocalVariable(name: "__l", scope: !566, file: !567, line: 23, type: !353)
!583 = !DILocalVariable(name: "__u", scope: !566, file: !567, line: 23, type: !353)
!584 = !DILocalVariable(name: "__idx", scope: !566, file: !567, line: 23, type: !353)
!585 = !DILocalVariable(name: "__p", scope: !566, file: !567, line: 24, type: !570)
!586 = !DILocalVariable(name: "__comparison", scope: !566, file: !567, line: 25, type: !297)
!587 = !DILocation(line: 0, scope: !566)
!588 = !DILocation(line: 29, column: 3, scope: !566)
!589 = !DILocation(line: 27, column: 7, scope: !566)
!590 = !DILocation(line: 29, column: 14, scope: !566)
!591 = !DILocation(line: 31, column: 20, scope: !592)
!592 = distinct !DILexicalBlock(scope: !566, file: !567, line: 30, column: 5)
!593 = !DILocation(line: 31, column: 27, scope: !592)
!594 = !DILocation(line: 32, column: 56, scope: !592)
!595 = !DILocation(line: 32, column: 47, scope: !592)
!596 = !DILocation(line: 33, column: 22, scope: !592)
!597 = !DILocation(line: 34, column: 24, scope: !598)
!598 = distinct !DILexicalBlock(scope: !592, file: !567, line: 34, column: 11)
!599 = !DILocation(line: 34, column: 11, scope: !592)
!600 = !DILocation(line: 36, column: 29, scope: !601)
!601 = distinct !DILexicalBlock(scope: !598, file: !567, line: 36, column: 16)
!602 = !DILocation(line: 36, column: 16, scope: !598)
!603 = !DILocation(line: 37, column: 14, scope: !601)
!604 = distinct !{!604, !588, !605}
!605 = !DILocation(line: 40, column: 5, scope: !566)
!606 = !DILocation(line: 43, column: 1, scope: !566)
!607 = distinct !DISubprogram(name: "atof", scope: !608, file: !608, line: 25, type: !609, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!608 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!609 = !DISubroutineType(types: !610)
!610 = !{!611, !302}
!611 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!612 = !{!613}
!613 = !DILocalVariable(name: "__nptr", arg: 1, scope: !607, file: !608, line: 25, type: !302)
!614 = !DILocation(line: 0, scope: !607)
!615 = !DILocation(line: 27, column: 10, scope: !607)
!616 = !DILocation(line: 27, column: 3, scope: !607)
!617 = distinct !DISubprogram(name: "strtoimax", scope: !618, file: !618, line: 324, type: !619, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !625)
!618 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!619 = !DISubroutineType(types: !620)
!620 = !{!621, !371, !624, !297}
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !622, line: 101, baseType: !623)
!622 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !328, line: 72, baseType: !423)
!624 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !298)
!625 = !{!626, !627, !628}
!626 = !DILocalVariable(name: "nptr", arg: 1, scope: !617, file: !618, line: 324, type: !371)
!627 = !DILocalVariable(name: "endptr", arg: 2, scope: !617, file: !618, line: 324, type: !624)
!628 = !DILocalVariable(name: "base", arg: 3, scope: !617, file: !618, line: 324, type: !297)
!629 = !DILocation(line: 0, scope: !617)
!630 = !DILocation(line: 327, column: 10, scope: !617)
!631 = !DILocation(line: 327, column: 3, scope: !617)
!632 = distinct !DISubprogram(name: "strtoumax", scope: !618, file: !618, line: 336, type: !633, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !637)
!633 = !DISubroutineType(types: !634)
!634 = !{!635, !371, !624, !297}
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !622, line: 102, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !328, line: 73, baseType: !355)
!637 = !{!638, !639, !640}
!638 = !DILocalVariable(name: "nptr", arg: 1, scope: !632, file: !618, line: 336, type: !371)
!639 = !DILocalVariable(name: "endptr", arg: 2, scope: !632, file: !618, line: 336, type: !624)
!640 = !DILocalVariable(name: "base", arg: 3, scope: !632, file: !618, line: 336, type: !297)
!641 = !DILocation(line: 0, scope: !632)
!642 = !DILocation(line: 339, column: 10, scope: !632)
!643 = !DILocation(line: 339, column: 3, scope: !632)
!644 = distinct !DISubprogram(name: "wcstoimax", scope: !618, file: !618, line: 348, type: !645, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !654)
!645 = !DISubroutineType(types: !646)
!646 = !{!621, !647, !651, !297}
!647 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !618, line: 34, baseType: !297)
!651 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!654 = !{!655, !656, !657}
!655 = !DILocalVariable(name: "nptr", arg: 1, scope: !644, file: !618, line: 348, type: !647)
!656 = !DILocalVariable(name: "endptr", arg: 2, scope: !644, file: !618, line: 348, type: !651)
!657 = !DILocalVariable(name: "base", arg: 3, scope: !644, file: !618, line: 348, type: !297)
!658 = !DILocation(line: 0, scope: !644)
!659 = !DILocation(line: 351, column: 10, scope: !644)
!660 = !DILocation(line: 351, column: 3, scope: !644)
!661 = distinct !DISubprogram(name: "wcstoumax", scope: !618, file: !618, line: 362, type: !662, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !664)
!662 = !DISubroutineType(types: !663)
!663 = !{!635, !647, !651, !297}
!664 = !{!665, !666, !667}
!665 = !DILocalVariable(name: "nptr", arg: 1, scope: !661, file: !618, line: 362, type: !647)
!666 = !DILocalVariable(name: "endptr", arg: 2, scope: !661, file: !618, line: 362, type: !651)
!667 = !DILocalVariable(name: "base", arg: 3, scope: !661, file: !618, line: 362, type: !297)
!668 = !DILocation(line: 0, scope: !661)
!669 = !DILocation(line: 365, column: 10, scope: !661)
!670 = !DILocation(line: 365, column: 3, scope: !661)
!671 = distinct !DISubprogram(name: "stat", scope: !672, file: !672, line: 453, type: !673, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !712)
!672 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!673 = !DISubroutineType(types: !674)
!674 = !{!297, !302, !675}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !677, line: 46, size: 1152, elements: !678)
!677 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!678 = !{!679, !681, !683, !685, !687, !689, !691, !692, !693, !694, !696, !698, !706, !707, !708}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !676, file: !677, line: 48, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !328, line: 145, baseType: !355)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !676, file: !677, line: 53, baseType: !682, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !328, line: 148, baseType: !355)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !676, file: !677, line: 61, baseType: !684, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !328, line: 151, baseType: !355)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !676, file: !677, line: 62, baseType: !686, size: 32, offset: 192)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !328, line: 150, baseType: !7)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !676, file: !677, line: 64, baseType: !688, size: 32, offset: 224)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !328, line: 146, baseType: !7)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !676, file: !677, line: 65, baseType: !690, size: 32, offset: 256)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !328, line: 147, baseType: !7)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !676, file: !677, line: 67, baseType: !297, size: 32, offset: 288)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !676, file: !677, line: 69, baseType: !680, size: 64, offset: 320)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !676, file: !677, line: 74, baseType: !422, size: 64, offset: 384)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !676, file: !677, line: 78, baseType: !695, size: 64, offset: 448)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !328, line: 174, baseType: !423)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !676, file: !677, line: 80, baseType: !697, size: 64, offset: 512)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !328, line: 179, baseType: !423)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !676, file: !677, line: 91, baseType: !699, size: 128, offset: 576)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !700, line: 10, size: 128, elements: !701)
!700 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!701 = !{!702, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !699, file: !700, line: 12, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !328, line: 160, baseType: !423)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !699, file: !700, line: 16, baseType: !705, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !328, line: 196, baseType: !423)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !676, file: !677, line: 92, baseType: !699, size: 128, offset: 704)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !676, file: !677, line: 93, baseType: !699, size: 128, offset: 832)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !676, file: !677, line: 106, baseType: !709, size: 192, offset: 960)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 192, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 3)
!712 = !{!713, !714}
!713 = !DILocalVariable(name: "__path", arg: 1, scope: !671, file: !672, line: 453, type: !302)
!714 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !671, file: !672, line: 453, type: !675)
!715 = !DILocation(line: 0, scope: !671)
!716 = !DILocation(line: 455, column: 10, scope: !671)
!717 = !DILocation(line: 455, column: 3, scope: !671)
!718 = distinct !DISubprogram(name: "lstat", scope: !672, file: !672, line: 460, type: !673, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !719)
!719 = !{!720, !721}
!720 = !DILocalVariable(name: "__path", arg: 1, scope: !718, file: !672, line: 460, type: !302)
!721 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !718, file: !672, line: 460, type: !675)
!722 = !DILocation(line: 0, scope: !718)
!723 = !DILocation(line: 462, column: 10, scope: !718)
!724 = !DILocation(line: 462, column: 3, scope: !718)
!725 = distinct !DISubprogram(name: "fstat", scope: !672, file: !672, line: 467, type: !726, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !728)
!726 = !DISubroutineType(types: !727)
!727 = !{!297, !297, !675}
!728 = !{!729, !730}
!729 = !DILocalVariable(name: "__fd", arg: 1, scope: !725, file: !672, line: 467, type: !297)
!730 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !725, file: !672, line: 467, type: !675)
!731 = !DILocation(line: 0, scope: !725)
!732 = !DILocation(line: 469, column: 10, scope: !725)
!733 = !DILocation(line: 469, column: 3, scope: !725)
!734 = distinct !DISubprogram(name: "fstatat", scope: !672, file: !672, line: 474, type: !735, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !737)
!735 = !DISubroutineType(types: !736)
!736 = !{!297, !297, !302, !675, !297}
!737 = !{!738, !739, !740, !741}
!738 = !DILocalVariable(name: "__fd", arg: 1, scope: !734, file: !672, line: 474, type: !297)
!739 = !DILocalVariable(name: "__filename", arg: 2, scope: !734, file: !672, line: 474, type: !302)
!740 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !734, file: !672, line: 474, type: !675)
!741 = !DILocalVariable(name: "__flag", arg: 4, scope: !734, file: !672, line: 474, type: !297)
!742 = !DILocation(line: 0, scope: !734)
!743 = !DILocation(line: 477, column: 10, scope: !734)
!744 = !DILocation(line: 477, column: 3, scope: !734)
!745 = distinct !DISubprogram(name: "mknod", scope: !672, file: !672, line: 483, type: !746, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !748)
!746 = !DISubroutineType(types: !747)
!747 = !{!297, !302, !686, !680}
!748 = !{!749, !750, !751}
!749 = !DILocalVariable(name: "__path", arg: 1, scope: !745, file: !672, line: 483, type: !302)
!750 = !DILocalVariable(name: "__mode", arg: 2, scope: !745, file: !672, line: 483, type: !686)
!751 = !DILocalVariable(name: "__dev", arg: 3, scope: !745, file: !672, line: 483, type: !680)
!752 = !DILocation(line: 0, scope: !745)
!753 = !DILocation(line: 485, column: 10, scope: !745)
!754 = !DILocation(line: 485, column: 3, scope: !745)
!755 = distinct !DISubprogram(name: "mknodat", scope: !672, file: !672, line: 491, type: !756, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !758)
!756 = !DISubroutineType(types: !757)
!757 = !{!297, !297, !302, !686, !680}
!758 = !{!759, !760, !761, !762}
!759 = !DILocalVariable(name: "__fd", arg: 1, scope: !755, file: !672, line: 491, type: !297)
!760 = !DILocalVariable(name: "__path", arg: 2, scope: !755, file: !672, line: 491, type: !302)
!761 = !DILocalVariable(name: "__mode", arg: 3, scope: !755, file: !672, line: 491, type: !686)
!762 = !DILocalVariable(name: "__dev", arg: 4, scope: !755, file: !672, line: 491, type: !680)
!763 = !DILocation(line: 0, scope: !755)
!764 = !DILocation(line: 494, column: 10, scope: !755)
!765 = !DILocation(line: 494, column: 3, scope: !755)
!766 = distinct !DISubprogram(name: "stat64", scope: !672, file: !672, line: 502, type: !767, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !789)
!767 = !DISubroutineType(types: !768)
!768 = !{!297, !302, !769}
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !677, line: 119, size: 1152, elements: !771)
!771 = !{!772, !773, !775, !776, !777, !778, !779, !780, !781, !782, !783, !785, !786, !787, !788}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !770, file: !677, line: 121, baseType: !680, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !770, file: !677, line: 123, baseType: !774, size: 64, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !328, line: 149, baseType: !355)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !770, file: !677, line: 124, baseType: !684, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !770, file: !677, line: 125, baseType: !686, size: 32, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !770, file: !677, line: 132, baseType: !688, size: 32, offset: 224)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !770, file: !677, line: 133, baseType: !690, size: 32, offset: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !770, file: !677, line: 135, baseType: !297, size: 32, offset: 288)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !770, file: !677, line: 136, baseType: !680, size: 64, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !770, file: !677, line: 137, baseType: !422, size: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !770, file: !677, line: 143, baseType: !695, size: 64, offset: 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !770, file: !677, line: 144, baseType: !784, size: 64, offset: 512)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !328, line: 180, baseType: !423)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !770, file: !677, line: 152, baseType: !699, size: 128, offset: 576)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !770, file: !677, line: 153, baseType: !699, size: 128, offset: 704)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !770, file: !677, line: 154, baseType: !699, size: 128, offset: 832)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !770, file: !677, line: 164, baseType: !709, size: 192, offset: 960)
!789 = !{!790, !791}
!790 = !DILocalVariable(name: "__path", arg: 1, scope: !766, file: !672, line: 502, type: !302)
!791 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !766, file: !672, line: 502, type: !769)
!792 = !DILocation(line: 0, scope: !766)
!793 = !DILocation(line: 504, column: 10, scope: !766)
!794 = !DILocation(line: 504, column: 3, scope: !766)
!795 = distinct !DISubprogram(name: "lstat64", scope: !672, file: !672, line: 509, type: !767, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !796)
!796 = !{!797, !798}
!797 = !DILocalVariable(name: "__path", arg: 1, scope: !795, file: !672, line: 509, type: !302)
!798 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !795, file: !672, line: 509, type: !769)
!799 = !DILocation(line: 0, scope: !795)
!800 = !DILocation(line: 511, column: 10, scope: !795)
!801 = !DILocation(line: 511, column: 3, scope: !795)
!802 = distinct !DISubprogram(name: "fstat64", scope: !672, file: !672, line: 516, type: !803, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{!297, !297, !769}
!805 = !{!806, !807}
!806 = !DILocalVariable(name: "__fd", arg: 1, scope: !802, file: !672, line: 516, type: !297)
!807 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !802, file: !672, line: 516, type: !769)
!808 = !DILocation(line: 0, scope: !802)
!809 = !DILocation(line: 518, column: 10, scope: !802)
!810 = !DILocation(line: 518, column: 3, scope: !802)
!811 = distinct !DISubprogram(name: "fstatat64", scope: !672, file: !672, line: 523, type: !812, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !814)
!812 = !DISubroutineType(types: !813)
!813 = !{!297, !297, !302, !769, !297}
!814 = !{!815, !816, !817, !818}
!815 = !DILocalVariable(name: "__fd", arg: 1, scope: !811, file: !672, line: 523, type: !297)
!816 = !DILocalVariable(name: "__filename", arg: 2, scope: !811, file: !672, line: 523, type: !302)
!817 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !811, file: !672, line: 523, type: !769)
!818 = !DILocalVariable(name: "__flag", arg: 4, scope: !811, file: !672, line: 523, type: !297)
!819 = !DILocation(line: 0, scope: !811)
!820 = !DILocation(line: 526, column: 10, scope: !811)
!821 = !DILocation(line: 526, column: 3, scope: !811)
!822 = distinct !DISubprogram(name: "lto_register_user_option", scope: !3, file: !3, line: 230, type: !823, scopeLine: 231, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !825)
!823 = !DISubroutineType(types: !824)
!824 = !{null, !353, !302, !297, !297}
!825 = !{!826, !827, !828, !829, !830}
!826 = !DILocalVariable(name: "code", arg: 1, scope: !822, file: !3, line: 230, type: !353)
!827 = !DILocalVariable(name: "arg", arg: 2, scope: !822, file: !3, line: 230, type: !302)
!828 = !DILocalVariable(name: "value", arg: 3, scope: !822, file: !3, line: 230, type: !297)
!829 = !DILocalVariable(name: "type", arg: 4, scope: !822, file: !3, line: 230, type: !297)
!830 = !DILocalVariable(name: "o", scope: !831, file: !3, line: 234, type: !348)
!831 = distinct !DILexicalBlock(scope: !832, file: !3, line: 233, column: 5)
!832 = distinct !DILexicalBlock(scope: !822, file: !3, line: 232, column: 7)
!833 = !DILocation(line: 0, scope: !822)
!834 = !DILocation(line: 232, column: 7, scope: !832)
!835 = !DILocation(line: 232, column: 7, scope: !822)
!836 = !DILocation(line: 234, column: 7, scope: !831)
!837 = !DILocation(line: 236, column: 9, scope: !831)
!838 = !DILocation(line: 236, column: 14, scope: !831)
!839 = !DILocation(line: 237, column: 9, scope: !831)
!840 = !DILocation(line: 237, column: 14, scope: !831)
!841 = !DILocation(line: 238, column: 15, scope: !842)
!842 = distinct !DILexicalBlock(scope: !831, file: !3, line: 238, column: 11)
!843 = !DILocation(line: 238, column: 11, scope: !831)
!844 = !DILocation(line: 240, column: 30, scope: !845)
!845 = distinct !DILexicalBlock(scope: !842, file: !3, line: 239, column: 2)
!846 = !DILocation(line: 240, column: 43, scope: !845)
!847 = !DILocation(line: 240, column: 21, scope: !845)
!848 = !DILocation(line: 240, column: 6, scope: !845)
!849 = !DILocation(line: 240, column: 10, scope: !845)
!850 = !DILocation(line: 241, column: 4, scope: !845)
!851 = !DILocation(line: 242, column: 2, scope: !845)
!852 = !DILocation(line: 244, column: 4, scope: !842)
!853 = !DILocation(line: 244, column: 8, scope: !842)
!854 = !DILocation(line: 245, column: 9, scope: !831)
!855 = !DILocation(line: 245, column: 15, scope: !831)
!856 = !DILocation(line: 0, scope: !831)
!857 = !DILocation(line: 246, column: 7, scope: !831)
!858 = !DILocation(line: 247, column: 5, scope: !832)
!859 = !DILocation(line: 247, column: 5, scope: !831)
!860 = !DILocation(line: 248, column: 1, scope: !822)
!861 = distinct !DISubprogram(name: "register_user_option_p", scope: !3, file: !3, line: 209, type: !862, scopeLine: 210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !864)
!862 = !DISubroutineType(types: !863)
!863 = !{!296, !353, !297}
!864 = !{!865, !866}
!865 = !DILocalVariable(name: "code", arg: 1, scope: !861, file: !3, line: 209, type: !353)
!866 = !DILocalVariable(name: "type", arg: 2, scope: !861, file: !3, line: 209, type: !297)
!867 = !DILocation(line: 0, scope: !861)
!868 = !DILocation(line: 211, column: 7, scope: !861)
!869 = !DILocation(line: 216, column: 8, scope: !870)
!870 = distinct !DILexicalBlock(scope: !871, file: !3, line: 214, column: 5)
!871 = distinct !DILexicalBlock(scope: !872, file: !3, line: 213, column: 12)
!872 = distinct !DILexicalBlock(scope: !861, file: !3, line: 211, column: 7)
!873 = !DILocation(line: 220, column: 8, scope: !870)
!874 = !DILocation(line: 215, column: 7, scope: !870)
!875 = !DILocation(line: 223, column: 3, scope: !861)
!876 = !DILocation(line: 224, column: 1, scope: !861)
!877 = distinct !DISubprogram(name: "VEC_opt_t_heap_safe_push", scope: !3, file: !3, line: 79, type: !878, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !884)
!878 = !DISubroutineType(types: !879)
!879 = !{!880, !881, !882}
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !348)
!884 = !{!885, !886}
!885 = !DILocalVariable(name: "vec_", arg: 1, scope: !877, file: !3, line: 79, type: !881)
!886 = !DILocalVariable(name: "obj_", arg: 2, scope: !877, file: !3, line: 79, type: !882)
!887 = !DILocation(line: 0, scope: !877)
!888 = !DILocation(line: 79, column: 1, scope: !877)
!889 = distinct !DISubprogram(name: "lto_clear_user_options", scope: !3, file: !3, line: 253, type: !890, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !389)
!890 = !DISubroutineType(types: !891)
!891 = !{null}
!892 = !DILocation(line: 255, column: 3, scope: !889)
!893 = !DILocation(line: 256, column: 1, scope: !889)
!894 = distinct !DISubprogram(name: "clear_options", scope: !3, file: !3, line: 125, type: !895, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !897)
!895 = !DISubroutineType(types: !896)
!896 = !{null, !881}
!897 = !{!898, !899, !900}
!898 = !DILocalVariable(name: "opts_p", arg: 1, scope: !894, file: !3, line: 125, type: !881)
!899 = !DILocalVariable(name: "i", scope: !894, file: !3, line: 127, type: !297)
!900 = !DILocalVariable(name: "o", scope: !894, file: !3, line: 128, type: !880)
!901 = !DILocation(line: 0, scope: !894)
!902 = !DILocation(line: 128, column: 3, scope: !894)
!903 = !DILocation(line: 130, column: 8, scope: !904)
!904 = distinct !DILexicalBlock(scope: !894, file: !3, line: 130, column: 3)
!905 = !DILocation(line: 0, scope: !904)
!906 = !DILocation(line: 130, column: 15, scope: !907)
!907 = distinct !DILexicalBlock(scope: !904, file: !3, line: 130, column: 3)
!908 = !DILocation(line: 130, column: 3, scope: !904)
!909 = !DILocation(line: 131, column: 11, scope: !907)
!910 = !DILocation(line: 131, column: 14, scope: !907)
!911 = !DILocation(line: 131, column: 5, scope: !907)
!912 = !DILocation(line: 130, column: 52, scope: !907)
!913 = !DILocation(line: 130, column: 3, scope: !907)
!914 = distinct !{!914, !908, !915}
!915 = !DILocation(line: 131, column: 17, scope: !904)
!916 = !DILocation(line: 133, column: 3, scope: !894)
!917 = !DILocation(line: 134, column: 1, scope: !894)
!918 = distinct !DISubprogram(name: "lto_clear_file_options", scope: !3, file: !3, line: 261, type: !890, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !389)
!919 = !DILocation(line: 263, column: 3, scope: !918)
!920 = !DILocation(line: 264, column: 1, scope: !918)
!921 = distinct !DISubprogram(name: "lto_write_options", scope: !3, file: !3, line: 294, type: !890, scopeLine: 295, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !922)
!922 = !{!923, !925, !926, !927}
!923 = !DILocalVariable(name: "section_name", scope: !921, file: !3, line: 296, type: !924)
!924 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !299)
!925 = !DILocalVariable(name: "stream", scope: !921, file: !3, line: 297, type: !305)
!926 = !DILocalVariable(name: "header", scope: !921, file: !3, line: 298, type: !319)
!927 = !DILocalVariable(name: "header_stream", scope: !921, file: !3, line: 299, type: !304)
!928 = !DILocation(line: 296, column: 30, scope: !921)
!929 = !DILocation(line: 0, scope: !921)
!930 = !DILocation(line: 297, column: 3, scope: !921)
!931 = !DILocation(line: 298, column: 3, scope: !921)
!932 = !DILocation(line: 301, column: 37, scope: !921)
!933 = !DILocation(line: 301, column: 36, scope: !921)
!934 = !DILocation(line: 301, column: 3, scope: !921)
!935 = !DILocation(line: 302, column: 3, scope: !921)
!936 = !DILocation(line: 304, column: 3, scope: !921)
!937 = !DILocation(line: 305, column: 3, scope: !921)
!938 = !DILocation(line: 307, column: 3, scope: !921)
!939 = !DILocation(line: 308, column: 21, scope: !921)
!940 = !DILocation(line: 308, column: 35, scope: !921)
!941 = !DILocation(line: 309, column: 21, scope: !921)
!942 = !DILocation(line: 309, column: 35, scope: !921)
!943 = !DILocation(line: 310, column: 21, scope: !921)
!944 = !DILocation(line: 310, column: 34, scope: !921)
!945 = !DILocation(line: 312, column: 10, scope: !921)
!946 = !DILocation(line: 312, column: 26, scope: !921)
!947 = !DILocation(line: 313, column: 29, scope: !921)
!948 = !DILocation(line: 313, column: 10, scope: !921)
!949 = !DILocation(line: 313, column: 20, scope: !921)
!950 = !DILocation(line: 316, column: 6, scope: !921)
!951 = !DILocation(line: 315, column: 20, scope: !921)
!952 = !DILocation(line: 317, column: 3, scope: !921)
!953 = !DILocation(line: 318, column: 3, scope: !921)
!954 = !DILocation(line: 319, column: 3, scope: !921)
!955 = !DILocation(line: 321, column: 3, scope: !921)
!956 = !DILocation(line: 322, column: 3, scope: !921)
!957 = !DILocation(line: 323, column: 1, scope: !921)
!958 = distinct !DISubprogram(name: "output_options", scope: !3, file: !3, line: 271, type: !959, scopeLine: 272, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !961)
!959 = !DISubroutineType(types: !960)
!960 = !{null, !304}
!961 = !{!962, !963, !964, !966, !967}
!962 = !DILocalVariable(name: "stream", arg: 1, scope: !958, file: !3, line: 271, type: !304)
!963 = !DILocalVariable(name: "opts", scope: !958, file: !3, line: 273, type: !336)
!964 = !DILocalVariable(name: "length", scope: !958, file: !3, line: 274, type: !965)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !353)
!966 = !DILocalVariable(name: "i", scope: !958, file: !3, line: 275, type: !297)
!967 = !DILocalVariable(name: "o", scope: !958, file: !3, line: 276, type: !880)
!968 = !DILocation(line: 0, scope: !958)
!969 = !DILocation(line: 273, column: 3, scope: !958)
!970 = !DILocation(line: 273, column: 49, scope: !958)
!971 = !DILocation(line: 273, column: 63, scope: !958)
!972 = !DILocation(line: 273, column: 28, scope: !958)
!973 = !DILocation(line: 273, column: 21, scope: !958)
!974 = !DILocation(line: 274, column: 3, scope: !958)
!975 = !DILocation(line: 274, column: 25, scope: !958)
!976 = !DILocation(line: 274, column: 16, scope: !958)
!977 = !DILocation(line: 276, column: 3, scope: !958)
!978 = !DILocation(line: 278, column: 3, scope: !958)
!979 = !DILocation(line: 0, scope: !980)
!980 = distinct !DILexicalBlock(scope: !981, file: !3, line: 281, column: 5)
!981 = distinct !DILexicalBlock(scope: !982, file: !3, line: 280, column: 3)
!982 = distinct !DILexicalBlock(scope: !958, file: !3, line: 280, column: 3)
!983 = !DILocation(line: 280, column: 8, scope: !982)
!984 = !DILocation(line: 280, column: 15, scope: !981)
!985 = !DILocation(line: 0, scope: !982)
!986 = !DILocation(line: 280, column: 3, scope: !982)
!987 = !DILocation(line: 282, column: 36, scope: !980)
!988 = !DILocation(line: 282, column: 7, scope: !980)
!989 = !DILocation(line: 283, column: 36, scope: !980)
!990 = !DILocation(line: 283, column: 39, scope: !980)
!991 = !DILocation(line: 283, column: 35, scope: !980)
!992 = !DILocation(line: 283, column: 7, scope: !980)
!993 = !DILocation(line: 284, column: 37, scope: !980)
!994 = !DILocation(line: 284, column: 40, scope: !980)
!995 = !DILocation(line: 284, column: 7, scope: !980)
!996 = !DILocation(line: 285, column: 36, scope: !980)
!997 = !DILocation(line: 285, column: 39, scope: !980)
!998 = !DILocation(line: 285, column: 35, scope: !980)
!999 = !DILocation(line: 285, column: 7, scope: !980)
!1000 = !DILocation(line: 280, column: 49, scope: !981)
!1001 = !DILocation(line: 280, column: 3, scope: !981)
!1002 = distinct !{!1002, !986, !1003}
!1003 = !DILocation(line: 286, column: 5, scope: !982)
!1004 = !DILocation(line: 288, column: 3, scope: !958)
!1005 = !DILocation(line: 289, column: 1, scope: !958)
!1006 = distinct !DISubprogram(name: "lto_read_file_options", scope: !3, file: !3, line: 349, type: !1007, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !2294)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null, !1009}
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_file_decl_data", file: !6, line: 540, size: 512, elements: !1011)
!1011 = !{!1012, !2069, !2070, !2289, !2290, !2291, !2292, !2293}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "current_decl_state", scope: !1010, file: !6, line: 543, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_in_decl_state", file: !6, line: 502, size: 960, elements: !1015)
!1015 = !{!1016, !2068}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !1014, file: !6, line: 505, baseType: !1017, size: 896)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 896, elements: !2066)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_tree_ref_table", file: !6, line: 473, size: 128, elements: !1019)
!1019 = !{!1020, !2065}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "trees", scope: !1018, file: !6, line: 476, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1023, line: 56, baseType: !1024)
!1023 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !21, line: 3371, size: 1792, elements: !1026)
!1026 = !{!1027, !1060, !1066, !1077, !1084, !1091, !1096, !1102, !1108, !1121, !1133, !1171, !1179, !1207, !1215, !1216, !1221, !1230, !1236, !1241, !1245, !1249, !1706, !1755, !1761, !1767, !1774, !1785, !1810, !1827, !1839, !1861, !1876, !2047}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1025, file: !21, line: 3372, baseType: !1028, size: 64)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !21, line: 360, size: 64, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1028, file: !21, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1028, file: !21, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1028, file: !21, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1028, file: !21, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1028, file: !21, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1028, file: !21, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1028, file: !21, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1028, file: !21, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1028, file: !21, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1028, file: !21, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1028, file: !21, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1028, file: !21, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1028, file: !21, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1028, file: !21, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1028, file: !21, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1028, file: !21, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1028, file: !21, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1028, file: !21, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1028, file: !21, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1028, file: !21, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1028, file: !21, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1028, file: !21, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1028, file: !21, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1028, file: !21, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1028, file: !21, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1028, file: !21, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1028, file: !21, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1028, file: !21, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1028, file: !21, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1028, file: !21, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1025, file: !21, line: 3373, baseType: !1061, size: 192)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !21, line: 402, size: 192, elements: !1062)
!1062 = !{!1063, !1064, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1061, file: !21, line: 403, baseType: !1028, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1061, file: !21, line: 404, baseType: !1022, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1061, file: !21, line: 405, baseType: !1022, size: 64, offset: 128)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1025, file: !21, line: 3374, baseType: !1067, size: 320)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !21, line: 1384, size: 320, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !21, line: 1385, baseType: !1061, size: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1067, file: !21, line: 1386, baseType: !1071, size: 128, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1072, line: 58, baseType: !1073)
!1072 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1072, line: 54, size: 128, elements: !1074)
!1074 = !{!1075, !1076}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1073, file: !1072, line: 56, baseType: !355, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1073, file: !1072, line: 57, baseType: !423, size: 64, offset: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1025, file: !21, line: 3375, baseType: !1078, size: 256)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !21, line: 1397, size: 256, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !21, line: 1398, baseType: !1061, size: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1078, file: !21, line: 1399, baseType: !1082, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !21, line: 1392, flags: DIFlagFwdDecl)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1025, file: !21, line: 3376, baseType: !1085, size: 256)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !21, line: 1408, size: 256, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !21, line: 1409, baseType: !1061, size: 192)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1085, file: !21, line: 1410, baseType: !1089, size: 64, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !21, line: 1403, flags: DIFlagFwdDecl)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1025, file: !21, line: 3377, baseType: !1092, size: 256)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !21, line: 1437, size: 256, elements: !1093)
!1093 = !{!1094, !1095}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !21, line: 1438, baseType: !1061, size: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1092, file: !21, line: 1439, baseType: !1022, size: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1025, file: !21, line: 3378, baseType: !1097, size: 256)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !21, line: 1418, size: 256, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1097, file: !21, line: 1419, baseType: !1061, size: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1097, file: !21, line: 1420, baseType: !297, size: 32, offset: 192)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1097, file: !21, line: 1421, baseType: !429, size: 8, offset: 224)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1025, file: !21, line: 3379, baseType: !1103, size: 320)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !21, line: 1428, size: 320, elements: !1104)
!1104 = !{!1105, !1106, !1107}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !21, line: 1429, baseType: !1061, size: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1103, file: !21, line: 1430, baseType: !1022, size: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1103, file: !21, line: 1431, baseType: !1022, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1025, file: !21, line: 3380, baseType: !1109, size: 320)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !21, line: 1460, size: 320, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !21, line: 1461, baseType: !1061, size: 192)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1109, file: !21, line: 1462, baseType: !1113, size: 128, offset: 192)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1114, line: 31, size: 128, elements: !1115)
!1114 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1115 = !{!1116, !1119, !1120}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1113, file: !1114, line: 32, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !296)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1113, file: !1114, line: 33, baseType: !7, size: 32, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1113, file: !1114, line: 34, baseType: !7, size: 32, offset: 96)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1025, file: !21, line: 3381, baseType: !1122, size: 384)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !21, line: 2507, size: 384, elements: !1123)
!1123 = !{!1124, !1125, !1130, !1131, !1132}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1122, file: !21, line: 2508, baseType: !1061, size: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1122, file: !21, line: 2509, baseType: !1126, size: 32, offset: 192)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1127, line: 58, baseType: !1128)
!1127 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1129, line: 44, baseType: !7)
!1129 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1122, file: !21, line: 2510, baseType: !7, size: 32, offset: 224)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1122, file: !21, line: 2511, baseType: !1022, size: 64, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1122, file: !21, line: 2512, baseType: !1022, size: 64, offset: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1025, file: !21, line: 3382, baseType: !1134, size: 896)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !21, line: 2652, size: 896, elements: !1135)
!1135 = !{!1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1134, file: !21, line: 2653, baseType: !1122, size: 384)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1134, file: !21, line: 2654, baseType: !1022, size: 64, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1134, file: !21, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1134, file: !21, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1134, file: !21, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1134, file: !21, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1134, file: !21, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1134, file: !21, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1134, file: !21, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1134, file: !21, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1134, file: !21, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1134, file: !21, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1134, file: !21, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1134, file: !21, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1134, file: !21, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1134, file: !21, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1134, file: !21, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1134, file: !21, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1134, file: !21, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1134, file: !21, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1134, file: !21, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1134, file: !21, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1134, file: !21, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1134, file: !21, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1134, file: !21, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1134, file: !21, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1134, file: !21, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1134, file: !21, line: 2703, baseType: !7, size: 32, offset: 512)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1134, file: !21, line: 2705, baseType: !1022, size: 64, offset: 576)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1134, file: !21, line: 2706, baseType: !1022, size: 64, offset: 640)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1134, file: !21, line: 2707, baseType: !1022, size: 64, offset: 704)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1134, file: !21, line: 2708, baseType: !1022, size: 64, offset: 768)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1134, file: !21, line: 2711, baseType: !1169, size: 64, offset: 832)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !21, line: 2711, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1025, file: !21, line: 3383, baseType: !1172, size: 960)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !21, line: 2756, size: 960, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1172, file: !21, line: 2757, baseType: !1134, size: 896)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1172, file: !21, line: 2758, baseType: !1176, size: 64, offset: 896)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1023, line: 50, baseType: !1177)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1023, line: 49, flags: DIFlagFwdDecl)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1025, file: !21, line: 3384, baseType: !1180, size: 1472)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !21, line: 3114, size: 1472, elements: !1181)
!1181 = !{!1182, !1203, !1204, !1205, !1206}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1180, file: !21, line: 3115, baseType: !1183, size: 1216)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !21, line: 2984, size: 1216, elements: !1184)
!1184 = !{!1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1183, file: !21, line: 2985, baseType: !1172, size: 960)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1183, file: !21, line: 2986, baseType: !1022, size: 64, offset: 960)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1183, file: !21, line: 2987, baseType: !1022, size: 64, offset: 1024)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1183, file: !21, line: 2988, baseType: !1022, size: 64, offset: 1088)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1183, file: !21, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1183, file: !21, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1183, file: !21, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1183, file: !21, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1183, file: !21, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1183, file: !21, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1183, file: !21, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1183, file: !21, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1183, file: !21, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1183, file: !21, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1183, file: !21, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1183, file: !21, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1183, file: !21, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1183, file: !21, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1180, file: !21, line: 3117, baseType: !1022, size: 64, offset: 1216)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1180, file: !21, line: 3119, baseType: !1022, size: 64, offset: 1280)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1180, file: !21, line: 3121, baseType: !1022, size: 64, offset: 1344)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1180, file: !21, line: 3123, baseType: !1022, size: 64, offset: 1408)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1025, file: !21, line: 3385, baseType: !1208, size: 1088)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !21, line: 2874, size: 1088, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1208, file: !21, line: 2875, baseType: !1172, size: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1208, file: !21, line: 2876, baseType: !1176, size: 64, offset: 960)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1208, file: !21, line: 2877, baseType: !1213, size: 64, offset: 1024)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !21, line: 2856, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1025, file: !21, line: 3386, baseType: !1183, size: 1216)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1025, file: !21, line: 3387, baseType: !1217, size: 1280)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !21, line: 3093, size: 1280, elements: !1218)
!1218 = !{!1219, !1220}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1217, file: !21, line: 3094, baseType: !1183, size: 1216)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1217, file: !21, line: 3095, baseType: !1213, size: 64, offset: 1216)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1025, file: !21, line: 3388, baseType: !1222, size: 1216)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !21, line: 2824, size: 1216, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227, !1228, !1229}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1222, file: !21, line: 2825, baseType: !1134, size: 896)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1222, file: !21, line: 2827, baseType: !1022, size: 64, offset: 896)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1222, file: !21, line: 2828, baseType: !1022, size: 64, offset: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1222, file: !21, line: 2829, baseType: !1022, size: 64, offset: 1024)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1222, file: !21, line: 2830, baseType: !1022, size: 64, offset: 1088)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1222, file: !21, line: 2831, baseType: !1022, size: 64, offset: 1152)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1025, file: !21, line: 3389, baseType: !1231, size: 1024)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !21, line: 2850, size: 1024, elements: !1232)
!1232 = !{!1233, !1234, !1235}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1231, file: !21, line: 2851, baseType: !1172, size: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1231, file: !21, line: 2852, baseType: !297, size: 32, offset: 960)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1231, file: !21, line: 2853, baseType: !297, size: 32, offset: 992)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1025, file: !21, line: 3390, baseType: !1237, size: 1024)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !21, line: 2857, size: 1024, elements: !1238)
!1238 = !{!1239, !1240}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1237, file: !21, line: 2858, baseType: !1172, size: 960)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1237, file: !21, line: 2859, baseType: !1213, size: 64, offset: 960)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1025, file: !21, line: 3391, baseType: !1242, size: 960)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !21, line: 2862, size: 960, elements: !1243)
!1243 = !{!1244}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1242, file: !21, line: 2863, baseType: !1172, size: 960)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1025, file: !21, line: 3392, baseType: !1246, size: 1472)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !21, line: 3304, size: 1472, elements: !1247)
!1247 = !{!1248}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1246, file: !21, line: 3305, baseType: !1180, size: 1472)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1025, file: !21, line: 3393, baseType: !1250, size: 1792)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !21, line: 3248, size: 1792, elements: !1251)
!1251 = !{!1252, !1253, !1685, !1686, !1687, !1688, !1689, !1690, !1691, !1692, !1693, !1694, !1695, !1696, !1697, !1698, !1699, !1700, !1701, !1702, !1703, !1704, !1705}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1250, file: !21, line: 3249, baseType: !1180, size: 1472)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1250, file: !21, line: 3251, baseType: !1254, size: 64, offset: 1472)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1256, line: 463, size: 1152, elements: !1257)
!1256 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1257 = !{!1258, !1261, !1576, !1577, !1580, !1583, !1628, !1629, !1630, !1631, !1632, !1658, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668, !1669, !1670, !1671, !1672, !1673, !1674, !1675, !1676, !1677, !1678, !1679, !1680, !1681, !1682, !1683, !1684}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1255, file: !1256, line: 464, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1256, line: 464, flags: DIFlagFwdDecl)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1255, file: !1256, line: 467, baseType: !1262, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !216, line: 374, size: 640, elements: !1264)
!1264 = !{!1265, !1551, !1552, !1565, !1566, !1567, !1568, !1569, !1570, !1572, !1574, !1575}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1263, file: !216, line: 377, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1023, line: 111, baseType: !1267)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !216, line: 217, size: 832, elements: !1269)
!1269 = !{!1270, !1514, !1515, !1516, !1519, !1525, !1526, !1527, !1545, !1546, !1547, !1548, !1549, !1550}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1268, file: !216, line: 219, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !216, line: 151, baseType: !1273)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !216, line: 151, size: 128, elements: !1274)
!1274 = !{!1275}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1273, file: !216, line: 151, baseType: !1276, size: 128)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !216, line: 150, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !216, line: 150, size: 128, elements: !1278)
!1278 = !{!1279, !1280, !1281}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1277, file: !216, line: 150, baseType: !7, size: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1277, file: !216, line: 150, baseType: !7, size: 32, offset: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1277, file: !216, line: 150, baseType: !1282, size: 64, offset: 64)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1283, size: 64, elements: !358)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1023, line: 108, baseType: !1284)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !216, line: 122, size: 512, elements: !1286)
!1286 = !{!1287, !1288, !1289, !1506, !1507, !1508, !1509, !1510, !1511, !1512}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1285, file: !216, line: 124, baseType: !1267, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1285, file: !216, line: 125, baseType: !1267, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1285, file: !216, line: 131, baseType: !1290, size: 64, offset: 128)
!1290 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !216, line: 128, size: 64, elements: !1291)
!1291 = !{!1292, !1505}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1290, file: !216, line: 129, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1023, line: 66, baseType: !1294)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
