; ModuleID = 'lto-cgraph.bc'
source_filename = "lto-cgraph.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cgraph_asm_node = type { %struct.cgraph_asm_node*, %union.tree_node*, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }

!387 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!388 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!389 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!390 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!391 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!392 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!393 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!394 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!395 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!396 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!397 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!398 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!399 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!400 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!401 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!402 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!403 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!404 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!405 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!406 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !408, line: 256, baseType: !7, size: 32, elements: !409)
!408 = !DIFile(filename: "./lto-streamer.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!410 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!411 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!412 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!413 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!414 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!415 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!416 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!417 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!418 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!419 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!420 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "LTO_cgraph_tags", file: !385, line: 630, baseType: !7, size: 32, elements: !422)
!422 = !{!423, !424, !425, !426, !427}
!423 = !DIEnumerator(name: "LTO_cgraph_avail_node", value: 1, isUnsigned: true)
!424 = !DIEnumerator(name: "LTO_cgraph_overwritable_node", value: 2, isUnsigned: true)
!425 = !DIEnumerator(name: "LTO_cgraph_unavail_node", value: 3, isUnsigned: true)
!426 = !DIEnumerator(name: "LTO_cgraph_edge", value: 4, isUnsigned: true)
!427 = !DIEnumerator(name: "LTO_cgraph_last_tag", value: 5, isUnsigned: true)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ld_plugin_symbol_resolution", file: !429, line: 123, baseType: !7, size: 32, elements: !430)
!429 = !DIFile(filename: "./include/plugin-api.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439}
!431 = !DIEnumerator(name: "LDPR_UNKNOWN", value: 0, isUnsigned: true)
!432 = !DIEnumerator(name: "LDPR_UNDEF", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "LDPR_PREVAILING_DEF", value: 2, isUnsigned: true)
!434 = !DIEnumerator(name: "LDPR_PREVAILING_DEF_IRONLY", value: 3, isUnsigned: true)
!435 = !DIEnumerator(name: "LDPR_PREEMPTED_REG", value: 4, isUnsigned: true)
!436 = !DIEnumerator(name: "LDPR_PREEMPTED_IR", value: 5, isUnsigned: true)
!437 = !DIEnumerator(name: "LDPR_RESOLVED_IR", value: 6, isUnsigned: true)
!438 = !DIEnumerator(name: "LDPR_RESOLVED_EXEC", value: 7, isUnsigned: true)
!439 = !DIEnumerator(name: "LDPR_RESOLVED_DYN", value: 8, isUnsigned: true)
!440 = !{!441, !442, !443, !444, !447, !448, !450, !2059, !458, !7, !421, !475, !445, !1012, !1912, !602, !470}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!443 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64)
!446 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !449, size: 64)
!449 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !446)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_cgraph_encoder_d", file: !408, line: 461, size: 128, elements: !452)
!452 = !{!453, !457}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !451, file: !408, line: 464, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !456, line: 33, flags: DIFlagFwdDecl)
!456 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!457 = !DIDerivedType(tag: DW_TAG_member, name: "nodes", scope: !451, file: !408, line: 467, baseType: !458, size: 64, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_cgraph_node_ptr_heap", file: !385, line: 271, baseType: !460)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_cgraph_node_ptr_heap", file: !385, line: 271, size: 128, elements: !461)
!461 = !{!462}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !460, file: !385, line: 271, baseType: !463, size: 128)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_cgraph_node_ptr_base", file: !385, line: 270, baseType: !464)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_cgraph_node_ptr_base", file: !385, line: 270, size: 128, elements: !465)
!465 = !{!466, !467, !468}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !464, file: !385, line: 270, baseType: !7, size: 32)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !464, file: !385, line: 270, baseType: !7, size: 32, offset: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !464, file: !385, line: 270, baseType: !469, size: 64, offset: 64)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !470, size: 64, elements: !574)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "cgraph_node_ptr", file: !385, line: 268, baseType: !471)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cgraph_node", file: !385, line: 181, size: 2496, elements: !473)
!473 = !{!474, !1898, !1921, !1922, !1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936, !1952, !1996, !2006, !2010, !2036, !2045, !2046, !2047, !2048, !2049, !2050, !2051, !2052, !2053, !2054, !2055, !2056, !2057, !2058}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !472, file: !385, line: 182, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !476, line: 56, baseType: !477)
!476 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !479)
!479 = !{!480, !513, !519, !532, !551, !562, !567, !576, !582, !595, !607, !645, !1138, !1166, !1183, !1184, !1189, !1198, !1204, !1209, !1213, !1217, !1549, !1596, !1602, !1608, !1615, !1628, !1642, !1659, !1671, !1693, !1708, !1880}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !478, file: !135, line: 3372, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !481, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !481, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !481, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !481, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !481, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !481, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !481, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !481, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !481, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !481, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !481, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !481, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !481, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !481, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !481, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !481, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !481, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !481, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !481, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !481, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !481, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !481, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !481, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !481, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !481, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !481, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !481, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !481, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !481, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !481, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !478, file: !135, line: 3373, baseType: !514, size: 192)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !514, file: !135, line: 403, baseType: !481, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !514, file: !135, line: 404, baseType: !475, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !135, line: 405, baseType: !475, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !478, file: !135, line: 3374, baseType: !520, size: 320)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !520, file: !135, line: 1385, baseType: !514, size: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !520, file: !135, line: 1386, baseType: !524, size: 128, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !525, line: 58, baseType: !526)
!525 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 54, size: 128, elements: !527)
!527 = !{!528, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !526, file: !525, line: 56, baseType: !529, size: 64)
!529 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !526, file: !525, line: 57, baseType: !531, size: 64, offset: 64)
!531 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !478, file: !135, line: 3375, baseType: !533, size: 256)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !533, file: !135, line: 1398, baseType: !514, size: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !533, file: !135, line: 1399, baseType: !537, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !539, line: 52, size: 256, elements: !540)
!539 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!540 = !{!541, !542, !543, !544, !545, !546, !547}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !538, file: !539, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !538, file: !539, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !538, file: !539, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !538, file: !539, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !538, file: !539, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !538, file: !539, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !538, file: !539, line: 62, baseType: !548, size: 192, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 192, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 3)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !478, file: !135, line: 3376, baseType: !552, size: 256)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !552, file: !135, line: 1409, baseType: !514, size: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !552, file: !135, line: 1410, baseType: !556, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !558, line: 27, size: 192, elements: !559)
!558 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !557, file: !558, line: 29, baseType: !524, size: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !557, file: !558, line: 30, baseType: !5, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !478, file: !135, line: 3377, baseType: !563, size: 256)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !563, file: !135, line: 1438, baseType: !514, size: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !563, file: !135, line: 1439, baseType: !475, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !478, file: !135, line: 3378, baseType: !568, size: 256)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !568, file: !135, line: 1419, baseType: !514, size: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !568, file: !135, line: 1420, baseType: !443, size: 32, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !568, file: !135, line: 1421, baseType: !573, size: 8, offset: 224)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 1)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !478, file: !135, line: 3379, baseType: !577, size: 320)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !578)
!578 = !{!579, !580, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !577, file: !135, line: 1429, baseType: !514, size: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !577, file: !135, line: 1430, baseType: !475, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !577, file: !135, line: 1431, baseType: !475, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !478, file: !135, line: 3380, baseType: !583, size: 320)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !135, line: 1461, baseType: !514, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !135, line: 1462, baseType: !587, size: 128, offset: 192)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !588, line: 31, size: 128, elements: !589)
!588 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!589 = !{!590, !593, !594}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !587, file: !588, line: 32, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !442)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !587, file: !588, line: 33, baseType: !7, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !587, file: !588, line: 34, baseType: !7, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !478, file: !135, line: 3381, baseType: !596, size: 384)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !597)
!597 = !{!598, !599, !604, !605, !606}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !596, file: !135, line: 2508, baseType: !514, size: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !596, file: !135, line: 2509, baseType: !600, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !601, line: 58, baseType: !602)
!601 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !603, line: 44, baseType: !7)
!603 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !596, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !135, line: 2511, baseType: !475, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !596, file: !135, line: 2512, baseType: !475, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !478, file: !135, line: 3382, baseType: !608, size: 896)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !135, line: 2653, baseType: !596, size: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !608, file: !135, line: 2654, baseType: !475, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !608, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !608, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !608, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !608, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !608, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !608, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !608, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !608, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !608, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !608, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !608, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !608, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !608, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !608, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !608, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !608, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !608, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !608, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !608, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !608, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !608, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !608, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !608, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !608, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !608, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !608, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !608, file: !135, line: 2705, baseType: !475, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !608, file: !135, line: 2706, baseType: !475, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !608, file: !135, line: 2707, baseType: !475, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !608, file: !135, line: 2708, baseType: !475, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !608, file: !135, line: 2711, baseType: !643, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !478, file: !135, line: 3383, baseType: !646, size: 960)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !646, file: !135, line: 2757, baseType: !608, size: 896)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !646, file: !135, line: 2758, baseType: !650, size: 64, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !476, line: 50, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !653, line: 240, size: 384, elements: !654)
!653 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !652, file: !653, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !652, file: !653, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !652, file: !653, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !652, file: !653, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !652, file: !653, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !652, file: !653, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !652, file: !653, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !652, file: !653, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !652, file: !653, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !652, file: !653, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !652, file: !653, line: 321, baseType: !666, size: 320, offset: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !653, line: 315, size: 320, elements: !667)
!667 = !{!668, !1071, !1073, !1136, !1137}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !666, file: !653, line: 316, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, elements: !574)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !653, line: 183, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !653, line: 166, size: 64, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !685, !686, !698, !701, !761, !762, !1048, !1061, !1068}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !671, file: !653, line: 168, baseType: !443, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !671, file: !653, line: 169, baseType: !7, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !671, file: !653, line: 170, baseType: !448, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !671, file: !653, line: 171, baseType: !650, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !671, file: !653, line: 172, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !476, line: 53, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !653, line: 359, size: 128, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !680, file: !653, line: 360, baseType: !443, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !680, file: !653, line: 361, baseType: !684, size: 64, offset: 64)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 64, elements: !574)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !671, file: !653, line: 173, baseType: !5, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !671, file: !653, line: 174, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !653, line: 133, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !653, line: 115, size: 32, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !688, file: !653, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !688, file: !653, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !688, file: !653, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !688, file: !653, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !688, file: !653, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !688, file: !653, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !688, file: !653, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !688, file: !653, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !671, file: !653, line: 175, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !653, line: 175, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !671, file: !653, line: 176, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !704, line: 75, size: 256, elements: !705)
!704 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!705 = !{!706, !720, !721, !722}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !703, file: !704, line: 76, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !704, line: 68, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !704, line: 63, size: 320, elements: !710)
!710 = !{!711, !713, !714, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !704, line: 64, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !709, file: !704, line: 65, baseType: !712, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !709, file: !704, line: 66, baseType: !7, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !709, file: !704, line: 67, baseType: !716, size: 128, offset: 192)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 128, elements: !718)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !704, line: 29, baseType: !529)
!718 = !{!719}
!719 = !DISubrange(count: 2)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !703, file: !704, line: 77, baseType: !707, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !703, file: !704, line: 78, baseType: !7, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !703, file: !704, line: 79, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !704, line: 49, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !704, line: 45, size: 832, elements: !726)
!726 = !{!727, !728, !729}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !725, file: !704, line: 46, baseType: !712, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !725, file: !704, line: 47, baseType: !702, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !725, file: !704, line: 48, baseType: !730, size: 704, offset: 128)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !731, line: 164, size: 704, elements: !732)
!731 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = !{!733, !734, !744, !745, !746, !747, !748, !749, !753, !757, !758, !759, !760}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !730, file: !731, line: 166, baseType: !531, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !730, file: !731, line: 167, baseType: !735, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !731, line: 157, size: 192, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !736, file: !731, line: 159, baseType: !445, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !736, file: !731, line: 160, baseType: !735, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !736, file: !731, line: 161, baseType: !741, size: 32, offset: 128)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !446, size: 32, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 4)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !730, file: !731, line: 168, baseType: !445, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !730, file: !731, line: 169, baseType: !445, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !730, file: !731, line: 170, baseType: !445, size: 64, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !730, file: !731, line: 171, baseType: !531, size: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !730, file: !731, line: 172, baseType: !443, size: 32, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !730, file: !731, line: 176, baseType: !750, size: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!735, !447, !531}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !730, file: !731, line: 177, baseType: !754, size: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !447, !735}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !730, file: !731, line: 178, baseType: !447, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !730, file: !731, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !730, file: !731, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !730, file: !731, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !671, file: !653, line: 177, baseType: !475, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !671, file: !653, line: 178, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !765)
!765 = !{!766, !1013, !1014, !1015, !1018, !1022, !1023, !1024, !1042, !1043, !1044, !1045, !1046, !1047}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !764, file: !337, line: 219, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !769, file: !337, line: 151, baseType: !772, size: 128)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !773, file: !337, line: 150, baseType: !7, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !773, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !773, file: !337, line: 150, baseType: !778, size: 64, offset: 64)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 64, elements: !574)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !476, line: 108, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !782)
!782 = !{!783, !784, !785, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !781, file: !337, line: 124, baseType: !763, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !781, file: !337, line: 125, baseType: !763, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !781, file: !337, line: 131, baseType: !786, size: 64, offset: 128)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !787)
!787 = !{!788, !1004}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !786, file: !337, line: 129, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !476, line: 66, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !792, line: 143, size: 192, elements: !793)
!792 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!793 = !{!794, !1002, !1003}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !791, file: !792, line: 145, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !476, line: 69, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !792, line: 136, size: 192, elements: !798)
!798 = !{!799, !1000, !1001}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !797, file: !792, line: 137, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !476, line: 58, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !792, line: 737, size: 768, elements: !803)
!803 = !{!804, !821, !855, !861, !866, !871, !878, !884, !890, !895, !909, !914, !920, !925, !935, !940, !958, !965, !972, !978, !983, !989, !995}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !802, file: !792, line: 738, baseType: !805, size: 256)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !792, line: 271, size: 256, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !805, file: !792, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !805, file: !792, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !805, file: !792, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !805, file: !792, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !805, file: !792, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !805, file: !792, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !805, file: !792, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !805, file: !792, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !805, file: !792, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !805, file: !792, line: 312, baseType: !7, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !805, file: !792, line: 316, baseType: !600, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !805, file: !792, line: 319, baseType: !7, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !805, file: !792, line: 323, baseType: !763, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !805, file: !792, line: 327, baseType: !475, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !802, file: !792, line: 739, baseType: !822, size: 448)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !792, line: 350, size: 448, elements: !823)
!823 = !{!824, !853}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !822, file: !792, line: 353, baseType: !825, size: 384)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !792, line: 333, size: 384, elements: !826)
!826 = !{!827, !828, !836}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !825, file: !792, line: 336, baseType: !805, size: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !825, file: !792, line: 343, baseType: !829, size: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !831, line: 37, size: 128, elements: !832)
!831 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !831, line: 39, baseType: !829, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !830, file: !831, line: 40, baseType: !835, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !825, file: !792, line: 344, baseType: !837, size: 64, offset: 320)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !831, line: 45, size: 320, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !831, line: 47, baseType: !837, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !838, file: !831, line: 48, baseType: !842, size: 256, offset: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !843)
!843 = !{!844, !846, !847, !852}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !842, file: !135, line: 1884, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !842, file: !135, line: 1885, baseType: !845, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !842, file: !135, line: 1891, baseType: !848, size: 64, offset: 128)
!848 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !842, file: !135, line: 1891, size: 64, elements: !849)
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !848, file: !135, line: 1891, baseType: !800, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !848, file: !135, line: 1891, baseType: !475, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !842, file: !135, line: 1892, baseType: !835, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !822, file: !792, line: 359, baseType: !854, size: 64, offset: 384)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 64, elements: !574)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !802, file: !792, line: 740, baseType: !856, size: 512)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !792, line: 365, size: 512, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !856, file: !792, line: 368, baseType: !825, size: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !856, file: !792, line: 373, baseType: !475, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !856, file: !792, line: 374, baseType: !475, size: 64, offset: 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !802, file: !792, line: 741, baseType: !862, size: 576)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !792, line: 380, size: 576, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !862, file: !792, line: 383, baseType: !856, size: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !862, file: !792, line: 389, baseType: !854, size: 64, offset: 512)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !802, file: !792, line: 742, baseType: !867, size: 320)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !792, line: 395, size: 320, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !867, file: !792, line: 397, baseType: !805, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !867, file: !792, line: 400, baseType: !789, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !802, file: !792, line: 743, baseType: !872, size: 448)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !792, line: 406, size: 448, elements: !873)
!873 = !{!874, !875, !876, !877}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !872, file: !792, line: 408, baseType: !805, size: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !872, file: !792, line: 412, baseType: !475, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !872, file: !792, line: 420, baseType: !475, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !872, file: !792, line: 423, baseType: !789, size: 64, offset: 384)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !802, file: !792, line: 744, baseType: !879, size: 384)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !792, line: 429, size: 384, elements: !880)
!880 = !{!881, !882, !883}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !879, file: !792, line: 431, baseType: !805, size: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !879, file: !792, line: 434, baseType: !475, size: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !879, file: !792, line: 437, baseType: !789, size: 64, offset: 320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !802, file: !792, line: 745, baseType: !885, size: 384)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !792, line: 443, size: 384, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !885, file: !792, line: 445, baseType: !805, size: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !885, file: !792, line: 449, baseType: !475, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !885, file: !792, line: 453, baseType: !789, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !802, file: !792, line: 746, baseType: !891, size: 320)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !792, line: 459, size: 320, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !891, file: !792, line: 461, baseType: !805, size: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !891, file: !792, line: 464, baseType: !475, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !802, file: !792, line: 747, baseType: !896, size: 768)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !792, line: 469, size: 768, elements: !897)
!897 = !{!898, !899, !900, !901, !902}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !896, file: !792, line: 471, baseType: !805, size: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !896, file: !792, line: 474, baseType: !7, size: 32, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !896, file: !792, line: 475, baseType: !7, size: 32, offset: 288)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !896, file: !792, line: 478, baseType: !475, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !896, file: !792, line: 481, baseType: !903, size: 384, offset: 384)
!903 = !DICompositeType(tag: DW_TAG_array_type, baseType: !904, size: 384, elements: !574)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !904, file: !135, line: 1920, baseType: !842, size: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !904, file: !135, line: 1921, baseType: !475, size: 64, offset: 256)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !904, file: !135, line: 1922, baseType: !600, size: 32, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !802, file: !792, line: 748, baseType: !910, size: 320)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !792, line: 487, size: 320, elements: !911)
!911 = !{!912, !913}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !910, file: !792, line: 490, baseType: !805, size: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !910, file: !792, line: 494, baseType: !443, size: 32, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !802, file: !792, line: 749, baseType: !915, size: 384)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !792, line: 500, size: 384, elements: !916)
!916 = !{!917, !918, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !915, file: !792, line: 502, baseType: !805, size: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !915, file: !792, line: 506, baseType: !789, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !915, file: !792, line: 510, baseType: !789, size: 64, offset: 320)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !802, file: !792, line: 750, baseType: !921, size: 320)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !792, line: 529, size: 320, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !921, file: !792, line: 531, baseType: !805, size: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !921, file: !792, line: 540, baseType: !789, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !802, file: !792, line: 751, baseType: !926, size: 704)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !792, line: 546, size: 704, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !934}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !926, file: !792, line: 549, baseType: !856, size: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !926, file: !792, line: 553, baseType: !448, size: 64, offset: 512)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !926, file: !792, line: 557, baseType: !442, size: 8, offset: 576)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !926, file: !792, line: 558, baseType: !442, size: 8, offset: 584)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !926, file: !792, line: 559, baseType: !442, size: 8, offset: 592)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !926, file: !792, line: 560, baseType: !442, size: 8, offset: 600)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !926, file: !792, line: 566, baseType: !854, size: 64, offset: 640)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !802, file: !792, line: 752, baseType: !936, size: 384)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !792, line: 571, size: 384, elements: !937)
!937 = !{!938, !939}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !936, file: !792, line: 573, baseType: !867, size: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !936, file: !792, line: 577, baseType: !475, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !802, file: !792, line: 753, baseType: !941, size: 576)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !792, line: 600, size: 576, elements: !942)
!942 = !{!943, !944, !945, !948, !957}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !941, file: !792, line: 602, baseType: !867, size: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !941, file: !792, line: 605, baseType: !475, size: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !941, file: !792, line: 609, baseType: !946, size: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !947, line: 46, baseType: !529)
!947 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!948 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !941, file: !792, line: 612, baseType: !949, size: 64, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !792, line: 581, size: 320, elements: !951)
!951 = !{!952, !953, !954, !955, !956}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !950, file: !792, line: 583, baseType: !134, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !950, file: !792, line: 586, baseType: !475, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !950, file: !792, line: 589, baseType: !475, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !950, file: !792, line: 592, baseType: !475, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !950, file: !792, line: 595, baseType: !475, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !941, file: !792, line: 616, baseType: !789, size: 64, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !802, file: !792, line: 754, baseType: !959, size: 512)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !792, line: 622, size: 512, elements: !960)
!960 = !{!961, !962, !963, !964}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !959, file: !792, line: 624, baseType: !867, size: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !959, file: !792, line: 628, baseType: !475, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !959, file: !792, line: 632, baseType: !475, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !959, file: !792, line: 636, baseType: !475, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !802, file: !792, line: 755, baseType: !966, size: 704)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !792, line: 642, size: 704, elements: !967)
!967 = !{!968, !969, !970, !971}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !966, file: !792, line: 644, baseType: !959, size: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !966, file: !792, line: 648, baseType: !475, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !966, file: !792, line: 652, baseType: !475, size: 64, offset: 576)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !966, file: !792, line: 653, baseType: !475, size: 64, offset: 640)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !802, file: !792, line: 756, baseType: !973, size: 448)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !792, line: 663, size: 448, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !973, file: !792, line: 665, baseType: !867, size: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !973, file: !792, line: 668, baseType: !475, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !973, file: !792, line: 673, baseType: !475, size: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !802, file: !792, line: 757, baseType: !979, size: 384)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !792, line: 694, size: 384, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !979, file: !792, line: 696, baseType: !867, size: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !979, file: !792, line: 699, baseType: !475, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !802, file: !792, line: 758, baseType: !984, size: 384)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !792, line: 681, size: 384, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !984, file: !792, line: 683, baseType: !805, size: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !984, file: !792, line: 686, baseType: !475, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !984, file: !792, line: 689, baseType: !475, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !802, file: !792, line: 759, baseType: !990, size: 384)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !792, line: 707, size: 384, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !990, file: !792, line: 709, baseType: !805, size: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !990, file: !792, line: 712, baseType: !475, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !990, file: !792, line: 712, baseType: !475, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !802, file: !792, line: 760, baseType: !996, size: 320)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !792, line: 718, size: 320, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !996, file: !792, line: 720, baseType: !805, size: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !996, file: !792, line: 723, baseType: !475, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !797, file: !792, line: 138, baseType: !796, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !797, file: !792, line: 139, baseType: !796, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !791, file: !792, line: 146, baseType: !795, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !791, file: !792, line: 152, baseType: !789, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !786, file: !337, line: 130, baseType: !650, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !781, file: !337, line: 134, baseType: !447, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !781, file: !337, line: 137, baseType: !475, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !781, file: !337, line: 138, baseType: !600, size: 32, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !781, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !781, file: !337, line: 144, baseType: !443, size: 32, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !781, file: !337, line: 145, baseType: !443, size: 32, offset: 416)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !781, file: !337, line: 146, baseType: !1012, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !531)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !764, file: !337, line: 220, baseType: !767, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !764, file: !337, line: 223, baseType: !447, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !764, file: !337, line: 226, baseType: !1016, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !764, file: !337, line: 229, baseType: !1019, size: 128, offset: 256)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 128, elements: !718)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !764, file: !337, line: 232, baseType: !763, size: 64, offset: 384)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !764, file: !337, line: 233, baseType: !763, size: 64, offset: 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !764, file: !337, line: 238, baseType: !1025, size: 64, offset: 512)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !1026)
!1026 = !{!1027, !1033}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1025, file: !337, line: 236, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1029, file: !337, line: 275, baseType: !789, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1029, file: !337, line: 278, baseType: !789, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1025, file: !337, line: 237, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1035, file: !337, line: 261, baseType: !650, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1035, file: !337, line: 262, baseType: !650, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1035, file: !337, line: 266, baseType: !650, size: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1035, file: !337, line: 267, baseType: !650, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1035, file: !337, line: 270, baseType: !443, size: 32, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !764, file: !337, line: 241, baseType: !1012, size: 64, offset: 576)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !764, file: !337, line: 244, baseType: !443, size: 32, offset: 640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !764, file: !337, line: 247, baseType: !443, size: 32, offset: 672)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !764, file: !337, line: 250, baseType: !443, size: 32, offset: 704)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !764, file: !337, line: 253, baseType: !443, size: 32, offset: 736)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !337, line: 256, baseType: !443, size: 32, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !671, file: !653, line: 179, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !653, line: 150, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !653, line: 142, size: 320, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1059, !1060}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1051, file: !653, line: 144, baseType: !475, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1051, file: !653, line: 145, baseType: !650, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1051, file: !653, line: 146, baseType: !650, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1051, file: !653, line: 147, baseType: !1057, size: 32, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1058, line: 31, baseType: !443)
!1058 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1051, file: !653, line: 148, baseType: !7, size: 32, offset: 224)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1051, file: !653, line: 149, baseType: !442, size: 8, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !671, file: !653, line: 180, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !653, line: 162, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !653, line: 159, size: 128, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1064, file: !653, line: 160, baseType: !475, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1064, file: !653, line: 161, baseType: !531, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !671, file: !653, line: 181, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !653, line: 181, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !666, file: !653, line: 317, baseType: !1072, size: 64)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 64, elements: !574)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !666, file: !653, line: 318, baseType: !1074, size: 320)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !653, line: 188, size: 320, elements: !1075)
!1075 = !{!1076, !1078, !1135}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1074, file: !653, line: 190, baseType: !1077, size: 192)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 192, elements: !549)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1074, file: !653, line: 193, baseType: !1079, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !653, line: 206, size: 320, elements: !1081)
!1081 = !{!1082, !1120, !1121, !1122, !1134}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1080, file: !653, line: 208, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !476, line: 62, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1086, line: 538, size: 256, elements: !1087)
!1086 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1087 = !{!1088, !1092, !1098, !1111}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !1086, line: 539, baseType: !1089, size: 32)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1086, line: 482, size: 32, elements: !1090)
!1090 = !{!1091}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !1086, line: 484, baseType: !7, size: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1085, file: !1086, line: 540, baseType: !1093, size: 192)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1086, line: 488, size: 192, elements: !1094)
!1094 = !{!1095, !1096, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !1086, line: 489, baseType: !1089, size: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1093, file: !1086, line: 492, baseType: !448, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1093, file: !1086, line: 496, baseType: !475, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1085, file: !1086, line: 541, baseType: !1099, size: 256)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1086, line: 504, size: 256, elements: !1100)
!1100 = !{!1101, !1102, !1109, !1110}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1099, file: !1086, line: 505, baseType: !1089, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1099, file: !1086, line: 509, baseType: !1103, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1086, line: 501, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !1086, line: 510, baseType: !1107, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1099, file: !1086, line: 513, baseType: !1083, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1085, file: !1086, line: 542, baseType: !1112, size: 128)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1086, line: 530, size: 128, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1112, file: !1086, line: 531, baseType: !1089, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1112, file: !1086, line: 534, baseType: !1116, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1086, line: 525, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!442, !475, !448, !529, !529}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1080, file: !653, line: 211, baseType: !7, size: 32, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1080, file: !653, line: 214, baseType: !531, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1080, file: !653, line: 224, baseType: !1123, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !653, line: 202, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !653, line: 202, size: 128, elements: !1126)
!1126 = !{!1127}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1125, file: !653, line: 202, baseType: !1128, size: 128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !653, line: 200, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !653, line: 200, size: 128, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1129, file: !653, line: 200, baseType: !7, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1129, file: !653, line: 200, baseType: !7, size: 32, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1129, file: !653, line: 200, baseType: !684, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1080, file: !653, line: 234, baseType: !1123, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1074, file: !653, line: 197, baseType: !531, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !666, file: !653, line: 319, baseType: !538, size: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !666, file: !653, line: 320, baseType: !557, size: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !478, file: !135, line: 3384, baseType: !1139, size: 1472)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1140)
!1140 = !{!1141, !1162, !1163, !1164, !1165}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !135, line: 3115, baseType: !1142, size: 1216)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !135, line: 2985, baseType: !646, size: 960)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1142, file: !135, line: 2986, baseType: !475, size: 64, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1142, file: !135, line: 2987, baseType: !475, size: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1142, file: !135, line: 2988, baseType: !475, size: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1142, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1142, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1142, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1142, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1142, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1142, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1142, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1142, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1142, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1142, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1142, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1142, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1142, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1142, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1139, file: !135, line: 3117, baseType: !475, size: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1139, file: !135, line: 3119, baseType: !475, size: 64, offset: 1280)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1139, file: !135, line: 3121, baseType: !475, size: 64, offset: 1344)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1139, file: !135, line: 3123, baseType: !475, size: 64, offset: 1408)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !478, file: !135, line: 3385, baseType: !1167, size: 1088)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !135, line: 2875, baseType: !646, size: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1167, file: !135, line: 2876, baseType: !650, size: 64, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1167, file: !135, line: 2877, baseType: !1172, size: 64, offset: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1174, line: 172, size: 128, elements: !1175)
!1174 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1182}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1173, file: !1174, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1173, file: !1174, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1173, file: !1174, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1173, file: !1174, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1173, file: !1174, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1173, file: !1174, line: 195, baseType: !7, size: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1173, file: !1174, line: 199, baseType: !475, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !478, file: !135, line: 3386, baseType: !1142, size: 1216)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !478, file: !135, line: 3387, baseType: !1185, size: 1280)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1185, file: !135, line: 3094, baseType: !1142, size: 1216)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1185, file: !135, line: 3095, baseType: !1172, size: 64, offset: 1216)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !478, file: !135, line: 3388, baseType: !1190, size: 1216)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196, !1197}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1190, file: !135, line: 2825, baseType: !608, size: 896)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1190, file: !135, line: 2827, baseType: !475, size: 64, offset: 896)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1190, file: !135, line: 2828, baseType: !475, size: 64, offset: 960)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1190, file: !135, line: 2829, baseType: !475, size: 64, offset: 1024)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1190, file: !135, line: 2830, baseType: !475, size: 64, offset: 1088)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1190, file: !135, line: 2831, baseType: !475, size: 64, offset: 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !478, file: !135, line: 3389, baseType: !1199, size: 1024)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1199, file: !135, line: 2851, baseType: !646, size: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1199, file: !135, line: 2852, baseType: !443, size: 32, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1199, file: !135, line: 2853, baseType: !443, size: 32, offset: 992)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !478, file: !135, line: 3390, baseType: !1205, size: 1024)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1205, file: !135, line: 2858, baseType: !646, size: 960)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1205, file: !135, line: 2859, baseType: !1172, size: 64, offset: 960)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !478, file: !135, line: 3391, baseType: !1210, size: 960)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1211)
!1211 = !{!1212}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1210, file: !135, line: 2863, baseType: !646, size: 960)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !478, file: !135, line: 3392, baseType: !1214, size: 1472)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1215)
!1215 = !{!1216}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !135, line: 3305, baseType: !1139, size: 1472)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !478, file: !135, line: 3393, baseType: !1218, size: 1792)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1219)
!1219 = !{!1220, !1221, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1218, file: !135, line: 3249, baseType: !1139, size: 1472)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1218, file: !135, line: 3251, baseType: !1222, size: 64, offset: 1472)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1224, line: 463, size: 1152, elements: !1225)
!1224 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1225 = !{!1226, !1385, !1416, !1417, !1469, !1472, !1473, !1474, !1475, !1476, !1477, !1501, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1223, file: !1224, line: 464, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !1229)
!1229 = !{!1230, !1279, !1292, !1306, !1354, !1366}
