; ModuleID = 'lto-wpa-fixup.bc'
source_filename = "lto-wpa-fixup.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }

!539 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!540 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!541 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!542 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!543 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!544 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!545 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!546 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!547 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!548 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!549 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!550 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!551 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!552 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!553 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!554 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!555 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!556 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!557 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!558 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!559 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!560 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!561 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!562 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!563 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!564 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!565 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!566 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!567 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!568 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!569 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!570 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!571 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!572 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!573 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!574 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!575 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!576 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!577 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!578 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!579 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!580 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!581 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!582 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!583 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !584, line: 256, baseType: !7, size: 32, elements: !585)
!584 = !DIFile(filename: "./lto-streamer.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!585 = !{!586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596}
!586 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!587 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!588 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!589 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!590 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!591 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!592 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!593 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!594 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!595 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!596 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!597 = !{!598, !599, !600, !601, !604, !605, !134, !607, !7}
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!600 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !603)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_heap", file: !135, line: 184, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_heap", file: !135, line: 184, size: 128, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !609, file: !135, line: 184, baseType: !612, size: 128)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !613, file: !135, line: 182, baseType: !7, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !613, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !613, file: !135, line: 182, baseType: !618, size: 64, offset: 64)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 64, elements: !718)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !620, line: 56, baseType: !621)
!620 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !623)
!623 = !{!624, !657, !663, !676, !695, !706, !711, !720, !726, !739, !751, !789, !1247, !1275, !1292, !1293, !1298, !1307, !1313, !1318, !1322, !1326, !1559, !1606, !1612, !1618, !1625, !1638, !1652, !1669, !1681, !1703, !1718, !1890}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !622, file: !135, line: 3372, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !626)
!626 = !{!627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !625, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !625, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !625, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !625, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !625, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !625, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !625, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !625, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !625, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !625, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !625, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !625, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !625, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !625, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !625, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !625, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !625, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !625, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !625, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !625, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !625, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !625, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !625, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !625, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !625, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !625, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !625, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !625, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !625, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !625, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !135, line: 3373, baseType: !658, size: 192)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !135, line: 403, baseType: !625, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !658, file: !135, line: 404, baseType: !619, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !658, file: !135, line: 405, baseType: !619, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !622, file: !135, line: 3374, baseType: !664, size: 320)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !665)
!665 = !{!666, !667}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !664, file: !135, line: 1385, baseType: !658, size: 192)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !664, file: !135, line: 1386, baseType: !668, size: 128, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !669, line: 58, baseType: !670)
!669 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !669, line: 54, size: 128, elements: !671)
!671 = !{!672, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !670, file: !669, line: 56, baseType: !673, size: 64)
!673 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !670, file: !669, line: 57, baseType: !675, size: 64, offset: 64)
!675 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !622, file: !135, line: 3375, baseType: !677, size: 256)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !135, line: 1398, baseType: !658, size: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !677, file: !135, line: 1399, baseType: !681, size: 64, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !683, line: 52, size: 256, elements: !684)
!683 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!684 = !{!685, !686, !687, !688, !689, !690, !691}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !682, file: !683, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !682, file: !683, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !682, file: !683, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !682, file: !683, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !682, file: !683, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !682, file: !683, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !682, file: !683, line: 62, baseType: !692, size: 192, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 192, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 3)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !622, file: !135, line: 3376, baseType: !696, size: 256)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !696, file: !135, line: 1409, baseType: !658, size: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !696, file: !135, line: 1410, baseType: !700, size: 64, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !702, line: 27, size: 192, elements: !703)
!702 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!703 = !{!704, !705}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !701, file: !702, line: 29, baseType: !668, size: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !701, file: !702, line: 30, baseType: !5, size: 32, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !622, file: !135, line: 3377, baseType: !707, size: 256)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !707, file: !135, line: 1438, baseType: !658, size: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !707, file: !135, line: 1439, baseType: !619, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !622, file: !135, line: 3378, baseType: !712, size: 256)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !135, line: 1419, baseType: !658, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !712, file: !135, line: 1420, baseType: !600, size: 32, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !712, file: !135, line: 1421, baseType: !717, size: 8, offset: 224)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 8, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 1)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !622, file: !135, line: 3379, baseType: !721, size: 320)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !722)
!722 = !{!723, !724, !725}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !721, file: !135, line: 1429, baseType: !658, size: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !721, file: !135, line: 1430, baseType: !619, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !721, file: !135, line: 1431, baseType: !619, size: 64, offset: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !622, file: !135, line: 3380, baseType: !727, size: 320)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !728)
!728 = !{!729, !730}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !727, file: !135, line: 1461, baseType: !658, size: 192)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !727, file: !135, line: 1462, baseType: !731, size: 128, offset: 192)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !732, line: 31, size: 128, elements: !733)
!732 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!733 = !{!734, !737, !738}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !731, file: !732, line: 32, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !731, file: !732, line: 33, baseType: !7, size: 32, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !731, file: !732, line: 34, baseType: !7, size: 32, offset: 96)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !622, file: !135, line: 3381, baseType: !740, size: 384)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !741)
!741 = !{!742, !743, !748, !749, !750}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !740, file: !135, line: 2508, baseType: !658, size: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !740, file: !135, line: 2509, baseType: !744, size: 32, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !745, line: 58, baseType: !746)
!745 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !747, line: 44, baseType: !7)
!747 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!748 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !740, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !740, file: !135, line: 2511, baseType: !619, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !740, file: !135, line: 2512, baseType: !619, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !622, file: !135, line: 3382, baseType: !752, size: 896)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !753)
!753 = !{!754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !752, file: !135, line: 2653, baseType: !740, size: 384)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !752, file: !135, line: 2654, baseType: !619, size: 64, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !752, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !752, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !752, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !752, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !752, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !752, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !752, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !752, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !752, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !752, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !752, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !752, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !752, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !752, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !752, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !752, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !752, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !752, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !752, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !752, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !752, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !752, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !752, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !752, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !752, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !752, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !752, file: !135, line: 2705, baseType: !619, size: 64, offset: 576)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !752, file: !135, line: 2706, baseType: !619, size: 64, offset: 640)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !752, file: !135, line: 2707, baseType: !619, size: 64, offset: 704)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !752, file: !135, line: 2708, baseType: !619, size: 64, offset: 768)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !752, file: !135, line: 2711, baseType: !787, size: 64, offset: 832)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !622, file: !135, line: 3383, baseType: !790, size: 960)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !135, line: 2757, baseType: !752, size: 896)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !790, file: !135, line: 2758, baseType: !794, size: 64, offset: 896)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !620, line: 50, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !797, line: 240, size: 384, elements: !798)
!797 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !796, file: !797, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !796, file: !797, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !796, file: !797, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !796, file: !797, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !796, file: !797, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !796, file: !797, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !796, file: !797, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !796, file: !797, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !796, file: !797, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !796, file: !797, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !796, file: !797, line: 321, baseType: !810, size: 320, offset: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !797, line: 315, size: 320, elements: !811)
!811 = !{!812, !1214, !1216, !1245, !1246}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !810, file: !797, line: 316, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 64, elements: !718)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !797, line: 183, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !797, line: 166, size: 64, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !829, !830, !842, !845, !905, !906, !1191, !1204, !1211}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !815, file: !797, line: 168, baseType: !600, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !815, file: !797, line: 169, baseType: !7, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !815, file: !797, line: 170, baseType: !605, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !815, file: !797, line: 171, baseType: !794, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !815, file: !797, line: 172, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !620, line: 53, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !797, line: 359, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !824, file: !797, line: 360, baseType: !600, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !824, file: !797, line: 361, baseType: !828, size: 64, offset: 64)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !794, size: 64, elements: !718)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !815, file: !797, line: 173, baseType: !5, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !815, file: !797, line: 174, baseType: !831, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !797, line: 133, baseType: !832)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !797, line: 115, size: 32, elements: !833)
!833 = !{!834, !835, !836, !837, !838, !839, !840, !841}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !832, file: !797, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !832, file: !797, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !832, file: !797, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !832, file: !797, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !832, file: !797, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !832, file: !797, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !832, file: !797, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !832, file: !797, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !815, file: !797, line: 175, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !797, line: 175, flags: DIFlagFwdDecl)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !815, file: !797, line: 176, baseType: !846, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !848, line: 75, size: 256, elements: !849)
!848 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!849 = !{!850, !864, !865, !866}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !847, file: !848, line: 76, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !848, line: 68, baseType: !853)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !848, line: 63, size: 320, elements: !854)
!854 = !{!855, !857, !858, !859}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !853, file: !848, line: 64, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !853, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !853, file: !848, line: 65, baseType: !856, size: 64, offset: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !853, file: !848, line: 66, baseType: !7, size: 32, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !853, file: !848, line: 67, baseType: !860, size: 128, offset: 192)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !861, size: 128, elements: !862)
!861 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !848, line: 29, baseType: !673)
!862 = !{!863}
!863 = !DISubrange(count: 2)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !847, file: !848, line: 77, baseType: !851, size: 64, offset: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !847, file: !848, line: 78, baseType: !7, size: 32, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !847, file: !848, line: 79, baseType: !867, size: 64, offset: 192)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !848, line: 49, baseType: !869)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !848, line: 45, size: 832, elements: !870)
!870 = !{!871, !872, !873}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !869, file: !848, line: 46, baseType: !856, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !869, file: !848, line: 47, baseType: !846, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !869, file: !848, line: 48, baseType: !874, size: 704, offset: 128)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !875, line: 164, size: 704, elements: !876)
!875 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!876 = !{!877, !878, !888, !889, !890, !891, !892, !893, !897, !901, !902, !903, !904}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !874, file: !875, line: 166, baseType: !675, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !874, file: !875, line: 167, baseType: !879, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !875, line: 157, size: 192, elements: !881)
!881 = !{!882, !883, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !880, file: !875, line: 159, baseType: !602, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !880, file: !875, line: 160, baseType: !879, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !880, file: !875, line: 161, baseType: !885, size: 32, offset: 128)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !603, size: 32, elements: !886)
!886 = !{!887}
!887 = !DISubrange(count: 4)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !874, file: !875, line: 168, baseType: !602, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !874, file: !875, line: 169, baseType: !602, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !874, file: !875, line: 170, baseType: !602, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !874, file: !875, line: 171, baseType: !675, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !874, file: !875, line: 172, baseType: !600, size: 32, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !874, file: !875, line: 176, baseType: !894, size: 64, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DISubroutineType(types: !896)
!896 = !{!879, !604, !675}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !874, file: !875, line: 177, baseType: !898, size: 64, offset: 512)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{null, !604, !879}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !874, file: !875, line: 178, baseType: !604, size: 64, offset: 576)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !874, file: !875, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !874, file: !875, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !874, file: !875, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !815, file: !797, line: 177, baseType: !619, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !815, file: !797, line: 178, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !909)
!909 = !{!910, !1156, !1157, !1158, !1161, !1165, !1166, !1167, !1185, !1186, !1187, !1188, !1189, !1190}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !908, file: !330, line: 219, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !913)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !914)
!914 = !{!915}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !913, file: !330, line: 151, baseType: !916, size: 128)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !917, file: !330, line: 150, baseType: !7, size: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !917, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !917, file: !330, line: 150, baseType: !922, size: 64, offset: 64)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !923, size: 64, elements: !718)
!923 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !620, line: 108, baseType: !924)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !926)
!926 = !{!927, !928, !929, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !925, file: !330, line: 124, baseType: !907, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !925, file: !330, line: 125, baseType: !907, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !925, file: !330, line: 131, baseType: !930, size: 64, offset: 128)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !931)
!931 = !{!932, !1147}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !930, file: !330, line: 129, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !620, line: 66, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !936, line: 143, size: 192, elements: !937)
!936 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!937 = !{!938, !1145, !1146}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !935, file: !936, line: 145, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !620, line: 69, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !936, line: 136, size: 192, elements: !942)
!942 = !{!943, !1143, !1144}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !941, file: !936, line: 137, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !620, line: 58, baseType: !945)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !936, line: 737, size: 768, elements: !947)
!947 = !{!948, !965, !998, !1004, !1009, !1014, !1021, !1027, !1033, !1038, !1052, !1057, !1063, !1068, !1078, !1083, !1101, !1108, !1115, !1121, !1126, !1132, !1138}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !946, file: !936, line: 738, baseType: !949, size: 256)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !936, line: 271, size: 256, elements: !950)
!950 = !{!951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !949, file: !936, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !949, file: !936, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !949, file: !936, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !949, file: !936, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !949, file: !936, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !949, file: !936, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !949, file: !936, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !949, file: !936, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !949, file: !936, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !949, file: !936, line: 312, baseType: !7, size: 32, offset: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !949, file: !936, line: 316, baseType: !744, size: 32, offset: 64)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !949, file: !936, line: 319, baseType: !7, size: 32, offset: 96)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !949, file: !936, line: 323, baseType: !907, size: 64, offset: 128)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !949, file: !936, line: 327, baseType: !619, size: 64, offset: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !946, file: !936, line: 739, baseType: !966, size: 448)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !936, line: 350, size: 448, elements: !967)
!967 = !{!968, !997}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !966, file: !936, line: 353, baseType: !969, size: 384)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !936, line: 333, size: 384, elements: !970)
!970 = !{!971, !972, !980}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !969, file: !936, line: 336, baseType: !949, size: 256)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !969, file: !936, line: 343, baseType: !973, size: 64, offset: 256)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !975, line: 37, size: 128, elements: !976)
!975 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !974, file: !975, line: 39, baseType: !973, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !974, file: !975, line: 40, baseType: !979, size: 64, offset: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !969, file: !936, line: 344, baseType: !981, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !975, line: 45, size: 320, elements: !983)
!983 = !{!984, !985}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !982, file: !975, line: 47, baseType: !981, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !982, file: !975, line: 48, baseType: !986, size: 256, offset: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !987)
!987 = !{!988, !990, !991, !996}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !986, file: !135, line: 1884, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !986, file: !135, line: 1885, baseType: !989, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !986, file: !135, line: 1891, baseType: !992, size: 64, offset: 128)
!992 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !986, file: !135, line: 1891, size: 64, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !992, file: !135, line: 1891, baseType: !944, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !992, file: !135, line: 1891, baseType: !619, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !986, file: !135, line: 1892, baseType: !979, size: 64, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !966, file: !936, line: 359, baseType: !618, size: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !946, file: !936, line: 740, baseType: !999, size: 512)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !936, line: 365, size: 512, elements: !1000)
!1000 = !{!1001, !1002, !1003}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !999, file: !936, line: 368, baseType: !969, size: 384)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !999, file: !936, line: 373, baseType: !619, size: 64, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !999, file: !936, line: 374, baseType: !619, size: 64, offset: 448)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !946, file: !936, line: 741, baseType: !1005, size: 576)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !936, line: 380, size: 576, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1005, file: !936, line: 383, baseType: !999, size: 512)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1005, file: !936, line: 389, baseType: !618, size: 64, offset: 512)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !946, file: !936, line: 742, baseType: !1010, size: 320)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !936, line: 395, size: 320, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1010, file: !936, line: 397, baseType: !949, size: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1010, file: !936, line: 400, baseType: !933, size: 64, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !946, file: !936, line: 743, baseType: !1015, size: 448)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !936, line: 406, size: 448, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1015, file: !936, line: 408, baseType: !949, size: 256)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1015, file: !936, line: 412, baseType: !619, size: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1015, file: !936, line: 420, baseType: !619, size: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1015, file: !936, line: 423, baseType: !933, size: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !946, file: !936, line: 744, baseType: !1022, size: 384)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !936, line: 429, size: 384, elements: !1023)
!1023 = !{!1024, !1025, !1026}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1022, file: !936, line: 431, baseType: !949, size: 256)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1022, file: !936, line: 434, baseType: !619, size: 64, offset: 256)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1022, file: !936, line: 437, baseType: !933, size: 64, offset: 320)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !946, file: !936, line: 745, baseType: !1028, size: 384)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !936, line: 443, size: 384, elements: !1029)
!1029 = !{!1030, !1031, !1032}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1028, file: !936, line: 445, baseType: !949, size: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1028, file: !936, line: 449, baseType: !619, size: 64, offset: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1028, file: !936, line: 453, baseType: !933, size: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !946, file: !936, line: 746, baseType: !1034, size: 320)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !936, line: 459, size: 320, elements: !1035)
!1035 = !{!1036, !1037}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1034, file: !936, line: 461, baseType: !949, size: 256)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1034, file: !936, line: 464, baseType: !619, size: 64, offset: 256)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !946, file: !936, line: 747, baseType: !1039, size: 768)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !936, line: 469, size: 768, elements: !1040)
!1040 = !{!1041, !1042, !1043, !1044, !1045}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1039, file: !936, line: 471, baseType: !949, size: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1039, file: !936, line: 474, baseType: !7, size: 32, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1039, file: !936, line: 475, baseType: !7, size: 32, offset: 288)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1039, file: !936, line: 478, baseType: !619, size: 64, offset: 320)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1039, file: !936, line: 481, baseType: !1046, size: 384, offset: 384)
!1046 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1047, size: 384, elements: !718)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1047, file: !135, line: 1920, baseType: !986, size: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1047, file: !135, line: 1921, baseType: !619, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1047, file: !135, line: 1922, baseType: !744, size: 32, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !946, file: !936, line: 748, baseType: !1053, size: 320)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !936, line: 487, size: 320, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1053, file: !936, line: 490, baseType: !949, size: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1053, file: !936, line: 494, baseType: !600, size: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !946, file: !936, line: 749, baseType: !1058, size: 384)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !936, line: 500, size: 384, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1058, file: !936, line: 502, baseType: !949, size: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1058, file: !936, line: 506, baseType: !933, size: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1058, file: !936, line: 510, baseType: !933, size: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !946, file: !936, line: 750, baseType: !1064, size: 320)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !936, line: 529, size: 320, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1064, file: !936, line: 531, baseType: !949, size: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1064, file: !936, line: 540, baseType: !933, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !946, file: !936, line: 751, baseType: !1069, size: 704)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !936, line: 546, size: 704, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1069, file: !936, line: 549, baseType: !999, size: 512)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1069, file: !936, line: 553, baseType: !605, size: 64, offset: 512)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1069, file: !936, line: 557, baseType: !599, size: 8, offset: 576)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1069, file: !936, line: 558, baseType: !599, size: 8, offset: 584)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1069, file: !936, line: 559, baseType: !599, size: 8, offset: 592)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1069, file: !936, line: 560, baseType: !599, size: 8, offset: 600)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1069, file: !936, line: 566, baseType: !618, size: 64, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !946, file: !936, line: 752, baseType: !1079, size: 384)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !936, line: 571, size: 384, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1079, file: !936, line: 573, baseType: !1010, size: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1079, file: !936, line: 577, baseType: !619, size: 64, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !946, file: !936, line: 753, baseType: !1084, size: 576)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !936, line: 600, size: 576, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1091, !1100}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1084, file: !936, line: 602, baseType: !1010, size: 320)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1084, file: !936, line: 605, baseType: !619, size: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1084, file: !936, line: 609, baseType: !1089, size: 64, offset: 384)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1090, line: 46, baseType: !673)
!1090 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1084, file: !936, line: 612, baseType: !1092, size: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !936, line: 581, size: 320, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1093, file: !936, line: 583, baseType: !134, size: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1093, file: !936, line: 586, baseType: !619, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1093, file: !936, line: 589, baseType: !619, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1093, file: !936, line: 592, baseType: !619, size: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1093, file: !936, line: 595, baseType: !619, size: 64, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1084, file: !936, line: 616, baseType: !933, size: 64, offset: 512)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !946, file: !936, line: 754, baseType: !1102, size: 512)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !936, line: 622, size: 512, elements: !1103)
!1103 = !{!1104, !1105, !1106, !1107}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1102, file: !936, line: 624, baseType: !1010, size: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1102, file: !936, line: 628, baseType: !619, size: 64, offset: 320)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1102, file: !936, line: 632, baseType: !619, size: 64, offset: 384)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1102, file: !936, line: 636, baseType: !619, size: 64, offset: 448)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !946, file: !936, line: 755, baseType: !1109, size: 704)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !936, line: 642, size: 704, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1109, file: !936, line: 644, baseType: !1102, size: 512)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1109, file: !936, line: 648, baseType: !619, size: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1109, file: !936, line: 652, baseType: !619, size: 64, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1109, file: !936, line: 653, baseType: !619, size: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !946, file: !936, line: 756, baseType: !1116, size: 448)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !936, line: 663, size: 448, elements: !1117)
!1117 = !{!1118, !1119, !1120}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1116, file: !936, line: 665, baseType: !1010, size: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1116, file: !936, line: 668, baseType: !619, size: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1116, file: !936, line: 673, baseType: !619, size: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !946, file: !936, line: 757, baseType: !1122, size: 384)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !936, line: 694, size: 384, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1122, file: !936, line: 696, baseType: !1010, size: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1122, file: !936, line: 699, baseType: !619, size: 64, offset: 320)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !946, file: !936, line: 758, baseType: !1127, size: 384)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !936, line: 681, size: 384, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1127, file: !936, line: 683, baseType: !949, size: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1127, file: !936, line: 686, baseType: !619, size: 64, offset: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1127, file: !936, line: 689, baseType: !619, size: 64, offset: 320)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !946, file: !936, line: 759, baseType: !1133, size: 384)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !936, line: 707, size: 384, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1133, file: !936, line: 709, baseType: !949, size: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1133, file: !936, line: 712, baseType: !619, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1133, file: !936, line: 712, baseType: !619, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !946, file: !936, line: 760, baseType: !1139, size: 320)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !936, line: 718, size: 320, elements: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1139, file: !936, line: 720, baseType: !949, size: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1139, file: !936, line: 723, baseType: !619, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !941, file: !936, line: 138, baseType: !940, size: 64, offset: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !941, file: !936, line: 139, baseType: !940, size: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !935, file: !936, line: 146, baseType: !939, size: 64, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !935, file: !936, line: 152, baseType: !933, size: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !930, file: !330, line: 130, baseType: !794, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !925, file: !330, line: 134, baseType: !604, size: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !925, file: !330, line: 137, baseType: !619, size: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !925, file: !330, line: 138, baseType: !744, size: 32, offset: 320)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !925, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !925, file: !330, line: 144, baseType: !600, size: 32, offset: 384)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !925, file: !330, line: 145, baseType: !600, size: 32, offset: 416)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !925, file: !330, line: 146, baseType: !1155, size: 64, offset: 448)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !675)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !908, file: !330, line: 220, baseType: !911, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !908, file: !330, line: 223, baseType: !604, size: 64, offset: 128)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !908, file: !330, line: 226, baseType: !1159, size: 64, offset: 192)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !908, file: !330, line: 229, baseType: !1162, size: 128, offset: 256)
!1162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1163, size: 128, elements: !862)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !908, file: !330, line: 232, baseType: !907, size: 64, offset: 384)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !908, file: !330, line: 233, baseType: !907, size: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !908, file: !330, line: 238, baseType: !1168, size: 64, offset: 512)
!1168 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1169)
!1169 = !{!1170, !1176}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1168, file: !330, line: 236, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1172, file: !330, line: 275, baseType: !933, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1172, file: !330, line: 278, baseType: !933, size: 64, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1168, file: !330, line: 237, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183, !1184}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1178, file: !330, line: 261, baseType: !794, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1178, file: !330, line: 262, baseType: !794, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1178, file: !330, line: 266, baseType: !794, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1178, file: !330, line: 267, baseType: !794, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1178, file: !330, line: 270, baseType: !600, size: 32, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !908, file: !330, line: 241, baseType: !1155, size: 64, offset: 576)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !908, file: !330, line: 244, baseType: !600, size: 32, offset: 640)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !908, file: !330, line: 247, baseType: !600, size: 32, offset: 672)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !908, file: !330, line: 250, baseType: !600, size: 32, offset: 704)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !908, file: !330, line: 253, baseType: !600, size: 32, offset: 736)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !908, file: !330, line: 256, baseType: !600, size: 32, offset: 768)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !815, file: !797, line: 179, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !797, line: 150, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !797, line: 142, size: 320, elements: !1195)
!1195 = !{!1196, !1197, !1198, !1199, !1202, !1203}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1194, file: !797, line: 144, baseType: !619, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1194, file: !797, line: 145, baseType: !794, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1194, file: !797, line: 146, baseType: !794, size: 64, offset: 128)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1194, file: !797, line: 147, baseType: !1200, size: 32, offset: 192)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1201, line: 31, baseType: !600)
!1201 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1194, file: !797, line: 148, baseType: !7, size: 32, offset: 224)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1194, file: !797, line: 149, baseType: !599, size: 8, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !815, file: !797, line: 180, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !797, line: 162, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !797, line: 159, size: 128, elements: !1208)
!1208 = !{!1209, !1210}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1207, file: !797, line: 160, baseType: !619, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1207, file: !797, line: 161, baseType: !675, size: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !815, file: !797, line: 181, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !797, line: 181, flags: DIFlagFwdDecl)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !810, file: !797, line: 317, baseType: !1215, size: 64)
!1215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !675, size: 64, elements: !718)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !810, file: !797, line: 318, baseType: !1217, size: 320)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !797, line: 188, size: 320, elements: !1218)
!1218 = !{!1219, !1221, !1244}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1217, file: !797, line: 190, baseType: !1220, size: 192)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 192, elements: !693)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1217, file: !797, line: 193, baseType: !1222, size: 64, offset: 192)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !797, line: 206, size: 320, elements: !1224)
!1224 = !{!1225, !1229, !1230, !1231, !1243}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1223, file: !797, line: 208, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !620, line: 62, baseType: !1228)
!1228 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !620, line: 61, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1223, file: !797, line: 211, baseType: !7, size: 32, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1223, file: !797, line: 214, baseType: !675, size: 64, offset: 128)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1223, file: !797, line: 224, baseType: !1232, size: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !797, line: 202, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !797, line: 202, size: 128, elements: !1235)
!1235 = !{!1236}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1234, file: !797, line: 202, baseType: !1237, size: 128)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !797, line: 200, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !797, line: 200, size: 128, elements: !1239)
!1239 = !{!1240, !1241, !1242}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1238, file: !797, line: 200, baseType: !7, size: 32)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1238, file: !797, line: 200, baseType: !7, size: 32, offset: 32)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1238, file: !797, line: 200, baseType: !828, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1223, file: !797, line: 234, baseType: !1232, size: 64, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1217, file: !797, line: 197, baseType: !675, size: 64, offset: 256)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !810, file: !797, line: 319, baseType: !682, size: 256)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !810, file: !797, line: 320, baseType: !701, size: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !622, file: !135, line: 3384, baseType: !1248, size: 1472)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1249)
!1249 = !{!1250, !1271, !1272, !1273, !1274}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1248, file: !135, line: 3115, baseType: !1251, size: 1216)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1252)
!1252 = !{!1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1251, file: !135, line: 2985, baseType: !790, size: 960)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1251, file: !135, line: 2986, baseType: !619, size: 64, offset: 960)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1251, file: !135, line: 2987, baseType: !619, size: 64, offset: 1024)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1251, file: !135, line: 2988, baseType: !619, size: 64, offset: 1088)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1251, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1251, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1251, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1251, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1251, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1251, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1251, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1251, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1251, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1251, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1251, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1251, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1251, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1251, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1248, file: !135, line: 3117, baseType: !619, size: 64, offset: 1216)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1248, file: !135, line: 3119, baseType: !619, size: 64, offset: 1280)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1248, file: !135, line: 3121, baseType: !619, size: 64, offset: 1344)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1248, file: !135, line: 3123, baseType: !619, size: 64, offset: 1408)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !622, file: !135, line: 3385, baseType: !1276, size: 1088)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1277)
!1277 = !{!1278, !1279, !1280}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1276, file: !135, line: 2875, baseType: !790, size: 960)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1276, file: !135, line: 2876, baseType: !794, size: 64, offset: 960)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1276, file: !135, line: 2877, baseType: !1281, size: 64, offset: 1024)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1283, line: 172, size: 128, elements: !1284)
!1283 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1284 = !{!1285, !1286, !1287, !1288, !1289, !1290, !1291}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1282, file: !1283, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1282, file: !1283, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1282, file: !1283, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1282, file: !1283, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1282, file: !1283, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1282, file: !1283, line: 195, baseType: !7, size: 32, offset: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1282, file: !1283, line: 199, baseType: !619, size: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !622, file: !135, line: 3386, baseType: !1251, size: 1216)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !622, file: !135, line: 3387, baseType: !1294, size: 1280)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1295)
!1295 = !{!1296, !1297}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1294, file: !135, line: 3094, baseType: !1251, size: 1216)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1294, file: !135, line: 3095, baseType: !1281, size: 64, offset: 1216)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !622, file: !135, line: 3388, baseType: !1299, size: 1216)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1300)
!1300 = !{!1301, !1302, !1303, !1304, !1305, !1306}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1299, file: !135, line: 2825, baseType: !752, size: 896)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1299, file: !135, line: 2827, baseType: !619, size: 64, offset: 896)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1299, file: !135, line: 2828, baseType: !619, size: 64, offset: 960)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1299, file: !135, line: 2829, baseType: !619, size: 64, offset: 1024)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1299, file: !135, line: 2830, baseType: !619, size: 64, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1299, file: !135, line: 2831, baseType: !619, size: 64, offset: 1152)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !622, file: !135, line: 3389, baseType: !1308, size: 1024)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1309)
!1309 = !{!1310, !1311, !1312}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1308, file: !135, line: 2851, baseType: !790, size: 960)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1308, file: !135, line: 2852, baseType: !600, size: 32, offset: 960)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1308, file: !135, line: 2853, baseType: !600, size: 32, offset: 992)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !622, file: !135, line: 3390, baseType: !1314, size: 1024)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1315)
!1315 = !{!1316, !1317}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1314, file: !135, line: 2858, baseType: !790, size: 960)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1314, file: !135, line: 2859, baseType: !1281, size: 64, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !622, file: !135, line: 3391, baseType: !1319, size: 960)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1320)
!1320 = !{!1321}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1319, file: !135, line: 2863, baseType: !790, size: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !622, file: !135, line: 3392, baseType: !1323, size: 1472)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1324)
!1324 = !{!1325}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1323, file: !135, line: 3305, baseType: !1248, size: 1472)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !622, file: !135, line: 3393, baseType: !1327, size: 1792)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1328)
!1328 = !{!1329, !1330, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1327, file: !135, line: 3249, baseType: !1248, size: 1472)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1327, file: !135, line: 3251, baseType: !1331, size: 64, offset: 1472)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1333, line: 463, size: 1152, elements: !1334)
!1333 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1334 = !{!1335, !1338, !1369, !1370, !1479, !1482, !1483, !1484, !1485, !1486, !1487, !1511, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537}
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1332, file: !1333, line: 464, baseType: !1336, size: 64)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1333, line: 464, flags: DIFlagFwdDecl)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1332, file: !1333, line: 467, baseType: !1339, size: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1341)
!1341 = !{!1342, !1344, !1345, !1358, !1359, !1360, !1361, !1362, !1363, !1365, !1367, !1368}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1340, file: !330, line: 377, baseType: !1343, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !620, line: 111, baseType: !907)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1340, file: !330, line: 378, baseType: !1343, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1340, file: !330, line: 381, baseType: !1346, size: 64, offset: 128)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1348)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1349)
!1349 = !{!1350}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1348, file: !330, line: 282, baseType: !1351, size: 128)
!1351 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1352)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1353)
!1353 = !{!1354, !1355, !1356}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1352, file: !330, line: 281, baseType: !7, size: 32)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1352, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1352, file: !330, line: 281, baseType: !1357, size: 64, offset: 64)
!1357 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1343, size: 64, elements: !718)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1340, file: !330, line: 384, baseType: !600, size: 32, offset: 192)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1340, file: !330, line: 387, baseType: !600, size: 32, offset: 224)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1340, file: !330, line: 390, baseType: !600, size: 32, offset: 256)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1340, file: !330, line: 394, baseType: !1346, size: 64, offset: 320)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1340, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1340, file: !330, line: 399, baseType: !1364, size: 64, offset: 416)
!1364 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !862)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1340, file: !330, line: 402, baseType: !1366, size: 64, offset: 480)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !862)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1340, file: !330, line: 406, baseType: !600, size: 32, offset: 544)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1340, file: !330, line: 409, baseType: !600, size: 32, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1332, file: !1333, line: 470, baseType: !934, size: 64, offset: 128)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1332, file: !1333, line: 473, baseType: !1371, size: 64, offset: 192)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1283, line: 39, size: 1152, elements: !1373)
!1373 = !{!1374, !1424, !1437, !1443, !1444, !1456, !1457, !1461, !1462, !1463, !1464, !1465}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1372, file: !1283, line: 41, baseType: !1375, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1376, line: 144, baseType: !1377)
!1376 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1378, size: 64)
!1378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1376, line: 100, size: 896, elements: !1379)
!1379 = !{!1380, !1388, !1393, !1398, !1400, !1401, !1402, !1403, !1404, !1405, !1410, !1412, !1413, !1418, !1423}
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1378, file: !1376, line: 102, baseType: !1381, size: 64)
