; ModuleID = 'lto-section-in.bc'
source_filename = "lto-section-in.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.lto_file_decl_data = type { %struct.lto_in_decl_state*, %struct.lto_in_decl_state*, %struct.lto_cgraph_encoder_d*, %struct.htab*, i8*, i8, %struct.htab*, %struct.htab* }
%struct.lto_in_decl_state = type { [7 x %struct.lto_tree_ref_table], %union.tree_node* }
%struct.lto_tree_ref_table = type { %union.tree_node**, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }

!367 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!368 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!369 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !135, line: 1817, baseType: !7, size: 32, elements: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!376 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !135, line: 1805, baseType: !7, size: 32, elements: !378)
!378 = !{!379, !380, !381, !382, !383}
!379 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!380 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!381 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!382 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!383 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!384 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !385, line: 309, baseType: !7, size: 32, elements: !386)
!385 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!386 = !{!387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!387 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!388 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!389 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!390 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!391 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!392 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!393 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!394 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!395 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!396 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!397 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!398 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!399 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!400 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!401 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!402 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!403 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!404 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!405 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!406 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "lto_section_type", file: !408, line: 256, baseType: !7, size: 32, elements: !409)
!408 = !DIFile(filename: "./lto-streamer.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!409 = !{!410, !411, !412, !413, !414, !415, !416, !417, !418, !419, !420}
!410 = !DIEnumerator(name: "LTO_section_decls", value: 0, isUnsigned: true)
!411 = !DIEnumerator(name: "LTO_section_function_body", value: 1, isUnsigned: true)
!412 = !DIEnumerator(name: "LTO_section_static_initializer", value: 2, isUnsigned: true)
!413 = !DIEnumerator(name: "LTO_section_cgraph", value: 3, isUnsigned: true)
!414 = !DIEnumerator(name: "LTO_section_jump_functions", value: 4, isUnsigned: true)
!415 = !DIEnumerator(name: "LTO_section_ipa_pure_const", value: 5, isUnsigned: true)
!416 = !DIEnumerator(name: "LTO_section_ipa_reference", value: 6, isUnsigned: true)
!417 = !DIEnumerator(name: "LTO_section_symtab", value: 7, isUnsigned: true)
!418 = !DIEnumerator(name: "LTO_section_wpa_fixup", value: 8, isUnsigned: true)
!419 = !DIEnumerator(name: "LTO_section_opts", value: 9, isUnsigned: true)
!420 = !DIEnumerator(name: "LTO_N_SECTION_TYPES", value: 10, isUnsigned: true)
!421 = !{!422, !423, !424, !425, !428, !429, !431, !432, !426, !441, !460, !466, !471, !1905, !1907, !1317, !1107}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!424 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!431 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !434)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_data_header", file: !3, line: 195, size: 128, elements: !435)
!435 = !{!436, !437}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !434, file: !3, line: 197, baseType: !429, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !434, file: !3, line: 198, baseType: !438, size: 64, offset: 64)
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !439, line: 46, baseType: !440)
!439 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!440 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !443)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_simple_header", file: !408, line: 600, size: 128, elements: !444)
!444 = !{!445, !456, !459}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lto_header", scope: !443, file: !408, line: 603, baseType: !446, size: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_header", file: !408, line: 387, size: 64, elements: !447)
!447 = !{!448, !454, !455}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "major_version", scope: !446, file: !408, line: 389, baseType: !449, size: 16)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !450, line: 25, baseType: !451)
!450 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !452, line: 39, baseType: !453)
!452 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!453 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "minor_version", scope: !446, file: !408, line: 390, baseType: !449, size: 16, offset: 16)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "section_type", scope: !446, file: !408, line: 391, baseType: !407, size: 32, offset: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "main_size", scope: !443, file: !408, line: 606, baseType: !457, size: 32, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !450, line: 26, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !452, line: 41, baseType: !424)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "compressed_size", scope: !443, file: !408, line: 609, baseType: !457, size: 32, offset: 96)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_input_block", file: !408, line: 363, size: 128, elements: !462)
!462 = !{!463, !464, !465}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !461, file: !408, line: 365, baseType: !429, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !461, file: !408, line: 366, baseType: !7, size: 32, offset: 64)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !461, file: !408, line: 367, baseType: !7, size: 32, offset: 96)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_renaming_slot", file: !3, line: 336, size: 128, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "old_name", scope: !467, file: !3, line: 338, baseType: !429, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "new_name", scope: !467, file: !3, line: 339, baseType: !429, size: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_in_decl_state", file: !408, line: 502, size: 960, elements: !473)
!473 = !{!474, !1904}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "streams", scope: !472, file: !408, line: 505, baseType: !475, size: 896)
!475 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 896, elements: !1902)
!476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lto_tree_ref_table", file: !408, line: 473, size: 128, elements: !477)
!477 = !{!478, !1901}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "trees", scope: !476, file: !408, line: 476, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !481, line: 56, baseType: !482)
!481 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!483 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !484)
!484 = !{!485, !518, !524, !535, !554, !565, !570, !579, !585, !598, !610, !648, !1138, !1166, !1183, !1184, !1189, !1198, !1204, !1209, !1213, !1217, !1552, !1599, !1605, !1611, !1618, !1631, !1645, !1662, !1674, !1696, !1711, !1883}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !483, file: !135, line: 3372, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !487)
!487 = !{!488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !486, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !486, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !486, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !486, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !486, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !486, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !486, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !486, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !486, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !486, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !486, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !486, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !486, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !486, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !486, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !486, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !486, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !486, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !486, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !486, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !486, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !486, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !486, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !486, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !486, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !486, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !486, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !486, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !486, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !486, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !483, file: !135, line: 3373, baseType: !519, size: 192)
!519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !520)
!520 = !{!521, !522, !523}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !519, file: !135, line: 403, baseType: !486, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !519, file: !135, line: 404, baseType: !480, size: 64, offset: 64)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !519, file: !135, line: 405, baseType: !480, size: 64, offset: 128)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !483, file: !135, line: 3374, baseType: !525, size: 320)
!525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !526)
!526 = !{!527, !528}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !525, file: !135, line: 1385, baseType: !519, size: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !525, file: !135, line: 1386, baseType: !529, size: 128, offset: 192)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !530, line: 58, baseType: !531)
!530 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !530, line: 54, size: 128, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !531, file: !530, line: 56, baseType: !440, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !531, file: !530, line: 57, baseType: !431, size: 64, offset: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !483, file: !135, line: 3375, baseType: !536, size: 256)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !536, file: !135, line: 1398, baseType: !519, size: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !536, file: !135, line: 1399, baseType: !540, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !542, line: 52, size: 256, elements: !543)
!542 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!543 = !{!544, !545, !546, !547, !548, !549, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !541, file: !542, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !541, file: !542, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !541, file: !542, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !541, file: !542, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !541, file: !542, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !541, file: !542, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !541, file: !542, line: 62, baseType: !551, size: 192, offset: 64)
!551 = !DICompositeType(tag: DW_TAG_array_type, baseType: !440, size: 192, elements: !552)
!552 = !{!553}
!553 = !DISubrange(count: 3)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !483, file: !135, line: 3376, baseType: !555, size: 256)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !556)
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !555, file: !135, line: 1409, baseType: !519, size: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !555, file: !135, line: 1410, baseType: !559, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !561, line: 27, size: 192, elements: !562)
!561 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!562 = !{!563, !564}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !560, file: !561, line: 29, baseType: !529, size: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !560, file: !561, line: 30, baseType: !5, size: 32, offset: 128)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !483, file: !135, line: 3377, baseType: !566, size: 256)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !566, file: !135, line: 1438, baseType: !519, size: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !566, file: !135, line: 1439, baseType: !480, size: 64, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !483, file: !135, line: 3378, baseType: !571, size: 256)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !572)
!572 = !{!573, !574, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !571, file: !135, line: 1419, baseType: !519, size: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !571, file: !135, line: 1420, baseType: !424, size: 32, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !571, file: !135, line: 1421, baseType: !576, size: 8, offset: 224)
!576 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 8, elements: !577)
!577 = !{!578}
!578 = !DISubrange(count: 1)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !483, file: !135, line: 3379, baseType: !580, size: 320)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !581)
!581 = !{!582, !583, !584}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !135, line: 1429, baseType: !519, size: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !580, file: !135, line: 1430, baseType: !480, size: 64, offset: 192)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !580, file: !135, line: 1431, baseType: !480, size: 64, offset: 256)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !483, file: !135, line: 3380, baseType: !586, size: 320)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !587)
!587 = !{!588, !589}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !586, file: !135, line: 1461, baseType: !519, size: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !586, file: !135, line: 1462, baseType: !590, size: 128, offset: 192)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !591, line: 31, size: 128, elements: !592)
!591 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!592 = !{!593, !596, !597}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !590, file: !591, line: 32, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !590, file: !591, line: 33, baseType: !7, size: 32, offset: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !590, file: !591, line: 34, baseType: !7, size: 32, offset: 96)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !483, file: !135, line: 3381, baseType: !599, size: 384)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !600)
!600 = !{!601, !602, !607, !608, !609}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !599, file: !135, line: 2508, baseType: !519, size: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !599, file: !135, line: 2509, baseType: !603, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !604, line: 58, baseType: !605)
!604 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !606, line: 44, baseType: !7)
!606 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!607 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !599, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !599, file: !135, line: 2511, baseType: !480, size: 64, offset: 256)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !599, file: !135, line: 2512, baseType: !480, size: 64, offset: 320)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !483, file: !135, line: 3382, baseType: !611, size: 896)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !612)
!612 = !{!613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !135, line: 2653, baseType: !599, size: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !611, file: !135, line: 2654, baseType: !480, size: 64, offset: 384)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !611, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !611, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !611, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !611, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !611, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !611, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !611, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !611, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !611, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !611, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !611, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !611, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !611, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !611, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !611, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !611, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !611, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !611, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !611, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !611, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !611, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !611, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !611, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !611, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !611, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !611, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !611, file: !135, line: 2705, baseType: !480, size: 64, offset: 576)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !611, file: !135, line: 2706, baseType: !480, size: 64, offset: 640)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !611, file: !135, line: 2707, baseType: !480, size: 64, offset: 704)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !611, file: !135, line: 2708, baseType: !480, size: 64, offset: 768)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !611, file: !135, line: 2711, baseType: !646, size: 64, offset: 832)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !483, file: !135, line: 3383, baseType: !649, size: 960)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !649, file: !135, line: 2757, baseType: !611, size: 896)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !649, file: !135, line: 2758, baseType: !653, size: 64, offset: 896)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !481, line: 50, baseType: !654)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !656, line: 240, size: 384, elements: !657)
!656 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !655, file: !656, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !655, file: !656, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !655, file: !656, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !655, file: !656, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !655, file: !656, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !655, file: !656, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !655, file: !656, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !655, file: !656, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !655, file: !656, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !655, file: !656, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !655, file: !656, line: 321, baseType: !669, size: 320, offset: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !656, line: 315, size: 320, elements: !670)
!670 = !{!671, !1071, !1073, !1136, !1137}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !669, file: !656, line: 316, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 64, elements: !577)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !656, line: 183, baseType: !674)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !656, line: 166, size: 64, elements: !675)
!675 = !{!676, !677, !678, !679, !680, !688, !689, !701, !704, !764, !765, !1048, !1061, !1068}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !674, file: !656, line: 168, baseType: !424, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !674, file: !656, line: 169, baseType: !7, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !674, file: !656, line: 170, baseType: !429, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !674, file: !656, line: 171, baseType: !653, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !674, file: !656, line: 172, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !481, line: 53, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !656, line: 359, size: 128, elements: !684)
!684 = !{!685, !686}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !683, file: !656, line: 360, baseType: !424, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !683, file: !656, line: 361, baseType: !687, size: 64, offset: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 64, elements: !577)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !674, file: !656, line: 173, baseType: !5, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !674, file: !656, line: 174, baseType: !690, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !656, line: 133, baseType: !691)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !656, line: 115, size: 32, elements: !692)
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !691, file: !656, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !691, file: !656, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !691, file: !656, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !691, file: !656, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !691, file: !656, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !691, file: !656, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !691, file: !656, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !691, file: !656, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !674, file: !656, line: 175, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !656, line: 175, flags: DIFlagFwdDecl)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !674, file: !656, line: 176, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !707, line: 75, size: 256, elements: !708)
!707 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!708 = !{!709, !723, !724, !725}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !706, file: !707, line: 76, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !707, line: 68, baseType: !712)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !707, line: 63, size: 320, elements: !713)
!713 = !{!714, !716, !717, !718}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !712, file: !707, line: 64, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !712, file: !707, line: 65, baseType: !715, size: 64, offset: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !712, file: !707, line: 66, baseType: !7, size: 32, offset: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !712, file: !707, line: 67, baseType: !719, size: 128, offset: 192)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !720, size: 128, elements: !721)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !707, line: 29, baseType: !440)
!721 = !{!722}
!722 = !DISubrange(count: 2)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !706, file: !707, line: 77, baseType: !710, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !706, file: !707, line: 78, baseType: !7, size: 32, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !706, file: !707, line: 79, baseType: !726, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !707, line: 49, baseType: !728)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !707, line: 45, size: 832, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !728, file: !707, line: 46, baseType: !715, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !728, file: !707, line: 47, baseType: !705, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !728, file: !707, line: 48, baseType: !733, size: 704, offset: 128)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !734, line: 164, size: 704, elements: !735)
!734 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!735 = !{!736, !737, !747, !748, !749, !750, !751, !752, !756, !760, !761, !762, !763}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !733, file: !734, line: 166, baseType: !431, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !733, file: !734, line: 167, baseType: !738, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !734, line: 157, size: 192, elements: !740)
!740 = !{!741, !742, !743}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !739, file: !734, line: 159, baseType: !426, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !739, file: !734, line: 160, baseType: !738, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !739, file: !734, line: 161, baseType: !744, size: 32, offset: 128)
!744 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 32, elements: !745)
!745 = !{!746}
!746 = !DISubrange(count: 4)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !733, file: !734, line: 168, baseType: !426, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !733, file: !734, line: 169, baseType: !426, size: 64, offset: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !733, file: !734, line: 170, baseType: !426, size: 64, offset: 256)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !733, file: !734, line: 171, baseType: !431, size: 64, offset: 320)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !733, file: !734, line: 172, baseType: !424, size: 32, offset: 384)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !733, file: !734, line: 176, baseType: !753, size: 64, offset: 448)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{!738, !428, !431}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !733, file: !734, line: 177, baseType: !757, size: 64, offset: 512)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{null, !428, !738}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !733, file: !734, line: 178, baseType: !428, size: 64, offset: 576)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !733, file: !734, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !733, file: !734, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !733, file: !734, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !674, file: !656, line: 177, baseType: !480, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !674, file: !656, line: 178, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !768)
!768 = !{!769, !1013, !1014, !1015, !1018, !1022, !1023, !1024, !1042, !1043, !1044, !1045, !1046, !1047}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !767, file: !337, line: 219, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !772)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !773)
!773 = !{!774}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !772, file: !337, line: 151, baseType: !775, size: 128)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !776, file: !337, line: 150, baseType: !7, size: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !776, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !776, file: !337, line: 150, baseType: !781, size: 64, offset: 64)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 64, elements: !577)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !481, line: 108, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !785)
!785 = !{!786, !787, !788, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !784, file: !337, line: 124, baseType: !766, size: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !784, file: !337, line: 125, baseType: !766, size: 64, offset: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !784, file: !337, line: 131, baseType: !789, size: 64, offset: 128)
!789 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !790)
!790 = !{!791, !1004}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !789, file: !337, line: 129, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !481, line: 66, baseType: !793)
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !795, line: 143, size: 192, elements: !796)
!795 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!796 = !{!797, !1002, !1003}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !794, file: !795, line: 145, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !481, line: 69, baseType: !799)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !795, line: 136, size: 192, elements: !801)
!801 = !{!802, !1000, !1001}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !800, file: !795, line: 137, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !481, line: 58, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !795, line: 737, size: 768, elements: !806)
!806 = !{!807, !824, !857, !863, !868, !873, !880, !886, !892, !897, !911, !916, !922, !927, !937, !942, !958, !965, !972, !978, !983, !989, !995}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !805, file: !795, line: 738, baseType: !808, size: 256)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !795, line: 271, size: 256, elements: !809)
!809 = !{!810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !808, file: !795, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !808, file: !795, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !808, file: !795, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !808, file: !795, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !808, file: !795, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !808, file: !795, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !808, file: !795, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !808, file: !795, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !808, file: !795, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !808, file: !795, line: 312, baseType: !7, size: 32, offset: 32)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !808, file: !795, line: 316, baseType: !603, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !808, file: !795, line: 319, baseType: !7, size: 32, offset: 96)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !808, file: !795, line: 323, baseType: !766, size: 64, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !808, file: !795, line: 327, baseType: !480, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !805, file: !795, line: 739, baseType: !825, size: 448)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !795, line: 350, size: 448, elements: !826)
!826 = !{!827, !855}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !825, file: !795, line: 353, baseType: !828, size: 384)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !795, line: 333, size: 384, elements: !829)
!829 = !{!830, !831, !838}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !828, file: !795, line: 336, baseType: !808, size: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !828, file: !795, line: 343, baseType: !832, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !834, line: 37, size: 128, elements: !835)
!834 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !833, file: !834, line: 39, baseType: !832, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !833, file: !834, line: 40, baseType: !479, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !828, file: !795, line: 344, baseType: !839, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !834, line: 45, size: 320, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !840, file: !834, line: 47, baseType: !839, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !840, file: !834, line: 48, baseType: !844, size: 256, offset: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !845)
!845 = !{!846, !848, !849, !854}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !844, file: !135, line: 1884, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !844, file: !135, line: 1885, baseType: !847, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !844, file: !135, line: 1891, baseType: !850, size: 64, offset: 128)
!850 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !844, file: !135, line: 1891, size: 64, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !850, file: !135, line: 1891, baseType: !803, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !850, file: !135, line: 1891, baseType: !480, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !844, file: !135, line: 1892, baseType: !479, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !825, file: !795, line: 359, baseType: !856, size: 64, offset: 384)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !480, size: 64, elements: !577)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !805, file: !795, line: 740, baseType: !858, size: 512)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !795, line: 365, size: 512, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !858, file: !795, line: 368, baseType: !828, size: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !858, file: !795, line: 373, baseType: !480, size: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !858, file: !795, line: 374, baseType: !480, size: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !805, file: !795, line: 741, baseType: !864, size: 576)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !795, line: 380, size: 576, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !864, file: !795, line: 383, baseType: !858, size: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !864, file: !795, line: 389, baseType: !856, size: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !805, file: !795, line: 742, baseType: !869, size: 320)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !795, line: 395, size: 320, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !869, file: !795, line: 397, baseType: !808, size: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !869, file: !795, line: 400, baseType: !792, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !805, file: !795, line: 743, baseType: !874, size: 448)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !795, line: 406, size: 448, elements: !875)
!875 = !{!876, !877, !878, !879}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !874, file: !795, line: 408, baseType: !808, size: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !874, file: !795, line: 412, baseType: !480, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !874, file: !795, line: 420, baseType: !480, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !874, file: !795, line: 423, baseType: !792, size: 64, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !805, file: !795, line: 744, baseType: !881, size: 384)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !795, line: 429, size: 384, elements: !882)
!882 = !{!883, !884, !885}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !881, file: !795, line: 431, baseType: !808, size: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !881, file: !795, line: 434, baseType: !480, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !881, file: !795, line: 437, baseType: !792, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !805, file: !795, line: 745, baseType: !887, size: 384)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !795, line: 443, size: 384, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !887, file: !795, line: 445, baseType: !808, size: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !887, file: !795, line: 449, baseType: !480, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !887, file: !795, line: 453, baseType: !792, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !805, file: !795, line: 746, baseType: !893, size: 320)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !795, line: 459, size: 320, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !893, file: !795, line: 461, baseType: !808, size: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !893, file: !795, line: 464, baseType: !480, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !805, file: !795, line: 747, baseType: !898, size: 768)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !795, line: 469, size: 768, elements: !899)
!899 = !{!900, !901, !902, !903, !904}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !898, file: !795, line: 471, baseType: !808, size: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !898, file: !795, line: 474, baseType: !7, size: 32, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !898, file: !795, line: 475, baseType: !7, size: 32, offset: 288)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !898, file: !795, line: 478, baseType: !480, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !898, file: !795, line: 481, baseType: !905, size: 384, offset: 384)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 384, elements: !577)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !906, file: !135, line: 1920, baseType: !844, size: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !906, file: !135, line: 1921, baseType: !480, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !906, file: !135, line: 1922, baseType: !603, size: 32, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !805, file: !795, line: 748, baseType: !912, size: 320)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !795, line: 487, size: 320, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !912, file: !795, line: 490, baseType: !808, size: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !912, file: !795, line: 494, baseType: !424, size: 32, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !805, file: !795, line: 749, baseType: !917, size: 384)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !795, line: 500, size: 384, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !917, file: !795, line: 502, baseType: !808, size: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !917, file: !795, line: 506, baseType: !792, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !917, file: !795, line: 510, baseType: !792, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !805, file: !795, line: 750, baseType: !923, size: 320)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !795, line: 529, size: 320, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !923, file: !795, line: 531, baseType: !808, size: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !923, file: !795, line: 540, baseType: !792, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !805, file: !795, line: 751, baseType: !928, size: 704)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !795, line: 546, size: 704, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !928, file: !795, line: 549, baseType: !858, size: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !928, file: !795, line: 553, baseType: !429, size: 64, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !928, file: !795, line: 557, baseType: !423, size: 8, offset: 576)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !928, file: !795, line: 558, baseType: !423, size: 8, offset: 584)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !928, file: !795, line: 559, baseType: !423, size: 8, offset: 592)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !928, file: !795, line: 560, baseType: !423, size: 8, offset: 600)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !928, file: !795, line: 566, baseType: !856, size: 64, offset: 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !805, file: !795, line: 752, baseType: !938, size: 384)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !795, line: 571, size: 384, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !938, file: !795, line: 573, baseType: !869, size: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !795, line: 577, baseType: !480, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !805, file: !795, line: 753, baseType: !943, size: 576)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !795, line: 600, size: 576, elements: !944)
!944 = !{!945, !946, !947, !948, !957}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !943, file: !795, line: 602, baseType: !869, size: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !943, file: !795, line: 605, baseType: !480, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !943, file: !795, line: 609, baseType: !438, size: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !943, file: !795, line: 612, baseType: !949, size: 64, offset: 448)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !795, line: 581, size: 320, elements: !951)
!951 = !{!952, !953, !954, !955, !956}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !950, file: !795, line: 583, baseType: !134, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !950, file: !795, line: 586, baseType: !480, size: 64, offset: 64)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !950, file: !795, line: 589, baseType: !480, size: 64, offset: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !950, file: !795, line: 592, baseType: !480, size: 64, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !950, file: !795, line: 595, baseType: !480, size: 64, offset: 256)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !943, file: !795, line: 616, baseType: !792, size: 64, offset: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !805, file: !795, line: 754, baseType: !959, size: 512)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !795, line: 622, size: 512, elements: !960)
!960 = !{!961, !962, !963, !964}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !959, file: !795, line: 624, baseType: !869, size: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !959, file: !795, line: 628, baseType: !480, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !959, file: !795, line: 632, baseType: !480, size: 64, offset: 384)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !959, file: !795, line: 636, baseType: !480, size: 64, offset: 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !805, file: !795, line: 755, baseType: !966, size: 704)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !795, line: 642, size: 704, elements: !967)
!967 = !{!968, !969, !970, !971}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !966, file: !795, line: 644, baseType: !959, size: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !966, file: !795, line: 648, baseType: !480, size: 64, offset: 512)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !966, file: !795, line: 652, baseType: !480, size: 64, offset: 576)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !966, file: !795, line: 653, baseType: !480, size: 64, offset: 640)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !805, file: !795, line: 756, baseType: !973, size: 448)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !795, line: 663, size: 448, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !973, file: !795, line: 665, baseType: !869, size: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !973, file: !795, line: 668, baseType: !480, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !973, file: !795, line: 673, baseType: !480, size: 64, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !805, file: !795, line: 757, baseType: !979, size: 384)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !795, line: 694, size: 384, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !979, file: !795, line: 696, baseType: !869, size: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !979, file: !795, line: 699, baseType: !480, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !805, file: !795, line: 758, baseType: !984, size: 384)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !795, line: 681, size: 384, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !984, file: !795, line: 683, baseType: !808, size: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !984, file: !795, line: 686, baseType: !480, size: 64, offset: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !984, file: !795, line: 689, baseType: !480, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !805, file: !795, line: 759, baseType: !990, size: 384)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !795, line: 707, size: 384, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !990, file: !795, line: 709, baseType: !808, size: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !990, file: !795, line: 712, baseType: !480, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !990, file: !795, line: 712, baseType: !480, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !805, file: !795, line: 760, baseType: !996, size: 320)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !795, line: 718, size: 320, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !996, file: !795, line: 720, baseType: !808, size: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !996, file: !795, line: 723, baseType: !480, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !800, file: !795, line: 138, baseType: !799, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !800, file: !795, line: 139, baseType: !799, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !794, file: !795, line: 146, baseType: !798, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !794, file: !795, line: 152, baseType: !792, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !789, file: !337, line: 130, baseType: !653, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !784, file: !337, line: 134, baseType: !428, size: 64, offset: 192)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !784, file: !337, line: 137, baseType: !480, size: 64, offset: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !784, file: !337, line: 138, baseType: !603, size: 32, offset: 320)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !784, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !784, file: !337, line: 144, baseType: !424, size: 32, offset: 384)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !784, file: !337, line: 145, baseType: !424, size: 32, offset: 416)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !784, file: !337, line: 146, baseType: !1012, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !431)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !767, file: !337, line: 220, baseType: !770, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !767, file: !337, line: 223, baseType: !428, size: 64, offset: 128)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !767, file: !337, line: 226, baseType: !1016, size: 64, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !767, file: !337, line: 229, baseType: !1019, size: 128, offset: 256)
!1019 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1020, size: 128, elements: !721)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !767, file: !337, line: 232, baseType: !766, size: 64, offset: 384)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !767, file: !337, line: 233, baseType: !766, size: 64, offset: 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !767, file: !337, line: 238, baseType: !1025, size: 64, offset: 512)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !1026)
!1026 = !{!1027, !1033}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1025, file: !337, line: 236, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1029, size: 64)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1029, file: !337, line: 275, baseType: !792, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1029, file: !337, line: 278, baseType: !792, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1025, file: !337, line: 237, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1035, file: !337, line: 261, baseType: !653, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1035, file: !337, line: 262, baseType: !653, size: 64, offset: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1035, file: !337, line: 266, baseType: !653, size: 64, offset: 128)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1035, file: !337, line: 267, baseType: !653, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1035, file: !337, line: 270, baseType: !424, size: 32, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !767, file: !337, line: 241, baseType: !1012, size: 64, offset: 576)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !767, file: !337, line: 244, baseType: !424, size: 32, offset: 640)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !767, file: !337, line: 247, baseType: !424, size: 32, offset: 672)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !767, file: !337, line: 250, baseType: !424, size: 32, offset: 704)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !767, file: !337, line: 253, baseType: !424, size: 32, offset: 736)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !767, file: !337, line: 256, baseType: !424, size: 32, offset: 768)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !674, file: !656, line: 179, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !656, line: 150, baseType: !1051)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !656, line: 142, size: 320, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1059, !1060}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1051, file: !656, line: 144, baseType: !480, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1051, file: !656, line: 145, baseType: !653, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1051, file: !656, line: 146, baseType: !653, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1051, file: !656, line: 147, baseType: !1057, size: 32, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1058, line: 31, baseType: !424)
!1058 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1051, file: !656, line: 148, baseType: !7, size: 32, offset: 224)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1051, file: !656, line: 149, baseType: !423, size: 8, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !674, file: !656, line: 180, baseType: !1062, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !656, line: 162, baseType: !1064)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !656, line: 159, size: 128, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1064, file: !656, line: 160, baseType: !480, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1064, file: !656, line: 161, baseType: !431, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !674, file: !656, line: 181, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !656, line: 181, flags: DIFlagFwdDecl)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !669, file: !656, line: 317, baseType: !1072, size: 64)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !431, size: 64, elements: !577)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !669, file: !656, line: 318, baseType: !1074, size: 320)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !656, line: 188, size: 320, elements: !1075)
!1075 = !{!1076, !1078, !1135}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1074, file: !656, line: 190, baseType: !1077, size: 192)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 192, elements: !552)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1074, file: !656, line: 193, baseType: !1079, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !656, line: 206, size: 320, elements: !1081)
!1081 = !{!1082, !1120, !1121, !1122, !1134}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1080, file: !656, line: 208, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !481, line: 62, baseType: !1085)
!1085 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1086, line: 538, size: 256, elements: !1087)
!1086 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1087 = !{!1088, !1092, !1098, !1111}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !1086, line: 539, baseType: !1089, size: 32)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1086, line: 482, size: 32, elements: !1090)
!1090 = !{!1091}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1089, file: !1086, line: 484, baseType: !7, size: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1085, file: !1086, line: 540, baseType: !1093, size: 192)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1086, line: 488, size: 192, elements: !1094)
!1094 = !{!1095, !1096, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !1086, line: 489, baseType: !1089, size: 32)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1093, file: !1086, line: 492, baseType: !429, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1093, file: !1086, line: 496, baseType: !480, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1085, file: !1086, line: 541, baseType: !1099, size: 256)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1086, line: 504, size: 256, elements: !1100)
!1100 = !{!1101, !1102, !1109, !1110}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1099, file: !1086, line: 505, baseType: !1089, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1099, file: !1086, line: 509, baseType: !1103, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1086, line: 501, baseType: !1104)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DISubroutineType(types: !1106)
!1106 = !{null, !1107}
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1099, file: !1086, line: 510, baseType: !1107, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1099, file: !1086, line: 513, baseType: !1083, size: 64, offset: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1085, file: !1086, line: 542, baseType: !1112, size: 128)
!1112 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1086, line: 530, size: 128, elements: !1113)
!1113 = !{!1114, !1115}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1112, file: !1086, line: 531, baseType: !1089, size: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1112, file: !1086, line: 534, baseType: !1116, size: 64, offset: 64)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1086, line: 525, baseType: !1117)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!423, !480, !429, !440, !440}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1080, file: !656, line: 211, baseType: !7, size: 32, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1080, file: !656, line: 214, baseType: !431, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1080, file: !656, line: 224, baseType: !1123, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !656, line: 202, baseType: !1125)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !656, line: 202, size: 128, elements: !1126)
!1126 = !{!1127}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1125, file: !656, line: 202, baseType: !1128, size: 128)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !656, line: 200, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !656, line: 200, size: 128, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1129, file: !656, line: 200, baseType: !7, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1129, file: !656, line: 200, baseType: !7, size: 32, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1129, file: !656, line: 200, baseType: !687, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1080, file: !656, line: 234, baseType: !1123, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1074, file: !656, line: 197, baseType: !431, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !669, file: !656, line: 319, baseType: !541, size: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !669, file: !656, line: 320, baseType: !560, size: 192)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !483, file: !135, line: 3384, baseType: !1139, size: 1472)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1140)
!1140 = !{!1141, !1162, !1163, !1164, !1165}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !135, line: 3115, baseType: !1142, size: 1216)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !135, line: 2985, baseType: !649, size: 960)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1142, file: !135, line: 2986, baseType: !480, size: 64, offset: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1142, file: !135, line: 2987, baseType: !480, size: 64, offset: 1024)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1142, file: !135, line: 2988, baseType: !480, size: 64, offset: 1088)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1142, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1142, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1142, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1142, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1142, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1142, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1142, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1142, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1142, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1142, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1142, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1142, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1142, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1142, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1139, file: !135, line: 3117, baseType: !480, size: 64, offset: 1216)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1139, file: !135, line: 3119, baseType: !480, size: 64, offset: 1280)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1139, file: !135, line: 3121, baseType: !480, size: 64, offset: 1344)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1139, file: !135, line: 3123, baseType: !480, size: 64, offset: 1408)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !483, file: !135, line: 3385, baseType: !1167, size: 1088)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !135, line: 2875, baseType: !649, size: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1167, file: !135, line: 2876, baseType: !653, size: 64, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1167, file: !135, line: 2877, baseType: !1172, size: 64, offset: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1174, line: 172, size: 128, elements: !1175)
!1174 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181, !1182}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1173, file: !1174, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1173, file: !1174, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1173, file: !1174, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1173, file: !1174, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1173, file: !1174, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1173, file: !1174, line: 195, baseType: !7, size: 32, offset: 32)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1173, file: !1174, line: 199, baseType: !480, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !483, file: !135, line: 3386, baseType: !1142, size: 1216)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !483, file: !135, line: 3387, baseType: !1185, size: 1280)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1185, file: !135, line: 3094, baseType: !1142, size: 1216)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1185, file: !135, line: 3095, baseType: !1172, size: 64, offset: 1216)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !483, file: !135, line: 3388, baseType: !1190, size: 1216)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196, !1197}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1190, file: !135, line: 2825, baseType: !611, size: 896)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1190, file: !135, line: 2827, baseType: !480, size: 64, offset: 896)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1190, file: !135, line: 2828, baseType: !480, size: 64, offset: 960)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1190, file: !135, line: 2829, baseType: !480, size: 64, offset: 1024)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1190, file: !135, line: 2830, baseType: !480, size: 64, offset: 1088)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1190, file: !135, line: 2831, baseType: !480, size: 64, offset: 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !483, file: !135, line: 3389, baseType: !1199, size: 1024)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1199, file: !135, line: 2851, baseType: !649, size: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1199, file: !135, line: 2852, baseType: !424, size: 32, offset: 960)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1199, file: !135, line: 2853, baseType: !424, size: 32, offset: 992)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !483, file: !135, line: 3390, baseType: !1205, size: 1024)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1205, file: !135, line: 2858, baseType: !649, size: 960)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1205, file: !135, line: 2859, baseType: !1172, size: 64, offset: 960)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !483, file: !135, line: 3391, baseType: !1210, size: 960)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1211)
!1211 = !{!1212}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1210, file: !135, line: 2863, baseType: !649, size: 960)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !483, file: !135, line: 3392, baseType: !1214, size: 1472)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1215)
!1215 = !{!1216}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !135, line: 3305, baseType: !1139, size: 1472)
