; ModuleID = 'make-relative-prefix.bc'
source_filename = "make-relative-prefix.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [5 x i8] c"PATH\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"..\00", align 1

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @atoi(i8* %__nptr) local_unnamed_addr #0 !dbg !17 {
entry:
  call void @llvm.dbg.value(metadata i8* %__nptr, metadata !22, metadata !DIExpression()), !dbg !23
  %call = tail call i64 @strtol(i8* %__nptr, i8** null, i32 10) #6, !dbg !24
  %conv = trunc i64 %call to i32, !dbg !25
  ret i32 %conv, !dbg !26
}

declare dso_local i64 @strtol(i8*, i8**, i32) local_unnamed_addr #1

; Function Attrs: inlinehint nounwind uwtable
define dso_local i64 @atol(i8* %__nptr) local_unnamed_addr #0 !dbg !27 {
entry:

!22 = !DILocalVariable(name: "__nptr", arg: 1, scope: !17, file: !18, line: 361, type: !9)
!23 = !DILocation(line: 0, scope: !17)
!24 = !DILocation(line: 363, column: 16, scope: !17)
!25 = !DILocation(line: 363, column: 10, scope: !17)
!26 = !DILocation(line: 363, column: 3, scope: !17)
!27 = distinct !DISubprogram(name: "atol", scope: !18, file: !18, line: 366, type: !28, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !31)
!28 = !DISubroutineType(types: !29)
!29 = !{!30, !9}
!30 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!31 = !{!32}
!32 = !DILocalVariable(name: "__nptr", arg: 1, scope: !27, file: !18, line: 366, type: !9)
!33 = !DILocation(line: 0, scope: !27)
!34 = !DILocation(line: 368, column: 10, scope: !27)
!35 = !DILocation(line: 368, column: 3, scope: !27)
!36 = distinct !DISubprogram(name: "atoll", scope: !18, file: !18, line: 373, type: !37, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !40)
!37 = !DISubroutineType(types: !38)
!38 = !{!39, !9}
!39 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!40 = !{!41}
!41 = !DILocalVariable(name: "__nptr", arg: 1, scope: !36, file: !18, line: 373, type: !9)
!42 = !DILocation(line: 0, scope: !36)
!43 = !DILocation(line: 375, column: 10, scope: !36)
!44 = !DILocation(line: 375, column: 3, scope: !36)
!45 = distinct !DISubprogram(name: "bsearch", scope: !46, file: !46, line: 20, type: !47, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !58)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!47 = !DISubroutineType(types: !48)
!48 = !{!8, !49, !49, !51, !51, !54}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !52, line: 46, baseType: !53)
!52 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !18, line: 808, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DISubroutineType(types: !57)
!57 = !{!4, !49, !49}
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66, !67, !68}
!59 = !DILocalVariable(name: "__key", arg: 1, scope: !45, file: !46, line: 20, type: !49)
!60 = !DILocalVariable(name: "__base", arg: 2, scope: !45, file: !46, line: 20, type: !49)
!61 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !45, file: !46, line: 20, type: !51)
!62 = !DILocalVariable(name: "__size", arg: 4, scope: !45, file: !46, line: 20, type: !51)
!63 = !DILocalVariable(name: "__compar", arg: 5, scope: !45, file: !46, line: 21, type: !54)
!64 = !DILocalVariable(name: "__l", scope: !45, file: !46, line: 23, type: !51)
!65 = !DILocalVariable(name: "__u", scope: !45, file: !46, line: 23, type: !51)
!66 = !DILocalVariable(name: "__idx", scope: !45, file: !46, line: 23, type: !51)
!67 = !DILocalVariable(name: "__p", scope: !45, file: !46, line: 24, type: !49)
!68 = !DILocalVariable(name: "__comparison", scope: !45, file: !46, line: 25, type: !4)
!69 = !DILocation(line: 0, scope: !45)
!70 = !DILocation(line: 29, column: 3, scope: !45)
!71 = !DILocation(line: 27, column: 7, scope: !45)
!72 = !DILocation(line: 29, column: 14, scope: !45)
!73 = !DILocation(line: 31, column: 20, scope: !74)
!74 = distinct !DILexicalBlock(scope: !45, file: !46, line: 30, column: 5)
!75 = !DILocation(line: 31, column: 27, scope: !74)
!76 = !DILocation(line: 32, column: 56, scope: !74)
!77 = !DILocation(line: 32, column: 47, scope: !74)
!78 = !DILocation(line: 33, column: 22, scope: !74)
!79 = !DILocation(line: 34, column: 24, scope: !80)
!80 = distinct !DILexicalBlock(scope: !74, file: !46, line: 34, column: 11)
!81 = !DILocation(line: 34, column: 11, scope: !74)
!82 = !DILocation(line: 36, column: 29, scope: !83)
!83 = distinct !DILexicalBlock(scope: !80, file: !46, line: 36, column: 16)
!84 = !DILocation(line: 36, column: 16, scope: !80)
!85 = !DILocation(line: 37, column: 14, scope: !83)
!86 = distinct !{!86, !70, !87}
!87 = !DILocation(line: 40, column: 5, scope: !45)
!88 = !DILocation(line: 43, column: 1, scope: !45)
!89 = distinct !DISubprogram(name: "atof", scope: !90, file: !90, line: 25, type: !91, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !94)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!91 = !DISubroutineType(types: !92)
!92 = !{!93, !9}
!93 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!94 = !{!95}
!95 = !DILocalVariable(name: "__nptr", arg: 1, scope: !89, file: !90, line: 25, type: !9)
!96 = !DILocation(line: 0, scope: !89)
!97 = !DILocation(line: 27, column: 10, scope: !89)
!98 = !DILocation(line: 27, column: 3, scope: !89)
!99 = distinct !DISubprogram(name: "vprintf", scope: !100, file: !100, line: 39, type: !101, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !112)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!101 = !DISubroutineType(types: !102)
!102 = !{!4, !103, !104}
!103 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 28, size: 192, elements: !106)
!106 = !{!107, !109, !110, !111}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !105, file: !1, line: 28, baseType: !108, size: 32)
!108 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !105, file: !1, line: 28, baseType: !108, size: 32, offset: 32)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !105, file: !1, line: 28, baseType: !8, size: 64, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !105, file: !1, line: 28, baseType: !8, size: 64, offset: 128)
!112 = !{!113, !114}
!113 = !DILocalVariable(name: "__fmt", arg: 1, scope: !99, file: !100, line: 39, type: !103)
!114 = !DILocalVariable(name: "__arg", arg: 2, scope: !99, file: !100, line: 39, type: !104)
!115 = !DILocation(line: 0, scope: !99)
!116 = !DILocation(line: 41, column: 20, scope: !99)
!117 = !DILocation(line: 41, column: 10, scope: !99)
!118 = !DILocation(line: 41, column: 3, scope: !99)
!119 = distinct !DISubprogram(name: "getchar", scope: !100, file: !100, line: 47, type: !120, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!120 = !DISubroutineType(types: !121)
!121 = !{!4}
!122 = !DILocation(line: 49, column: 16, scope: !119)
!123 = !DILocation(line: 49, column: 10, scope: !119)
!124 = !DILocation(line: 49, column: 3, scope: !119)
!125 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !100, file: !100, line: 56, type: !126, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !183)
!126 = !DISubroutineType(types: !127)
!127 = !{!4, !128}
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !130, line: 7, baseType: !131)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !132, line: 49, size: 1728, elements: !133)
!132 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !149, !151, !152, !153, !156, !158, !160, !164, !167, !169, !172, !175, !176, !177, !178, !179}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !131, file: !132, line: 51, baseType: !4, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !131, file: !132, line: 54, baseType: !6, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !131, file: !132, line: 55, baseType: !6, size: 64, offset: 128)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !131, file: !132, line: 56, baseType: !6, size: 64, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !131, file: !132, line: 57, baseType: !6, size: 64, offset: 256)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !131, file: !132, line: 58, baseType: !6, size: 64, offset: 320)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !131, file: !132, line: 59, baseType: !6, size: 64, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !131, file: !132, line: 60, baseType: !6, size: 64, offset: 448)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !131, file: !132, line: 61, baseType: !6, size: 64, offset: 512)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !131, file: !132, line: 64, baseType: !6, size: 64, offset: 576)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !131, file: !132, line: 65, baseType: !6, size: 64, offset: 640)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !131, file: !132, line: 66, baseType: !6, size: 64, offset: 704)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !131, file: !132, line: 68, baseType: !147, size: 64, offset: 768)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !132, line: 36, flags: DIFlagFwdDecl)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !131, file: !132, line: 70, baseType: !150, size: 64, offset: 832)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !131, file: !132, line: 72, baseType: !4, size: 32, offset: 896)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !131, file: !132, line: 73, baseType: !4, size: 32, offset: 928)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !131, file: !132, line: 74, baseType: !154, size: 64, offset: 960)
!154 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !155, line: 152, baseType: !30)
!155 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !131, file: !132, line: 77, baseType: !157, size: 16, offset: 1024)
!157 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !131, file: !132, line: 78, baseType: !159, size: 8, offset: 1040)
!159 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !131, file: !132, line: 79, baseType: !161, size: 8, offset: 1048)
!161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !162)
!162 = !{!163}
!163 = !DISubrange(count: 1)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !131, file: !132, line: 81, baseType: !165, size: 64, offset: 1088)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !132, line: 43, baseType: null)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !131, file: !132, line: 89, baseType: !168, size: 64, offset: 1152)
!168 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !155, line: 153, baseType: !30)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !131, file: !132, line: 91, baseType: !170, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !132, line: 37, flags: DIFlagFwdDecl)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !131, file: !132, line: 92, baseType: !173, size: 64, offset: 1280)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !132, line: 38, flags: DIFlagFwdDecl)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !131, file: !132, line: 93, baseType: !150, size: 64, offset: 1344)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !131, file: !132, line: 94, baseType: !8, size: 64, offset: 1408)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !131, file: !132, line: 95, baseType: !51, size: 64, offset: 1472)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !131, file: !132, line: 96, baseType: !4, size: 32, offset: 1536)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !131, file: !132, line: 98, baseType: !180, size: 160, offset: 1568)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !181)
!181 = !{!182}
!182 = !DISubrange(count: 20)
!183 = !{!184}
!184 = !DILocalVariable(name: "__fp", arg: 1, scope: !125, file: !100, line: 56, type: !128)
!185 = !DILocation(line: 0, scope: !125)
!186 = !DILocation(line: 58, column: 10, scope: !125)
!187 = !DILocation(line: 58, column: 3, scope: !125)
!188 = distinct !DISubprogram(name: "getc_unlocked", scope: !100, file: !100, line: 66, type: !126, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !189)
!189 = !{!190}
!190 = !DILocalVariable(name: "__fp", arg: 1, scope: !188, file: !100, line: 66, type: !128)
!191 = !DILocation(line: 0, scope: !188)
!192 = !DILocation(line: 68, column: 10, scope: !188)
!193 = !DILocation(line: 68, column: 3, scope: !188)
!194 = distinct !DISubprogram(name: "getchar_unlocked", scope: !100, file: !100, line: 73, type: !120, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!195 = !DILocation(line: 75, column: 10, scope: !194)
!196 = !DILocation(line: 75, column: 3, scope: !194)
!197 = distinct !DISubprogram(name: "putchar", scope: !100, file: !100, line: 82, type: !198, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !200)
!198 = !DISubroutineType(types: !199)
!199 = !{!4, !4}
!200 = !{!201}
!201 = !DILocalVariable(name: "__c", arg: 1, scope: !197, file: !100, line: 82, type: !4)
!202 = !DILocation(line: 0, scope: !197)
!203 = !DILocation(line: 84, column: 21, scope: !197)
!204 = !DILocation(line: 84, column: 10, scope: !197)
!205 = !DILocation(line: 84, column: 3, scope: !197)
!206 = distinct !DISubprogram(name: "fputc_unlocked", scope: !100, file: !100, line: 91, type: !207, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !209)
!207 = !DISubroutineType(types: !208)
!208 = !{!4, !4, !128}
!209 = !{!210, !211}
!210 = !DILocalVariable(name: "__c", arg: 1, scope: !206, file: !100, line: 91, type: !4)
!211 = !DILocalVariable(name: "__stream", arg: 2, scope: !206, file: !100, line: 91, type: !128)
!212 = !DILocation(line: 0, scope: !206)
!213 = !DILocation(line: 93, column: 10, scope: !206)
!214 = !DILocation(line: 93, column: 3, scope: !206)
!215 = distinct !DISubprogram(name: "putc_unlocked", scope: !100, file: !100, line: 101, type: !207, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !216)
!216 = !{!217, !218}
!217 = !DILocalVariable(name: "__c", arg: 1, scope: !215, file: !100, line: 101, type: !4)
!218 = !DILocalVariable(name: "__stream", arg: 2, scope: !215, file: !100, line: 101, type: !128)
!219 = !DILocation(line: 0, scope: !215)
!220 = !DILocation(line: 103, column: 10, scope: !215)
!221 = !DILocation(line: 103, column: 3, scope: !215)
!222 = distinct !DISubprogram(name: "putchar_unlocked", scope: !100, file: !100, line: 108, type: !198, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !223)
!223 = !{!224}
!224 = !DILocalVariable(name: "__c", arg: 1, scope: !222, file: !100, line: 108, type: !4)
!225 = !DILocation(line: 0, scope: !222)
!226 = !DILocation(line: 110, column: 10, scope: !222)
!227 = !DILocation(line: 110, column: 3, scope: !222)
!228 = distinct !DISubprogram(name: "getline", scope: !100, file: !100, line: 118, type: !229, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !233)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !5, !232, !128}
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !155, line: 193, baseType: !30)
