; ModuleID = 'mcf.bc'
source_filename = "mcf.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!196 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!197 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!198 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!199 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!200 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!201 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!202 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!203 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!204 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!205 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!206 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!207 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!208 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!209 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!210 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!211 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!212 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!213 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!214 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!215 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!216 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!217 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!218 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!219 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!220 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!221 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!222 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!223 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!224 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!226 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!227 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!228 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!229 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!230 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!231 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!232 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!233 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!234 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!235 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!236 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!237 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!238 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!239 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!240 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!241 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!242 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!243 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!244 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!245 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!246 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!247 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !1, line: 68, baseType: !5, size: 32, elements: !248)
!248 = !{!249, !250, !251, !252, !253, !254, !255, !256, !257}
!249 = !DIEnumerator(name: "INVALID_EDGE", value: 0, isUnsigned: true)
!250 = !DIEnumerator(name: "VERTEX_SPLIT_EDGE", value: 1, isUnsigned: true)
!251 = !DIEnumerator(name: "REDIRECT_EDGE", value: 2, isUnsigned: true)
!252 = !DIEnumerator(name: "REVERSE_EDGE", value: 3, isUnsigned: true)
!253 = !DIEnumerator(name: "SOURCE_CONNECT_EDGE", value: 4, isUnsigned: true)
!254 = !DIEnumerator(name: "SINK_CONNECT_EDGE", value: 5, isUnsigned: true)
!255 = !DIEnumerator(name: "BALANCE_EDGE", value: 6, isUnsigned: true)
!256 = !DIEnumerator(name: "REDIRECT_NORMALIZED_EDGE", value: 7, isUnsigned: true)
!257 = !DIEnumerator(name: "REVERSE_NORMALIZED_EDGE", value: 8, isUnsigned: true)
!258 = !{!259, !260, !261, !262, !265, !266, !268, !275, !293, !313, !305, !306, !281, !5, !314}
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64)
!260 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!261 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_info", file: !270, line: 27, size: 32, elements: !271)
!270 = !DIFile(filename: "./profile.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!271 = !{!272, !273, !274}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "count_valid", scope: !269, file: !270, line: 29, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "on_tree", scope: !269, file: !270, line: 32, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !269, file: !270, line: 36, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixup_vertex_p", file: !1, line: 111, baseType: !276)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixup_vertex_type", file: !1, line: 109, baseType: !278)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixup_vertex_d", file: !1, line: 106, size: 64, elements: !279)
!279 = !{!280}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "succ_edges", scope: !278, file: !1, line: 108, baseType: !281, size: 64)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_fixup_edge_p_heap", file: !1, line: 103, baseType: !283)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_fixup_edge_p_heap", file: !1, line: 103, size: 128, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !283, file: !1, line: 103, baseType: !286, size: 128)
!286 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_fixup_edge_p_base", file: !1, line: 102, baseType: !287)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_fixup_edge_p_base", file: !1, line: 102, size: 128, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !287, file: !1, line: 102, baseType: !5, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !287, file: !1, line: 102, baseType: !5, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !287, file: !1, line: 102, baseType: !292, size: 64, offset: 64)
!292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !293, size: 64, elements: !311)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixup_edge_p", file: !1, line: 100, baseType: !294)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "fixup_edge_type", file: !1, line: 98, baseType: !296)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixup_edge_d", file: !1, line: 82, size: 512, elements: !297)
!297 = !{!298, !299, !300, !302, !303, !304, !307, !308, !309, !310}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !296, file: !1, line: 84, baseType: !261, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !296, file: !1, line: 85, baseType: !261, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !296, file: !1, line: 87, baseType: !301, size: 32, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge_type", file: !1, line: 79, baseType: !247)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "is_rflow_valid", scope: !296, file: !1, line: 88, baseType: !260, size: 8, offset: 96)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "norm_vertex_index", scope: !296, file: !1, line: 90, baseType: !261, size: 32, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "flow", scope: !296, file: !1, line: 92, baseType: !305, size: 64, offset: 192)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !4, line: 119, baseType: !306)
!306 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "rflow", scope: !296, file: !1, line: 94, baseType: !305, size: 64, offset: 256)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "weight", scope: !296, file: !1, line: 95, baseType: !305, size: 64, offset: 320)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cost", scope: !296, file: !1, line: 96, baseType: !305, size: 64, offset: 384)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "max_capacity", scope: !296, file: !1, line: 97, baseType: !305, size: 64, offset: 448)
!311 = !{!312}
!312 = !DISubrange(count: 1)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!315 = !{i32 2, !"Dwarf Version", i32 4}
!316 = !{i32 2, !"Debug Info Version", i32 3}
!317 = !{i32 1, !"wchar_size", i32 4}
!318 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!319 = distinct !DISubprogram(name: "vprintf", scope: !320, file: !320, line: 39, type: !321, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !331)
!320 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!321 = !DISubroutineType(types: !322)
!322 = !{!261, !323, !324}
!323 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !266)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !325, file: !1, baseType: !5, size: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !325, file: !1, baseType: !5, size: 32, offset: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !325, file: !1, baseType: !265, size: 64, offset: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !325, file: !1, baseType: !265, size: 64, offset: 128)
!331 = !{!332, !333}
!332 = !DILocalVariable(name: "__fmt", arg: 1, scope: !319, file: !320, line: 39, type: !323)
!333 = !DILocalVariable(name: "__arg", arg: 2, scope: !319, file: !320, line: 39, type: !324)
!334 = !DILocation(line: 0, scope: !319)
!335 = !DILocation(line: 41, column: 20, scope: !319)
!336 = !DILocation(line: 41, column: 10, scope: !319)
!337 = !DILocation(line: 41, column: 3, scope: !319)
!338 = distinct !DISubprogram(name: "getchar", scope: !320, file: !320, line: 47, type: !339, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !341)
!339 = !DISubroutineType(types: !340)
!340 = !{!261}
!341 = !{}
!342 = !DILocation(line: 49, column: 16, scope: !338)
!343 = !DILocation(line: 49, column: 10, scope: !338)
!344 = !DILocation(line: 49, column: 3, scope: !338)
!345 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !320, file: !320, line: 56, type: !346, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !404)
!346 = !DISubroutineType(types: !347)
!347 = !{!261, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !350, line: 7, baseType: !351)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !352, line: 49, size: 1728, elements: !353)
!352 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!353 = !{!354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !369, !371, !372, !373, !376, !378, !380, !382, !385, !387, !390, !393, !394, !395, !399, !400}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !351, file: !352, line: 51, baseType: !261, size: 32)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !351, file: !352, line: 54, baseType: !263, size: 64, offset: 64)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !351, file: !352, line: 55, baseType: !263, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !351, file: !352, line: 56, baseType: !263, size: 64, offset: 192)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !351, file: !352, line: 57, baseType: !263, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !351, file: !352, line: 58, baseType: !263, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !351, file: !352, line: 59, baseType: !263, size: 64, offset: 384)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !351, file: !352, line: 60, baseType: !263, size: 64, offset: 448)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !351, file: !352, line: 61, baseType: !263, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !351, file: !352, line: 64, baseType: !263, size: 64, offset: 576)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !351, file: !352, line: 65, baseType: !263, size: 64, offset: 640)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !351, file: !352, line: 66, baseType: !263, size: 64, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !351, file: !352, line: 68, baseType: !367, size: 64, offset: 768)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !352, line: 36, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !351, file: !352, line: 70, baseType: !370, size: 64, offset: 832)
!370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !351, file: !352, line: 72, baseType: !261, size: 32, offset: 896)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !351, file: !352, line: 73, baseType: !261, size: 32, offset: 928)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !351, file: !352, line: 74, baseType: !374, size: 64, offset: 960)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !375, line: 152, baseType: !306)
!375 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !351, file: !352, line: 77, baseType: !377, size: 16, offset: 1024)
!377 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !351, file: !352, line: 78, baseType: !379, size: 8, offset: 1040)
!379 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !351, file: !352, line: 79, baseType: !381, size: 8, offset: 1048)
!381 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 8, elements: !311)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !351, file: !352, line: 81, baseType: !383, size: 64, offset: 1088)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !352, line: 43, baseType: null)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !351, file: !352, line: 89, baseType: !386, size: 64, offset: 1152)
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !375, line: 153, baseType: !306)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !351, file: !352, line: 91, baseType: !388, size: 64, offset: 1216)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !352, line: 37, flags: DIFlagFwdDecl)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !351, file: !352, line: 92, baseType: !391, size: 64, offset: 1280)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !352, line: 38, flags: DIFlagFwdDecl)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !351, file: !352, line: 93, baseType: !370, size: 64, offset: 1344)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !351, file: !352, line: 94, baseType: !265, size: 64, offset: 1408)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !351, file: !352, line: 95, baseType: !396, size: 64, offset: 1472)
!396 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !397, line: 46, baseType: !398)
!397 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!398 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !351, file: !352, line: 96, baseType: !261, size: 32, offset: 1536)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !351, file: !352, line: 98, baseType: !401, size: 160, offset: 1568)
!401 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 160, elements: !402)
!402 = !{!403}
!403 = !DISubrange(count: 20)
!404 = !{!405}
!405 = !DILocalVariable(name: "__fp", arg: 1, scope: !345, file: !320, line: 56, type: !348)
!406 = !DILocation(line: 0, scope: !345)
!407 = !DILocation(line: 58, column: 10, scope: !345)
!408 = !DILocation(line: 58, column: 3, scope: !345)
!409 = distinct !DISubprogram(name: "getc_unlocked", scope: !320, file: !320, line: 66, type: !346, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !410)
!410 = !{!411}
!411 = !DILocalVariable(name: "__fp", arg: 1, scope: !409, file: !320, line: 66, type: !348)
!412 = !DILocation(line: 0, scope: !409)
!413 = !DILocation(line: 68, column: 10, scope: !409)
!414 = !DILocation(line: 68, column: 3, scope: !409)
!415 = distinct !DISubprogram(name: "getchar_unlocked", scope: !320, file: !320, line: 73, type: !339, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !341)
!416 = !DILocation(line: 75, column: 10, scope: !415)
!417 = !DILocation(line: 75, column: 3, scope: !415)
!418 = distinct !DISubprogram(name: "putchar", scope: !320, file: !320, line: 82, type: !419, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !421)
!419 = !DISubroutineType(types: !420)
!420 = !{!261, !261}
!421 = !{!422}
!422 = !DILocalVariable(name: "__c", arg: 1, scope: !418, file: !320, line: 82, type: !261)
!423 = !DILocation(line: 0, scope: !418)
!424 = !DILocation(line: 84, column: 21, scope: !418)
!425 = !DILocation(line: 84, column: 10, scope: !418)
!426 = !DILocation(line: 84, column: 3, scope: !418)
!427 = distinct !DISubprogram(name: "fputc_unlocked", scope: !320, file: !320, line: 91, type: !428, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{!261, !261, !348}
!430 = !{!431, !432}
!431 = !DILocalVariable(name: "__c", arg: 1, scope: !427, file: !320, line: 91, type: !261)
!432 = !DILocalVariable(name: "__stream", arg: 2, scope: !427, file: !320, line: 91, type: !348)
!433 = !DILocation(line: 0, scope: !427)
!434 = !DILocation(line: 93, column: 10, scope: !427)
!435 = !DILocation(line: 93, column: 3, scope: !427)
!436 = distinct !DISubprogram(name: "putc_unlocked", scope: !320, file: !320, line: 101, type: !428, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !437)
!437 = !{!438, !439}
!438 = !DILocalVariable(name: "__c", arg: 1, scope: !436, file: !320, line: 101, type: !261)
!439 = !DILocalVariable(name: "__stream", arg: 2, scope: !436, file: !320, line: 101, type: !348)
!440 = !DILocation(line: 0, scope: !436)
!441 = !DILocation(line: 103, column: 10, scope: !436)
!442 = !DILocation(line: 103, column: 3, scope: !436)
!443 = distinct !DISubprogram(name: "putchar_unlocked", scope: !320, file: !320, line: 108, type: !419, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !444)
!444 = !{!445}
!445 = !DILocalVariable(name: "__c", arg: 1, scope: !443, file: !320, line: 108, type: !261)
!446 = !DILocation(line: 0, scope: !443)
!447 = !DILocation(line: 110, column: 10, scope: !443)
!448 = !DILocation(line: 110, column: 3, scope: !443)
!449 = distinct !DISubprogram(name: "getline", scope: !320, file: !320, line: 118, type: !450, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !454)
!450 = !DISubroutineType(types: !451)
!451 = !{!452, !262, !453, !348}
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !375, line: 193, baseType: !306)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!454 = !{!455, !456, !457}
!455 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !449, file: !320, line: 118, type: !262)
!456 = !DILocalVariable(name: "__n", arg: 2, scope: !449, file: !320, line: 118, type: !453)
!457 = !DILocalVariable(name: "__stream", arg: 3, scope: !449, file: !320, line: 118, type: !348)
!458 = !DILocation(line: 0, scope: !449)
!459 = !DILocation(line: 120, column: 10, scope: !449)
!460 = !DILocation(line: 120, column: 3, scope: !449)
!461 = distinct !DISubprogram(name: "feof_unlocked", scope: !320, file: !320, line: 128, type: !346, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !462)
!462 = !{!463}
!463 = !DILocalVariable(name: "__stream", arg: 1, scope: !461, file: !320, line: 128, type: !348)
!464 = !DILocation(line: 0, scope: !461)
!465 = !DILocation(line: 130, column: 10, scope: !461)
!466 = !DILocation(line: 130, column: 3, scope: !461)
!467 = distinct !DISubprogram(name: "ferror_unlocked", scope: !320, file: !320, line: 135, type: !346, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !468)
!468 = !{!469}
!469 = !DILocalVariable(name: "__stream", arg: 1, scope: !467, file: !320, line: 135, type: !348)
!470 = !DILocation(line: 0, scope: !467)
!471 = !DILocation(line: 137, column: 10, scope: !467)
!472 = !DILocation(line: 137, column: 3, scope: !467)
!473 = distinct !DISubprogram(name: "tolower", scope: !474, file: !474, line: 207, type: !419, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !475)
!474 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!475 = !{!476}
!476 = !DILocalVariable(name: "__c", arg: 1, scope: !473, file: !474, line: 207, type: !261)
!477 = !DILocation(line: 0, scope: !473)
!478 = !DILocation(line: 209, column: 22, scope: !473)
!479 = !DILocation(line: 209, column: 39, scope: !473)
!480 = !DILocation(line: 209, column: 38, scope: !473)
!481 = !DILocation(line: 209, column: 37, scope: !473)
!482 = !DILocation(line: 209, column: 10, scope: !473)
!483 = !DILocation(line: 209, column: 3, scope: !473)
!484 = distinct !DISubprogram(name: "toupper", scope: !474, file: !474, line: 213, type: !419, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !485)
!485 = !{!486}
!486 = !DILocalVariable(name: "__c", arg: 1, scope: !484, file: !474, line: 213, type: !261)
!487 = !DILocation(line: 0, scope: !484)
!488 = !DILocation(line: 215, column: 22, scope: !484)
!489 = !DILocation(line: 215, column: 39, scope: !484)
!490 = !DILocation(line: 215, column: 38, scope: !484)
!491 = !DILocation(line: 215, column: 37, scope: !484)
!492 = !DILocation(line: 215, column: 10, scope: !484)
!493 = !DILocation(line: 215, column: 3, scope: !484)
!494 = distinct !DISubprogram(name: "atoi", scope: !495, file: !495, line: 361, type: !496, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !498)
!495 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!496 = !DISubroutineType(types: !497)
!497 = !{!261, !266}
!498 = !{!499}
!499 = !DILocalVariable(name: "__nptr", arg: 1, scope: !494, file: !495, line: 361, type: !266)
!500 = !DILocation(line: 0, scope: !494)
!501 = !DILocation(line: 363, column: 16, scope: !494)
!502 = !DILocation(line: 363, column: 10, scope: !494)
!503 = !DILocation(line: 363, column: 3, scope: !494)
!504 = distinct !DISubprogram(name: "atol", scope: !495, file: !495, line: 366, type: !505, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !507)
!505 = !DISubroutineType(types: !506)
!506 = !{!306, !266}
!507 = !{!508}
!508 = !DILocalVariable(name: "__nptr", arg: 1, scope: !504, file: !495, line: 366, type: !266)
!509 = !DILocation(line: 0, scope: !504)
!510 = !DILocation(line: 368, column: 10, scope: !504)
!511 = !DILocation(line: 368, column: 3, scope: !504)
!512 = distinct !DISubprogram(name: "atoll", scope: !495, file: !495, line: 373, type: !513, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !516)
!513 = !DISubroutineType(types: !514)
!514 = !{!515, !266}
!515 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!516 = !{!517}
!517 = !DILocalVariable(name: "__nptr", arg: 1, scope: !512, file: !495, line: 373, type: !266)
!518 = !DILocation(line: 0, scope: !512)
!519 = !DILocation(line: 375, column: 10, scope: !512)
!520 = !DILocation(line: 375, column: 3, scope: !512)
!521 = distinct !DISubprogram(name: "bsearch", scope: !522, file: !522, line: 20, type: !523, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !531)
!522 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!523 = !DISubroutineType(types: !524)
!524 = !{!265, !525, !525, !396, !396, !527}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !495, line: 808, baseType: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DISubroutineType(types: !530)
!530 = !{!261, !525, !525}
!531 = !{!532, !533, !534, !535, !536, !537, !538, !539, !540, !541}
!532 = !DILocalVariable(name: "__key", arg: 1, scope: !521, file: !522, line: 20, type: !525)
!533 = !DILocalVariable(name: "__base", arg: 2, scope: !521, file: !522, line: 20, type: !525)
!534 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !521, file: !522, line: 20, type: !396)
!535 = !DILocalVariable(name: "__size", arg: 4, scope: !521, file: !522, line: 20, type: !396)
!536 = !DILocalVariable(name: "__compar", arg: 5, scope: !521, file: !522, line: 21, type: !527)
!537 = !DILocalVariable(name: "__l", scope: !521, file: !522, line: 23, type: !396)
!538 = !DILocalVariable(name: "__u", scope: !521, file: !522, line: 23, type: !396)
!539 = !DILocalVariable(name: "__idx", scope: !521, file: !522, line: 23, type: !396)
!540 = !DILocalVariable(name: "__p", scope: !521, file: !522, line: 24, type: !525)
!541 = !DILocalVariable(name: "__comparison", scope: !521, file: !522, line: 25, type: !261)
!542 = !DILocation(line: 0, scope: !521)
!543 = !DILocation(line: 29, column: 3, scope: !521)
!544 = !DILocation(line: 27, column: 7, scope: !521)
!545 = !DILocation(line: 29, column: 14, scope: !521)
!546 = !DILocation(line: 31, column: 20, scope: !547)
!547 = distinct !DILexicalBlock(scope: !521, file: !522, line: 30, column: 5)
!548 = !DILocation(line: 31, column: 27, scope: !547)
!549 = !DILocation(line: 32, column: 56, scope: !547)
!550 = !DILocation(line: 32, column: 47, scope: !547)
!551 = !DILocation(line: 33, column: 22, scope: !547)
!552 = !DILocation(line: 34, column: 24, scope: !553)
!553 = distinct !DILexicalBlock(scope: !547, file: !522, line: 34, column: 11)
!554 = !DILocation(line: 34, column: 11, scope: !547)
!555 = !DILocation(line: 36, column: 29, scope: !556)
!556 = distinct !DILexicalBlock(scope: !553, file: !522, line: 36, column: 16)
!557 = !DILocation(line: 36, column: 16, scope: !553)
!558 = !DILocation(line: 37, column: 14, scope: !556)
!559 = distinct !{!559, !543, !560}
!560 = !DILocation(line: 40, column: 5, scope: !521)
!561 = !DILocation(line: 43, column: 1, scope: !521)
!562 = distinct !DISubprogram(name: "atof", scope: !563, file: !563, line: 25, type: !564, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !567)
!563 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!564 = !DISubroutineType(types: !565)
!565 = !{!566, !266}
!566 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!567 = !{!568}
!568 = !DILocalVariable(name: "__nptr", arg: 1, scope: !562, file: !563, line: 25, type: !266)
!569 = !DILocation(line: 0, scope: !562)
!570 = !DILocation(line: 27, column: 10, scope: !562)
!571 = !DILocation(line: 27, column: 3, scope: !562)
!572 = distinct !DISubprogram(name: "strtoimax", scope: !573, file: !573, line: 324, type: !574, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !580)
!573 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!574 = !DISubroutineType(types: !575)
!575 = !{!576, !323, !579, !261}
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !577, line: 101, baseType: !578)
!577 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!578 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !375, line: 72, baseType: !306)
!579 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !262)
!580 = !{!581, !582, !583}
!581 = !DILocalVariable(name: "nptr", arg: 1, scope: !572, file: !573, line: 324, type: !323)
!582 = !DILocalVariable(name: "endptr", arg: 2, scope: !572, file: !573, line: 324, type: !579)
!583 = !DILocalVariable(name: "base", arg: 3, scope: !572, file: !573, line: 324, type: !261)
!584 = !DILocation(line: 0, scope: !572)
!585 = !DILocation(line: 327, column: 10, scope: !572)
!586 = !DILocation(line: 327, column: 3, scope: !572)
!587 = distinct !DISubprogram(name: "strtoumax", scope: !573, file: !573, line: 336, type: !588, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !592)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !323, !579, !261}
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !577, line: 102, baseType: !591)
!591 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !375, line: 73, baseType: !398)
!592 = !{!593, !594, !595}
!593 = !DILocalVariable(name: "nptr", arg: 1, scope: !587, file: !573, line: 336, type: !323)
!594 = !DILocalVariable(name: "endptr", arg: 2, scope: !587, file: !573, line: 336, type: !579)
!595 = !DILocalVariable(name: "base", arg: 3, scope: !587, file: !573, line: 336, type: !261)
!596 = !DILocation(line: 0, scope: !587)
!597 = !DILocation(line: 339, column: 10, scope: !587)
!598 = !DILocation(line: 339, column: 3, scope: !587)
!599 = distinct !DISubprogram(name: "wcstoimax", scope: !573, file: !573, line: 348, type: !600, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !609)
!600 = !DISubroutineType(types: !601)
!601 = !{!576, !602, !606, !261}
!602 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !573, line: 34, baseType: !261)
!606 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!609 = !{!610, !611, !612}
!610 = !DILocalVariable(name: "nptr", arg: 1, scope: !599, file: !573, line: 348, type: !602)
!611 = !DILocalVariable(name: "endptr", arg: 2, scope: !599, file: !573, line: 348, type: !606)
!612 = !DILocalVariable(name: "base", arg: 3, scope: !599, file: !573, line: 348, type: !261)
!613 = !DILocation(line: 0, scope: !599)
!614 = !DILocation(line: 351, column: 10, scope: !599)
!615 = !DILocation(line: 351, column: 3, scope: !599)
!616 = distinct !DISubprogram(name: "wcstoumax", scope: !573, file: !573, line: 362, type: !617, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!590, !602, !606, !261}
!619 = !{!620, !621, !622}
!620 = !DILocalVariable(name: "nptr", arg: 1, scope: !616, file: !573, line: 362, type: !602)
!621 = !DILocalVariable(name: "endptr", arg: 2, scope: !616, file: !573, line: 362, type: !606)
!622 = !DILocalVariable(name: "base", arg: 3, scope: !616, file: !573, line: 362, type: !261)
!623 = !DILocation(line: 0, scope: !616)
!624 = !DILocation(line: 365, column: 10, scope: !616)
!625 = !DILocation(line: 365, column: 3, scope: !616)
!626 = distinct !DISubprogram(name: "stat", scope: !627, file: !627, line: 453, type: !628, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !667)
!627 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!628 = !DISubroutineType(types: !629)
!629 = !{!261, !266, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !632, line: 46, size: 1152, elements: !633)
!632 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!633 = !{!634, !636, !638, !640, !642, !644, !646, !647, !648, !649, !651, !653, !661, !662, !663}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !631, file: !632, line: 48, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !375, line: 145, baseType: !398)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !631, file: !632, line: 53, baseType: !637, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !375, line: 148, baseType: !398)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !631, file: !632, line: 61, baseType: !639, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !375, line: 151, baseType: !398)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !631, file: !632, line: 62, baseType: !641, size: 32, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !375, line: 150, baseType: !5)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !631, file: !632, line: 64, baseType: !643, size: 32, offset: 224)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !375, line: 146, baseType: !5)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !631, file: !632, line: 65, baseType: !645, size: 32, offset: 256)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !375, line: 147, baseType: !5)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !631, file: !632, line: 67, baseType: !261, size: 32, offset: 288)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !631, file: !632, line: 69, baseType: !635, size: 64, offset: 320)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !631, file: !632, line: 74, baseType: !374, size: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !631, file: !632, line: 78, baseType: !650, size: 64, offset: 448)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !375, line: 174, baseType: !306)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !631, file: !632, line: 80, baseType: !652, size: 64, offset: 512)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !375, line: 179, baseType: !306)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !631, file: !632, line: 91, baseType: !654, size: 128, offset: 576)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !655, line: 10, size: 128, elements: !656)
!655 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!656 = !{!657, !659}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !654, file: !655, line: 12, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !375, line: 160, baseType: !306)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !654, file: !655, line: 16, baseType: !660, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !375, line: 196, baseType: !306)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !631, file: !632, line: 92, baseType: !654, size: 128, offset: 704)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !631, file: !632, line: 93, baseType: !654, size: 128, offset: 832)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !631, file: !632, line: 106, baseType: !664, size: 192, offset: 960)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 192, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 3)
!667 = !{!668, !669}
!668 = !DILocalVariable(name: "__path", arg: 1, scope: !626, file: !627, line: 453, type: !266)
!669 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !626, file: !627, line: 453, type: !630)
!670 = !DILocation(line: 0, scope: !626)
!671 = !DILocation(line: 455, column: 10, scope: !626)
!672 = !DILocation(line: 455, column: 3, scope: !626)
!673 = distinct !DISubprogram(name: "lstat", scope: !627, file: !627, line: 460, type: !628, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !674)
!674 = !{!675, !676}
!675 = !DILocalVariable(name: "__path", arg: 1, scope: !673, file: !627, line: 460, type: !266)
!676 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !673, file: !627, line: 460, type: !630)
!677 = !DILocation(line: 0, scope: !673)
!678 = !DILocation(line: 462, column: 10, scope: !673)
!679 = !DILocation(line: 462, column: 3, scope: !673)
!680 = distinct !DISubprogram(name: "fstat", scope: !627, file: !627, line: 467, type: !681, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !683)
!681 = !DISubroutineType(types: !682)
!682 = !{!261, !261, !630}
!683 = !{!684, !685}
!684 = !DILocalVariable(name: "__fd", arg: 1, scope: !680, file: !627, line: 467, type: !261)
!685 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !680, file: !627, line: 467, type: !630)
!686 = !DILocation(line: 0, scope: !680)
!687 = !DILocation(line: 469, column: 10, scope: !680)
!688 = !DILocation(line: 469, column: 3, scope: !680)
!689 = distinct !DISubprogram(name: "fstatat", scope: !627, file: !627, line: 474, type: !690, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !692)
!690 = !DISubroutineType(types: !691)
!691 = !{!261, !261, !266, !630, !261}
!692 = !{!693, !694, !695, !696}
!693 = !DILocalVariable(name: "__fd", arg: 1, scope: !689, file: !627, line: 474, type: !261)
!694 = !DILocalVariable(name: "__filename", arg: 2, scope: !689, file: !627, line: 474, type: !266)
!695 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !689, file: !627, line: 474, type: !630)
!696 = !DILocalVariable(name: "__flag", arg: 4, scope: !689, file: !627, line: 474, type: !261)
!697 = !DILocation(line: 0, scope: !689)
!698 = !DILocation(line: 477, column: 10, scope: !689)
!699 = !DILocation(line: 477, column: 3, scope: !689)
!700 = distinct !DISubprogram(name: "mknod", scope: !627, file: !627, line: 483, type: !701, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !703)
!701 = !DISubroutineType(types: !702)
!702 = !{!261, !266, !641, !635}
!703 = !{!704, !705, !706}
!704 = !DILocalVariable(name: "__path", arg: 1, scope: !700, file: !627, line: 483, type: !266)
!705 = !DILocalVariable(name: "__mode", arg: 2, scope: !700, file: !627, line: 483, type: !641)
!706 = !DILocalVariable(name: "__dev", arg: 3, scope: !700, file: !627, line: 483, type: !635)
!707 = !DILocation(line: 0, scope: !700)
!708 = !DILocation(line: 485, column: 10, scope: !700)
!709 = !DILocation(line: 485, column: 3, scope: !700)
!710 = distinct !DISubprogram(name: "mknodat", scope: !627, file: !627, line: 491, type: !711, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !713)
!711 = !DISubroutineType(types: !712)
!712 = !{!261, !261, !266, !641, !635}
!713 = !{!714, !715, !716, !717}
!714 = !DILocalVariable(name: "__fd", arg: 1, scope: !710, file: !627, line: 491, type: !261)
!715 = !DILocalVariable(name: "__path", arg: 2, scope: !710, file: !627, line: 491, type: !266)
!716 = !DILocalVariable(name: "__mode", arg: 3, scope: !710, file: !627, line: 491, type: !641)
!717 = !DILocalVariable(name: "__dev", arg: 4, scope: !710, file: !627, line: 491, type: !635)
!718 = !DILocation(line: 0, scope: !710)
!719 = !DILocation(line: 494, column: 10, scope: !710)
!720 = !DILocation(line: 494, column: 3, scope: !710)
!721 = distinct !DISubprogram(name: "stat64", scope: !627, file: !627, line: 502, type: !722, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !744)
!722 = !DISubroutineType(types: !723)
!723 = !{!261, !266, !724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !632, line: 119, size: 1152, elements: !726)
!726 = !{!727, !728, !730, !731, !732, !733, !734, !735, !736, !737, !738, !740, !741, !742, !743}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !725, file: !632, line: 121, baseType: !635, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !725, file: !632, line: 123, baseType: !729, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !375, line: 149, baseType: !398)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !725, file: !632, line: 124, baseType: !639, size: 64, offset: 128)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !725, file: !632, line: 125, baseType: !641, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !725, file: !632, line: 132, baseType: !643, size: 32, offset: 224)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !725, file: !632, line: 133, baseType: !645, size: 32, offset: 256)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !725, file: !632, line: 135, baseType: !261, size: 32, offset: 288)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !725, file: !632, line: 136, baseType: !635, size: 64, offset: 320)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !725, file: !632, line: 137, baseType: !374, size: 64, offset: 384)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !725, file: !632, line: 143, baseType: !650, size: 64, offset: 448)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !725, file: !632, line: 144, baseType: !739, size: 64, offset: 512)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !375, line: 180, baseType: !306)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !725, file: !632, line: 152, baseType: !654, size: 128, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !725, file: !632, line: 153, baseType: !654, size: 128, offset: 704)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !725, file: !632, line: 154, baseType: !654, size: 128, offset: 832)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !725, file: !632, line: 164, baseType: !664, size: 192, offset: 960)
!744 = !{!745, !746}
!745 = !DILocalVariable(name: "__path", arg: 1, scope: !721, file: !627, line: 502, type: !266)
!746 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !721, file: !627, line: 502, type: !724)
!747 = !DILocation(line: 0, scope: !721)
!748 = !DILocation(line: 504, column: 10, scope: !721)
!749 = !DILocation(line: 504, column: 3, scope: !721)
!750 = distinct !DISubprogram(name: "lstat64", scope: !627, file: !627, line: 509, type: !722, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !751)
!751 = !{!752, !753}
!752 = !DILocalVariable(name: "__path", arg: 1, scope: !750, file: !627, line: 509, type: !266)
!753 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !750, file: !627, line: 509, type: !724)
!754 = !DILocation(line: 0, scope: !750)
!755 = !DILocation(line: 511, column: 10, scope: !750)
!756 = !DILocation(line: 511, column: 3, scope: !750)
!757 = distinct !DISubprogram(name: "fstat64", scope: !627, file: !627, line: 516, type: !758, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !760)
!758 = !DISubroutineType(types: !759)
!759 = !{!261, !261, !724}
!760 = !{!761, !762}
!761 = !DILocalVariable(name: "__fd", arg: 1, scope: !757, file: !627, line: 516, type: !261)
!762 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !757, file: !627, line: 516, type: !724)
!763 = !DILocation(line: 0, scope: !757)
!764 = !DILocation(line: 518, column: 10, scope: !757)
!765 = !DILocation(line: 518, column: 3, scope: !757)
!766 = distinct !DISubprogram(name: "fstatat64", scope: !627, file: !627, line: 523, type: !767, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !769)
!767 = !DISubroutineType(types: !768)
!768 = !{!261, !261, !266, !724, !261}
!769 = !{!770, !771, !772, !773}
!770 = !DILocalVariable(name: "__fd", arg: 1, scope: !766, file: !627, line: 523, type: !261)
!771 = !DILocalVariable(name: "__filename", arg: 2, scope: !766, file: !627, line: 523, type: !266)
!772 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !766, file: !627, line: 523, type: !724)
!773 = !DILocalVariable(name: "__flag", arg: 4, scope: !766, file: !627, line: 523, type: !261)
!774 = !DILocation(line: 0, scope: !766)
!775 = !DILocation(line: 526, column: 10, scope: !766)
!776 = !DILocation(line: 526, column: 3, scope: !766)
!777 = distinct !DISubprogram(name: "sum_edge_counts", scope: !1, file: !1, line: 1372, type: !778, scopeLine: 1373, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1629)
!778 = !DISubroutineType(types: !779)
!779 = !{!305, !780}
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !4, line: 151, baseType: !782)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !4, line: 151, size: 128, elements: !783)
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !782, file: !4, line: 151, baseType: !785, size: 128)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !4, line: 150, baseType: !786)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !4, line: 150, size: 128, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !786, file: !4, line: 150, baseType: !5, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !786, file: !4, line: 150, baseType: !5, size: 32, offset: 32)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !786, file: !4, line: 150, baseType: !791, size: 64, offset: 64)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !792, size: 64, elements: !311)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !793, line: 108, baseType: !794)
!793 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !4, line: 122, size: 512, elements: !796)
!796 = !{!797, !845, !846, !851, !852, !1624, !1625, !1626, !1627, !1628}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !795, file: !4, line: 124, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !4, line: 217, size: 832, elements: !800)
!800 = !{!801, !802, !803, !804, !807, !813, !814, !815, !839, !840, !841, !842, !843, !844}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !799, file: !4, line: 219, baseType: !780, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !799, file: !4, line: 220, baseType: !780, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !799, file: !4, line: 223, baseType: !265, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !799, file: !4, line: 226, baseType: !805, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !4, line: 185, flags: DIFlagFwdDecl)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !799, file: !4, line: 229, baseType: !808, size: 128, offset: 256)
!808 = !DICompositeType(tag: DW_TAG_array_type, baseType: !809, size: 128, elements: !811)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !4, line: 229, flags: DIFlagFwdDecl)
!811 = !{!812}
!812 = !DISubrange(count: 2)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !799, file: !4, line: 232, baseType: !798, size: 64, offset: 384)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !799, file: !4, line: 233, baseType: !798, size: 64, offset: 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !799, file: !4, line: 238, baseType: !816, size: 64, offset: 512)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !4, line: 235, size: 64, elements: !817)
!817 = !{!818, !827}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !816, file: !4, line: 236, baseType: !819, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !4, line: 273, size: 128, elements: !821)
!821 = !{!822, !826}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !820, file: !4, line: 275, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !793, line: 66, baseType: !824)
!824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !793, line: 65, flags: DIFlagFwdDecl)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !820, file: !4, line: 278, baseType: !823, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !816, file: !4, line: 237, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !4, line: 259, size: 320, elements: !830)
!830 = !{!831, !835, !836, !837, !838}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !829, file: !4, line: 261, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !793, line: 50, baseType: !833)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !793, line: 49, flags: DIFlagFwdDecl)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !829, file: !4, line: 262, baseType: !832, size: 64, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !829, file: !4, line: 266, baseType: !832, size: 64, offset: 128)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !829, file: !4, line: 267, baseType: !832, size: 64, offset: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !829, file: !4, line: 270, baseType: !261, size: 32, offset: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !799, file: !4, line: 241, baseType: !305, size: 64, offset: 576)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !799, file: !4, line: 244, baseType: !261, size: 32, offset: 640)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !799, file: !4, line: 247, baseType: !261, size: 32, offset: 672)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !799, file: !4, line: 250, baseType: !261, size: 32, offset: 704)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !799, file: !4, line: 253, baseType: !261, size: 32, offset: 736)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !799, file: !4, line: 256, baseType: !261, size: 32, offset: 768)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !795, file: !4, line: 125, baseType: !798, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !795, file: !4, line: 131, baseType: !847, size: 64, offset: 128)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !4, line: 128, size: 64, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !847, file: !4, line: 129, baseType: !823, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !847, file: !4, line: 130, baseType: !832, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !795, file: !4, line: 134, baseType: !265, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !795, file: !4, line: 137, baseType: !853, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !793, line: 56, baseType: !854)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !21, line: 3371, size: 1792, elements: !856)
!856 = !{!857, !890, !896, !907, !914, !921, !926, !932, !938, !951, !963, !1001, !1006, !1034, !1042, !1043, !1048, !1057, !1063, !1068, !1072, !1076, !1249, !1298, !1304, !1311, !1318, !1344, !1369, !1386, !1398, !1420, !1435, !1606}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !855, file: !21, line: 3372, baseType: !858, size: 64)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !21, line: 360, size: 64, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !858, file: !21, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !858, file: !21, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !858, file: !21, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !858, file: !21, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !858, file: !21, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !858, file: !21, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !858, file: !21, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !858, file: !21, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !858, file: !21, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !858, file: !21, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !858, file: !21, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !858, file: !21, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !858, file: !21, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !858, file: !21, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !858, file: !21, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !858, file: !21, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !858, file: !21, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !858, file: !21, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !858, file: !21, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !858, file: !21, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !858, file: !21, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !858, file: !21, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !858, file: !21, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !858, file: !21, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !858, file: !21, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !858, file: !21, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !858, file: !21, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !858, file: !21, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !858, file: !21, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !858, file: !21, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !21, line: 3373, baseType: !891, size: 192)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !21, line: 402, size: 192, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !891, file: !21, line: 403, baseType: !858, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !891, file: !21, line: 404, baseType: !853, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !891, file: !21, line: 405, baseType: !853, size: 64, offset: 128)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !855, file: !21, line: 3374, baseType: !897, size: 320)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !21, line: 1384, size: 320, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !21, line: 1385, baseType: !891, size: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !897, file: !21, line: 1386, baseType: !901, size: 128, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !902, line: 58, baseType: !903)
!902 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !902, line: 54, size: 128, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !903, file: !902, line: 56, baseType: !398, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !903, file: !902, line: 57, baseType: !306, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !855, file: !21, line: 3375, baseType: !908, size: 256)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !21, line: 1397, size: 256, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !908, file: !21, line: 1398, baseType: !891, size: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !908, file: !21, line: 1399, baseType: !912, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !21, line: 1392, flags: DIFlagFwdDecl)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !855, file: !21, line: 3376, baseType: !915, size: 256)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !21, line: 1408, size: 256, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !915, file: !21, line: 1409, baseType: !891, size: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !915, file: !21, line: 1410, baseType: !919, size: 64, offset: 192)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !21, line: 1403, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !855, file: !21, line: 3377, baseType: !922, size: 256)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !21, line: 1437, size: 256, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !922, file: !21, line: 1438, baseType: !891, size: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !922, file: !21, line: 1439, baseType: !853, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !855, file: !21, line: 3378, baseType: !927, size: 256)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !21, line: 1418, size: 256, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !21, line: 1419, baseType: !891, size: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !927, file: !21, line: 1420, baseType: !261, size: 32, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !927, file: !21, line: 1421, baseType: !381, size: 8, offset: 224)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !855, file: !21, line: 3379, baseType: !933, size: 320)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !21, line: 1428, size: 320, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !21, line: 1429, baseType: !891, size: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !933, file: !21, line: 1430, baseType: !853, size: 64, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !933, file: !21, line: 1431, baseType: !853, size: 64, offset: 256)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !855, file: !21, line: 3380, baseType: !939, size: 320)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !21, line: 1460, size: 320, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !939, file: !21, line: 1461, baseType: !891, size: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !939, file: !21, line: 1462, baseType: !943, size: 128, offset: 192)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !944, line: 31, size: 128, elements: !945)
!944 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!945 = !{!946, !949, !950}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !943, file: !944, line: 32, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !260)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !943, file: !944, line: 33, baseType: !5, size: 32, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !943, file: !944, line: 34, baseType: !5, size: 32, offset: 96)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !855, file: !21, line: 3381, baseType: !952, size: 384)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !21, line: 2507, size: 384, elements: !953)
!953 = !{!954, !955, !960, !961, !962}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !21, line: 2508, baseType: !891, size: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !952, file: !21, line: 2509, baseType: !956, size: 32, offset: 192)
!956 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !957, line: 58, baseType: !958)
!957 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !959, line: 44, baseType: !5)
!959 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!960 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !952, file: !21, line: 2510, baseType: !5, size: 32, offset: 224)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !952, file: !21, line: 2511, baseType: !853, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !952, file: !21, line: 2512, baseType: !853, size: 64, offset: 320)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !855, file: !21, line: 3382, baseType: !964, size: 896)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !21, line: 2652, size: 896, elements: !965)
!965 = !{!966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !21, line: 2653, baseType: !952, size: 384)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !964, file: !21, line: 2654, baseType: !853, size: 64, offset: 384)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !964, file: !21, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !964, file: !21, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !964, file: !21, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !964, file: !21, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !964, file: !21, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !964, file: !21, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !964, file: !21, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !964, file: !21, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !964, file: !21, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !964, file: !21, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !964, file: !21, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !964, file: !21, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !964, file: !21, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !964, file: !21, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !964, file: !21, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !964, file: !21, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !964, file: !21, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !964, file: !21, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !964, file: !21, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !964, file: !21, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !964, file: !21, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !964, file: !21, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !964, file: !21, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !964, file: !21, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !964, file: !21, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !964, file: !21, line: 2703, baseType: !5, size: 32, offset: 512)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !964, file: !21, line: 2705, baseType: !853, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !964, file: !21, line: 2706, baseType: !853, size: 64, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !964, file: !21, line: 2707, baseType: !853, size: 64, offset: 704)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !964, file: !21, line: 2708, baseType: !853, size: 64, offset: 768)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !964, file: !21, line: 2711, baseType: !999, size: 64, offset: 832)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !21, line: 2711, flags: DIFlagFwdDecl)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !855, file: !21, line: 3383, baseType: !1002, size: 960)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !21, line: 2756, size: 960, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1002, file: !21, line: 2757, baseType: !964, size: 896)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1002, file: !21, line: 2758, baseType: !832, size: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !855, file: !21, line: 3384, baseType: !1007, size: 1472)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !21, line: 3114, size: 1472, elements: !1008)
!1008 = !{!1009, !1030, !1031, !1032, !1033}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !21, line: 3115, baseType: !1010, size: 1216)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !21, line: 2984, size: 1216, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1010, file: !21, line: 2985, baseType: !1002, size: 960)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1010, file: !21, line: 2986, baseType: !853, size: 64, offset: 960)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1010, file: !21, line: 2987, baseType: !853, size: 64, offset: 1024)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1010, file: !21, line: 2988, baseType: !853, size: 64, offset: 1088)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1010, file: !21, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1010, file: !21, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1010, file: !21, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1010, file: !21, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1010, file: !21, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1010, file: !21, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1010, file: !21, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1010, file: !21, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1010, file: !21, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1010, file: !21, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1010, file: !21, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1010, file: !21, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1010, file: !21, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1010, file: !21, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1007, file: !21, line: 3117, baseType: !853, size: 64, offset: 1216)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1007, file: !21, line: 3119, baseType: !853, size: 64, offset: 1280)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1007, file: !21, line: 3121, baseType: !853, size: 64, offset: 1344)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1007, file: !21, line: 3123, baseType: !853, size: 64, offset: 1408)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !855, file: !21, line: 3385, baseType: !1035, size: 1088)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !21, line: 2874, size: 1088, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !21, line: 2875, baseType: !1002, size: 960)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1035, file: !21, line: 2876, baseType: !832, size: 64, offset: 960)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1035, file: !21, line: 2877, baseType: !1040, size: 64, offset: 1024)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !21, line: 2856, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !855, file: !21, line: 3386, baseType: !1010, size: 1216)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !855, file: !21, line: 3387, baseType: !1044, size: 1280)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !21, line: 3093, size: 1280, elements: !1045)
!1045 = !{!1046, !1047}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1044, file: !21, line: 3094, baseType: !1010, size: 1216)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1044, file: !21, line: 3095, baseType: !1040, size: 64, offset: 1216)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !855, file: !21, line: 3388, baseType: !1049, size: 1216)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !21, line: 2824, size: 1216, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1049, file: !21, line: 2825, baseType: !964, size: 896)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1049, file: !21, line: 2827, baseType: !853, size: 64, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1049, file: !21, line: 2828, baseType: !853, size: 64, offset: 960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1049, file: !21, line: 2829, baseType: !853, size: 64, offset: 1024)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1049, file: !21, line: 2830, baseType: !853, size: 64, offset: 1088)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1049, file: !21, line: 2831, baseType: !853, size: 64, offset: 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !855, file: !21, line: 3389, baseType: !1058, size: 1024)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !21, line: 2850, size: 1024, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !21, line: 2851, baseType: !1002, size: 960)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1058, file: !21, line: 2852, baseType: !261, size: 32, offset: 960)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1058, file: !21, line: 2853, baseType: !261, size: 32, offset: 992)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !855, file: !21, line: 3390, baseType: !1064, size: 1024)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !21, line: 2857, size: 1024, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1064, file: !21, line: 2858, baseType: !1002, size: 960)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1064, file: !21, line: 2859, baseType: !1040, size: 64, offset: 960)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !855, file: !21, line: 3391, baseType: !1069, size: 960)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !21, line: 2862, size: 960, elements: !1070)
!1070 = !{!1071}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1069, file: !21, line: 2863, baseType: !1002, size: 960)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !855, file: !21, line: 3392, baseType: !1073, size: 1472)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !21, line: 3304, size: 1472, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !21, line: 3305, baseType: !1007, size: 1472)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !855, file: !21, line: 3393, baseType: !1077, size: 1792)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !21, line: 3248, size: 1792, elements: !1078)
!1078 = !{!1079, !1080, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1077, file: !21, line: 3249, baseType: !1007, size: 1472)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1077, file: !21, line: 3251, baseType: !1081, size: 64, offset: 1472)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1083, line: 463, size: 1152, elements: !1084)
!1083 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1084 = !{!1085, !1088, !1119, !1120, !1123, !1126, !1171, !1172, !1173, !1174, !1175, !1201, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1082, file: !1083, line: 464, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1083, line: 464, flags: DIFlagFwdDecl)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1082, file: !1083, line: 467, baseType: !1089, size: 64, offset: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !4, line: 374, size: 640, elements: !1091)
!1091 = !{!1092, !1094, !1095, !1108, !1109, !1110, !1111, !1112, !1113, !1115, !1117, !1118}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1090, file: !4, line: 377, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !793, line: 111, baseType: !798)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1090, file: !4, line: 378, baseType: !1093, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1090, file: !4, line: 381, baseType: !1096, size: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !4, line: 282, baseType: !1098)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !4, line: 282, size: 128, elements: !1099)
!1099 = !{!1100}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1098, file: !4, line: 282, baseType: !1101, size: 128)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !4, line: 281, baseType: !1102)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !4, line: 281, size: 128, elements: !1103)
!1103 = !{!1104, !1105, !1106}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1102, file: !4, line: 281, baseType: !5, size: 32)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1102, file: !4, line: 281, baseType: !5, size: 32, offset: 32)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1102, file: !4, line: 281, baseType: !1107, size: 64, offset: 64)
!1107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1093, size: 64, elements: !311)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1090, file: !4, line: 384, baseType: !261, size: 32, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1090, file: !4, line: 387, baseType: !261, size: 32, offset: 224)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1090, file: !4, line: 390, baseType: !261, size: 32, offset: 256)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1090, file: !4, line: 394, baseType: !1096, size: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1090, file: !4, line: 396, baseType: !3, size: 32, offset: 384)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1090, file: !4, line: 399, baseType: !1114, size: 64, offset: 416)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 64, elements: !811)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1090, file: !4, line: 402, baseType: !1116, size: 64, offset: 480)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !811)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1090, file: !4, line: 406, baseType: !261, size: 32, offset: 544)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1090, file: !4, line: 409, baseType: !261, size: 32, offset: 576)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1082, file: !1083, line: 470, baseType: !824, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1082, file: !1083, line: 473, baseType: !1121, size: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1083, line: 166, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1082, file: !1083, line: 476, baseType: !1124, size: 64, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1083, line: 476, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1082, file: !1083, line: 479, baseType: !1127, size: 64, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1128, line: 144, baseType: !1129)
!1128 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1128, line: 100, size: 896, elements: !1131)
!1131 = !{!1132, !1138, !1140, !1145, !1147, !1148, !1149, !1150, !1151, !1152, !1157, !1159, !1160, !1165, !1170}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1130, file: !1128, line: 102, baseType: !1133, size: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1128, line: 52, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!1137, !525}
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1128, line: 47, baseType: !5)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1130, file: !1128, line: 105, baseType: !1139, size: 64, offset: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1128, line: 59, baseType: !528)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1130, file: !1128, line: 108, baseType: !1141, size: 64, offset: 128)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1128, line: 63, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DISubroutineType(types: !1144)
!1144 = !{null, !265}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1130, file: !1128, line: 111, baseType: !1146, size: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1130, file: !1128, line: 114, baseType: !396, size: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1130, file: !1128, line: 117, baseType: !396, size: 64, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1130, file: !1128, line: 120, baseType: !396, size: 64, offset: 384)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1130, file: !1128, line: 124, baseType: !5, size: 32, offset: 448)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1130, file: !1128, line: 128, baseType: !5, size: 32, offset: 480)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1130, file: !1128, line: 131, baseType: !1153, size: 64, offset: 512)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1128, line: 75, baseType: !1154)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = !DISubroutineType(types: !1156)
!1156 = !{!265, !396, !396}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1130, file: !1128, line: 132, baseType: !1158, size: 64, offset: 576)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1128, line: 78, baseType: !1142)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1130, file: !1128, line: 135, baseType: !265, size: 64, offset: 640)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1130, file: !1128, line: 136, baseType: !1161, size: 64, offset: 704)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1128, line: 82, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DISubroutineType(types: !1164)
!1164 = !{!265, !265, !396, !396}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1130, file: !1128, line: 137, baseType: !1166, size: 64, offset: 768)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1128, line: 83, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DISubroutineType(types: !1169)
!1169 = !{null, !265, !265}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1130, file: !1128, line: 141, baseType: !5, size: 32, offset: 832)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1082, file: !1083, line: 484, baseType: !853, size: 64, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1082, file: !1083, line: 488, baseType: !853, size: 64, offset: 448)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1082, file: !1083, line: 493, baseType: !853, size: 64, offset: 512)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1082, file: !1083, line: 496, baseType: !853, size: 64, offset: 576)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1082, file: !1083, line: 501, baseType: !1176, size: 64, offset: 640)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !16, line: 2355, size: 576, elements: !1178)
