; ModuleID = 'md5.bc'
source_filename = "md5.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.md5_ctx = type { i32, i32, i32, i32, [2 x i32], i32, [128 x i8] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@fillbuf = internal constant <{ i8, [63 x i8] }> <{ i8 -128, [63 x i8] zeroinitializer }>, align 16, !dbg !0

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @atoi(i8* %__nptr) local_unnamed_addr #0 !dbg !34 {
entry:
  call void @llvm.dbg.value(metadata i8* %__nptr, metadata !39, metadata !DIExpression()), !dbg !40
  %call = tail call i64 @strtol(i8* %__nptr, i8** null, i32 10) #6, !dbg !41
  %conv = trunc i64 %call to i32, !dbg !42
  ret i32 %conv, !dbg !43
}

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1

declare dso_local i64 @strtol(i8*, i8**, i32) local_unnamed_addr #2


!34 = distinct !DISubprogram(name: "atoi", scope: !35, file: !35, line: 361, type: !36, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !38)
!35 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!36 = !DISubroutineType(types: !37)
!37 = !{!6, !11}
!38 = !{!39}
!39 = !DILocalVariable(name: "__nptr", arg: 1, scope: !34, file: !35, line: 361, type: !11)
!40 = !DILocation(line: 0, scope: !34)
!41 = !DILocation(line: 363, column: 16, scope: !34)
!42 = !DILocation(line: 363, column: 10, scope: !34)
!43 = !DILocation(line: 363, column: 3, scope: !34)
!44 = distinct !DISubprogram(name: "atol", scope: !35, file: !35, line: 366, type: !45, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !48)
!45 = !DISubroutineType(types: !46)
!46 = !{!47, !11}
!47 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!48 = !{!49}
!49 = !DILocalVariable(name: "__nptr", arg: 1, scope: !44, file: !35, line: 366, type: !11)
!50 = !DILocation(line: 0, scope: !44)
!51 = !DILocation(line: 368, column: 10, scope: !44)
!52 = !DILocation(line: 368, column: 3, scope: !44)
!53 = distinct !DISubprogram(name: "atoll", scope: !35, file: !35, line: 373, type: !54, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !57)
!54 = !DISubroutineType(types: !55)
!55 = !{!56, !11}
!56 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!57 = !{!58}
!58 = !DILocalVariable(name: "__nptr", arg: 1, scope: !53, file: !35, line: 373, type: !11)
!59 = !DILocation(line: 0, scope: !53)
!60 = !DILocation(line: 375, column: 10, scope: !53)
!61 = !DILocation(line: 375, column: 3, scope: !53)
!62 = distinct !DISubprogram(name: "bsearch", scope: !63, file: !63, line: 20, type: !64, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !72)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!64 = !DISubroutineType(types: !65)
!65 = !{!10, !19, !19, !66, !66, !68}
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 46, baseType: !22)
!67 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !35, line: 808, baseType: !69)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DISubroutineType(types: !71)
!71 = !{!6, !19, !19}
!72 = !{!73, !74, !75, !76, !77, !78, !79, !80, !81, !82}
!73 = !DILocalVariable(name: "__key", arg: 1, scope: !62, file: !63, line: 20, type: !19)
!74 = !DILocalVariable(name: "__base", arg: 2, scope: !62, file: !63, line: 20, type: !19)
!75 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !62, file: !63, line: 20, type: !66)
!76 = !DILocalVariable(name: "__size", arg: 4, scope: !62, file: !63, line: 20, type: !66)
!77 = !DILocalVariable(name: "__compar", arg: 5, scope: !62, file: !63, line: 21, type: !68)
!78 = !DILocalVariable(name: "__l", scope: !62, file: !63, line: 23, type: !66)
!79 = !DILocalVariable(name: "__u", scope: !62, file: !63, line: 23, type: !66)
!80 = !DILocalVariable(name: "__idx", scope: !62, file: !63, line: 23, type: !66)
!81 = !DILocalVariable(name: "__p", scope: !62, file: !63, line: 24, type: !19)
!82 = !DILocalVariable(name: "__comparison", scope: !62, file: !63, line: 25, type: !6)
!83 = !DILocation(line: 0, scope: !62)
!84 = !DILocation(line: 29, column: 3, scope: !62)
!85 = !DILocation(line: 27, column: 7, scope: !62)
!86 = !DILocation(line: 29, column: 14, scope: !62)
!87 = !DILocation(line: 31, column: 20, scope: !88)
!88 = distinct !DILexicalBlock(scope: !62, file: !63, line: 30, column: 5)
!89 = !DILocation(line: 31, column: 27, scope: !88)
!90 = !DILocation(line: 32, column: 56, scope: !88)
!91 = !DILocation(line: 32, column: 47, scope: !88)
!92 = !DILocation(line: 33, column: 22, scope: !88)
!93 = !DILocation(line: 34, column: 24, scope: !94)
!94 = distinct !DILexicalBlock(scope: !88, file: !63, line: 34, column: 11)
!95 = !DILocation(line: 34, column: 11, scope: !88)
!96 = !DILocation(line: 36, column: 29, scope: !97)
!97 = distinct !DILexicalBlock(scope: !94, file: !63, line: 36, column: 16)
!98 = !DILocation(line: 36, column: 16, scope: !94)
!99 = !DILocation(line: 37, column: 14, scope: !97)
!100 = distinct !{!100, !84, !101}
!101 = !DILocation(line: 40, column: 5, scope: !62)
!102 = !DILocation(line: 43, column: 1, scope: !62)
!103 = distinct !DISubprogram(name: "atof", scope: !104, file: !104, line: 25, type: !105, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !108)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!105 = !DISubroutineType(types: !106)
!106 = !{!107, !11}
!107 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!108 = !{!109}
!109 = !DILocalVariable(name: "__nptr", arg: 1, scope: !103, file: !104, line: 25, type: !11)
!110 = !DILocation(line: 0, scope: !103)
!111 = !DILocation(line: 27, column: 10, scope: !103)
!112 = !DILocation(line: 27, column: 3, scope: !103)
!113 = distinct !DISubprogram(name: "vprintf", scope: !114, file: !114, line: 39, type: !115, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !125)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!115 = !DISubroutineType(types: !116)
!116 = !{!6, !117, !118}
!117 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 28, size: 192, elements: !120)
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !119, file: !3, line: 28, baseType: !17, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !119, file: !3, line: 28, baseType: !17, size: 32, offset: 32)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !119, file: !3, line: 28, baseType: !10, size: 64, offset: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !119, file: !3, line: 28, baseType: !10, size: 64, offset: 128)
!125 = !{!126, !127}
!126 = !DILocalVariable(name: "__fmt", arg: 1, scope: !113, file: !114, line: 39, type: !117)
!127 = !DILocalVariable(name: "__arg", arg: 2, scope: !113, file: !114, line: 39, type: !118)
!128 = !DILocation(line: 0, scope: !113)
!129 = !DILocation(line: 41, column: 20, scope: !113)
!130 = !DILocation(line: 41, column: 10, scope: !113)
!131 = !DILocation(line: 41, column: 3, scope: !113)
!132 = distinct !DISubprogram(name: "getchar", scope: !114, file: !114, line: 47, type: !133, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!133 = !DISubroutineType(types: !134)
!134 = !{!6}
!135 = !DILocation(line: 49, column: 16, scope: !132)
!136 = !DILocation(line: 49, column: 10, scope: !132)
!137 = !DILocation(line: 49, column: 3, scope: !132)
!138 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !114, file: !114, line: 56, type: !139, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !196)
!139 = !DISubroutineType(types: !140)
!140 = !{!6, !141}
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !143, line: 7, baseType: !144)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !145, line: 49, size: 1728, elements: !146)
!145 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!146 = !{!147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !162, !164, !165, !166, !169, !171, !173, !177, !180, !182, !185, !188, !189, !190, !191, !192}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !144, file: !145, line: 51, baseType: !6, size: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !144, file: !145, line: 54, baseType: !8, size: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !144, file: !145, line: 55, baseType: !8, size: 64, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !144, file: !145, line: 56, baseType: !8, size: 64, offset: 192)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !144, file: !145, line: 57, baseType: !8, size: 64, offset: 256)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !144, file: !145, line: 58, baseType: !8, size: 64, offset: 320)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !144, file: !145, line: 59, baseType: !8, size: 64, offset: 384)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !144, file: !145, line: 60, baseType: !8, size: 64, offset: 448)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !144, file: !145, line: 61, baseType: !8, size: 64, offset: 512)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !144, file: !145, line: 64, baseType: !8, size: 64, offset: 576)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !144, file: !145, line: 65, baseType: !8, size: 64, offset: 640)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !144, file: !145, line: 66, baseType: !8, size: 64, offset: 704)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !144, file: !145, line: 68, baseType: !160, size: 64, offset: 768)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !145, line: 36, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !144, file: !145, line: 70, baseType: !163, size: 64, offset: 832)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !144, file: !145, line: 72, baseType: !6, size: 32, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !144, file: !145, line: 73, baseType: !6, size: 32, offset: 928)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !144, file: !145, line: 74, baseType: !167, size: 64, offset: 960)
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !168, line: 152, baseType: !47)
!168 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !144, file: !145, line: 77, baseType: !170, size: 16, offset: 1024)
!170 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !144, file: !145, line: 78, baseType: !172, size: 8, offset: 1040)
!172 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !144, file: !145, line: 79, baseType: !174, size: 8, offset: 1048)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 1)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !144, file: !145, line: 81, baseType: !178, size: 64, offset: 1088)
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !145, line: 43, baseType: null)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !144, file: !145, line: 89, baseType: !181, size: 64, offset: 1152)
!181 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !168, line: 153, baseType: !47)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !144, file: !145, line: 91, baseType: !183, size: 64, offset: 1216)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !145, line: 37, flags: DIFlagFwdDecl)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !144, file: !145, line: 92, baseType: !186, size: 64, offset: 1280)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !145, line: 38, flags: DIFlagFwdDecl)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !144, file: !145, line: 93, baseType: !163, size: 64, offset: 1344)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !144, file: !145, line: 94, baseType: !10, size: 64, offset: 1408)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !144, file: !145, line: 95, baseType: !66, size: 64, offset: 1472)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !144, file: !145, line: 96, baseType: !6, size: 32, offset: 1536)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !144, file: !145, line: 98, baseType: !193, size: 160, offset: 1568)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 20)
!196 = !{!197}
!197 = !DILocalVariable(name: "__fp", arg: 1, scope: !138, file: !114, line: 56, type: !141)
!198 = !DILocation(line: 0, scope: !138)
!199 = !DILocation(line: 58, column: 10, scope: !138)
!200 = !DILocation(line: 58, column: 3, scope: !138)
!201 = distinct !DISubprogram(name: "getc_unlocked", scope: !114, file: !114, line: 66, type: !139, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !202)
!202 = !{!203}
!203 = !DILocalVariable(name: "__fp", arg: 1, scope: !201, file: !114, line: 66, type: !141)
!204 = !DILocation(line: 0, scope: !201)
!205 = !DILocation(line: 68, column: 10, scope: !201)
!206 = !DILocation(line: 68, column: 3, scope: !201)
!207 = distinct !DISubprogram(name: "getchar_unlocked", scope: !114, file: !114, line: 73, type: !133, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!208 = !DILocation(line: 75, column: 10, scope: !207)
!209 = !DILocation(line: 75, column: 3, scope: !207)
!210 = distinct !DISubprogram(name: "putchar", scope: !114, file: !114, line: 82, type: !211, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !213)
!211 = !DISubroutineType(types: !212)
!212 = !{!6, !6}
!213 = !{!214}
!214 = !DILocalVariable(name: "__c", arg: 1, scope: !210, file: !114, line: 82, type: !6)
!215 = !DILocation(line: 0, scope: !210)
!216 = !DILocation(line: 84, column: 21, scope: !210)
!217 = !DILocation(line: 84, column: 10, scope: !210)
!218 = !DILocation(line: 84, column: 3, scope: !210)
!219 = distinct !DISubprogram(name: "fputc_unlocked", scope: !114, file: !114, line: 91, type: !220, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !222)
!220 = !DISubroutineType(types: !221)
!221 = !{!6, !6, !141}
!222 = !{!223, !224}
!223 = !DILocalVariable(name: "__c", arg: 1, scope: !219, file: !114, line: 91, type: !6)
!224 = !DILocalVariable(name: "__stream", arg: 2, scope: !219, file: !114, line: 91, type: !141)
!225 = !DILocation(line: 0, scope: !219)
!226 = !DILocation(line: 93, column: 10, scope: !219)
!227 = !DILocation(line: 93, column: 3, scope: !219)
!228 = distinct !DISubprogram(name: "putc_unlocked", scope: !114, file: !114, line: 101, type: !220, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !229)
!229 = !{!230, !231}
!230 = !DILocalVariable(name: "__c", arg: 1, scope: !228, file: !114, line: 101, type: !6)
!231 = !DILocalVariable(name: "__stream", arg: 2, scope: !228, file: !114, line: 101, type: !141)
!232 = !DILocation(line: 0, scope: !228)
!233 = !DILocation(line: 103, column: 10, scope: !228)
!234 = !DILocation(line: 103, column: 3, scope: !228)
!235 = distinct !DISubprogram(name: "putchar_unlocked", scope: !114, file: !114, line: 108, type: !211, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !236)
!236 = !{!237}
!237 = !DILocalVariable(name: "__c", arg: 1, scope: !235, file: !114, line: 108, type: !6)
!238 = !DILocation(line: 0, scope: !235)
!239 = !DILocation(line: 110, column: 10, scope: !235)
!240 = !DILocation(line: 110, column: 3, scope: !235)
!241 = distinct !DISubprogram(name: "getline", scope: !114, file: !114, line: 118, type: !242, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !246)
!242 = !DISubroutineType(types: !243)
!243 = !{!244, !7, !245, !141}
!244 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !168, line: 193, baseType: !47)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!246 = !{!247, !248, !249}
!247 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !241, file: !114, line: 118, type: !7)
!248 = !DILocalVariable(name: "__n", arg: 2, scope: !241, file: !114, line: 118, type: !245)
!249 = !DILocalVariable(name: "__stream", arg: 3, scope: !241, file: !114, line: 118, type: !141)
!250 = !DILocation(line: 0, scope: !241)
!251 = !DILocation(line: 120, column: 10, scope: !241)
!252 = !DILocation(line: 120, column: 3, scope: !241)
!253 = distinct !DISubprogram(name: "feof_unlocked", scope: !114, file: !114, line: 128, type: !139, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!254 = !{!255}
!255 = !DILocalVariable(name: "__stream", arg: 1, scope: !253, file: !114, line: 128, type: !141)
!256 = !DILocation(line: 0, scope: !253)
!257 = !DILocation(line: 130, column: 10, scope: !253)
!258 = !DILocation(line: 130, column: 3, scope: !253)
!259 = distinct !DISubprogram(name: "ferror_unlocked", scope: !114, file: !114, line: 135, type: !139, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!260 = !{!261}
!261 = !DILocalVariable(name: "__stream", arg: 1, scope: !259, file: !114, line: 135, type: !141)
!262 = !DILocation(line: 0, scope: !259)
!263 = !DILocation(line: 137, column: 10, scope: !259)
!264 = !DILocation(line: 137, column: 3, scope: !259)
!265 = distinct !DISubprogram(name: "md5_init_ctx", scope: !3, file: !3, line: 65, type: !266, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !284)
!266 = !DISubroutineType(types: !267)
!267 = !{null, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "md5_ctx", file: !16, line: 80, size: 1248, elements: !270)
!270 = !{!271, !272, !273, !274, !275, !279, !280}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !269, file: !16, line: 82, baseType: !15, size: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !269, file: !16, line: 83, baseType: !15, size: 32, offset: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !269, file: !16, line: 84, baseType: !15, size: 32, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !269, file: !16, line: 85, baseType: !15, size: 32, offset: 96)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !269, file: !16, line: 87, baseType: !276, size: 64, offset: 128)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 64, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 2)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !269, file: !16, line: 88, baseType: !15, size: 32, offset: 192)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !269, file: !16, line: 89, baseType: !281, size: 1024, offset: 224)
!281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1024, elements: !282)
!282 = !{!283}
!283 = !DISubrange(count: 128)
!284 = !{!285}
!285 = !DILocalVariable(name: "ctx", arg: 1, scope: !265, file: !3, line: 65, type: !268)
!286 = !DILocation(line: 0, scope: !265)
!287 = !DILocation(line: 67, column: 8, scope: !265)
!288 = !DILocation(line: 67, column: 10, scope: !265)
!289 = !DILocation(line: 68, column: 8, scope: !265)
!290 = !DILocation(line: 68, column: 10, scope: !265)
!291 = !DILocation(line: 69, column: 8, scope: !265)
!292 = !DILocation(line: 69, column: 10, scope: !265)
!293 = !DILocation(line: 70, column: 8, scope: !265)
!294 = !DILocation(line: 70, column: 10, scope: !265)
!295 = !DILocation(line: 72, column: 19, scope: !265)
!296 = !DILocation(line: 72, column: 33, scope: !265)
!297 = !DILocation(line: 72, column: 3, scope: !265)
!298 = !DILocation(line: 72, column: 17, scope: !265)
!299 = !DILocation(line: 73, column: 8, scope: !265)
!300 = !DILocation(line: 73, column: 15, scope: !265)
!301 = !DILocation(line: 74, column: 1, scope: !265)
!302 = distinct !DISubprogram(name: "md5_read_ctx", scope: !3, file: !3, line: 82, type: !303, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !307)
!303 = !DISubroutineType(types: !304)
!304 = !{!10, !305, !10}
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !269)
!307 = !{!308, !309}
!308 = !DILocalVariable(name: "ctx", arg: 1, scope: !302, file: !3, line: 82, type: !305)
!309 = !DILocalVariable(name: "resbuf", arg: 2, scope: !302, file: !3, line: 82, type: !10)
!310 = !DILocation(line: 0, scope: !302)
!311 = !DILocation(line: 84, column: 32, scope: !302)
!312 = !DILocation(line: 84, column: 4, scope: !302)
!313 = !DILocation(line: 84, column: 30, scope: !302)
!314 = !DILocation(line: 85, column: 32, scope: !302)
!315 = !DILocation(line: 85, column: 3, scope: !302)
!316 = !DILocation(line: 85, column: 30, scope: !302)
!317 = !DILocation(line: 86, column: 32, scope: !302)
!318 = !DILocation(line: 86, column: 3, scope: !302)
!319 = !DILocation(line: 86, column: 30, scope: !302)
!320 = !DILocation(line: 87, column: 32, scope: !302)
!321 = !DILocation(line: 87, column: 3, scope: !302)
!322 = !DILocation(line: 87, column: 30, scope: !302)
!323 = !DILocation(line: 89, column: 3, scope: !302)
!324 = distinct !DISubprogram(name: "md5_finish_ctx", scope: !3, file: !3, line: 98, type: !325, scopeLine: 99, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !327)
!325 = !DISubroutineType(types: !326)
!326 = !{!10, !268, !10}
!327 = !{!328, !329, !330, !331}
!328 = !DILocalVariable(name: "ctx", arg: 1, scope: !324, file: !3, line: 98, type: !268)
!329 = !DILocalVariable(name: "resbuf", arg: 2, scope: !324, file: !3, line: 98, type: !10)
!330 = !DILocalVariable(name: "bytes", scope: !324, file: !3, line: 101, type: !15)
!331 = !DILocalVariable(name: "pad", scope: !324, file: !3, line: 102, type: !66)
!332 = !DILocation(line: 0, scope: !324)
!333 = !DILocation(line: 101, column: 27, scope: !324)
!334 = !DILocation(line: 105, column: 3, scope: !324)
!335 = !DILocation(line: 105, column: 17, scope: !324)
!336 = !DILocation(line: 106, column: 21, scope: !337)
!337 = distinct !DILexicalBlock(scope: !324, file: !3, line: 106, column: 7)
!338 = !DILocation(line: 106, column: 7, scope: !324)
!339 = !DILocation(line: 107, column: 7, scope: !337)
!340 = !DILocation(line: 107, column: 5, scope: !337)
!341 = !DILocation(line: 109, column: 15, scope: !324)
!342 = !DILocation(line: 109, column: 9, scope: !324)
!343 = !DILocation(line: 110, column: 12, scope: !324)
!344 = !DILocation(line: 110, column: 3, scope: !324)
!345 = !DILocation(line: 113, column: 47, scope: !324)
