; ModuleID = 'mkstemps.bc'
source_filename = "mkstemps.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.timeval = type { i64, i64 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@mkstemps.letters = internal unnamed_addr constant [63 x i8] c"abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789\00", align 16, !dbg !0
@mkstemps.value = internal unnamed_addr global i64 0, align 8, !dbg !21
@.str = private unnamed_addr constant [7 x i8] c"XXXXXX\00", align 1

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @atoi(i8* %__nptr) local_unnamed_addr #0 !dbg !54 {
entry:
  call void @llvm.dbg.value(metadata i8* %__nptr, metadata !59, metadata !DIExpression()), !dbg !60
  %call = tail call i64 @strtol(i8* %__nptr, i8** null, i32 10) #6, !dbg !61
  %conv = trunc i64 %call to i32, !dbg !62
  ret i32 %conv, !dbg !63
}


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "letters", scope: !2, file: !3, line: 80, type: !47, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "mkstemps", scope: !3, file: !3, line: 78, type: !4, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !23)
!3 = !DIFile(filename: "mkstemps.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !7, !6}
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !10, retainedTypes: !11, globals: !20, nameTableKind: None)
!10 = !{}
!11 = !{!6, !12, !13, !14, !16, !17, !18}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcc_uint64_t", file: !3, line: 43, baseType: !19)
!19 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!20 = !{!0, !21}
!21 = !DIGlobalVariableExpression(var: !22, expr: !DIExpression())
!22 = distinct !DIGlobalVariable(name: "value", scope: !2, file: !3, line: 82, type: !18, isLocal: true, isDefinition: true)
!23 = !{!24, !25, !26, !36, !37, !41, !42, !46}
!24 = !DILocalVariable(name: "pattern", arg: 1, scope: !2, file: !3, line: 78, type: !7)
!25 = !DILocalVariable(name: "suffix_len", arg: 2, scope: !2, file: !3, line: 78, type: !6)
!26 = !DILocalVariable(name: "tv", scope: !2, file: !3, line: 84, type: !27)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !28, line: 8, size: 128, elements: !29)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timeval.h", directory: "")
!29 = !{!30, !34}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !27, file: !28, line: 10, baseType: !31, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !32, line: 160, baseType: !33)
!32 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!33 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !27, file: !28, line: 11, baseType: !35, size: 64, offset: 64)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !32, line: 162, baseType: !33)
!36 = !DILocalVariable(name: "XXXXXX", scope: !2, file: !3, line: 86, type: !7)
!37 = !DILocalVariable(name: "len", scope: !2, file: !3, line: 87, type: !38)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DILocalVariable(name: "count", scope: !2, file: !3, line: 88, type: !6)
!42 = !DILocalVariable(name: "v", scope: !43, file: !3, line: 110, type: !18)
!43 = distinct !DILexicalBlock(scope: !44, file: !3, line: 109, column: 5)
!44 = distinct !DILexicalBlock(scope: !45, file: !3, line: 108, column: 3)
!45 = distinct !DILexicalBlock(scope: !2, file: !3, line: 108, column: 3)
!46 = !DILocalVariable(name: "fd", scope: !43, file: !3, line: 111, type: !6)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 504, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 63)
!50 = !{i32 2, !"Dwarf Version", i32 4}
!51 = !{i32 2, !"Debug Info Version", i32 3}
!52 = !{i32 1, !"wchar_size", i32 4}
!53 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!54 = distinct !DISubprogram(name: "atoi", scope: !55, file: !55, line: 361, type: !56, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !58)
!55 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!56 = !DISubroutineType(types: !57)
!57 = !{!6, !14}
!58 = !{!59}
!59 = !DILocalVariable(name: "__nptr", arg: 1, scope: !54, file: !55, line: 361, type: !14)
!60 = !DILocation(line: 0, scope: !54)
!61 = !DILocation(line: 363, column: 16, scope: !54)
!62 = !DILocation(line: 363, column: 10, scope: !54)
!63 = !DILocation(line: 363, column: 3, scope: !54)
!64 = distinct !DISubprogram(name: "atol", scope: !55, file: !55, line: 366, type: !65, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !67)
!65 = !DISubroutineType(types: !66)
!66 = !{!33, !14}
!67 = !{!68}
!68 = !DILocalVariable(name: "__nptr", arg: 1, scope: !64, file: !55, line: 366, type: !14)
!69 = !DILocation(line: 0, scope: !64)
!70 = !DILocation(line: 368, column: 10, scope: !64)
!71 = !DILocation(line: 368, column: 3, scope: !64)
!72 = distinct !DISubprogram(name: "atoll", scope: !55, file: !55, line: 373, type: !73, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !76)
!73 = !DISubroutineType(types: !74)
!74 = !{!75, !14}
!75 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!76 = !{!77}
!77 = !DILocalVariable(name: "__nptr", arg: 1, scope: !72, file: !55, line: 373, type: !14)
!78 = !DILocation(line: 0, scope: !72)
!79 = !DILocation(line: 375, column: 10, scope: !72)
!80 = !DILocation(line: 375, column: 3, scope: !72)
!81 = distinct !DISubprogram(name: "bsearch", scope: !82, file: !82, line: 20, type: !83, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !91)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!83 = !DISubroutineType(types: !84)
!84 = !{!13, !85, !85, !38, !38, !87}
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !55, line: 808, baseType: !88)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DISubroutineType(types: !90)
!90 = !{!6, !85, !85}
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!92 = !DILocalVariable(name: "__key", arg: 1, scope: !81, file: !82, line: 20, type: !85)
!93 = !DILocalVariable(name: "__base", arg: 2, scope: !81, file: !82, line: 20, type: !85)
!94 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !81, file: !82, line: 20, type: !38)
!95 = !DILocalVariable(name: "__size", arg: 4, scope: !81, file: !82, line: 20, type: !38)
!96 = !DILocalVariable(name: "__compar", arg: 5, scope: !81, file: !82, line: 21, type: !87)
!97 = !DILocalVariable(name: "__l", scope: !81, file: !82, line: 23, type: !38)
!98 = !DILocalVariable(name: "__u", scope: !81, file: !82, line: 23, type: !38)
!99 = !DILocalVariable(name: "__idx", scope: !81, file: !82, line: 23, type: !38)
!100 = !DILocalVariable(name: "__p", scope: !81, file: !82, line: 24, type: !85)
!101 = !DILocalVariable(name: "__comparison", scope: !81, file: !82, line: 25, type: !6)
!102 = !DILocation(line: 0, scope: !81)
!103 = !DILocation(line: 29, column: 3, scope: !81)
!104 = !DILocation(line: 27, column: 7, scope: !81)
!105 = !DILocation(line: 29, column: 14, scope: !81)
!106 = !DILocation(line: 31, column: 20, scope: !107)
!107 = distinct !DILexicalBlock(scope: !81, file: !82, line: 30, column: 5)
!108 = !DILocation(line: 31, column: 27, scope: !107)
!109 = !DILocation(line: 32, column: 56, scope: !107)
!110 = !DILocation(line: 32, column: 47, scope: !107)
!111 = !DILocation(line: 33, column: 22, scope: !107)
!112 = !DILocation(line: 34, column: 24, scope: !113)
!113 = distinct !DILexicalBlock(scope: !107, file: !82, line: 34, column: 11)
!114 = !DILocation(line: 34, column: 11, scope: !107)
!115 = !DILocation(line: 36, column: 29, scope: !116)
!116 = distinct !DILexicalBlock(scope: !113, file: !82, line: 36, column: 16)
!117 = !DILocation(line: 36, column: 16, scope: !113)
!118 = !DILocation(line: 37, column: 14, scope: !116)
!119 = distinct !{!119, !103, !120}
!120 = !DILocation(line: 40, column: 5, scope: !81)
!121 = !DILocation(line: 43, column: 1, scope: !81)
!122 = distinct !DISubprogram(name: "atof", scope: !123, file: !123, line: 25, type: !124, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !127)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !14}
!126 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!127 = !{!128}
!128 = !DILocalVariable(name: "__nptr", arg: 1, scope: !122, file: !123, line: 25, type: !14)
!129 = !DILocation(line: 0, scope: !122)
!130 = !DILocation(line: 27, column: 10, scope: !122)
!131 = !DILocation(line: 27, column: 3, scope: !122)
!132 = distinct !DISubprogram(name: "vprintf", scope: !133, file: !133, line: 39, type: !134, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !145)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!6, !136, !137}
!136 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !14)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !138, size: 64)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, line: 28, size: 192, elements: !139)
!139 = !{!140, !142, !143, !144}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !138, file: !3, line: 28, baseType: !141, size: 32)
!141 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !138, file: !3, line: 28, baseType: !141, size: 32, offset: 32)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !138, file: !3, line: 28, baseType: !13, size: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !138, file: !3, line: 28, baseType: !13, size: 64, offset: 128)
!145 = !{!146, !147}
!146 = !DILocalVariable(name: "__fmt", arg: 1, scope: !132, file: !133, line: 39, type: !136)
!147 = !DILocalVariable(name: "__arg", arg: 2, scope: !132, file: !133, line: 39, type: !137)
!148 = !DILocation(line: 0, scope: !132)
!149 = !DILocation(line: 41, column: 20, scope: !132)
!150 = !DILocation(line: 41, column: 10, scope: !132)
!151 = !DILocation(line: 41, column: 3, scope: !132)
!152 = distinct !DISubprogram(name: "getchar", scope: !133, file: !133, line: 47, type: !153, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !10)
!153 = !DISubroutineType(types: !154)
!154 = !{!6}
!155 = !DILocation(line: 49, column: 16, scope: !152)
!156 = !DILocation(line: 49, column: 10, scope: !152)
!157 = !DILocation(line: 49, column: 3, scope: !152)
!158 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !133, file: !133, line: 56, type: !159, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !215)
!159 = !DISubroutineType(types: !160)
!160 = !{!6, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !163, line: 7, baseType: !164)
!163 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !165, line: 49, size: 1728, elements: !166)
!165 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !182, !184, !185, !186, !188, !190, !192, !196, !199, !201, !204, !207, !208, !209, !210, !211}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !164, file: !165, line: 51, baseType: !6, size: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !164, file: !165, line: 54, baseType: !7, size: 64, offset: 64)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !164, file: !165, line: 55, baseType: !7, size: 64, offset: 128)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !164, file: !165, line: 56, baseType: !7, size: 64, offset: 192)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !164, file: !165, line: 57, baseType: !7, size: 64, offset: 256)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !164, file: !165, line: 58, baseType: !7, size: 64, offset: 320)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !164, file: !165, line: 59, baseType: !7, size: 64, offset: 384)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !164, file: !165, line: 60, baseType: !7, size: 64, offset: 448)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !164, file: !165, line: 61, baseType: !7, size: 64, offset: 512)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !164, file: !165, line: 64, baseType: !7, size: 64, offset: 576)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !164, file: !165, line: 65, baseType: !7, size: 64, offset: 640)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !164, file: !165, line: 66, baseType: !7, size: 64, offset: 704)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !164, file: !165, line: 68, baseType: !180, size: 64, offset: 768)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !165, line: 36, flags: DIFlagFwdDecl)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !164, file: !165, line: 70, baseType: !183, size: 64, offset: 832)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !164, file: !165, line: 72, baseType: !6, size: 32, offset: 896)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !164, file: !165, line: 73, baseType: !6, size: 32, offset: 928)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !164, file: !165, line: 74, baseType: !187, size: 64, offset: 960)
!187 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !32, line: 152, baseType: !33)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !164, file: !165, line: 77, baseType: !189, size: 16, offset: 1024)
!189 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !164, file: !165, line: 78, baseType: !191, size: 8, offset: 1040)
!191 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !164, file: !165, line: 79, baseType: !193, size: 8, offset: 1048)
!193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !194)
!194 = !{!195}
!195 = !DISubrange(count: 1)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !164, file: !165, line: 81, baseType: !197, size: 64, offset: 1088)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !165, line: 43, baseType: null)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !164, file: !165, line: 89, baseType: !200, size: 64, offset: 1152)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !32, line: 153, baseType: !33)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !164, file: !165, line: 91, baseType: !202, size: 64, offset: 1216)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !203, size: 64)
!203 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !165, line: 37, flags: DIFlagFwdDecl)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !164, file: !165, line: 92, baseType: !205, size: 64, offset: 1280)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !165, line: 38, flags: DIFlagFwdDecl)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !164, file: !165, line: 93, baseType: !183, size: 64, offset: 1344)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !164, file: !165, line: 94, baseType: !13, size: 64, offset: 1408)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !164, file: !165, line: 95, baseType: !38, size: 64, offset: 1472)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !164, file: !165, line: 96, baseType: !6, size: 32, offset: 1536)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !164, file: !165, line: 98, baseType: !212, size: 160, offset: 1568)
!212 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !213)
!213 = !{!214}
!214 = !DISubrange(count: 20)
!215 = !{!216}
!216 = !DILocalVariable(name: "__fp", arg: 1, scope: !158, file: !133, line: 56, type: !161)
!217 = !DILocation(line: 0, scope: !158)
!218 = !DILocation(line: 58, column: 10, scope: !158)
!219 = !DILocation(line: 58, column: 3, scope: !158)
!220 = distinct !DISubprogram(name: "getc_unlocked", scope: !133, file: !133, line: 66, type: !159, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !221)
!221 = !{!222}
!222 = !DILocalVariable(name: "__fp", arg: 1, scope: !220, file: !133, line: 66, type: !161)
!223 = !DILocation(line: 0, scope: !220)
!224 = !DILocation(line: 68, column: 10, scope: !220)
!225 = !DILocation(line: 68, column: 3, scope: !220)
!226 = distinct !DISubprogram(name: "getchar_unlocked", scope: !133, file: !133, line: 73, type: !153, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !10)
!227 = !DILocation(line: 75, column: 10, scope: !226)
!228 = !DILocation(line: 75, column: 3, scope: !226)
!229 = distinct !DISubprogram(name: "putchar", scope: !133, file: !133, line: 82, type: !230, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !232)
!230 = !DISubroutineType(types: !231)
!231 = !{!6, !6}
!232 = !{!233}
!233 = !DILocalVariable(name: "__c", arg: 1, scope: !229, file: !133, line: 82, type: !6)
!234 = !DILocation(line: 0, scope: !229)
!235 = !DILocation(line: 84, column: 21, scope: !229)
!236 = !DILocation(line: 84, column: 10, scope: !229)
!237 = !DILocation(line: 84, column: 3, scope: !229)
!238 = distinct !DISubprogram(name: "fputc_unlocked", scope: !133, file: !133, line: 91, type: !239, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !241)
!239 = !DISubroutineType(types: !240)
!240 = !{!6, !6, !161}
!241 = !{!242, !243}
!242 = !DILocalVariable(name: "__c", arg: 1, scope: !238, file: !133, line: 91, type: !6)
!243 = !DILocalVariable(name: "__stream", arg: 2, scope: !238, file: !133, line: 91, type: !161)
!244 = !DILocation(line: 0, scope: !238)
!245 = !DILocation(line: 93, column: 10, scope: !238)
!246 = !DILocation(line: 93, column: 3, scope: !238)
!247 = distinct !DISubprogram(name: "putc_unlocked", scope: !133, file: !133, line: 101, type: !239, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !248)
!248 = !{!249, !250}
!249 = !DILocalVariable(name: "__c", arg: 1, scope: !247, file: !133, line: 101, type: !6)
!250 = !DILocalVariable(name: "__stream", arg: 2, scope: !247, file: !133, line: 101, type: !161)
!251 = !DILocation(line: 0, scope: !247)
!252 = !DILocation(line: 103, column: 10, scope: !247)
!253 = !DILocation(line: 103, column: 3, scope: !247)
!254 = distinct !DISubprogram(name: "putchar_unlocked", scope: !133, file: !133, line: 108, type: !230, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !255)
!255 = !{!256}
!256 = !DILocalVariable(name: "__c", arg: 1, scope: !254, file: !133, line: 108, type: !6)
!257 = !DILocation(line: 0, scope: !254)
!258 = !DILocation(line: 110, column: 10, scope: !254)
!259 = !DILocation(line: 110, column: 3, scope: !254)
!260 = distinct !DISubprogram(name: "getline", scope: !133, file: !133, line: 118, type: !261, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !9, retainedNodes: !265)
!261 = !DISubroutineType(types: !262)
!262 = !{!263, !12, !264, !161}
!263 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !32, line: 193, baseType: !33)
