; ModuleID = 'mode-switching.bc'
source_filename = "mode-switching.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!676 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!677 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!678 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!679 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!680 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!681 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!682 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!683 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!684 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!685 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!686 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!687 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!688 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!689 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!690 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!691 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!692 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!693 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!694 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!695 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!696 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!697 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!698 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!700 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!701 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!702 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !561, line: 836, baseType: !7, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736}
!705 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!706 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!709 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!710 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!711 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!712 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!713 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!714 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!715 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!716 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!717 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!718 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!719 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!720 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!721 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!722 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!723 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!724 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!725 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!726 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!727 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!737 = !{!738, !739, !740, !741, !744, !745, !747, !1829, !560, !703, !189, !7, !756, !751, !826, !1832}
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!740 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !743)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bb_info", file: !3, line: 81, size: 128, elements: !749)
!749 = !{!750, !1831}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "seginfo", scope: !748, file: !3, line: 83, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "seginfo", file: !3, line: 72, size: 320, elements: !753)
!753 = !{!754, !755, !1826, !1827, !1828}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !752, file: !3, line: 74, baseType: !740, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "insn_ptr", scope: !752, file: !3, line: 75, baseType: !756, size: 64, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !757, line: 50, baseType: !758)
!757 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !759, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !759, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !759, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !759, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !759, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !759, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !759, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !759, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !759, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !759, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !759, file: !561, line: 321, baseType: !772, size: 320, offset: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !773)
!773 = !{!774, !1761, !1763, !1824, !1825}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !772, file: !561, line: 316, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 64, elements: !791)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !793, !794, !806, !809, !871, !1739, !1740, !1751, !1758}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !777, file: !561, line: 168, baseType: !740, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !777, file: !561, line: 169, baseType: !7, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !777, file: !561, line: 170, baseType: !745, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !777, file: !561, line: 171, baseType: !756, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !777, file: !561, line: 172, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !757, line: 53, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !786, file: !561, line: 360, baseType: !740, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !786, file: !561, line: 361, baseType: !790, size: 64, offset: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 64, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 1)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !777, file: !561, line: 173, baseType: !189, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !777, file: !561, line: 174, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !796, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !796, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !796, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !796, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !796, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !796, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !796, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !796, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !777, file: !561, line: 175, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !777, file: !561, line: 176, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !812, line: 75, size: 256, elements: !813)
!812 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!813 = !{!814, !829, !830, !831}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !811, file: !812, line: 76, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !812, line: 68, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !812, line: 63, size: 320, elements: !818)
!818 = !{!819, !821, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !817, file: !812, line: 64, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !817, file: !812, line: 65, baseType: !820, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !817, file: !812, line: 66, baseType: !7, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !817, file: !812, line: 67, baseType: !824, size: 128, offset: 192)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 128, elements: !827)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !812, line: 29, baseType: !826)
!826 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!827 = !{!828}
!828 = !DISubrange(count: 2)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !811, file: !812, line: 77, baseType: !815, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !811, file: !812, line: 78, baseType: !7, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !811, file: !812, line: 79, baseType: !832, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !812, line: 49, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !812, line: 45, size: 832, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !834, file: !812, line: 46, baseType: !820, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !834, file: !812, line: 47, baseType: !810, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !834, file: !812, line: 48, baseType: !839, size: 704, offset: 128)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !840, line: 164, size: 704, elements: !841)
!840 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!841 = !{!842, !844, !854, !855, !856, !857, !858, !859, !863, !867, !868, !869, !870}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !839, file: !840, line: 166, baseType: !843, size: 64)
!843 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !839, file: !840, line: 167, baseType: !845, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !840, line: 157, size: 192, elements: !847)
!847 = !{!848, !849, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !846, file: !840, line: 159, baseType: !742, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !846, file: !840, line: 160, baseType: !845, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !846, file: !840, line: 161, baseType: !851, size: 32, offset: 128)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 32, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 4)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !839, file: !840, line: 168, baseType: !742, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !839, file: !840, line: 169, baseType: !742, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !839, file: !840, line: 170, baseType: !742, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !839, file: !840, line: 171, baseType: !843, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !839, file: !840, line: 172, baseType: !740, size: 32, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !839, file: !840, line: 176, baseType: !860, size: 64, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!845, !744, !843}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !839, file: !840, line: 177, baseType: !864, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !744, !845}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !839, file: !840, line: 178, baseType: !744, size: 64, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !839, file: !840, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !839, file: !840, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !839, file: !840, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !777, file: !561, line: 177, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !757, line: 56, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !875)
!875 = !{!876, !909, !915, !926, !945, !956, !961, !968, !974, !987, !999, !1037, !1042, !1070, !1078, !1079, !1084, !1093, !1099, !1104, !1108, !1112, !1363, !1412, !1418, !1425, !1432, !1458, !1483, !1500, !1512, !1534, !1549, !1721}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !874, file: !334, line: 3372, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !877, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !877, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !877, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !877, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !877, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !877, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !877, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !877, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !877, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !877, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !877, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !877, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !877, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !877, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !877, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !877, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !877, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !877, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !877, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !877, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !877, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !877, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !877, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !877, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !877, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !877, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !877, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !877, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !877, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !877, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !874, file: !334, line: 3373, baseType: !910, size: 192)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !910, file: !334, line: 403, baseType: !877, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !910, file: !334, line: 404, baseType: !872, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !910, file: !334, line: 405, baseType: !872, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !874, file: !334, line: 3374, baseType: !916, size: 320)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !916, file: !334, line: 1385, baseType: !910, size: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !916, file: !334, line: 1386, baseType: !920, size: 128, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !921, line: 58, baseType: !922)
!921 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !921, line: 54, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !922, file: !921, line: 56, baseType: !826, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !922, file: !921, line: 57, baseType: !843, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !874, file: !334, line: 3375, baseType: !927, size: 256)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !334, line: 1398, baseType: !910, size: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !927, file: !334, line: 1399, baseType: !931, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !933, line: 52, size: 256, elements: !934)
!933 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!934 = !{!935, !936, !937, !938, !939, !940, !941}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !932, file: !933, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !932, file: !933, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !932, file: !933, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !932, file: !933, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !932, file: !933, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !932, file: !933, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !932, file: !933, line: 62, baseType: !942, size: 192, offset: 64)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 192, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 3)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !874, file: !334, line: 3376, baseType: !946, size: 256)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !946, file: !334, line: 1409, baseType: !910, size: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !946, file: !334, line: 1410, baseType: !950, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !952, line: 27, size: 192, elements: !953)
!952 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !951, file: !952, line: 29, baseType: !920, size: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !951, file: !952, line: 30, baseType: !189, size: 32, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !874, file: !334, line: 3377, baseType: !957, size: 256)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !334, line: 1438, baseType: !910, size: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !957, file: !334, line: 1439, baseType: !872, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !874, file: !334, line: 3378, baseType: !962, size: 256)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !963)
!963 = !{!964, !965, !966}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !334, line: 1419, baseType: !910, size: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !962, file: !334, line: 1420, baseType: !740, size: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !962, file: !334, line: 1421, baseType: !967, size: 8, offset: 224)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 8, elements: !791)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !874, file: !334, line: 3379, baseType: !969, size: 320)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !334, line: 1429, baseType: !910, size: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !969, file: !334, line: 1430, baseType: !872, size: 64, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !969, file: !334, line: 1431, baseType: !872, size: 64, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !874, file: !334, line: 3380, baseType: !975, size: 320)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !975, file: !334, line: 1461, baseType: !910, size: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !975, file: !334, line: 1462, baseType: !979, size: 128, offset: 192)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !980, line: 31, size: 128, elements: !981)
!980 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!981 = !{!982, !985, !986}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !979, file: !980, line: 32, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !979, file: !980, line: 33, baseType: !7, size: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !979, file: !980, line: 34, baseType: !7, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !874, file: !334, line: 3381, baseType: !988, size: 384)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !989)
!989 = !{!990, !991, !996, !997, !998}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !334, line: 2508, baseType: !910, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !988, file: !334, line: 2509, baseType: !992, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !993, line: 58, baseType: !994)
!993 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !995, line: 44, baseType: !7)
!995 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !988, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !334, line: 2511, baseType: !872, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !988, file: !334, line: 2512, baseType: !872, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !874, file: !334, line: 3382, baseType: !1000, size: 896)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !334, line: 2653, baseType: !988, size: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1000, file: !334, line: 2654, baseType: !872, size: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1000, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1000, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1000, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1000, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1000, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1000, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1000, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1000, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1000, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1000, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1000, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1000, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1000, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1000, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1000, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1000, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1000, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1000, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1000, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1000, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1000, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1000, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1000, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1000, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1000, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1000, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1000, file: !334, line: 2705, baseType: !872, size: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1000, file: !334, line: 2706, baseType: !872, size: 64, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1000, file: !334, line: 2707, baseType: !872, size: 64, offset: 704)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1000, file: !334, line: 2708, baseType: !872, size: 64, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1000, file: !334, line: 2711, baseType: !1035, size: 64, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !874, file: !334, line: 3383, baseType: !1038, size: 960)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1038, file: !334, line: 2757, baseType: !1000, size: 896)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1038, file: !334, line: 2758, baseType: !756, size: 64, offset: 896)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !874, file: !334, line: 3384, baseType: !1043, size: 1472)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1044)
!1044 = !{!1045, !1066, !1067, !1068, !1069}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1043, file: !334, line: 3115, baseType: !1046, size: 1216)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1046, file: !334, line: 2985, baseType: !1038, size: 960)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1046, file: !334, line: 2986, baseType: !872, size: 64, offset: 960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1046, file: !334, line: 2987, baseType: !872, size: 64, offset: 1024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1046, file: !334, line: 2988, baseType: !872, size: 64, offset: 1088)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1046, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1046, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1046, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1046, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1046, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1046, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1046, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1046, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1046, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1046, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1046, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1046, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1046, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1046, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1043, file: !334, line: 3117, baseType: !872, size: 64, offset: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1043, file: !334, line: 3119, baseType: !872, size: 64, offset: 1280)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1043, file: !334, line: 3121, baseType: !872, size: 64, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1043, file: !334, line: 3123, baseType: !872, size: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !874, file: !334, line: 3385, baseType: !1071, size: 1088)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !334, line: 2875, baseType: !1038, size: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1071, file: !334, line: 2876, baseType: !756, size: 64, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1071, file: !334, line: 2877, baseType: !1076, size: 64, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !334, line: 2856, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !874, file: !334, line: 3386, baseType: !1046, size: 1216)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !874, file: !334, line: 3387, baseType: !1080, size: 1280)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1080, file: !334, line: 3094, baseType: !1046, size: 1216)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1080, file: !334, line: 3095, baseType: !1076, size: 64, offset: 1216)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !874, file: !334, line: 3388, baseType: !1085, size: 1216)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !334, line: 2825, baseType: !1000, size: 896)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1085, file: !334, line: 2827, baseType: !872, size: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1085, file: !334, line: 2828, baseType: !872, size: 64, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1085, file: !334, line: 2829, baseType: !872, size: 64, offset: 1024)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1085, file: !334, line: 2830, baseType: !872, size: 64, offset: 1088)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1085, file: !334, line: 2831, baseType: !872, size: 64, offset: 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !874, file: !334, line: 3389, baseType: !1094, size: 1024)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1094, file: !334, line: 2851, baseType: !1038, size: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1094, file: !334, line: 2852, baseType: !740, size: 32, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1094, file: !334, line: 2853, baseType: !740, size: 32, offset: 992)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !874, file: !334, line: 3390, baseType: !1100, size: 1024)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !334, line: 2858, baseType: !1038, size: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1100, file: !334, line: 2859, baseType: !1076, size: 64, offset: 960)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !874, file: !334, line: 3391, baseType: !1105, size: 960)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1106)
!1106 = !{!1107}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !334, line: 2863, baseType: !1038, size: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !874, file: !334, line: 3392, baseType: !1109, size: 1472)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1110)
!1110 = !{!1111}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !334, line: 3305, baseType: !1043, size: 1472)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !874, file: !334, line: 3393, baseType: !1113, size: 1792)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1114)
!1114 = !{!1115, !1116, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1113, file: !334, line: 3249, baseType: !1043, size: 1472)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1113, file: !334, line: 3251, baseType: !1117, size: 64, offset: 1472)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1119, line: 463, size: 1152, elements: !1120)
!1119 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1120 = !{!1121, !1124, !1228, !1229, !1232, !1235, !1287, !1288, !1289, !1290, !1291, !1315, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1118, file: !1119, line: 464, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1119, line: 464, flags: DIFlagFwdDecl)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1118, file: !1119, line: 467, baseType: !1125, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1127)
!1127 = !{!1128, !1203, !1204, !1217, !1218, !1219, !1220, !1221, !1222, !1224, !1226, !1227}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1126, file: !318, line: 377, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !757, line: 111, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1132)
!1132 = !{!1133, !1168, !1169, !1170, !1173, !1177, !1178, !1179, !1197, !1198, !1199, !1200, !1201, !1202}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1131, file: !318, line: 219, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1137)
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1136, file: !318, line: 151, baseType: !1139, size: 128)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1141)
!1141 = !{!1142, !1143, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1140, file: !318, line: 150, baseType: !7, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1140, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1140, file: !318, line: 150, baseType: !1145, size: 64, offset: 64)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 64, elements: !791)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !757, line: 108, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1160, !1161, !1162, !1163, !1164, !1165, !1166}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1148, file: !318, line: 124, baseType: !1130, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1148, file: !318, line: 125, baseType: !1130, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1148, file: !318, line: 131, baseType: !1153, size: 64, offset: 128)
!1153 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1154)
!1154 = !{!1155, !1159}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1153, file: !318, line: 129, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !757, line: 66, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !757, line: 65, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1153, file: !318, line: 130, baseType: !756, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1148, file: !318, line: 134, baseType: !744, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1148, file: !318, line: 137, baseType: !872, size: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1148, file: !318, line: 138, baseType: !992, size: 32, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1148, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1148, file: !318, line: 144, baseType: !740, size: 32, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1148, file: !318, line: 145, baseType: !740, size: 32, offset: 416)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1148, file: !318, line: 146, baseType: !1167, size: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !843)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1131, file: !318, line: 220, baseType: !1134, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1131, file: !318, line: 223, baseType: !744, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1131, file: !318, line: 226, baseType: !1171, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1131, file: !318, line: 229, baseType: !1174, size: 128, offset: 256)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 128, elements: !827)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1131, file: !318, line: 232, baseType: !1130, size: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1131, file: !318, line: 233, baseType: !1130, size: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1131, file: !318, line: 238, baseType: !1180, size: 64, offset: 512)
!1180 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1181)
!1181 = !{!1182, !1188}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1180, file: !318, line: 236, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1185)
!1185 = !{!1186, !1187}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1184, file: !318, line: 275, baseType: !1156, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1184, file: !318, line: 278, baseType: !1156, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1180, file: !318, line: 237, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1190, file: !318, line: 261, baseType: !756, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1190, file: !318, line: 262, baseType: !756, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1190, file: !318, line: 266, baseType: !756, size: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1190, file: !318, line: 267, baseType: !756, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1190, file: !318, line: 270, baseType: !740, size: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1131, file: !318, line: 241, baseType: !1167, size: 64, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1131, file: !318, line: 244, baseType: !740, size: 32, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1131, file: !318, line: 247, baseType: !740, size: 32, offset: 672)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1131, file: !318, line: 250, baseType: !740, size: 32, offset: 704)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1131, file: !318, line: 253, baseType: !740, size: 32, offset: 736)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1131, file: !318, line: 256, baseType: !740, size: 32, offset: 768)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1126, file: !318, line: 378, baseType: !1129, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1126, file: !318, line: 381, baseType: !1205, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1208)
!1208 = !{!1209}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1207, file: !318, line: 282, baseType: !1210, size: 128)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1211, file: !318, line: 281, baseType: !7, size: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1211, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1211, file: !318, line: 281, baseType: !1216, size: 64, offset: 64)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 64, elements: !791)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1126, file: !318, line: 384, baseType: !740, size: 32, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1126, file: !318, line: 387, baseType: !740, size: 32, offset: 224)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1126, file: !318, line: 390, baseType: !740, size: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1126, file: !318, line: 394, baseType: !1205, size: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1126, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1126, file: !318, line: 399, baseType: !1223, size: 64, offset: 416)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !827)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1126, file: !318, line: 402, baseType: !1225, size: 64, offset: 480)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !827)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1126, file: !318, line: 406, baseType: !740, size: 32, offset: 544)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1126, file: !318, line: 409, baseType: !740, size: 32, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1118, file: !1119, line: 470, baseType: !1157, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1118, file: !1119, line: 473, baseType: !1230, size: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1119, line: 166, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1118, file: !1119, line: 476, baseType: !1233, size: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1119, line: 476, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1118, file: !1119, line: 479, baseType: !1236, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1237, line: 144, baseType: !1238)
!1237 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1237, line: 100, size: 896, elements: !1240)
!1240 = !{!1241, !1249, !1254, !1259, !1261, !1264, !1265, !1266, !1267, !1268, !1273, !1275, !1276, !1281, !1286}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1239, file: !1237, line: 102, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1237, line: 52, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{!1246, !1247}
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1237, line: 47, baseType: !7)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1239, file: !1237, line: 105, baseType: !1250, size: 64, offset: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1237, line: 59, baseType: !1251)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DISubroutineType(types: !1253)
!1253 = !{!740, !1247, !1247}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1239, file: !1237, line: 108, baseType: !1255, size: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1237, line: 63, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{null, !744}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1239, file: !1237, line: 111, baseType: !1260, size: 64, offset: 192)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1239, file: !1237, line: 114, baseType: !1262, size: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1263, line: 46, baseType: !826)
!1263 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1239, file: !1237, line: 117, baseType: !1262, size: 64, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1239, file: !1237, line: 120, baseType: !1262, size: 64, offset: 384)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1239, file: !1237, line: 124, baseType: !7, size: 32, offset: 448)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1239, file: !1237, line: 128, baseType: !7, size: 32, offset: 480)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1239, file: !1237, line: 131, baseType: !1269, size: 64, offset: 512)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1237, line: 75, baseType: !1270)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{!744, !1262, !1262}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1239, file: !1237, line: 132, baseType: !1274, size: 64, offset: 576)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1237, line: 78, baseType: !1256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1239, file: !1237, line: 135, baseType: !744, size: 64, offset: 640)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1239, file: !1237, line: 136, baseType: !1277, size: 64, offset: 704)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1237, line: 82, baseType: !1278)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DISubroutineType(types: !1280)
!1280 = !{!744, !744, !1262, !1262}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1239, file: !1237, line: 137, baseType: !1282, size: 64, offset: 768)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1237, line: 83, baseType: !1283)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{null, !744, !744}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1239, file: !1237, line: 141, baseType: !7, size: 32, offset: 832)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1118, file: !1119, line: 484, baseType: !872, size: 64, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1118, file: !1119, line: 488, baseType: !872, size: 64, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1118, file: !1119, line: 493, baseType: !872, size: 64, offset: 512)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1118, file: !1119, line: 496, baseType: !872, size: 64, offset: 576)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1118, file: !1119, line: 501, baseType: !1292, size: 64, offset: 640)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1294)
!1294 = !{!1295, !1298, !1299, !1300, !1301, !1303, !1304, !1309, !1310, !1311, !1312, !1313, !1314}
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1293, file: !329, line: 2356, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1293, file: !329, line: 2357, baseType: !745, size: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1293, file: !329, line: 2358, baseType: !740, size: 32, offset: 128)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1293, file: !329, line: 2359, baseType: !740, size: 32, offset: 160)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1293, file: !329, line: 2360, baseType: !1302, size: 128, offset: 192)
!1302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !740, size: 128, elements: !852)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1293, file: !329, line: 2364, baseType: !740, size: 32, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1293, file: !329, line: 2367, baseType: !1305, size: 128, offset: 384)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1306)
!1306 = !{!1307, !1308}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1305, file: !329, line: 2351, baseType: !756, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1305, file: !329, line: 2352, baseType: !843, size: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1293, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1293, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1293, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1293, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1293, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1293, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1118, file: !1119, line: 504, baseType: !1316, size: 64, offset: 704)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1119, line: 504, flags: DIFlagFwdDecl)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1118, file: !1119, line: 507, baseType: !1236, size: 64, offset: 768)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1118, file: !1119, line: 510, baseType: !740, size: 32, offset: 832)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1118, file: !1119, line: 513, baseType: !740, size: 32, offset: 864)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1118, file: !1119, line: 516, baseType: !992, size: 32, offset: 896)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1118, file: !1119, line: 519, baseType: !992, size: 32, offset: 928)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1118, file: !1119, line: 522, baseType: !7, size: 32, offset: 960)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1118, file: !1119, line: 523, baseType: !7, size: 32, offset: 992)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1118, file: !1119, line: 528, baseType: !745, size: 64, offset: 1024)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1118, file: !1119, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1118, file: !1119, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1118, file: !1119, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1118, file: !1119, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1118, file: !1119, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1118, file: !1119, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1118, file: !1119, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1118, file: !1119, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1118, file: !1119, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1118, file: !1119, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1118, file: !1119, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1118, file: !1119, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1118, file: !1119, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1118, file: !1119, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1118, file: !1119, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1118, file: !1119, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1113, file: !334, line: 3254, baseType: !872, size: 64, offset: 1536)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1113, file: !334, line: 3257, baseType: !872, size: 64, offset: 1600)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1113, file: !334, line: 3258, baseType: !872, size: 64, offset: 1664)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1113, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1113, file: !334, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1113, file: !334, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1113, file: !334, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1113, file: !334, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1113, file: !334, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1113, file: !334, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1113, file: !334, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1113, file: !334, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1113, file: !334, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1113, file: !334, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1113, file: !334, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1113, file: !334, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1113, file: !334, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1113, file: !334, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1113, file: !334, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1113, file: !334, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1113, file: !334, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !874, file: !334, line: 3394, baseType: !1364, size: 1344)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !334, line: 2279, size: 1344, elements: !1365)
!1365 = !{!1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1391, !1392, !1393, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1364, file: !334, line: 2280, baseType: !910, size: 192)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1364, file: !334, line: 2281, baseType: !872, size: 64, offset: 192)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1364, file: !334, line: 2282, baseType: !872, size: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1364, file: !334, line: 2283, baseType: !872, size: 64, offset: 320)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1364, file: !334, line: 2284, baseType: !872, size: 64, offset: 384)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1364, file: !334, line: 2285, baseType: !7, size: 32, offset: 448)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1364, file: !334, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1364, file: !334, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1364, file: !334, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1364, file: !334, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1364, file: !334, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1364, file: !334, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1364, file: !334, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1364, file: !334, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1364, file: !334, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1364, file: !334, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1364, file: !334, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1364, file: !334, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1364, file: !334, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1364, file: !334, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1364, file: !334, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1364, file: !334, line: 2305, baseType: !7, size: 32, offset: 512)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1364, file: !334, line: 2306, baseType: !1389, size: 32, offset: 544)
!1389 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1390, line: 31, baseType: !740)
!1390 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1364, file: !334, line: 2307, baseType: !872, size: 64, offset: 576)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1364, file: !334, line: 2308, baseType: !872, size: 64, offset: 640)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1364, file: !334, line: 2314, baseType: !1394, size: 64, offset: 704)
!1394 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !334, line: 2309, size: 64, elements: !1395)
!1395 = !{!1396, !1397, !1398}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1394, file: !334, line: 2310, baseType: !740, size: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1394, file: !334, line: 2311, baseType: !745, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1394, file: !334, line: 2312, baseType: !1399, size: 64)
!1399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1400, size: 64)
!1400 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !334, line: 2277, flags: DIFlagFwdDecl)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1364, file: !334, line: 2315, baseType: !872, size: 64, offset: 768)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1364, file: !334, line: 2316, baseType: !872, size: 64, offset: 832)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1364, file: !334, line: 2317, baseType: !872, size: 64, offset: 896)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1364, file: !334, line: 2318, baseType: !872, size: 64, offset: 960)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1364, file: !334, line: 2319, baseType: !872, size: 64, offset: 1024)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1364, file: !334, line: 2320, baseType: !872, size: 64, offset: 1088)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1364, file: !334, line: 2321, baseType: !872, size: 64, offset: 1152)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1364, file: !334, line: 2322, baseType: !872, size: 64, offset: 1216)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1364, file: !334, line: 2324, baseType: !1410, size: 64, offset: 1280)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !334, line: 2324, flags: DIFlagFwdDecl)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !874, file: !334, line: 3395, baseType: !1413, size: 320)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !334, line: 1469, size: 320, elements: !1414)
!1414 = !{!1415, !1416, !1417}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1413, file: !334, line: 1470, baseType: !910, size: 192)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1413, file: !334, line: 1471, baseType: !872, size: 64, offset: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1413, file: !334, line: 1472, baseType: !872, size: 64, offset: 256)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !874, file: !334, line: 3396, baseType: !1419, size: 320)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !334, line: 1482, size: 320, elements: !1420)
!1420 = !{!1421, !1422, !1423}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1419, file: !334, line: 1483, baseType: !910, size: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1419, file: !334, line: 1484, baseType: !740, size: 32, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1419, file: !334, line: 1485, baseType: !1424, size: 64, offset: 256)
!1424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 64, elements: !791)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !874, file: !334, line: 3397, baseType: !1426, size: 384)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !334, line: 1829, size: 384, elements: !1427)
!1427 = !{!1428, !1429, !1430, !1431}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1426, file: !334, line: 1830, baseType: !910, size: 192)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1426, file: !334, line: 1831, baseType: !992, size: 32, offset: 192)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1426, file: !334, line: 1832, baseType: !872, size: 64, offset: 256)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1426, file: !334, line: 1835, baseType: !1424, size: 64, offset: 320)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !874, file: !334, line: 3398, baseType: !1433, size: 704)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !334, line: 1898, size: 704, elements: !1434)
!1434 = !{!1435, !1436, !1437, !1441, !1442, !1445}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1433, file: !334, line: 1899, baseType: !910, size: 192)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1433, file: !334, line: 1902, baseType: !872, size: 64, offset: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1433, file: !334, line: 1905, baseType: !1438, size: 64, offset: 256)
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !757, line: 58, baseType: !1439)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !757, line: 57, flags: DIFlagFwdDecl)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1433, file: !334, line: 1908, baseType: !7, size: 32, offset: 320)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1433, file: !334, line: 1911, baseType: !1443, size: 64, offset: 384)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64)
!1444 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !334, line: 1876, flags: DIFlagFwdDecl)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1433, file: !334, line: 1914, baseType: !1446, size: 256, offset: 448)
!1446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1447)
!1447 = !{!1448, !1450, !1451, !1456}
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1446, file: !334, line: 1884, baseType: !1449, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1446, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1446, file: !334, line: 1885, baseType: !1449, size: 64, offset: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1446, file: !334, line: 1891, baseType: !1452, size: 64, offset: 128)
!1452 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1446, file: !334, line: 1891, size: 64, elements: !1453)
!1453 = !{!1454, !1455}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1452, file: !334, line: 1891, baseType: !1438, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1452, file: !334, line: 1891, baseType: !872, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1446, file: !334, line: 1892, baseType: !1457, size: 64, offset: 192)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !874, file: !334, line: 3399, baseType: !1459, size: 704)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !334, line: 2008, size: 704, elements: !1460)
!1460 = !{!1461, !1462, !1463, !1464, !1465, !1466, !1478, !1479, !1480, !1481, !1482}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1459, file: !334, line: 2009, baseType: !910, size: 192)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1459, file: !334, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1459, file: !334, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1459, file: !334, line: 2014, baseType: !992, size: 32, offset: 224)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1459, file: !334, line: 2016, baseType: !872, size: 64, offset: 256)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1459, file: !334, line: 2017, baseType: !1467, size: 64, offset: 320)
!1467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1468, size: 64)
!1468 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1469)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1470)
!1470 = !{!1471}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1469, file: !334, line: 183, baseType: !1472, size: 128)
!1472 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1473)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1474)
!1474 = !{!1475, !1476, !1477}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1473, file: !334, line: 182, baseType: !7, size: 32)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1473, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1473, file: !334, line: 182, baseType: !1424, size: 64, offset: 64)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1459, file: !334, line: 2019, baseType: !872, size: 64, offset: 384)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1459, file: !334, line: 2020, baseType: !872, size: 64, offset: 448)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1459, file: !334, line: 2021, baseType: !872, size: 64, offset: 512)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1459, file: !334, line: 2022, baseType: !872, size: 64, offset: 576)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1459, file: !334, line: 2023, baseType: !872, size: 64, offset: 640)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !874, file: !334, line: 3400, baseType: !1484, size: 832)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !334, line: 2430, size: 832, elements: !1485)
!1485 = !{!1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495}
