; ModuleID = 'modulo-sched.bc'
source_filename = "modulo-sched.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }

!704 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!705 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!706 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!707 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!708 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!709 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!710 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!711 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!712 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!713 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!714 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!715 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!716 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!717 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!718 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!719 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!720 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!721 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!722 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!723 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!724 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!725 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!726 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!727 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!728 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!729 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!730 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!731 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!732 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!733 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!734 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!735 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sched_pass_id_t", file: !736, line: 37, baseType: !7, size: 32, elements: !737)
!736 = !DIFile(filename: "./sched-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!737 = !{!738, !739, !740, !741, !742}
!738 = !DIEnumerator(name: "SCHED_PASS_UNKNOWN", value: 0, isUnsigned: true)
!739 = !DIEnumerator(name: "SCHED_RGN_PASS", value: 1, isUnsigned: true)
!740 = !DIEnumerator(name: "SCHED_EBB_PASS", value: 2, isUnsigned: true)
!741 = !DIEnumerator(name: "SCHED_SMS_PASS", value: 3, isUnsigned: true)
!742 = !DIEnumerator(name: "SCHED_SEL_PASS", value: 4, isUnsigned: true)
!743 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sms_direction", file: !3, line: 2052, baseType: !7, size: 32, elements: !744)
!744 = !{!745, !746}
!745 = !DIEnumerator(name: "BOTTOMUP", value: 0, isUnsigned: true)
!746 = !DIEnumerator(name: "TOPDOWN", value: 1, isUnsigned: true)
!747 = !{!748, !749, !750, !751, !754, !755, !757, !881, !592, !795, !2012, !2013, !2033, !1375, !2045, !2051, !7, !864, !2052, !2014, !2020, !2022, !5, !2063}
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!750 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !753)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "ddg_ptr", file: !398, line: 33, baseType: !759)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ddg", file: !398, line: 112, size: 448, elements: !761)
!761 = !{!762, !1957, !1958, !1959, !1960, !1961, !2007, !2008, !2009, !2010}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !760, file: !398, line: 115, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !764, line: 111, baseType: !765)
!764 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !155, line: 217, size: 832, elements: !767)
!767 = !{!768, !1924, !1925, !1926, !1927, !1931, !1932, !1933, !1951, !1952, !1953, !1954, !1955, !1956}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !766, file: !155, line: 219, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !155, line: 151, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !155, line: 151, size: 128, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !771, file: !155, line: 151, baseType: !774, size: 128)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !155, line: 150, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !155, line: 150, size: 128, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !775, file: !155, line: 150, baseType: !7, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !775, file: !155, line: 150, baseType: !7, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !775, file: !155, line: 150, baseType: !780, size: 64, offset: 64)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 64, elements: !829)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !764, line: 108, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !155, line: 122, size: 512, elements: !784)
!784 = !{!785, !786, !787, !1916, !1917, !1918, !1919, !1920, !1921, !1922}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !783, file: !155, line: 124, baseType: !765, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !783, file: !155, line: 125, baseType: !765, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !783, file: !155, line: 131, baseType: !788, size: 64, offset: 128)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !155, line: 128, size: 64, elements: !789)
!789 = !{!790, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !788, file: !155, line: 129, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !764, line: 66, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !764, line: 65, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !788, file: !155, line: 130, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !764, line: 50, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !593, line: 240, size: 384, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !797, file: !593, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !797, file: !593, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !797, file: !593, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !797, file: !593, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !797, file: !593, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !797, file: !593, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !797, file: !593, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !797, file: !593, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !797, file: !593, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !797, file: !593, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !797, file: !593, line: 321, baseType: !810, size: 320, offset: 64)
!810 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !593, line: 315, size: 320, elements: !811)
!811 = !{!812, !1883, !1885, !1914, !1915}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !810, file: !593, line: 316, baseType: !813, size: 64)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 64, elements: !829)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !593, line: 183, baseType: !815)
!815 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !593, line: 166, size: 64, elements: !816)
!816 = !{!817, !818, !819, !820, !821, !831, !832, !844, !847, !909, !1861, !1862, !1873, !1880}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !815, file: !593, line: 168, baseType: !750, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !815, file: !593, line: 169, baseType: !7, size: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !815, file: !593, line: 170, baseType: !755, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !815, file: !593, line: 171, baseType: !795, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !815, file: !593, line: 172, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !764, line: 53, baseType: !823)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !593, line: 359, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !824, file: !593, line: 360, baseType: !750, size: 32)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !824, file: !593, line: 361, baseType: !828, size: 64, offset: 64)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !795, size: 64, elements: !829)
!829 = !{!830}
!830 = !DISubrange(count: 1)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !815, file: !593, line: 173, baseType: !5, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !815, file: !593, line: 174, baseType: !833, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !593, line: 133, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !593, line: 115, size: 32, elements: !835)
!835 = !{!836, !837, !838, !839, !840, !841, !842, !843}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !834, file: !593, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !834, file: !593, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !834, file: !593, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !834, file: !593, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !834, file: !593, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !834, file: !593, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !834, file: !593, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !834, file: !593, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !815, file: !593, line: 175, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !593, line: 175, flags: DIFlagFwdDecl)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !815, file: !593, line: 176, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !849, size: 64)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !850, line: 75, size: 256, elements: !851)
!850 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!851 = !{!852, !867, !868, !869}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !849, file: !850, line: 76, baseType: !853, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !850, line: 68, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !850, line: 63, size: 320, elements: !856)
!856 = !{!857, !859, !860, !861}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !855, file: !850, line: 64, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !855, file: !850, line: 65, baseType: !858, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !855, file: !850, line: 66, baseType: !7, size: 32, offset: 128)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !855, file: !850, line: 67, baseType: !862, size: 128, offset: 192)
!862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !863, size: 128, elements: !865)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !850, line: 29, baseType: !864)
!864 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!865 = !{!866}
!866 = !DISubrange(count: 2)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !849, file: !850, line: 77, baseType: !853, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !849, file: !850, line: 78, baseType: !7, size: 32, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !849, file: !850, line: 79, baseType: !870, size: 64, offset: 192)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !850, line: 49, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !850, line: 45, size: 832, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !872, file: !850, line: 46, baseType: !858, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !872, file: !850, line: 47, baseType: !848, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !872, file: !850, line: 48, baseType: !877, size: 704, offset: 128)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !878, line: 164, size: 704, elements: !879)
!878 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!879 = !{!880, !882, !892, !893, !894, !895, !896, !897, !901, !905, !906, !907, !908}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !877, file: !878, line: 166, baseType: !881, size: 64)
!881 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !877, file: !878, line: 167, baseType: !883, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !878, line: 157, size: 192, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !884, file: !878, line: 159, baseType: !752, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !884, file: !878, line: 160, baseType: !883, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !884, file: !878, line: 161, baseType: !889, size: 32, offset: 128)
!889 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 32, elements: !890)
!890 = !{!891}
!891 = !DISubrange(count: 4)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !877, file: !878, line: 168, baseType: !752, size: 64, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !877, file: !878, line: 169, baseType: !752, size: 64, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !877, file: !878, line: 170, baseType: !752, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !877, file: !878, line: 171, baseType: !881, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !877, file: !878, line: 172, baseType: !750, size: 32, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !877, file: !878, line: 176, baseType: !898, size: 64, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = !DISubroutineType(types: !900)
!900 = !{!883, !754, !881}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !877, file: !878, line: 177, baseType: !902, size: 64, offset: 512)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = !DISubroutineType(types: !904)
!904 = !{null, !754, !883}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !877, file: !878, line: 178, baseType: !754, size: 64, offset: 576)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !877, file: !878, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !877, file: !878, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !877, file: !878, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !815, file: !593, line: 177, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !764, line: 56, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !171, line: 3371, size: 1792, elements: !913)
!913 = !{!914, !947, !953, !964, !983, !994, !999, !1006, !1012, !1025, !1037, !1075, !1080, !1108, !1116, !1117, !1122, !1131, !1137, !1142, !1146, !1150, !1500, !1549, !1555, !1561, !1568, !1591, !1605, !1622, !1634, !1656, !1671, !1843}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !912, file: !171, line: 3372, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !171, line: 360, size: 64, elements: !916)
!916 = !{!917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !915, file: !171, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !915, file: !171, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !915, file: !171, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !915, file: !171, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !915, file: !171, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !915, file: !171, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !915, file: !171, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !915, file: !171, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !915, file: !171, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !915, file: !171, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !915, file: !171, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !915, file: !171, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !915, file: !171, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !915, file: !171, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !915, file: !171, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !915, file: !171, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !915, file: !171, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !915, file: !171, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !915, file: !171, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !915, file: !171, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !915, file: !171, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !915, file: !171, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !915, file: !171, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !915, file: !171, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !915, file: !171, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !915, file: !171, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !915, file: !171, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !915, file: !171, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !915, file: !171, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !915, file: !171, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !912, file: !171, line: 3373, baseType: !948, size: 192)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !171, line: 402, size: 192, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !948, file: !171, line: 403, baseType: !915, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !948, file: !171, line: 404, baseType: !910, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !948, file: !171, line: 405, baseType: !910, size: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !912, file: !171, line: 3374, baseType: !954, size: 320)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !171, line: 1384, size: 320, elements: !955)
!955 = !{!956, !957}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !954, file: !171, line: 1385, baseType: !948, size: 192)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !954, file: !171, line: 1386, baseType: !958, size: 128, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !959, line: 58, baseType: !960)
!959 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !959, line: 54, size: 128, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !960, file: !959, line: 56, baseType: !864, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !960, file: !959, line: 57, baseType: !881, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !912, file: !171, line: 3375, baseType: !965, size: 256)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !171, line: 1397, size: 256, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !965, file: !171, line: 1398, baseType: !948, size: 192)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !965, file: !171, line: 1399, baseType: !969, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !971, line: 52, size: 256, elements: !972)
!971 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!972 = !{!973, !974, !975, !976, !977, !978, !979}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !970, file: !971, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !970, file: !971, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !970, file: !971, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !970, file: !971, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !970, file: !971, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !970, file: !971, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !970, file: !971, line: 62, baseType: !980, size: 192, offset: 64)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !864, size: 192, elements: !981)
!981 = !{!982}
!982 = !DISubrange(count: 3)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !912, file: !171, line: 3376, baseType: !984, size: 256)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !171, line: 1408, size: 256, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !171, line: 1409, baseType: !948, size: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !984, file: !171, line: 1410, baseType: !988, size: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !990, line: 27, size: 192, elements: !991)
!990 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !989, file: !990, line: 29, baseType: !958, size: 128)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !989, file: !990, line: 30, baseType: !5, size: 32, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !912, file: !171, line: 3377, baseType: !995, size: 256)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !171, line: 1437, size: 256, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !995, file: !171, line: 1438, baseType: !948, size: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !995, file: !171, line: 1439, baseType: !910, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !912, file: !171, line: 3378, baseType: !1000, size: 256)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !171, line: 1418, size: 256, elements: !1001)
!1001 = !{!1002, !1003, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !171, line: 1419, baseType: !948, size: 192)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1000, file: !171, line: 1420, baseType: !750, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1000, file: !171, line: 1421, baseType: !1005, size: 8, offset: 224)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 8, elements: !829)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !912, file: !171, line: 3379, baseType: !1007, size: 320)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !171, line: 1428, size: 320, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !171, line: 1429, baseType: !948, size: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1007, file: !171, line: 1430, baseType: !910, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1007, file: !171, line: 1431, baseType: !910, size: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !912, file: !171, line: 3380, baseType: !1013, size: 320)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !171, line: 1460, size: 320, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1013, file: !171, line: 1461, baseType: !948, size: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1013, file: !171, line: 1462, baseType: !1017, size: 128, offset: 192)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1018, line: 31, size: 128, elements: !1019)
!1018 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1019 = !{!1020, !1023, !1024}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1017, file: !1018, line: 32, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !749)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1017, file: !1018, line: 33, baseType: !7, size: 32, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1017, file: !1018, line: 34, baseType: !7, size: 32, offset: 96)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !912, file: !171, line: 3381, baseType: !1026, size: 384)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !171, line: 2507, size: 384, elements: !1027)
!1027 = !{!1028, !1029, !1034, !1035, !1036}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1026, file: !171, line: 2508, baseType: !948, size: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1026, file: !171, line: 2509, baseType: !1030, size: 32, offset: 192)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1031, line: 58, baseType: !1032)
!1031 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1033, line: 44, baseType: !7)
!1033 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1026, file: !171, line: 2510, baseType: !7, size: 32, offset: 224)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1026, file: !171, line: 2511, baseType: !910, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1026, file: !171, line: 2512, baseType: !910, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !912, file: !171, line: 3382, baseType: !1038, size: 896)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !171, line: 2652, size: 896, elements: !1039)
!1039 = !{!1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1038, file: !171, line: 2653, baseType: !1026, size: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1038, file: !171, line: 2654, baseType: !910, size: 64, offset: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1038, file: !171, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1038, file: !171, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1038, file: !171, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1038, file: !171, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1038, file: !171, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1038, file: !171, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1038, file: !171, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1038, file: !171, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1038, file: !171, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1038, file: !171, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1038, file: !171, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1038, file: !171, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1038, file: !171, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1038, file: !171, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1038, file: !171, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1038, file: !171, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1038, file: !171, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1038, file: !171, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1038, file: !171, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1038, file: !171, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1038, file: !171, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1038, file: !171, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1038, file: !171, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1038, file: !171, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1038, file: !171, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1038, file: !171, line: 2703, baseType: !7, size: 32, offset: 512)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1038, file: !171, line: 2705, baseType: !910, size: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1038, file: !171, line: 2706, baseType: !910, size: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1038, file: !171, line: 2707, baseType: !910, size: 64, offset: 704)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1038, file: !171, line: 2708, baseType: !910, size: 64, offset: 768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1038, file: !171, line: 2711, baseType: !1073, size: 64, offset: 832)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !171, line: 2711, flags: DIFlagFwdDecl)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !912, file: !171, line: 3383, baseType: !1076, size: 960)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !171, line: 2756, size: 960, elements: !1077)
!1077 = !{!1078, !1079}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1076, file: !171, line: 2757, baseType: !1038, size: 896)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1076, file: !171, line: 2758, baseType: !795, size: 64, offset: 896)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !912, file: !171, line: 3384, baseType: !1081, size: 1472)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !171, line: 3114, size: 1472, elements: !1082)
!1082 = !{!1083, !1104, !1105, !1106, !1107}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1081, file: !171, line: 3115, baseType: !1084, size: 1216)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !171, line: 2984, size: 1216, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1084, file: !171, line: 2985, baseType: !1076, size: 960)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1084, file: !171, line: 2986, baseType: !910, size: 64, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1084, file: !171, line: 2987, baseType: !910, size: 64, offset: 1024)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1084, file: !171, line: 2988, baseType: !910, size: 64, offset: 1088)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1084, file: !171, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1084, file: !171, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1084, file: !171, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1084, file: !171, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1084, file: !171, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1084, file: !171, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1084, file: !171, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1084, file: !171, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1084, file: !171, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1084, file: !171, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1084, file: !171, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1084, file: !171, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1084, file: !171, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1084, file: !171, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1081, file: !171, line: 3117, baseType: !910, size: 64, offset: 1216)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1081, file: !171, line: 3119, baseType: !910, size: 64, offset: 1280)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1081, file: !171, line: 3121, baseType: !910, size: 64, offset: 1344)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1081, file: !171, line: 3123, baseType: !910, size: 64, offset: 1408)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !912, file: !171, line: 3385, baseType: !1109, size: 1088)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !171, line: 2874, size: 1088, elements: !1110)
!1110 = !{!1111, !1112, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !171, line: 2875, baseType: !1076, size: 960)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1109, file: !171, line: 2876, baseType: !795, size: 64, offset: 960)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1109, file: !171, line: 2877, baseType: !1114, size: 64, offset: 1024)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !171, line: 2856, flags: DIFlagFwdDecl)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !912, file: !171, line: 3386, baseType: !1084, size: 1216)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !912, file: !171, line: 3387, baseType: !1118, size: 1280)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !171, line: 3093, size: 1280, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !171, line: 3094, baseType: !1084, size: 1216)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1118, file: !171, line: 3095, baseType: !1114, size: 64, offset: 1216)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !912, file: !171, line: 3388, baseType: !1123, size: 1216)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !171, line: 2824, size: 1216, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128, !1129, !1130}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1123, file: !171, line: 2825, baseType: !1038, size: 896)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1123, file: !171, line: 2827, baseType: !910, size: 64, offset: 896)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1123, file: !171, line: 2828, baseType: !910, size: 64, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1123, file: !171, line: 2829, baseType: !910, size: 64, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1123, file: !171, line: 2830, baseType: !910, size: 64, offset: 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1123, file: !171, line: 2831, baseType: !910, size: 64, offset: 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !912, file: !171, line: 3389, baseType: !1132, size: 1024)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !171, line: 2850, size: 1024, elements: !1133)
!1133 = !{!1134, !1135, !1136}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1132, file: !171, line: 2851, baseType: !1076, size: 960)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1132, file: !171, line: 2852, baseType: !750, size: 32, offset: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1132, file: !171, line: 2853, baseType: !750, size: 32, offset: 992)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !912, file: !171, line: 3390, baseType: !1138, size: 1024)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !171, line: 2857, size: 1024, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !171, line: 2858, baseType: !1076, size: 960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1138, file: !171, line: 2859, baseType: !1114, size: 64, offset: 960)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !912, file: !171, line: 3391, baseType: !1143, size: 960)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !171, line: 2862, size: 960, elements: !1144)
!1144 = !{!1145}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1143, file: !171, line: 2863, baseType: !1076, size: 960)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !912, file: !171, line: 3392, baseType: !1147, size: 1472)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !171, line: 3304, size: 1472, elements: !1148)
!1148 = !{!1149}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1147, file: !171, line: 3305, baseType: !1081, size: 1472)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !912, file: !171, line: 3393, baseType: !1151, size: 1792)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !171, line: 3248, size: 1792, elements: !1152)
!1152 = !{!1153, !1154, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1151, file: !171, line: 3249, baseType: !1081, size: 1472)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1151, file: !171, line: 3251, baseType: !1155, size: 64, offset: 1472)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1157, line: 463, size: 1152, elements: !1158)
!1157 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1158 = !{!1159, !1323, !1353, !1354, !1357, !1423, !1424, !1425, !1426, !1427, !1428, !1452, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1156, file: !1157, line: 464, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1162)
!1162 = !{!1163, !1212, !1225, !1239, !1291, !1304}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1161, file: !135, line: 197, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1165)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172, !1173, !1200, !1209, !1210, !1211}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1166, file: !135, line: 119, baseType: !1165, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1166, file: !135, line: 122, baseType: !1165, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1166, file: !135, line: 123, baseType: !1165, size: 64, offset: 128)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1166, file: !135, line: 126, baseType: !750, size: 32, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1166, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1166, file: !135, line: 165, baseType: !1174, size: 192, offset: 256)
!1174 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1175)
!1175 = !{!1176, !1189, !1195}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1174, file: !135, line: 137, baseType: !1177, size: 128)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1178)
!1178 = !{!1179, !1188}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1177, file: !135, line: 135, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1182)
!1182 = !{!1183, !1184, !1185, !1186, !1187}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1181, file: !135, line: 96, baseType: !1180, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1181, file: !135, line: 97, baseType: !1180, size: 64, offset: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1181, file: !135, line: 101, baseType: !910, size: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1181, file: !135, line: 106, baseType: !910, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1181, file: !135, line: 111, baseType: !910, size: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1177, file: !135, line: 136, baseType: !1180, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1174, file: !135, line: 151, baseType: !1190, size: 192)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1190, file: !135, line: 141, baseType: !910, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1190, file: !135, line: 145, baseType: !910, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1190, file: !135, line: 150, baseType: !750, size: 32, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1174, file: !135, line: 164, baseType: !1196, size: 128)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1196, file: !135, line: 161, baseType: !910, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1196, file: !135, line: 163, baseType: !1030, size: 32, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1166, file: !135, line: 168, baseType: !1201, size: 64, offset: 448)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1203)
!1203 = !{!1204, !1205, !1206, !1207, !1208}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1202, file: !135, line: 70, baseType: !1201, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1202, file: !135, line: 73, baseType: !1165, size: 64, offset: 64)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1202, file: !135, line: 78, baseType: !910, size: 64, offset: 128)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1202, file: !135, line: 85, baseType: !795, size: 64, offset: 192)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1202, file: !135, line: 88, baseType: !750, size: 32, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1166, file: !135, line: 173, baseType: !795, size: 64, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1166, file: !135, line: 173, baseType: !795, size: 64, offset: 576)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1166, file: !135, line: 177, baseType: !749, size: 8, offset: 640)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1161, file: !135, line: 200, baseType: !1213, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1216)
!1216 = !{!1217}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1215, file: !135, line: 185, baseType: !1218, size: 128)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1220)
!1220 = !{!1221, !1222, !1223}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1219, file: !135, line: 184, baseType: !7, size: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1219, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1219, file: !135, line: 184, baseType: !1224, size: 64, offset: 64)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1164, size: 64, elements: !829)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1161, file: !135, line: 203, baseType: !1226, size: 64, offset: 128)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1228)
!1228 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1229)
!1229 = !{!1230}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1228, file: !135, line: 189, baseType: !1231, size: 128)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1232)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1233)
!1233 = !{!1234, !1235, !1236}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1232, file: !135, line: 188, baseType: !7, size: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1232, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1232, file: !135, line: 188, baseType: !1237, size: 64, offset: 64)
!1237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1238, size: 64, elements: !829)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1201)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1161, file: !135, line: 207, baseType: !1240, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1241, line: 144, baseType: !1242)
!1241 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1241, line: 100, size: 896, elements: !1244)
!1244 = !{!1245, !1253, !1258, !1263, !1265, !1268, !1269, !1270, !1271, !1272, !1277, !1279, !1280, !1285, !1290}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1243, file: !1241, line: 102, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1241, line: 52, baseType: !1247)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = !DISubroutineType(types: !1249)
!1249 = !{!1250, !1251}
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1241, line: 47, baseType: !7)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1243, file: !1241, line: 105, baseType: !1254, size: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1241, line: 59, baseType: !1255)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!750, !1251, !1251}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1243, file: !1241, line: 108, baseType: !1259, size: 64, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1241, line: 63, baseType: !1260)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null, !754}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1243, file: !1241, line: 111, baseType: !1264, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1243, file: !1241, line: 114, baseType: !1266, size: 64, offset: 256)
!1266 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1267, line: 46, baseType: !864)
!1267 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1243, file: !1241, line: 117, baseType: !1266, size: 64, offset: 320)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1243, file: !1241, line: 120, baseType: !1266, size: 64, offset: 384)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1243, file: !1241, line: 124, baseType: !7, size: 32, offset: 448)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1243, file: !1241, line: 128, baseType: !7, size: 32, offset: 480)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1243, file: !1241, line: 131, baseType: !1273, size: 64, offset: 512)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1241, line: 75, baseType: !1274)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DISubroutineType(types: !1276)
!1276 = !{!754, !1266, !1266}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1243, file: !1241, line: 132, baseType: !1278, size: 64, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1241, line: 78, baseType: !1260)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1243, file: !1241, line: 135, baseType: !754, size: 64, offset: 640)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1243, file: !1241, line: 136, baseType: !1281, size: 64, offset: 704)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1241, line: 82, baseType: !1282)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DISubroutineType(types: !1284)
!1284 = !{!754, !754, !1266, !1266}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1243, file: !1241, line: 137, baseType: !1286, size: 64, offset: 768)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1241, line: 83, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{null, !754, !754}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1243, file: !1241, line: 141, baseType: !7, size: 32, offset: 832)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1161, file: !135, line: 211, baseType: !1292, size: 64, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !171, line: 183, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !171, line: 183, size: 128, elements: !1295)
!1295 = !{!1296}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1294, file: !171, line: 183, baseType: !1297, size: 128)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !171, line: 182, baseType: !1298)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !171, line: 182, size: 128, elements: !1299)
!1299 = !{!1300, !1301, !1302}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1298, file: !171, line: 182, baseType: !7, size: 32)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1298, file: !171, line: 182, baseType: !7, size: 32, offset: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1298, file: !171, line: 182, baseType: !1303, size: 64, offset: 64)
!1303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 64, elements: !829)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1161, file: !135, line: 220, baseType: !1305, size: 64, offset: 320)
!1305 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1306)
!1306 = !{!1307, !1308}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1305, file: !135, line: 218, baseType: !1292, size: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1305, file: !135, line: 219, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1311, line: 29, baseType: !1312)
!1311 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1311, line: 29, size: 96, elements: !1313)
!1313 = !{!1314}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1312, file: !1311, line: 29, baseType: !1315, size: 96)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1311, line: 27, baseType: !1316)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1311, line: 27, size: 96, elements: !1317)
!1317 = !{!1318, !1319, !1320}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1316, file: !1311, line: 27, baseType: !7, size: 32)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1316, file: !1311, line: 27, baseType: !7, size: 32, offset: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1316, file: !1311, line: 27, baseType: !1321, size: 8, offset: 64)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1322, size: 8, elements: !829)
!1322 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1311, line: 26, baseType: !749)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1156, file: !1157, line: 467, baseType: !1324, size: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !155, line: 374, size: 640, elements: !1326)
!1326 = !{!1327, !1328, !1329, !1342, !1343, !1344, !1345, !1346, !1347, !1349, !1351, !1352}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1325, file: !155, line: 377, baseType: !763, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1325, file: !155, line: 378, baseType: !763, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1325, file: !155, line: 381, baseType: !1330, size: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !155, line: 282, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !155, line: 282, size: 128, elements: !1333)
!1333 = !{!1334}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1332, file: !155, line: 282, baseType: !1335, size: 128)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !155, line: 281, baseType: !1336)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !155, line: 281, size: 128, elements: !1337)
!1337 = !{!1338, !1339, !1340}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1336, file: !155, line: 281, baseType: !7, size: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1336, file: !155, line: 281, baseType: !7, size: 32, offset: 32)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1336, file: !155, line: 281, baseType: !1341, size: 64, offset: 64)
!1341 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 64, elements: !829)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1325, file: !155, line: 384, baseType: !750, size: 32, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1325, file: !155, line: 387, baseType: !750, size: 32, offset: 224)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1325, file: !155, line: 390, baseType: !750, size: 32, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1325, file: !155, line: 394, baseType: !1330, size: 64, offset: 320)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1325, file: !155, line: 396, baseType: !154, size: 32, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1325, file: !155, line: 399, baseType: !1348, size: 64, offset: 416)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !865)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1325, file: !155, line: 402, baseType: !1350, size: 64, offset: 480)
!1350 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !865)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1325, file: !155, line: 406, baseType: !750, size: 32, offset: 544)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1325, file: !155, line: 409, baseType: !750, size: 32, offset: 576)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1156, file: !1157, line: 470, baseType: !792, size: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1156, file: !1157, line: 473, baseType: !1355, size: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1157, line: 166, flags: DIFlagFwdDecl)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1156, file: !1157, line: 476, baseType: !1358, size: 64, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !142, line: 187, size: 256, elements: !1360)
!1360 = !{!1361, !1362, !1421, !1422}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1359, file: !142, line: 189, baseType: !750, size: 32)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1359, file: !142, line: 192, baseType: !1363, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !142, line: 87, baseType: !1365)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !142, line: 87, size: 128, elements: !1366)
!1366 = !{!1367}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1365, file: !142, line: 87, baseType: !1368, size: 128)
!1368 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !142, line: 85, baseType: !1369)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !142, line: 85, size: 128, elements: !1370)
!1370 = !{!1371, !1372, !1373}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1369, file: !142, line: 85, baseType: !7, size: 32)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1369, file: !142, line: 85, baseType: !7, size: 32, offset: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1369, file: !142, line: 85, baseType: !1374, size: 64, offset: 64)
!1374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1375, size: 64, elements: !829)
!1375 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !142, line: 84, baseType: !1376)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 100, size: 1216, elements: !1378)
!1378 = !{!1379, !1380, !1381, !1382, !1383, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1411, !1419, !1420}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1377, file: !142, line: 102, baseType: !750, size: 32)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1377, file: !142, line: 105, baseType: !7, size: 32, offset: 32)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1377, file: !142, line: 108, baseType: !765, size: 64, offset: 64)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1377, file: !142, line: 111, baseType: !765, size: 64, offset: 128)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1377, file: !142, line: 114, baseType: !1384, size: 64, offset: 192)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !142, line: 41, size: 64, elements: !1385)
!1385 = !{!1386, !1387}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1384, file: !142, line: 42, baseType: !141, size: 32)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1384, file: !142, line: 43, baseType: !7, size: 32, offset: 32)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1377, file: !142, line: 117, baseType: !7, size: 32, offset: 256)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1377, file: !142, line: 120, baseType: !7, size: 32, offset: 288)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1377, file: !142, line: 123, baseType: !1363, size: 64, offset: 320)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1377, file: !142, line: 126, baseType: !1376, size: 64, offset: 384)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1377, file: !142, line: 129, baseType: !1376, size: 64, offset: 448)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1377, file: !142, line: 132, baseType: !754, size: 64, offset: 512)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1377, file: !142, line: 139, baseType: !910, size: 64, offset: 576)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1377, file: !142, line: 143, baseType: !958, size: 128, offset: 640)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1377, file: !142, line: 146, baseType: !958, size: 128, offset: 768)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1377, file: !142, line: 148, baseType: !749, size: 8, offset: 896)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1377, file: !142, line: 149, baseType: !749, size: 8, offset: 904)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1377, file: !142, line: 153, baseType: !150, size: 32, offset: 928)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1377, file: !142, line: 156, baseType: !1401, size: 64, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1402, size: 64)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !142, line: 48, size: 320, elements: !1403)
!1403 = !{!1404, !1408, !1409, !1410}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1402, file: !142, line: 50, baseType: !1405, size: 64)
!1405 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !764, line: 58, baseType: !1406)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !764, line: 57, flags: DIFlagFwdDecl)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1402, file: !142, line: 59, baseType: !958, size: 128, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1402, file: !142, line: 64, baseType: !749, size: 8, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1402, file: !142, line: 67, baseType: !1401, size: 64, offset: 256)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1377, file: !142, line: 159, baseType: !1412, size: 64, offset: 1024)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !142, line: 72, size: 256, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1418}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1413, file: !142, line: 74, baseType: !782, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1413, file: !142, line: 77, baseType: !1412, size: 64, offset: 64)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1413, file: !142, line: 78, baseType: !1412, size: 64, offset: 128)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1413, file: !142, line: 81, baseType: !1412, size: 64, offset: 192)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1377, file: !142, line: 162, baseType: !749, size: 8, offset: 1088)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1377, file: !142, line: 166, baseType: !910, size: 64, offset: 1152)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1359, file: !142, line: 197, baseType: !1240, size: 64, offset: 128)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1359, file: !142, line: 200, baseType: !1376, size: 64, offset: 192)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1156, file: !1157, line: 479, baseType: !1240, size: 64, offset: 320)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1156, file: !1157, line: 484, baseType: !910, size: 64, offset: 384)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1156, file: !1157, line: 488, baseType: !910, size: 64, offset: 448)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1156, file: !1157, line: 493, baseType: !910, size: 64, offset: 512)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1156, file: !1157, line: 496, baseType: !910, size: 64, offset: 576)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1156, file: !1157, line: 501, baseType: !1429, size: 64, offset: 640)
!1429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1430, size: 64)
!1430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !166, line: 2355, size: 576, elements: !1431)
!1431 = !{!1432, !1435, !1436, !1437, !1438, !1440, !1441, !1446, !1447, !1448, !1449, !1450, !1451}
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1430, file: !166, line: 2356, baseType: !1433, size: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !166, line: 2356, flags: DIFlagFwdDecl)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1430, file: !166, line: 2357, baseType: !755, size: 64, offset: 64)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1430, file: !166, line: 2358, baseType: !750, size: 32, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1430, file: !166, line: 2359, baseType: !750, size: 32, offset: 160)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1430, file: !166, line: 2360, baseType: !1439, size: 128, offset: 192)
!1439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !750, size: 128, elements: !890)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1430, file: !166, line: 2364, baseType: !750, size: 32, offset: 320)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1430, file: !166, line: 2367, baseType: !1442, size: 128, offset: 384)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !166, line: 2349, size: 128, elements: !1443)
!1443 = !{!1444, !1445}
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1442, file: !166, line: 2351, baseType: !795, size: 64)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1442, file: !166, line: 2352, baseType: !881, size: 64, offset: 64)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1430, file: !166, line: 2371, baseType: !165, size: 32, offset: 512)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1430, file: !166, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1430, file: !166, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1430, file: !166, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1430, file: !166, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1430, file: !166, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1156, file: !1157, line: 504, baseType: !1453, size: 64, offset: 704)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1157, line: 504, flags: DIFlagFwdDecl)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1156, file: !1157, line: 507, baseType: !1240, size: 64, offset: 768)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1156, file: !1157, line: 510, baseType: !750, size: 32, offset: 832)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1156, file: !1157, line: 513, baseType: !750, size: 32, offset: 864)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1156, file: !1157, line: 516, baseType: !1030, size: 32, offset: 896)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1156, file: !1157, line: 519, baseType: !1030, size: 32, offset: 928)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1156, file: !1157, line: 522, baseType: !7, size: 32, offset: 960)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1156, file: !1157, line: 523, baseType: !7, size: 32, offset: 992)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1156, file: !1157, line: 528, baseType: !755, size: 64, offset: 1024)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1156, file: !1157, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1156, file: !1157, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1156, file: !1157, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1156, file: !1157, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1156, file: !1157, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1156, file: !1157, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1156, file: !1157, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1156, file: !1157, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1156, file: !1157, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1156, file: !1157, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1156, file: !1157, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1156, file: !1157, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1156, file: !1157, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1156, file: !1157, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1156, file: !1157, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1156, file: !1157, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1151, file: !171, line: 3254, baseType: !910, size: 64, offset: 1536)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1151, file: !171, line: 3257, baseType: !910, size: 64, offset: 1600)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1151, file: !171, line: 3258, baseType: !910, size: 64, offset: 1664)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1151, file: !171, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1151, file: !171, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1151, file: !171, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1151, file: !171, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1151, file: !171, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1151, file: !171, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1151, file: !171, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1151, file: !171, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1151, file: !171, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1151, file: !171, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1151, file: !171, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1151, file: !171, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1151, file: !171, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1151, file: !171, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1151, file: !171, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1151, file: !171, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1151, file: !171, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1151, file: !171, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !912, file: !171, line: 3394, baseType: !1501, size: 1344)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !171, line: 2279, size: 1344, elements: !1502)
!1502 = !{!1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1528, !1529, !1530, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1501, file: !171, line: 2280, baseType: !948, size: 192)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1501, file: !171, line: 2281, baseType: !910, size: 64, offset: 192)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1501, file: !171, line: 2282, baseType: !910, size: 64, offset: 256)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1501, file: !171, line: 2283, baseType: !910, size: 64, offset: 320)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1501, file: !171, line: 2284, baseType: !910, size: 64, offset: 384)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1501, file: !171, line: 2285, baseType: !7, size: 32, offset: 448)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1501, file: !171, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1501, file: !171, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1501, file: !171, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1501, file: !171, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1501, file: !171, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1501, file: !171, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1501, file: !171, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1501, file: !171, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
