; ModuleID = 'objalloc.bc'
source_filename = "objalloc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.objalloc = type { i8*, i32, i8* }
%struct.objalloc_chunk = type { %struct.objalloc_chunk*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !30 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !43, metadata !DIExpression()), !dbg !45
  call void @llvm.dbg.value(metadata %struct.__va_list_tag* %__arg, metadata !44, metadata !DIExpression()), !dbg !45
  %0 = load %struct._IO_FILE*, %struct._IO_FILE** @stdout, align 8, !dbg !46
  %call = tail call i32 @vfprintf(%struct._IO_FILE* %0, i8* %__fmt, %struct.__va_list_tag* %__arg) #5, !dbg !47
  ret i32 %call, !dbg !48
}


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "objalloc.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13, !21, !8}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "objalloc", file: !15, line: 44, size: 192, elements: !16)
!15 = !DIFile(filename: "./include/objalloc.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!16 = !{!17, !18, !20}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "current_ptr", scope: !14, file: !15, line: 46, baseType: !8, size: 64)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "current_space", scope: !14, file: !15, line: 47, baseType: !19, size: 32, offset: 64)
!19 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "chunks", scope: !14, file: !15, line: 48, baseType: !10, size: 64, offset: 128)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!22 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "objalloc_chunk", file: !1, line: 58, size: 128, elements: !23)
!23 = !{!24, !25}
!24 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !22, file: !1, line: 61, baseType: !21, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "current_ptr", scope: !22, file: !1, line: 65, baseType: !8, size: 64, offset: 64)
!26 = !{i32 2, !"Dwarf Version", i32 4}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{i32 1, !"wchar_size", i32 4}
!29 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!30 = distinct !DISubprogram(name: "vprintf", scope: !31, file: !31, line: 39, type: !32, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !42)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!6, !34, !35}
!34 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !37)
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !36, file: !1, baseType: !19, size: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !36, file: !1, baseType: !19, size: 32, offset: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !36, file: !1, baseType: !10, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !36, file: !1, baseType: !10, size: 64, offset: 128)
!42 = !{!43, !44}
!43 = !DILocalVariable(name: "__fmt", arg: 1, scope: !30, file: !31, line: 39, type: !34)
!44 = !DILocalVariable(name: "__arg", arg: 2, scope: !30, file: !31, line: 39, type: !35)
!45 = !DILocation(line: 0, scope: !30)
!46 = !DILocation(line: 41, column: 20, scope: !30)
!47 = !DILocation(line: 41, column: 10, scope: !30)
!48 = !DILocation(line: 41, column: 3, scope: !30)
!49 = distinct !DISubprogram(name: "getchar", scope: !31, file: !31, line: 47, type: !50, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!50 = !DISubroutineType(types: !51)
!51 = !{!6}
!52 = !DILocation(line: 49, column: 16, scope: !49)
!53 = !DILocation(line: 49, column: 10, scope: !49)
!54 = !DILocation(line: 49, column: 3, scope: !49)
!55 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !31, file: !31, line: 56, type: !56, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !117)
!56 = !DISubroutineType(types: !57)
!57 = !{!6, !58}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !60, line: 7, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !62, line: 49, size: 1728, elements: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!63 = !{!64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !79, !81, !82, !83, !87, !89, !91, !95, !98, !100, !103, !106, !107, !108, !112, !113}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !61, file: !62, line: 51, baseType: !6, size: 32)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !61, file: !62, line: 54, baseType: !8, size: 64, offset: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !61, file: !62, line: 55, baseType: !8, size: 64, offset: 128)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !61, file: !62, line: 56, baseType: !8, size: 64, offset: 192)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !61, file: !62, line: 57, baseType: !8, size: 64, offset: 256)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !61, file: !62, line: 58, baseType: !8, size: 64, offset: 320)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !61, file: !62, line: 59, baseType: !8, size: 64, offset: 384)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !61, file: !62, line: 60, baseType: !8, size: 64, offset: 448)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !61, file: !62, line: 61, baseType: !8, size: 64, offset: 512)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !61, file: !62, line: 64, baseType: !8, size: 64, offset: 576)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !61, file: !62, line: 65, baseType: !8, size: 64, offset: 640)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !61, file: !62, line: 66, baseType: !8, size: 64, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !61, file: !62, line: 68, baseType: !77, size: 64, offset: 768)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !62, line: 36, flags: DIFlagFwdDecl)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !61, file: !62, line: 70, baseType: !80, size: 64, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !61, file: !62, line: 72, baseType: !6, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !61, file: !62, line: 73, baseType: !6, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !61, file: !62, line: 74, baseType: !84, size: 64, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !85, line: 152, baseType: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!86 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !61, file: !62, line: 77, baseType: !88, size: 16, offset: 1024)
!88 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !61, file: !62, line: 78, baseType: !90, size: 8, offset: 1040)
!90 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !61, file: !62, line: 79, baseType: !92, size: 8, offset: 1048)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !61, file: !62, line: 81, baseType: !96, size: 64, offset: 1088)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !62, line: 43, baseType: null)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !61, file: !62, line: 89, baseType: !99, size: 64, offset: 1152)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !85, line: 153, baseType: !86)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !61, file: !62, line: 91, baseType: !101, size: 64, offset: 1216)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !62, line: 37, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !61, file: !62, line: 92, baseType: !104, size: 64, offset: 1280)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !62, line: 38, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !61, file: !62, line: 93, baseType: !80, size: 64, offset: 1344)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !61, file: !62, line: 94, baseType: !10, size: 64, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !61, file: !62, line: 95, baseType: !109, size: 64, offset: 1472)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !110, line: 46, baseType: !111)
!110 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!111 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !61, file: !62, line: 96, baseType: !6, size: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !61, file: !62, line: 98, baseType: !114, size: 160, offset: 1568)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 20)
!117 = !{!118}
!118 = !DILocalVariable(name: "__fp", arg: 1, scope: !55, file: !31, line: 56, type: !58)
!119 = !DILocation(line: 0, scope: !55)
!120 = !DILocation(line: 58, column: 10, scope: !55)
!121 = !DILocation(line: 58, column: 3, scope: !55)
!122 = distinct !DISubprogram(name: "getc_unlocked", scope: !31, file: !31, line: 66, type: !56, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !123)
!123 = !{!124}
!124 = !DILocalVariable(name: "__fp", arg: 1, scope: !122, file: !31, line: 66, type: !58)
!125 = !DILocation(line: 0, scope: !122)
!126 = !DILocation(line: 68, column: 10, scope: !122)
!127 = !DILocation(line: 68, column: 3, scope: !122)
!128 = distinct !DISubprogram(name: "getchar_unlocked", scope: !31, file: !31, line: 73, type: !50, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!129 = !DILocation(line: 75, column: 10, scope: !128)
!130 = !DILocation(line: 75, column: 3, scope: !128)
!131 = distinct !DISubprogram(name: "putchar", scope: !31, file: !31, line: 82, type: !132, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{!6, !6}
!134 = !{!135}
!135 = !DILocalVariable(name: "__c", arg: 1, scope: !131, file: !31, line: 82, type: !6)
!136 = !DILocation(line: 0, scope: !131)
!137 = !DILocation(line: 84, column: 21, scope: !131)
!138 = !DILocation(line: 84, column: 10, scope: !131)
!139 = !DILocation(line: 84, column: 3, scope: !131)
!140 = distinct !DISubprogram(name: "fputc_unlocked", scope: !31, file: !31, line: 91, type: !141, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !143)
!141 = !DISubroutineType(types: !142)
!142 = !{!6, !6, !58}
!143 = !{!144, !145}
!144 = !DILocalVariable(name: "__c", arg: 1, scope: !140, file: !31, line: 91, type: !6)
!145 = !DILocalVariable(name: "__stream", arg: 2, scope: !140, file: !31, line: 91, type: !58)
!146 = !DILocation(line: 0, scope: !140)
!147 = !DILocation(line: 93, column: 10, scope: !140)
!148 = !DILocation(line: 93, column: 3, scope: !140)
!149 = distinct !DISubprogram(name: "putc_unlocked", scope: !31, file: !31, line: 101, type: !141, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !150)
!150 = !{!151, !152}
!151 = !DILocalVariable(name: "__c", arg: 1, scope: !149, file: !31, line: 101, type: !6)
!152 = !DILocalVariable(name: "__stream", arg: 2, scope: !149, file: !31, line: 101, type: !58)
!153 = !DILocation(line: 0, scope: !149)
!154 = !DILocation(line: 103, column: 10, scope: !149)
!155 = !DILocation(line: 103, column: 3, scope: !149)
!156 = distinct !DISubprogram(name: "putchar_unlocked", scope: !31, file: !31, line: 108, type: !132, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !157)
!157 = !{!158}
!158 = !DILocalVariable(name: "__c", arg: 1, scope: !156, file: !31, line: 108, type: !6)
!159 = !DILocation(line: 0, scope: !156)
!160 = !DILocation(line: 110, column: 10, scope: !156)
!161 = !DILocation(line: 110, column: 3, scope: !156)
!162 = distinct !DISubprogram(name: "getline", scope: !31, file: !31, line: 118, type: !163, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !167)
!163 = !DISubroutineType(types: !164)
!164 = !{!165, !7, !166, !58}
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !85, line: 193, baseType: !86)
