; ModuleID = 'omega.bc'
source_filename = "omega.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.omega_pb_d = type { i32, i32, i32, i32, i32, i32, i8, i8, i32*, i32*, %struct.eqn_d*, %struct.eqn_d*, %struct.eqn_d* }
%struct.eqn_d = type { i32, i32, i32, i32* }
%struct.param_info = type { i8*, i32, i8, i32, i32, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@omega_when_reduced = dso_local local_unnamed_addr global void (%struct.omega_pb_d*)* @omega_no_procedure, align 8, !dbg !0
@.str = private unnamed_addr constant [2 x i8] c"!\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "omega_when_reduced", scope: !2, file: !3, line: 185, type: !213, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !159, globals: !164, nameTableKind: None)
!3 = !DIFile(filename: "omega.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{!5, !11, !148, !154}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omega_eqn_color", file: !6, line: 55, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "./omega.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10}
!9 = !DIEnumerator(name: "omega_black", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "omega_red", value: 1, isUnsigned: true)
!11 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !12, file: !3, line: 506, baseType: !7, size: 32, elements: !144)
!12 = distinct !DISubprogram(name: "omega_pretty_print_problem", scope: !3, file: !3, line: 499, type: !13, scopeLine: 500, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !105)
!13 = !DISubroutineType(types: !14)
!14 = !{null, !15, !78}
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !17, line: 7, baseType: !18)
!17 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!18 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !19, line: 49, size: 1728, elements: !20)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!20 = !{!21, !23, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !39, !41, !42, !43, !47, !49, !51, !55, !58, !60, !63, !66, !67, !69, !73, !74}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !18, file: !19, line: 51, baseType: !22, size: 32)
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !18, file: !19, line: 54, baseType: !24, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !18, file: !19, line: 55, baseType: !24, size: 64, offset: 128)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !18, file: !19, line: 56, baseType: !24, size: 64, offset: 192)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !18, file: !19, line: 57, baseType: !24, size: 64, offset: 256)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !18, file: !19, line: 58, baseType: !24, size: 64, offset: 320)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !18, file: !19, line: 59, baseType: !24, size: 64, offset: 384)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !18, file: !19, line: 60, baseType: !24, size: 64, offset: 448)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !18, file: !19, line: 61, baseType: !24, size: 64, offset: 512)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !18, file: !19, line: 64, baseType: !24, size: 64, offset: 576)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !18, file: !19, line: 65, baseType: !24, size: 64, offset: 640)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !18, file: !19, line: 66, baseType: !24, size: 64, offset: 704)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !18, file: !19, line: 68, baseType: !37, size: 64, offset: 768)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !19, line: 36, flags: DIFlagFwdDecl)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !18, file: !19, line: 70, baseType: !40, size: 64, offset: 832)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !18, file: !19, line: 72, baseType: !22, size: 32, offset: 896)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !18, file: !19, line: 73, baseType: !22, size: 32, offset: 928)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !18, file: !19, line: 74, baseType: !44, size: 64, offset: 960)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !45, line: 152, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!46 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !18, file: !19, line: 77, baseType: !48, size: 16, offset: 1024)
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !18, file: !19, line: 78, baseType: !50, size: 8, offset: 1040)
!50 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !18, file: !19, line: 79, baseType: !52, size: 8, offset: 1048)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 8, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 1)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !18, file: !19, line: 81, baseType: !56, size: 64, offset: 1088)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !19, line: 43, baseType: null)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !18, file: !19, line: 89, baseType: !59, size: 64, offset: 1152)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !45, line: 153, baseType: !46)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !18, file: !19, line: 91, baseType: !61, size: 64, offset: 1216)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !19, line: 37, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !18, file: !19, line: 92, baseType: !64, size: 64, offset: 1280)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !19, line: 38, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !18, file: !19, line: 93, baseType: !40, size: 64, offset: 1344)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !18, file: !19, line: 94, baseType: !68, size: 64, offset: 1408)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !18, file: !19, line: 95, baseType: !70, size: 64, offset: 1472)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !18, file: !19, line: 96, baseType: !22, size: 32, offset: 1536)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !18, file: !19, line: 98, baseType: !75, size: 160, offset: 1568)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 160, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 20)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "omega_pb", file: !6, line: 115, baseType: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "omega_pb_d", file: !6, line: 75, size: 576, elements: !81)
!81 = !{!82, !83, !84, !85, !86, !87, !88, !90, !91, !93, !94, !103, !104}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "num_vars", scope: !80, file: !6, line: 78, baseType: !22, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "safe_vars", scope: !80, file: !6, line: 85, baseType: !22, size: 32, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "num_eqs", scope: !80, file: !6, line: 88, baseType: !22, size: 32, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "num_geqs", scope: !80, file: !6, line: 90, baseType: !22, size: 32, offset: 96)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "num_subs", scope: !80, file: !6, line: 92, baseType: !22, size: 32, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "hash_version", scope: !80, file: !6, line: 94, baseType: !22, size: 32, offset: 160)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "variables_initialized", scope: !80, file: !6, line: 95, baseType: !89, size: 8, offset: 192)
!89 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "variables_freed", scope: !80, file: !6, line: 96, baseType: !89, size: 8, offset: 200)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !80, file: !6, line: 103, baseType: !92, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "forwarding_address", scope: !80, file: !6, line: 105, baseType: !92, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "geqs", scope: !80, file: !6, line: 108, baseType: !95, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "eqn", file: !6, line: 73, baseType: !96)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eqn_d", file: !6, line: 61, size: 192, elements: !98)
!98 = !{!99, !100, !101, !102}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !97, file: !6, line: 63, baseType: !22, size: 32)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "touched", scope: !97, file: !6, line: 64, baseType: !22, size: 32, offset: 32)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !97, file: !6, line: 65, baseType: !5, size: 32, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "coef", scope: !97, file: !6, line: 72, baseType: !92, size: 64, offset: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "eqs", scope: !80, file: !6, line: 111, baseType: !95, size: 64, offset: 448)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "subs", scope: !80, file: !6, line: 114, baseType: !95, size: 64, offset: 512)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113, !114, !116, !117, !118, !122, !124, !125, !126, !127, !128, !129, !130, !131, !136, !137, !139, !140}
!106 = !DILocalVariable(name: "file", arg: 1, scope: !12, file: !3, line: 499, type: !15)
!107 = !DILocalVariable(name: "pb", arg: 2, scope: !12, file: !3, line: 499, type: !78)
!108 = !DILocalVariable(name: "e", scope: !12, file: !3, line: 501, type: !22)
!109 = !DILocalVariable(name: "v", scope: !12, file: !3, line: 501, type: !22)
!110 = !DILocalVariable(name: "v1", scope: !12, file: !3, line: 501, type: !22)
!111 = !DILocalVariable(name: "v2", scope: !12, file: !3, line: 501, type: !22)
!112 = !DILocalVariable(name: "v3", scope: !12, file: !3, line: 501, type: !22)
!113 = !DILocalVariable(name: "t", scope: !12, file: !3, line: 501, type: !22)
!114 = !DILocalVariable(name: "live", scope: !12, file: !3, line: 502, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!116 = !DILocalVariable(name: "stuffPrinted", scope: !12, file: !3, line: 503, type: !22)
!117 = !DILocalVariable(name: "change", scope: !12, file: !3, line: 504, type: !89)
!118 = !DILocalVariable(name: "po", scope: !12, file: !3, line: 510, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "partial_order_type", scope: !12, file: !3, line: 508, baseType: !11)
!122 = !DILocalVariable(name: "po_eq", scope: !12, file: !3, line: 512, type: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!124 = !DILocalVariable(name: "last_links", scope: !12, file: !3, line: 513, type: !92)
!125 = !DILocalVariable(name: "first_links", scope: !12, file: !3, line: 514, type: !92)
!126 = !DILocalVariable(name: "chain_length", scope: !12, file: !3, line: 515, type: !92)
!127 = !DILocalVariable(name: "chain", scope: !12, file: !3, line: 516, type: !92)
!128 = !DILocalVariable(name: "i", scope: !12, file: !3, line: 517, type: !22)
!129 = !DILocalVariable(name: "m", scope: !12, file: !3, line: 517, type: !22)
!130 = !DILocalVariable(name: "multiprint", scope: !12, file: !3, line: 518, type: !89)
!131 = !DILocalVariable(name: "tmp", scope: !132, file: !3, line: 637, type: !22)
!132 = distinct !DILexicalBlock(scope: !133, file: !3, line: 636, column: 4)
!133 = distinct !DILexicalBlock(scope: !134, file: !3, line: 540, column: 2)
!134 = distinct !DILexicalBlock(scope: !135, file: !3, line: 524, column: 5)
!135 = distinct !DILexicalBlock(scope: !12, file: !3, line: 523, column: 7)
!136 = !DILocalVariable(name: "first", scope: !132, file: !3, line: 638, type: !89)
!137 = !DILocalVariable(name: "tmp", scope: !138, file: !3, line: 710, type: !22)
!138 = distinct !DILexicalBlock(scope: !133, file: !3, line: 709, column: 4)
!139 = !DILocalVariable(name: "first", scope: !138, file: !3, line: 711, type: !89)
!140 = !DILocalVariable(name: "eq", scope: !141, file: !3, line: 742, type: !95)
!141 = distinct !DILexicalBlock(scope: !142, file: !3, line: 741, column: 2)
!142 = distinct !DILexicalBlock(scope: !143, file: !3, line: 740, column: 7)
!143 = distinct !DILexicalBlock(scope: !134, file: !3, line: 740, column: 7)
!144 = !{!145, !146, !147}
!145 = !DIEnumerator(name: "none", value: 0, isUnsigned: true)
!146 = !DIEnumerator(name: "le", value: 1, isUnsigned: true)
!147 = !DIEnumerator(name: "lt", value: 2, isUnsigned: true)
!148 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omega_result", file: !6, line: 41, baseType: !7, size: 32, elements: !149)
!149 = !{!150, !151, !152, !153}
!150 = !DIEnumerator(name: "omega_false", value: 0, isUnsigned: true)
!151 = !DIEnumerator(name: "omega_true", value: 1, isUnsigned: true)
!152 = !DIEnumerator(name: "omega_unknown", value: 2, isUnsigned: true)
!153 = !DIEnumerator(name: "omega_simplify", value: 3, isUnsigned: true)
!154 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !3, line: 1400, baseType: !7, size: 32, elements: !155)
!155 = !{!156, !157, !158}
!156 = !DIEnumerator(name: "normalize_false", value: 0, isUnsigned: true)
!157 = !DIEnumerator(name: "normalize_uncoupled", value: 1, isUnsigned: true)
!158 = !DIEnumerator(name: "normalize_coupled", value: 2, isUnsigned: true)
!159 = !{!115, !89, !22, !160, !68, !161, !119, !123, !92, !163, !79, !95}
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!164 = !{!0, !165, !167, !169, !171, !177, !179, !181, !183, !185, !187, !189, !191, !193, !195, !197, !199, !201, !203, !205, !207, !209, !211}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "hash_master", scope: !2, file: !3, line: 62, type: !95, isLocal: true, isDefinition: true)
!167 = !DIGlobalVariableExpression(var: !168, expr: !DIExpression())
!168 = distinct !DIGlobalVariable(name: "next_key", scope: !2, file: !3, line: 63, type: !22, isLocal: true, isDefinition: true)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "omega_found_reduction", scope: !2, file: !3, line: 75, type: !148, isLocal: true, isDefinition: true)
!171 = !DIGlobalVariableExpression(var: !172, expr: !DIExpression())
!172 = distinct !DIGlobalVariable(name: "wild_name", scope: !2, file: !3, line: 88, type: !173, isLocal: true, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 64000, elements: !174)
!174 = !{!175, !176}
!175 = !DISubrange(count: 200)
!176 = !DISubrange(count: 40)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "packing", scope: !2, file: !3, line: 929, type: !92, isLocal: true, isDefinition: true)
!179 = !DIGlobalVariableExpression(var: !180, expr: !DIExpression())
!180 = distinct !DIGlobalVariable(name: "fast_lookup", scope: !2, file: !3, line: 1397, type: !92, isLocal: true, isDefinition: true)
!181 = !DIGlobalVariableExpression(var: !182, expr: !DIExpression())
!182 = distinct !DIGlobalVariable(name: "fast_lookup_red", scope: !2, file: !3, line: 1398, type: !92, isLocal: true, isDefinition: true)
!183 = !DIGlobalVariableExpression(var: !184, expr: !DIExpression())
!184 = distinct !DIGlobalVariable(name: "original_problem", scope: !2, file: !3, line: 94, type: !78, isLocal: true, isDefinition: true)
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "no_problem", scope: !2, file: !3, line: 91, type: !78, isLocal: true, isDefinition: true)
!187 = !DIGlobalVariableExpression(var: !188, expr: !DIExpression())
!188 = distinct !DIGlobalVariable(name: "conservative", scope: !2, file: !3, line: 71, type: !22, isLocal: true, isDefinition: true)
!189 = !DIGlobalVariableExpression(var: !190, expr: !DIExpression())
!190 = distinct !DIGlobalVariable(name: "omega_reduce_with_subs", scope: !2, file: !3, line: 47, type: !89, isLocal: true, isDefinition: true)
!191 = !DIGlobalVariableExpression(var: !192, expr: !DIExpression())
!192 = distinct !DIGlobalVariable(name: "please_no_equalities_in_simplified_problems", scope: !2, file: !3, line: 85, type: !22, isLocal: true, isDefinition: true)
!193 = !DIGlobalVariableExpression(var: !194, expr: !DIExpression())
!194 = distinct !DIGlobalVariable(name: "omega_verify_simplification", scope: !2, file: !3, line: 51, type: !89, isLocal: true, isDefinition: true)
!195 = !DIGlobalVariableExpression(var: !196, expr: !DIExpression())
!196 = distinct !DIGlobalVariable(name: "omega_solve_depth", scope: !2, file: !3, line: 4783, type: !22, isLocal: true, isDefinition: true)
!197 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression())
!198 = distinct !DIGlobalVariable(name: "in_approximate_mode", scope: !2, file: !3, line: 67, type: !89, isLocal: true, isDefinition: true)
!199 = !DIGlobalVariableExpression(var: !200, expr: !DIExpression())
!200 = distinct !DIGlobalVariable(name: "may_be_red", scope: !2, file: !3, line: 81, type: !22, isLocal: true, isDefinition: true)
!201 = !DIGlobalVariableExpression(var: !202, expr: !DIExpression())
!202 = distinct !DIGlobalVariable(name: "omega_single_result", scope: !2, file: !3, line: 54, type: !89, isLocal: true, isDefinition: true)
!203 = !DIGlobalVariableExpression(var: !204, expr: !DIExpression())
!204 = distinct !DIGlobalVariable(name: "return_single_result", scope: !2, file: !3, line: 57, type: !22, isLocal: true, isDefinition: true)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "create_color", scope: !2, file: !3, line: 78, type: !89, isLocal: true, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "hash_version", scope: !2, file: !3, line: 64, type: !22, isLocal: true, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "omega_initialized", scope: !2, file: !3, line: 5518, type: !89, isLocal: true, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "next_wild_card", scope: !2, file: !3, line: 769, type: !22, isLocal: true, isDefinition: true)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DISubroutineType(types: !215)
!215 = !{null, !78}
!216 = !DIGlobalVariableExpression(var: !198, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!217 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!218 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!219 = !{i32 2, !"Dwarf Version", i32 4}
!220 = !{i32 2, !"Debug Info Version", i32 3}
!221 = !{i32 1, !"wchar_size", i32 4}
!222 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!223 = distinct !DISubprogram(name: "vprintf", scope: !224, file: !224, line: 39, type: !225, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !235)
!224 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!225 = !DISubroutineType(types: !226)
!226 = !{!22, !227, !228}
!227 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !161)
!228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !229, size: 64)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !230)
!230 = !{!231, !232, !233, !234}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !229, file: !3, baseType: !7, size: 32)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !229, file: !3, baseType: !7, size: 32, offset: 32)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !229, file: !3, baseType: !68, size: 64, offset: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !229, file: !3, baseType: !68, size: 64, offset: 128)
!235 = !{!236, !237}
!236 = !DILocalVariable(name: "__fmt", arg: 1, scope: !223, file: !224, line: 39, type: !227)
!237 = !DILocalVariable(name: "__arg", arg: 2, scope: !223, file: !224, line: 39, type: !228)
!238 = !DILocation(line: 0, scope: !223)
!239 = !DILocation(line: 41, column: 20, scope: !223)
!240 = !DILocation(line: 41, column: 10, scope: !223)
!241 = !DILocation(line: 41, column: 3, scope: !223)
!242 = distinct !DISubprogram(name: "getchar", scope: !224, file: !224, line: 47, type: !243, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !245)
!243 = !DISubroutineType(types: !244)
!244 = !{!22}
!245 = !{}
!246 = !DILocation(line: 49, column: 16, scope: !242)
!247 = !DILocation(line: 49, column: 10, scope: !242)
!248 = !DILocation(line: 49, column: 3, scope: !242)
!249 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !224, file: !224, line: 56, type: !250, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !252)
!250 = !DISubroutineType(types: !251)
!251 = !{!22, !15}
!252 = !{!253}
!253 = !DILocalVariable(name: "__fp", arg: 1, scope: !249, file: !224, line: 56, type: !15)
!254 = !DILocation(line: 0, scope: !249)
!255 = !DILocation(line: 58, column: 10, scope: !249)
!256 = !DILocation(line: 58, column: 3, scope: !249)
!257 = distinct !DISubprogram(name: "getc_unlocked", scope: !224, file: !224, line: 66, type: !250, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !258)
!258 = !{!259}
!259 = !DILocalVariable(name: "__fp", arg: 1, scope: !257, file: !224, line: 66, type: !15)
!260 = !DILocation(line: 0, scope: !257)
!261 = !DILocation(line: 68, column: 10, scope: !257)
!262 = !DILocation(line: 68, column: 3, scope: !257)
!263 = distinct !DISubprogram(name: "getchar_unlocked", scope: !224, file: !224, line: 73, type: !243, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !245)
!264 = !DILocation(line: 75, column: 10, scope: !263)
!265 = !DILocation(line: 75, column: 3, scope: !263)
!266 = distinct !DISubprogram(name: "putchar", scope: !224, file: !224, line: 82, type: !267, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !269)
!267 = !DISubroutineType(types: !268)
!268 = !{!22, !22}
!269 = !{!270}
!270 = !DILocalVariable(name: "__c", arg: 1, scope: !266, file: !224, line: 82, type: !22)
!271 = !DILocation(line: 0, scope: !266)
!272 = !DILocation(line: 84, column: 21, scope: !266)
!273 = !DILocation(line: 84, column: 10, scope: !266)
!274 = !DILocation(line: 84, column: 3, scope: !266)
!275 = distinct !DISubprogram(name: "fputc_unlocked", scope: !224, file: !224, line: 91, type: !276, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !278)
!276 = !DISubroutineType(types: !277)
!277 = !{!22, !22, !15}
!278 = !{!279, !280}
!279 = !DILocalVariable(name: "__c", arg: 1, scope: !275, file: !224, line: 91, type: !22)
!280 = !DILocalVariable(name: "__stream", arg: 2, scope: !275, file: !224, line: 91, type: !15)
!281 = !DILocation(line: 0, scope: !275)
!282 = !DILocation(line: 93, column: 10, scope: !275)
!283 = !DILocation(line: 93, column: 3, scope: !275)
!284 = distinct !DISubprogram(name: "putc_unlocked", scope: !224, file: !224, line: 101, type: !276, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !285)
!285 = !{!286, !287}
!286 = !DILocalVariable(name: "__c", arg: 1, scope: !284, file: !224, line: 101, type: !22)
!287 = !DILocalVariable(name: "__stream", arg: 2, scope: !284, file: !224, line: 101, type: !15)
!288 = !DILocation(line: 0, scope: !284)
!289 = !DILocation(line: 103, column: 10, scope: !284)
!290 = !DILocation(line: 103, column: 3, scope: !284)
!291 = distinct !DISubprogram(name: "putchar_unlocked", scope: !224, file: !224, line: 108, type: !267, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !292)
!292 = !{!293}
!293 = !DILocalVariable(name: "__c", arg: 1, scope: !291, file: !224, line: 108, type: !22)
!294 = !DILocation(line: 0, scope: !291)
!295 = !DILocation(line: 110, column: 10, scope: !291)
!296 = !DILocation(line: 110, column: 3, scope: !291)
!297 = distinct !DISubprogram(name: "getline", scope: !224, file: !224, line: 118, type: !298, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !302)
!298 = !DISubroutineType(types: !299)
!299 = !{!300, !160, !301, !15}
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !45, line: 193, baseType: !46)
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!302 = !{!303, !304, !305}
!303 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !297, file: !224, line: 118, type: !160)
!304 = !DILocalVariable(name: "__n", arg: 2, scope: !297, file: !224, line: 118, type: !301)
!305 = !DILocalVariable(name: "__stream", arg: 3, scope: !297, file: !224, line: 118, type: !15)
!306 = !DILocation(line: 0, scope: !297)
!307 = !DILocation(line: 120, column: 10, scope: !297)
!308 = !DILocation(line: 120, column: 3, scope: !297)
!309 = distinct !DISubprogram(name: "feof_unlocked", scope: !224, file: !224, line: 128, type: !250, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !310)
!310 = !{!311}
!311 = !DILocalVariable(name: "__stream", arg: 1, scope: !309, file: !224, line: 128, type: !15)
!312 = !DILocation(line: 0, scope: !309)
!313 = !DILocation(line: 130, column: 10, scope: !309)
!314 = !DILocation(line: 130, column: 3, scope: !309)
!315 = distinct !DISubprogram(name: "ferror_unlocked", scope: !224, file: !224, line: 135, type: !250, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !316)
!316 = !{!317}
!317 = !DILocalVariable(name: "__stream", arg: 1, scope: !315, file: !224, line: 135, type: !15)
!318 = !DILocation(line: 0, scope: !315)
!319 = !DILocation(line: 137, column: 10, scope: !315)
!320 = !DILocation(line: 137, column: 3, scope: !315)
!321 = distinct !DISubprogram(name: "tolower", scope: !322, file: !322, line: 207, type: !267, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !323)
!322 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!323 = !{!324}
!324 = !DILocalVariable(name: "__c", arg: 1, scope: !321, file: !322, line: 207, type: !22)
!325 = !DILocation(line: 0, scope: !321)
!326 = !DILocation(line: 209, column: 22, scope: !321)
!327 = !DILocation(line: 209, column: 39, scope: !321)
!328 = !DILocation(line: 209, column: 38, scope: !321)
!329 = !DILocation(line: 209, column: 37, scope: !321)
!330 = !DILocation(line: 209, column: 10, scope: !321)
!331 = !DILocation(line: 209, column: 3, scope: !321)
!332 = distinct !DISubprogram(name: "toupper", scope: !322, file: !322, line: 213, type: !267, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !333)
!333 = !{!334}
!334 = !DILocalVariable(name: "__c", arg: 1, scope: !332, file: !322, line: 213, type: !22)
!335 = !DILocation(line: 0, scope: !332)
!336 = !DILocation(line: 215, column: 22, scope: !332)
!337 = !DILocation(line: 215, column: 39, scope: !332)
!338 = !DILocation(line: 215, column: 38, scope: !332)
!339 = !DILocation(line: 215, column: 37, scope: !332)
!340 = !DILocation(line: 215, column: 10, scope: !332)
!341 = !DILocation(line: 215, column: 3, scope: !332)
!342 = distinct !DISubprogram(name: "atoi", scope: !343, file: !343, line: 361, type: !344, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !346)
!343 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!344 = !DISubroutineType(types: !345)
!345 = !{!22, !161}
!346 = !{!347}
!347 = !DILocalVariable(name: "__nptr", arg: 1, scope: !342, file: !343, line: 361, type: !161)
!348 = !DILocation(line: 0, scope: !342)
!349 = !DILocation(line: 363, column: 16, scope: !342)
!350 = !DILocation(line: 363, column: 10, scope: !342)
!351 = !DILocation(line: 363, column: 3, scope: !342)
!352 = distinct !DISubprogram(name: "atol", scope: !343, file: !343, line: 366, type: !353, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !355)
!353 = !DISubroutineType(types: !354)
!354 = !{!46, !161}
!355 = !{!356}
!356 = !DILocalVariable(name: "__nptr", arg: 1, scope: !352, file: !343, line: 366, type: !161)
!357 = !DILocation(line: 0, scope: !352)
!358 = !DILocation(line: 368, column: 10, scope: !352)
!359 = !DILocation(line: 368, column: 3, scope: !352)
!360 = distinct !DISubprogram(name: "atoll", scope: !343, file: !343, line: 373, type: !361, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !364)
!361 = !DISubroutineType(types: !362)
!362 = !{!363, !161}
!363 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!364 = !{!365}
!365 = !DILocalVariable(name: "__nptr", arg: 1, scope: !360, file: !343, line: 373, type: !161)
!366 = !DILocation(line: 0, scope: !360)
!367 = !DILocation(line: 375, column: 10, scope: !360)
!368 = !DILocation(line: 375, column: 3, scope: !360)
!369 = distinct !DISubprogram(name: "bsearch", scope: !370, file: !370, line: 20, type: !371, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !379)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!371 = !DISubroutineType(types: !372)
!372 = !{!68, !373, !373, !70, !70, !375}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !343, line: 808, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !377, size: 64)
!377 = !DISubroutineType(types: !378)
!378 = !{!22, !373, !373}
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!380 = !DILocalVariable(name: "__key", arg: 1, scope: !369, file: !370, line: 20, type: !373)
!381 = !DILocalVariable(name: "__base", arg: 2, scope: !369, file: !370, line: 20, type: !373)
!382 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !369, file: !370, line: 20, type: !70)
!383 = !DILocalVariable(name: "__size", arg: 4, scope: !369, file: !370, line: 20, type: !70)
!384 = !DILocalVariable(name: "__compar", arg: 5, scope: !369, file: !370, line: 21, type: !375)
!385 = !DILocalVariable(name: "__l", scope: !369, file: !370, line: 23, type: !70)
!386 = !DILocalVariable(name: "__u", scope: !369, file: !370, line: 23, type: !70)
!387 = !DILocalVariable(name: "__idx", scope: !369, file: !370, line: 23, type: !70)
!388 = !DILocalVariable(name: "__p", scope: !369, file: !370, line: 24, type: !373)
!389 = !DILocalVariable(name: "__comparison", scope: !369, file: !370, line: 25, type: !22)
!390 = !DILocation(line: 0, scope: !369)
!391 = !DILocation(line: 29, column: 3, scope: !369)
!392 = !DILocation(line: 27, column: 7, scope: !369)
!393 = !DILocation(line: 29, column: 14, scope: !369)
!394 = !DILocation(line: 31, column: 20, scope: !395)
!395 = distinct !DILexicalBlock(scope: !369, file: !370, line: 30, column: 5)
!396 = !DILocation(line: 31, column: 27, scope: !395)
!397 = !DILocation(line: 32, column: 56, scope: !395)
!398 = !DILocation(line: 32, column: 47, scope: !395)
!399 = !DILocation(line: 33, column: 22, scope: !395)
!400 = !DILocation(line: 34, column: 24, scope: !401)
!401 = distinct !DILexicalBlock(scope: !395, file: !370, line: 34, column: 11)
!402 = !DILocation(line: 34, column: 11, scope: !395)
!403 = !DILocation(line: 36, column: 29, scope: !404)
!404 = distinct !DILexicalBlock(scope: !401, file: !370, line: 36, column: 16)
!405 = !DILocation(line: 36, column: 16, scope: !401)
!406 = !DILocation(line: 37, column: 14, scope: !404)
!407 = distinct !{!407, !391, !408}
!408 = !DILocation(line: 40, column: 5, scope: !369)
!409 = !DILocation(line: 43, column: 1, scope: !369)
!410 = distinct !DISubprogram(name: "atof", scope: !411, file: !411, line: 25, type: !412, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !415)
!411 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!412 = !DISubroutineType(types: !413)
!413 = !{!414, !161}
!414 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!415 = !{!416}
!416 = !DILocalVariable(name: "__nptr", arg: 1, scope: !410, file: !411, line: 25, type: !161)
!417 = !DILocation(line: 0, scope: !410)
!418 = !DILocation(line: 27, column: 10, scope: !410)
!419 = !DILocation(line: 27, column: 3, scope: !410)
!420 = distinct !DISubprogram(name: "strtoimax", scope: !421, file: !421, line: 324, type: !422, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !428)
!421 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!422 = !DISubroutineType(types: !423)
!423 = !{!424, !227, !427, !22}
!424 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !425, line: 101, baseType: !426)
!425 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !45, line: 72, baseType: !46)
!427 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !160)
!428 = !{!429, !430, !431}
!429 = !DILocalVariable(name: "nptr", arg: 1, scope: !420, file: !421, line: 324, type: !227)
!430 = !DILocalVariable(name: "endptr", arg: 2, scope: !420, file: !421, line: 324, type: !427)
!431 = !DILocalVariable(name: "base", arg: 3, scope: !420, file: !421, line: 324, type: !22)
!432 = !DILocation(line: 0, scope: !420)
!433 = !DILocation(line: 327, column: 10, scope: !420)
!434 = !DILocation(line: 327, column: 3, scope: !420)
!435 = distinct !DISubprogram(name: "strtoumax", scope: !421, file: !421, line: 336, type: !436, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !440)
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !227, !427, !22}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !425, line: 102, baseType: !439)
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !45, line: 73, baseType: !72)
!440 = !{!441, !442, !443}
!441 = !DILocalVariable(name: "nptr", arg: 1, scope: !435, file: !421, line: 336, type: !227)
!442 = !DILocalVariable(name: "endptr", arg: 2, scope: !435, file: !421, line: 336, type: !427)
!443 = !DILocalVariable(name: "base", arg: 3, scope: !435, file: !421, line: 336, type: !22)
!444 = !DILocation(line: 0, scope: !435)
!445 = !DILocation(line: 339, column: 10, scope: !435)
!446 = !DILocation(line: 339, column: 3, scope: !435)
!447 = distinct !DISubprogram(name: "wcstoimax", scope: !421, file: !421, line: 348, type: !448, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !457)
!448 = !DISubroutineType(types: !449)
!449 = !{!424, !450, !454, !22}
!450 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !421, line: 34, baseType: !22)
!454 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !455)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !456, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!457 = !{!458, !459, !460}
!458 = !DILocalVariable(name: "nptr", arg: 1, scope: !447, file: !421, line: 348, type: !450)
!459 = !DILocalVariable(name: "endptr", arg: 2, scope: !447, file: !421, line: 348, type: !454)
!460 = !DILocalVariable(name: "base", arg: 3, scope: !447, file: !421, line: 348, type: !22)
!461 = !DILocation(line: 0, scope: !447)
!462 = !DILocation(line: 351, column: 10, scope: !447)
!463 = !DILocation(line: 351, column: 3, scope: !447)
!464 = distinct !DISubprogram(name: "wcstoumax", scope: !421, file: !421, line: 362, type: !465, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !467)
!465 = !DISubroutineType(types: !466)
!466 = !{!438, !450, !454, !22}
!467 = !{!468, !469, !470}
!468 = !DILocalVariable(name: "nptr", arg: 1, scope: !464, file: !421, line: 362, type: !450)
!469 = !DILocalVariable(name: "endptr", arg: 2, scope: !464, file: !421, line: 362, type: !454)
!470 = !DILocalVariable(name: "base", arg: 3, scope: !464, file: !421, line: 362, type: !22)
!471 = !DILocation(line: 0, scope: !464)
!472 = !DILocation(line: 365, column: 10, scope: !464)
!473 = !DILocation(line: 365, column: 3, scope: !464)
!474 = distinct !DISubprogram(name: "stat", scope: !475, file: !475, line: 453, type: !476, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !515)
!475 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!476 = !DISubroutineType(types: !477)
!477 = !{!22, !161, !478}
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !480, line: 46, size: 1152, elements: !481)
!480 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!481 = !{!482, !484, !486, !488, !490, !492, !494, !495, !496, !497, !499, !501, !509, !510, !511}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !479, file: !480, line: 48, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !45, line: 145, baseType: !72)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !479, file: !480, line: 53, baseType: !485, size: 64, offset: 64)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !45, line: 148, baseType: !72)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !479, file: !480, line: 61, baseType: !487, size: 64, offset: 128)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !45, line: 151, baseType: !72)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !479, file: !480, line: 62, baseType: !489, size: 32, offset: 192)
!489 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !45, line: 150, baseType: !7)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !479, file: !480, line: 64, baseType: !491, size: 32, offset: 224)
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !45, line: 146, baseType: !7)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !479, file: !480, line: 65, baseType: !493, size: 32, offset: 256)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !45, line: 147, baseType: !7)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !479, file: !480, line: 67, baseType: !22, size: 32, offset: 288)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !479, file: !480, line: 69, baseType: !483, size: 64, offset: 320)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !479, file: !480, line: 74, baseType: !44, size: 64, offset: 384)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !479, file: !480, line: 78, baseType: !498, size: 64, offset: 448)
!498 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !45, line: 174, baseType: !46)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !479, file: !480, line: 80, baseType: !500, size: 64, offset: 512)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !45, line: 179, baseType: !46)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !479, file: !480, line: 91, baseType: !502, size: 128, offset: 576)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !503, line: 10, size: 128, elements: !504)
!503 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!504 = !{!505, !507}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !502, file: !503, line: 12, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !45, line: 160, baseType: !46)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !502, file: !503, line: 16, baseType: !508, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !45, line: 196, baseType: !46)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !479, file: !480, line: 92, baseType: !502, size: 128, offset: 704)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !479, file: !480, line: 93, baseType: !502, size: 128, offset: 832)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !479, file: !480, line: 106, baseType: !512, size: 192, offset: 960)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 192, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 3)
!515 = !{!516, !517}
!516 = !DILocalVariable(name: "__path", arg: 1, scope: !474, file: !475, line: 453, type: !161)
!517 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !474, file: !475, line: 453, type: !478)
!518 = !DILocation(line: 0, scope: !474)
!519 = !DILocation(line: 455, column: 10, scope: !474)
!520 = !DILocation(line: 455, column: 3, scope: !474)
!521 = distinct !DISubprogram(name: "lstat", scope: !475, file: !475, line: 460, type: !476, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !522)
!522 = !{!523, !524}
!523 = !DILocalVariable(name: "__path", arg: 1, scope: !521, file: !475, line: 460, type: !161)
!524 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !521, file: !475, line: 460, type: !478)
!525 = !DILocation(line: 0, scope: !521)
!526 = !DILocation(line: 462, column: 10, scope: !521)
!527 = !DILocation(line: 462, column: 3, scope: !521)
!528 = distinct !DISubprogram(name: "fstat", scope: !475, file: !475, line: 467, type: !529, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !531)
!529 = !DISubroutineType(types: !530)
!530 = !{!22, !22, !478}
!531 = !{!532, !533}
!532 = !DILocalVariable(name: "__fd", arg: 1, scope: !528, file: !475, line: 467, type: !22)
!533 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !528, file: !475, line: 467, type: !478)
!534 = !DILocation(line: 0, scope: !528)
!535 = !DILocation(line: 469, column: 10, scope: !528)
!536 = !DILocation(line: 469, column: 3, scope: !528)
!537 = distinct !DISubprogram(name: "fstatat", scope: !475, file: !475, line: 474, type: !538, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !540)
!538 = !DISubroutineType(types: !539)
!539 = !{!22, !22, !161, !478, !22}
!540 = !{!541, !542, !543, !544}
!541 = !DILocalVariable(name: "__fd", arg: 1, scope: !537, file: !475, line: 474, type: !22)
!542 = !DILocalVariable(name: "__filename", arg: 2, scope: !537, file: !475, line: 474, type: !161)
!543 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !537, file: !475, line: 474, type: !478)
!544 = !DILocalVariable(name: "__flag", arg: 4, scope: !537, file: !475, line: 474, type: !22)
!545 = !DILocation(line: 0, scope: !537)
!546 = !DILocation(line: 477, column: 10, scope: !537)
!547 = !DILocation(line: 477, column: 3, scope: !537)
!548 = distinct !DISubprogram(name: "mknod", scope: !475, file: !475, line: 483, type: !549, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !551)
!549 = !DISubroutineType(types: !550)
!550 = !{!22, !161, !489, !483}
!551 = !{!552, !553, !554}
!552 = !DILocalVariable(name: "__path", arg: 1, scope: !548, file: !475, line: 483, type: !161)
!553 = !DILocalVariable(name: "__mode", arg: 2, scope: !548, file: !475, line: 483, type: !489)
!554 = !DILocalVariable(name: "__dev", arg: 3, scope: !548, file: !475, line: 483, type: !483)
!555 = !DILocation(line: 0, scope: !548)
!556 = !DILocation(line: 485, column: 10, scope: !548)
!557 = !DILocation(line: 485, column: 3, scope: !548)
!558 = distinct !DISubprogram(name: "mknodat", scope: !475, file: !475, line: 491, type: !559, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !561)
!559 = !DISubroutineType(types: !560)
!560 = !{!22, !22, !161, !489, !483}
!561 = !{!562, !563, !564, !565}
!562 = !DILocalVariable(name: "__fd", arg: 1, scope: !558, file: !475, line: 491, type: !22)
!563 = !DILocalVariable(name: "__path", arg: 2, scope: !558, file: !475, line: 491, type: !161)
!564 = !DILocalVariable(name: "__mode", arg: 3, scope: !558, file: !475, line: 491, type: !489)
!565 = !DILocalVariable(name: "__dev", arg: 4, scope: !558, file: !475, line: 491, type: !483)
!566 = !DILocation(line: 0, scope: !558)
!567 = !DILocation(line: 494, column: 10, scope: !558)
!568 = !DILocation(line: 494, column: 3, scope: !558)
!569 = distinct !DISubprogram(name: "stat64", scope: !475, file: !475, line: 502, type: !570, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !592)
!570 = !DISubroutineType(types: !571)
!571 = !{!22, !161, !572}
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !480, line: 119, size: 1152, elements: !574)
!574 = !{!575, !576, !578, !579, !580, !581, !582, !583, !584, !585, !586, !588, !589, !590, !591}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !573, file: !480, line: 121, baseType: !483, size: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !573, file: !480, line: 123, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !45, line: 149, baseType: !72)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !573, file: !480, line: 124, baseType: !487, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !573, file: !480, line: 125, baseType: !489, size: 32, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !573, file: !480, line: 132, baseType: !491, size: 32, offset: 224)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !573, file: !480, line: 133, baseType: !493, size: 32, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !573, file: !480, line: 135, baseType: !22, size: 32, offset: 288)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !573, file: !480, line: 136, baseType: !483, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !573, file: !480, line: 137, baseType: !44, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !573, file: !480, line: 143, baseType: !498, size: 64, offset: 448)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !573, file: !480, line: 144, baseType: !587, size: 64, offset: 512)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !45, line: 180, baseType: !46)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !573, file: !480, line: 152, baseType: !502, size: 128, offset: 576)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !573, file: !480, line: 153, baseType: !502, size: 128, offset: 704)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !573, file: !480, line: 154, baseType: !502, size: 128, offset: 832)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !573, file: !480, line: 164, baseType: !512, size: 192, offset: 960)
!592 = !{!593, !594}
!593 = !DILocalVariable(name: "__path", arg: 1, scope: !569, file: !475, line: 502, type: !161)
!594 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !569, file: !475, line: 502, type: !572)
!595 = !DILocation(line: 0, scope: !569)
!596 = !DILocation(line: 504, column: 10, scope: !569)
!597 = !DILocation(line: 504, column: 3, scope: !569)
!598 = distinct !DISubprogram(name: "lstat64", scope: !475, file: !475, line: 509, type: !570, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !599)
!599 = !{!600, !601}
!600 = !DILocalVariable(name: "__path", arg: 1, scope: !598, file: !475, line: 509, type: !161)
!601 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !598, file: !475, line: 509, type: !572)
!602 = !DILocation(line: 0, scope: !598)
!603 = !DILocation(line: 511, column: 10, scope: !598)
!604 = !DILocation(line: 511, column: 3, scope: !598)
!605 = distinct !DISubprogram(name: "fstat64", scope: !475, file: !475, line: 516, type: !606, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{!22, !22, !572}
!608 = !{!609, !610}
!609 = !DILocalVariable(name: "__fd", arg: 1, scope: !605, file: !475, line: 516, type: !22)
!610 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !605, file: !475, line: 516, type: !572)
!611 = !DILocation(line: 0, scope: !605)
!612 = !DILocation(line: 518, column: 10, scope: !605)
!613 = !DILocation(line: 518, column: 3, scope: !605)
!614 = distinct !DISubprogram(name: "fstatat64", scope: !475, file: !475, line: 523, type: !615, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !617)
!615 = !DISubroutineType(types: !616)
!616 = !{!22, !22, !161, !572, !22}
!617 = !{!618, !619, !620, !621}
!618 = !DILocalVariable(name: "__fd", arg: 1, scope: !614, file: !475, line: 523, type: !22)
!619 = !DILocalVariable(name: "__filename", arg: 2, scope: !614, file: !475, line: 523, type: !161)
!620 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !614, file: !475, line: 523, type: !572)
!621 = !DILocalVariable(name: "__flag", arg: 4, scope: !614, file: !475, line: 523, type: !22)
!622 = !DILocation(line: 0, scope: !614)
!623 = !DILocation(line: 526, column: 10, scope: !614)
!624 = !DILocation(line: 526, column: 3, scope: !614)
!625 = distinct !DISubprogram(name: "omega_no_procedure", scope: !3, file: !3, line: 181, type: !214, scopeLine: 182, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !626)
!626 = !{!627}
!627 = !DILocalVariable(name: "pb", arg: 1, scope: !625, file: !3, line: 181, type: !78)
!628 = !DILocation(line: 0, scope: !625)
!629 = !DILocation(line: 183, column: 1, scope: !625)
!630 = distinct !DISubprogram(name: "omega_print_eqn", scope: !3, file: !3, line: 257, type: !631, scopeLine: 258, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !633)
!631 = !DISubroutineType(types: !632)
!632 = !{null, !15, !78, !95, !89, !22}
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642}
!634 = !DILocalVariable(name: "file", arg: 1, scope: !630, file: !3, line: 257, type: !15)
!635 = !DILocalVariable(name: "pb", arg: 2, scope: !630, file: !3, line: 257, type: !78)
!636 = !DILocalVariable(name: "e", arg: 3, scope: !630, file: !3, line: 257, type: !95)
!637 = !DILocalVariable(name: "test", arg: 4, scope: !630, file: !3, line: 257, type: !89)
!638 = !DILocalVariable(name: "extra", arg: 5, scope: !630, file: !3, line: 257, type: !22)
!639 = !DILocalVariable(name: "i", scope: !630, file: !3, line: 259, type: !22)
!640 = !DILocalVariable(name: "n", scope: !630, file: !3, line: 260, type: !22)
