; ModuleID = 'omp-low.bc'
source_filename = "omp-low.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.omp_region = type { %struct.omp_region*, %struct.omp_region*, %struct.omp_region*, %struct.basic_block_def*, %struct.basic_block_def*, %struct.basic_block_def*, %union.tree_node*, i32, i32, i8 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.gimple_seq_d = type { %struct.gimple_seq_node_d*, %struct.gimple_seq_node_d*, %struct.gimple_seq_d* }

!2871 = !DIEnumerator(name: "CODE_FOR_vec_initv8sf", value: 2949, isUnsigned: true)
!2872 = !DIEnumerator(name: "CODE_FOR_vec_initv4df", value: 2950, isUnsigned: true)
!2873 = !DIEnumerator(name: "CODE_FOR_memory_barrier", value: 2951, isUnsigned: true)
!2874 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapqi", value: 2952, isUnsigned: true)
!2875 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swaphi", value: 2953, isUnsigned: true)
!2876 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapsi", value: 2954, isUnsigned: true)
!2877 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapdi", value: 2955, isUnsigned: true)
!2878 = !DIEnumerator(name: "CODE_FOR_nothing", value: 2956, isUnsigned: true)
!2879 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !398, line: 80, baseType: !7, size: 32, elements: !2880)
!2880 = !{!2881, !2882, !2883, !2884}
!2881 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!2882 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!2883 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!2884 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!2885 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !2886, line: 309, baseType: !7, size: 32, elements: !2887)
!2886 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2887 = !{!2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907}
!2888 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!2889 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!2890 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!2891 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!2892 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!2893 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!2894 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!2895 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!2896 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!2897 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!2898 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!2899 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!2900 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!2901 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!2902 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!2903 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!2904 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!2905 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!2906 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!2907 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!2908 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "copy_body_cge_which", file: !2909, line: 33, baseType: !7, size: 32, elements: !2910)
!2909 = !DIFile(filename: "./tree-inline.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2910 = !{!2911, !2912, !2913}
!2911 = !DIEnumerator(name: "CB_CGE_DUPLICATE", value: 0, isUnsigned: true)
!2912 = !DIEnumerator(name: "CB_CGE_MOVE", value: 1, isUnsigned: true)
!2913 = !DIEnumerator(name: "CB_CGE_MOVE_CLONES", value: 2, isUnsigned: true)
!2914 = !{!2915, !2916, !2917, !2918, !2921, !2922, !2924, !4375, !134, !436, !5, !3051, !3249, !4388, !3283, !2919, !4390, !667, !4398, !2879, !3917, !4403, !2978, !4692, !4695, !4730, !4747, !4748, !3248}
!2915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2916, size: 64)
!2916 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2917 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2919, size: 64)
!2919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2920, size: 64)
!2920 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2923, size: 64)
!2923 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2920)
!2924 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2925, line: 56, baseType: !2926)
!2925 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2927, size: 64)
!2927 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !2928)
!2928 = !{!2929, !2962, !2968, !2981, !3000, !3011, !3016, !3025, !3031, !3044, !3056, !3094, !3605, !3633, !3650, !3651, !3656, !3665, !3671, !3676, !3680, !3684, !4026, !4073, !4079, !4085, !4092, !4105, !4119, !4136, !4148, !4170, !4185, !4357}
!2929 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2927, file: !135, line: 3372, baseType: !2930, size: 64)
!2930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !2931)
!2931 = !{!2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961}
!2932 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2930, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2933 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2930, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2934 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2930, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2935 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2930, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2936 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2930, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2937 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2930, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2938 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2930, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2939 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2930, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2940 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2930, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2941 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2930, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2942 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2930, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2943 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2930, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2944 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2930, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2945 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2930, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2946 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2930, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2947 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2930, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2948 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2930, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2949 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2930, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2950 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2930, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2951 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2930, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2952 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2930, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2953 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2930, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2954 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2930, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2955 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2930, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2956 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2930, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2957 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2930, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2958 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2930, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2959 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2930, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2960 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2930, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2961 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2930, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2962 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2927, file: !135, line: 3373, baseType: !2963, size: 192)
!2963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !2964)
!2964 = !{!2965, !2966, !2967}
!2965 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2963, file: !135, line: 403, baseType: !2930, size: 64)
!2966 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2963, file: !135, line: 404, baseType: !2924, size: 64, offset: 64)
!2967 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2963, file: !135, line: 405, baseType: !2924, size: 64, offset: 128)
!2968 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2927, file: !135, line: 3374, baseType: !2969, size: 320)
!2969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !2970)
!2970 = !{!2971, !2972}
!2971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2969, file: !135, line: 1385, baseType: !2963, size: 192)
!2972 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2969, file: !135, line: 1386, baseType: !2973, size: 128, offset: 192)
!2973 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2974, line: 58, baseType: !2975)
!2974 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2975 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2974, line: 54, size: 128, elements: !2976)
!2976 = !{!2977, !2979}
!2977 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2975, file: !2974, line: 56, baseType: !2978, size: 64)
!2978 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2979 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2975, file: !2974, line: 57, baseType: !2980, size: 64, offset: 64)
!2980 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2981 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2927, file: !135, line: 3375, baseType: !2982, size: 256)
!2982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !2983)
!2983 = !{!2984, !2985}
!2984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2982, file: !135, line: 1398, baseType: !2963, size: 192)
!2985 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2982, file: !135, line: 1399, baseType: !2986, size: 64, offset: 192)
!2986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2987, size: 64)
!2987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2988, line: 52, size: 256, elements: !2989)
!2988 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2989 = !{!2990, !2991, !2992, !2993, !2994, !2995, !2996}
!2990 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2987, file: !2988, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2991 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2987, file: !2988, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2992 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2987, file: !2988, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2993 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2987, file: !2988, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2994 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2987, file: !2988, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2995 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2987, file: !2988, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2996 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2987, file: !2988, line: 62, baseType: !2997, size: 192, offset: 64)
!2997 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2978, size: 192, elements: !2998)
!2998 = !{!2999}
!2999 = !DISubrange(count: 3)
!3000 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2927, file: !135, line: 3376, baseType: !3001, size: 256)
!3001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !3002)
!3002 = !{!3003, !3004}
!3003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3001, file: !135, line: 1409, baseType: !2963, size: 192)
!3004 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !3001, file: !135, line: 1410, baseType: !3005, size: 64, offset: 192)
!3005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3006, size: 64)
!3006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !3007, line: 27, size: 192, elements: !3008)
!3007 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3008 = !{!3009, !3010}
!3009 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !3006, file: !3007, line: 29, baseType: !2973, size: 128)
!3010 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3006, file: !3007, line: 30, baseType: !5, size: 32, offset: 128)
!3011 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2927, file: !135, line: 3377, baseType: !3012, size: 256)
!3012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !3013)
!3013 = !{!3014, !3015}
!3014 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3012, file: !135, line: 1438, baseType: !2963, size: 192)
!3015 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !3012, file: !135, line: 1439, baseType: !2924, size: 64, offset: 192)
!3016 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2927, file: !135, line: 3378, baseType: !3017, size: 256)
!3017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !3018)
!3018 = !{!3019, !3020, !3021}
!3019 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3017, file: !135, line: 1419, baseType: !2963, size: 192)
!3020 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !3017, file: !135, line: 1420, baseType: !2917, size: 32, offset: 192)
!3021 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !3017, file: !135, line: 1421, baseType: !3022, size: 8, offset: 224)
!3022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2920, size: 8, elements: !3023)
!3023 = !{!3024}
!3024 = !DISubrange(count: 1)
!3025 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2927, file: !135, line: 3379, baseType: !3026, size: 320)
!3026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !3027)
!3027 = !{!3028, !3029, !3030}
!3028 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3026, file: !135, line: 1429, baseType: !2963, size: 192)
!3029 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !3026, file: !135, line: 1430, baseType: !2924, size: 64, offset: 192)
!3030 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !3026, file: !135, line: 1431, baseType: !2924, size: 64, offset: 256)
!3031 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2927, file: !135, line: 3380, baseType: !3032, size: 320)
!3032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !3033)
!3033 = !{!3034, !3035}
!3034 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3032, file: !135, line: 1461, baseType: !2963, size: 192)
!3035 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !3032, file: !135, line: 1462, baseType: !3036, size: 128, offset: 192)
!3036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !3037, line: 31, size: 128, elements: !3038)
!3037 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3038 = !{!3039, !3042, !3043}
!3039 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !3036, file: !3037, line: 32, baseType: !3040, size: 64)
!3040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3041, size: 64)
!3041 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2916)
!3042 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !3036, file: !3037, line: 33, baseType: !7, size: 32, offset: 64)
!3043 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !3036, file: !3037, line: 34, baseType: !7, size: 32, offset: 96)
!3044 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2927, file: !135, line: 3381, baseType: !3045, size: 384)
!3045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !3046)
!3046 = !{!3047, !3048, !3053, !3054, !3055}
!3047 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3045, file: !135, line: 2508, baseType: !2963, size: 192)
!3048 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3045, file: !135, line: 2509, baseType: !3049, size: 32, offset: 192)
!3049 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !3050, line: 58, baseType: !3051)
!3050 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3051 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !3052, line: 44, baseType: !7)
!3052 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3053 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3045, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!3054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3045, file: !135, line: 2511, baseType: !2924, size: 64, offset: 256)
!3055 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !3045, file: !135, line: 2512, baseType: !2924, size: 64, offset: 320)
!3056 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2927, file: !135, line: 3382, baseType: !3057, size: 896)
!3057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !3058)
!3058 = !{!3059, !3060, !3061, !3062, !3063, !3064, !3065, !3066, !3067, !3068, !3069, !3070, !3071, !3072, !3073, !3074, !3075, !3076, !3077, !3078, !3079, !3080, !3081, !3082, !3083, !3084, !3085, !3086, !3087, !3088, !3089, !3090, !3091}
!3059 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3057, file: !135, line: 2653, baseType: !3045, size: 384)
!3060 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3057, file: !135, line: 2654, baseType: !2924, size: 64, offset: 384)
!3061 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3057, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!3062 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !3057, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!3063 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !3057, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!3064 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !3057, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!3065 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !3057, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!3066 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !3057, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!3067 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !3057, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!3068 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !3057, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!3069 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !3057, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!3070 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !3057, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!3071 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !3057, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!3072 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !3057, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!3073 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !3057, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!3074 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !3057, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!3075 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !3057, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!3076 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !3057, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!3077 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !3057, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!3078 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !3057, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!3079 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !3057, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!3080 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !3057, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!3081 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !3057, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!3082 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !3057, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!3083 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !3057, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!3084 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !3057, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!3085 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !3057, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!3086 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3057, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!3087 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !3057, file: !135, line: 2705, baseType: !2924, size: 64, offset: 576)
!3088 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3057, file: !135, line: 2706, baseType: !2924, size: 64, offset: 640)
!3089 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !3057, file: !135, line: 2707, baseType: !2924, size: 64, offset: 704)
!3090 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !3057, file: !135, line: 2708, baseType: !2924, size: 64, offset: 768)
!3091 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !3057, file: !135, line: 2711, baseType: !3092, size: 64, offset: 832)
!3092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3093, size: 64)
!3093 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!3094 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2927, file: !135, line: 3383, baseType: !3095, size: 960)
!3095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !3096)
!3096 = !{!3097, !3098}
!3097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3095, file: !135, line: 2757, baseType: !3057, size: 896)
!3098 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !3095, file: !135, line: 2758, baseType: !3099, size: 64, offset: 896)
!3099 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2925, line: 50, baseType: !3100)
!3100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3101, size: 64)
!3101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !3102, line: 240, size: 384, elements: !3103)
!3102 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3103 = !{!3104, !3105, !3106, !3107, !3108, !3109, !3110, !3111, !3112, !3113, !3114}
!3104 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3101, file: !3102, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!3105 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !3101, file: !3102, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3106 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !3101, file: !3102, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!3107 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !3101, file: !3102, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!3108 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !3101, file: !3102, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!3109 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !3101, file: !3102, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!3110 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !3101, file: !3102, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!3111 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !3101, file: !3102, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!3112 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !3101, file: !3102, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!3113 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !3101, file: !3102, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!3114 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !3101, file: !3102, line: 321, baseType: !3115, size: 320, offset: 64)
!3115 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !3102, line: 315, size: 320, elements: !3116)
!3116 = !{!3117, !3572, !3574, !3603, !3604}
!3117 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !3115, file: !3102, line: 316, baseType: !3118, size: 64)
!3118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3119, size: 64, elements: !3023)
!3119 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !3102, line: 183, baseType: !3120)
!3120 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !3102, line: 166, size: 64, elements: !3121)
!3121 = !{!3122, !3123, !3124, !3125, !3126, !3134, !3135, !3147, !3150, !3210, !3211, !3549, !3562, !3569}
!3122 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !3120, file: !3102, line: 168, baseType: !2917, size: 32)
!3123 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !3120, file: !3102, line: 169, baseType: !7, size: 32)
!3124 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !3120, file: !3102, line: 170, baseType: !2922, size: 64)
!3125 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !3120, file: !3102, line: 171, baseType: !3099, size: 64)
!3126 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !3120, file: !3102, line: 172, baseType: !3127, size: 64)
!3127 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2925, line: 53, baseType: !3128)
!3128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3129, size: 64)
!3129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !3102, line: 359, size: 128, elements: !3130)
!3130 = !{!3131, !3132}
!3131 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !3129, file: !3102, line: 360, baseType: !2917, size: 32)
!3132 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !3129, file: !3102, line: 361, baseType: !3133, size: 64, offset: 64)
!3133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3099, size: 64, elements: !3023)
!3134 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !3120, file: !3102, line: 173, baseType: !5, size: 32)
!3135 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !3120, file: !3102, line: 174, baseType: !3136, size: 32)
!3136 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !3102, line: 133, baseType: !3137)
!3137 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !3102, line: 115, size: 32, elements: !3138)
!3138 = !{!3139, !3140, !3141, !3142, !3143, !3144, !3145, !3146}
!3139 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !3137, file: !3102, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!3140 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !3137, file: !3102, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!3141 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !3137, file: !3102, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!3142 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !3137, file: !3102, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!3143 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !3137, file: !3102, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!3144 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !3137, file: !3102, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!3145 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !3137, file: !3102, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!3146 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !3137, file: !3102, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3147 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !3120, file: !3102, line: 175, baseType: !3148, size: 64)
!3148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3149, size: 64)
!3149 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !3102, line: 175, flags: DIFlagFwdDecl)
!3150 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !3120, file: !3102, line: 176, baseType: !3151, size: 64)
!3151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3152, size: 64)
!3152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !3153, line: 75, size: 256, elements: !3154)
!3153 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3154 = !{!3155, !3169, !3170, !3171}
!3155 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !3152, file: !3153, line: 76, baseType: !3156, size: 64)
!3156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3157, size: 64)
!3157 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !3153, line: 68, baseType: !3158)
!3158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !3153, line: 63, size: 320, elements: !3159)
!3159 = !{!3160, !3162, !3163, !3164}
!3160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3158, file: !3153, line: 64, baseType: !3161, size: 64)
!3161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3158, size: 64)
!3162 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3158, file: !3153, line: 65, baseType: !3161, size: 64, offset: 64)
!3163 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !3158, file: !3153, line: 66, baseType: !7, size: 32, offset: 128)
!3164 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !3158, file: !3153, line: 67, baseType: !3165, size: 128, offset: 192)
!3165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3166, size: 128, elements: !3167)
!3166 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !3153, line: 29, baseType: !2978)
!3167 = !{!3168}
!3168 = !DISubrange(count: 2)
!3169 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !3152, file: !3153, line: 77, baseType: !3156, size: 64, offset: 64)
!3170 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !3152, file: !3153, line: 78, baseType: !7, size: 32, offset: 128)
!3171 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !3152, file: !3153, line: 79, baseType: !3172, size: 64, offset: 192)
!3172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3173, size: 64)
!3173 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !3153, line: 49, baseType: !3174)
!3174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !3153, line: 45, size: 832, elements: !3175)
!3175 = !{!3176, !3177, !3178}
!3176 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !3174, file: !3153, line: 46, baseType: !3161, size: 64)
!3177 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !3174, file: !3153, line: 47, baseType: !3151, size: 64, offset: 64)
!3178 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !3174, file: !3153, line: 48, baseType: !3179, size: 704, offset: 128)
!3179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !3180, line: 164, size: 704, elements: !3181)
!3180 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3181 = !{!3182, !3183, !3193, !3194, !3195, !3196, !3197, !3198, !3202, !3206, !3207, !3208, !3209}
!3182 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !3179, file: !3180, line: 166, baseType: !2980, size: 64)
!3183 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !3179, file: !3180, line: 167, baseType: !3184, size: 64, offset: 64)
!3184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3185, size: 64)
!3185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !3180, line: 157, size: 192, elements: !3186)
!3186 = !{!3187, !3188, !3189}
!3187 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !3185, file: !3180, line: 159, baseType: !2919, size: 64)
!3188 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3185, file: !3180, line: 160, baseType: !3184, size: 64, offset: 64)
!3189 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !3185, file: !3180, line: 161, baseType: !3190, size: 32, offset: 128)
!3190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2920, size: 32, elements: !3191)
!3191 = !{!3192}
!3192 = !DISubrange(count: 4)
!3193 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !3179, file: !3180, line: 168, baseType: !2919, size: 64, offset: 128)
!3194 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !3179, file: !3180, line: 169, baseType: !2919, size: 64, offset: 192)
!3195 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !3179, file: !3180, line: 170, baseType: !2919, size: 64, offset: 256)
!3196 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !3179, file: !3180, line: 171, baseType: !2980, size: 64, offset: 320)
!3197 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !3179, file: !3180, line: 172, baseType: !2917, size: 32, offset: 384)
!3198 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !3179, file: !3180, line: 176, baseType: !3199, size: 64, offset: 448)
!3199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3200, size: 64)
!3200 = !DISubroutineType(types: !3201)
!3201 = !{!3184, !2921, !2980}
!3202 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !3179, file: !3180, line: 177, baseType: !3203, size: 64, offset: 512)
!3203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3204, size: 64)
!3204 = !DISubroutineType(types: !3205)
!3205 = !{null, !2921, !3184}
!3206 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !3179, file: !3180, line: 178, baseType: !2921, size: 64, offset: 576)
!3207 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !3179, file: !3180, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!3208 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !3179, file: !3180, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!3209 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !3179, file: !3180, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!3210 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !3120, file: !3102, line: 177, baseType: !2924, size: 64)
!3211 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !3120, file: !3102, line: 178, baseType: !3212, size: 64)
!3212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3213, size: 64)
!3213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !350, line: 217, size: 832, elements: !3214)
!3214 = !{!3215, !3461, !3462, !3463, !3519, !3523, !3524, !3525, !3543, !3544, !3545, !3546, !3547, !3548}
!3215 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !3213, file: !350, line: 219, baseType: !3216, size: 64)
!3216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3217, size: 64)
!3217 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !350, line: 151, baseType: !3218)
!3218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !350, line: 151, size: 128, elements: !3219)
!3219 = !{!3220}
!3220 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3218, file: !350, line: 151, baseType: !3221, size: 128)
!3221 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !350, line: 150, baseType: !3222)
!3222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !350, line: 150, size: 128, elements: !3223)
!3223 = !{!3224, !3225, !3226}
!3224 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3222, file: !350, line: 150, baseType: !7, size: 32)
!3225 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3222, file: !350, line: 150, baseType: !7, size: 32, offset: 32)
!3226 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3222, file: !350, line: 150, baseType: !3227, size: 64, offset: 64)
!3227 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3228, size: 64, elements: !3023)
!3228 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2925, line: 108, baseType: !3229)
!3229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3230, size: 64)
!3230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !350, line: 122, size: 512, elements: !3231)
!3231 = !{!3232, !3233, !3234, !3453, !3454, !3455, !3456, !3457, !3458, !3459}
!3232 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !3230, file: !350, line: 124, baseType: !3212, size: 64)
!3233 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !3230, file: !350, line: 125, baseType: !3212, size: 64, offset: 64)
!3234 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !3230, file: !350, line: 131, baseType: !3235, size: 64, offset: 128)
!3235 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !350, line: 128, size: 64, elements: !3236)
!3236 = !{!3237, !3452}
!3237 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !3235, file: !350, line: 129, baseType: !3238, size: 64)
!3238 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2925, line: 66, baseType: !3239)
!3239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3240, size: 64)
!3240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !398, line: 143, size: 192, elements: !3241)
!3241 = !{!3242, !3450, !3451}
!3242 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !3240, file: !398, line: 145, baseType: !3243, size: 64)
!3243 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !2925, line: 69, baseType: !3244)
!3244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3245, size: 64)
!3245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !398, line: 136, size: 192, elements: !3246)
!3246 = !{!3247, !3448, !3449}
!3247 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3245, file: !398, line: 137, baseType: !3248, size: 64)
!3248 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2925, line: 58, baseType: !3249)
!3249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3250, size: 64)
!3250 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !398, line: 737, size: 768, elements: !3251)
!3251 = !{!3252, !3269, !3303, !3309, !3314, !3319, !3326, !3332, !3338, !3343, !3357, !3362, !3368, !3373, !3383, !3388, !3406, !3413, !3420, !3426, !3431, !3437, !3443}
!3252 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3250, file: !398, line: 738, baseType: !3253, size: 256)
!3253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !398, line: 271, size: 256, elements: !3254)
!3254 = !{!3255, !3256, !3257, !3258, !3259, !3260, !3261, !3262, !3263, !3264, !3265, !3266, !3267, !3268}
!3255 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !3253, file: !398, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!3256 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !3253, file: !398, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!3257 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3253, file: !398, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!3258 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !3253, file: !398, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!3259 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !3253, file: !398, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!3260 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !3253, file: !398, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!3261 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !3253, file: !398, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!3262 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !3253, file: !398, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!3263 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !3253, file: !398, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!3264 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !3253, file: !398, line: 312, baseType: !7, size: 32, offset: 32)
!3265 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !3253, file: !398, line: 316, baseType: !3049, size: 32, offset: 64)
!3266 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !3253, file: !398, line: 319, baseType: !7, size: 32, offset: 96)
!3267 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !3253, file: !398, line: 323, baseType: !3212, size: 64, offset: 128)
!3268 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3253, file: !398, line: 327, baseType: !2924, size: 64, offset: 192)
!3269 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !3250, file: !398, line: 739, baseType: !3270, size: 448)
!3270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !398, line: 350, size: 448, elements: !3271)
!3271 = !{!3272, !3301}
!3272 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !3270, file: !398, line: 353, baseType: !3273, size: 384)
!3273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !398, line: 333, size: 384, elements: !3274)
!3274 = !{!3275, !3276, !3284}
!3275 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3273, file: !398, line: 336, baseType: !3253, size: 256)
!3276 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !3273, file: !398, line: 343, baseType: !3277, size: 64, offset: 256)
!3277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3278, size: 64)
!3278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !3279, line: 37, size: 128, elements: !3280)
!3279 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3280 = !{!3281, !3282}
!3281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3278, file: !3279, line: 39, baseType: !3277, size: 64)
!3282 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !3278, file: !3279, line: 40, baseType: !3283, size: 64, offset: 64)
!3283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2924, size: 64)
!3284 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !3273, file: !398, line: 344, baseType: !3285, size: 64, offset: 320)
!3285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3286, size: 64)
!3286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !3279, line: 45, size: 320, elements: !3287)
!3287 = !{!3288, !3289}
!3288 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3286, file: !3279, line: 47, baseType: !3285, size: 64)
!3289 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !3286, file: !3279, line: 48, baseType: !3290, size: 256, offset: 64)
!3290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !3291)
!3291 = !{!3292, !3294, !3295, !3300}
!3292 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3290, file: !135, line: 1884, baseType: !3293, size: 64)
!3293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3290, size: 64)
!3294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3290, file: !135, line: 1885, baseType: !3293, size: 64, offset: 64)
!3295 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !3290, file: !135, line: 1891, baseType: !3296, size: 64, offset: 128)
!3296 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !3290, file: !135, line: 1891, size: 64, elements: !3297)
!3297 = !{!3298, !3299}
!3298 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3296, file: !135, line: 1891, baseType: !3248, size: 64)
!3299 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !3296, file: !135, line: 1891, baseType: !2924, size: 64)
!3300 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !3290, file: !135, line: 1892, baseType: !3283, size: 64, offset: 192)
!3301 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3270, file: !398, line: 359, baseType: !3302, size: 64, offset: 384)
!3302 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2924, size: 64, elements: !3023)
!3303 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !3250, file: !398, line: 740, baseType: !3304, size: 512)
!3304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !398, line: 365, size: 512, elements: !3305)
!3305 = !{!3306, !3307, !3308}
!3306 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !3304, file: !398, line: 368, baseType: !3273, size: 384)
!3307 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !3304, file: !398, line: 373, baseType: !2924, size: 64, offset: 384)
!3308 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !3304, file: !398, line: 374, baseType: !2924, size: 64, offset: 448)
!3309 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !3250, file: !398, line: 741, baseType: !3310, size: 576)
!3310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !398, line: 380, size: 576, elements: !3311)
!3311 = !{!3312, !3313}
!3312 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !3310, file: !398, line: 383, baseType: !3304, size: 512)
!3313 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3310, file: !398, line: 389, baseType: !3302, size: 64, offset: 512)
!3314 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3250, file: !398, line: 742, baseType: !3315, size: 320)
!3315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !398, line: 395, size: 320, elements: !3316)
!3316 = !{!3317, !3318}
!3317 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3315, file: !398, line: 397, baseType: !3253, size: 256)
!3318 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !3315, file: !398, line: 400, baseType: !3238, size: 64, offset: 256)
!3319 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !3250, file: !398, line: 743, baseType: !3320, size: 448)
!3320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !398, line: 406, size: 448, elements: !3321)
!3321 = !{!3322, !3323, !3324, !3325}
!3322 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3320, file: !398, line: 408, baseType: !3253, size: 256)
!3323 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !3320, file: !398, line: 412, baseType: !2924, size: 64, offset: 256)
!3324 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3320, file: !398, line: 420, baseType: !2924, size: 64, offset: 320)
!3325 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !3320, file: !398, line: 423, baseType: !3238, size: 64, offset: 384)
!3326 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !3250, file: !398, line: 744, baseType: !3327, size: 384)
!3327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !398, line: 429, size: 384, elements: !3328)
!3328 = !{!3329, !3330, !3331}
!3329 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3327, file: !398, line: 431, baseType: !3253, size: 256)
!3330 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !3327, file: !398, line: 434, baseType: !2924, size: 64, offset: 256)
!3331 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !3327, file: !398, line: 437, baseType: !3238, size: 64, offset: 320)
!3332 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !3250, file: !398, line: 745, baseType: !3333, size: 384)
!3333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !398, line: 443, size: 384, elements: !3334)
!3334 = !{!3335, !3336, !3337}
!3335 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3333, file: !398, line: 445, baseType: !3253, size: 256)
!3336 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !3333, file: !398, line: 449, baseType: !2924, size: 64, offset: 256)
!3337 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !3333, file: !398, line: 453, baseType: !3238, size: 64, offset: 320)
!3338 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !3250, file: !398, line: 746, baseType: !3339, size: 320)
!3339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !398, line: 459, size: 320, elements: !3340)
!3340 = !{!3341, !3342}
!3341 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3339, file: !398, line: 461, baseType: !3253, size: 256)
!3342 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !3339, file: !398, line: 464, baseType: !2924, size: 64, offset: 256)
!3343 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !3250, file: !398, line: 747, baseType: !3344, size: 768)
!3344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !398, line: 469, size: 768, elements: !3345)
!3345 = !{!3346, !3347, !3348, !3349, !3350}
!3346 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3344, file: !398, line: 471, baseType: !3253, size: 256)
!3347 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !3344, file: !398, line: 474, baseType: !7, size: 32, offset: 256)
!3348 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !3344, file: !398, line: 475, baseType: !7, size: 32, offset: 288)
!3349 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3344, file: !398, line: 478, baseType: !2924, size: 64, offset: 320)
!3350 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !3344, file: !398, line: 481, baseType: !3351, size: 384, offset: 384)
!3351 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3352, size: 384, elements: !3023)
!3352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !3353)
!3353 = !{!3354, !3355, !3356}
!3354 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !3352, file: !135, line: 1920, baseType: !3290, size: 256)
!3355 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !3352, file: !135, line: 1921, baseType: !2924, size: 64, offset: 256)
!3356 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !3352, file: !135, line: 1922, baseType: !3049, size: 32, offset: 320)
!3357 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !3250, file: !398, line: 748, baseType: !3358, size: 320)
!3358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !398, line: 487, size: 320, elements: !3359)
!3359 = !{!3360, !3361}
!3360 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3358, file: !398, line: 490, baseType: !3253, size: 256)
!3361 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !3358, file: !398, line: 494, baseType: !2917, size: 32, offset: 256)
!3362 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !3250, file: !398, line: 749, baseType: !3363, size: 384)
!3363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !398, line: 500, size: 384, elements: !3364)
!3364 = !{!3365, !3366, !3367}
!3365 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3363, file: !398, line: 502, baseType: !3253, size: 256)
!3366 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !3363, file: !398, line: 506, baseType: !3238, size: 64, offset: 256)
!3367 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !3363, file: !398, line: 510, baseType: !3238, size: 64, offset: 320)
!3368 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !3250, file: !398, line: 750, baseType: !3369, size: 320)
!3369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !398, line: 529, size: 320, elements: !3370)
!3370 = !{!3371, !3372}
!3371 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3369, file: !398, line: 531, baseType: !3253, size: 256)
!3372 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !3369, file: !398, line: 540, baseType: !3238, size: 64, offset: 256)
!3373 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !3250, file: !398, line: 751, baseType: !3374, size: 704)
!3374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !398, line: 546, size: 704, elements: !3375)
!3375 = !{!3376, !3377, !3378, !3379, !3380, !3381, !3382}
!3376 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !3374, file: !398, line: 549, baseType: !3304, size: 512)
!3377 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !3374, file: !398, line: 553, baseType: !2922, size: 64, offset: 512)
!3378 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !3374, file: !398, line: 557, baseType: !2916, size: 8, offset: 576)
!3379 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !3374, file: !398, line: 558, baseType: !2916, size: 8, offset: 584)
!3380 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !3374, file: !398, line: 559, baseType: !2916, size: 8, offset: 592)
!3381 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !3374, file: !398, line: 560, baseType: !2916, size: 8, offset: 600)
!3382 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !3374, file: !398, line: 566, baseType: !3302, size: 64, offset: 640)
!3383 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !3250, file: !398, line: 752, baseType: !3384, size: 384)
!3384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !398, line: 571, size: 384, elements: !3385)
!3385 = !{!3386, !3387}
!3386 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3384, file: !398, line: 573, baseType: !3315, size: 320)
!3387 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !3384, file: !398, line: 577, baseType: !2924, size: 64, offset: 320)
!3388 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !3250, file: !398, line: 753, baseType: !3389, size: 576)
!3389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !398, line: 600, size: 576, elements: !3390)
!3390 = !{!3391, !3392, !3393, !3396, !3405}
!3391 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3389, file: !398, line: 602, baseType: !3315, size: 320)
!3392 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3389, file: !398, line: 605, baseType: !2924, size: 64, offset: 320)
!3393 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !3389, file: !398, line: 609, baseType: !3394, size: 64, offset: 384)
!3394 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !3395, line: 46, baseType: !2978)
!3395 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!3396 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !3389, file: !398, line: 612, baseType: !3397, size: 64, offset: 448)
!3397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3398, size: 64)
!3398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !398, line: 581, size: 320, elements: !3399)
!3399 = !{!3400, !3401, !3402, !3403, !3404}
!3400 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !3398, file: !398, line: 583, baseType: !134, size: 32)
!3401 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3398, file: !398, line: 586, baseType: !2924, size: 64, offset: 64)
!3402 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !3398, file: !398, line: 589, baseType: !2924, size: 64, offset: 128)
!3403 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !3398, file: !398, line: 592, baseType: !2924, size: 64, offset: 192)
!3404 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !3398, file: !398, line: 595, baseType: !2924, size: 64, offset: 256)
!3405 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !3389, file: !398, line: 616, baseType: !3238, size: 64, offset: 512)
!3406 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !3250, file: !398, line: 754, baseType: !3407, size: 512)
!3407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !398, line: 622, size: 512, elements: !3408)
!3408 = !{!3409, !3410, !3411, !3412}
!3409 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3407, file: !398, line: 624, baseType: !3315, size: 320)
!3410 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3407, file: !398, line: 628, baseType: !2924, size: 64, offset: 320)
!3411 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !3407, file: !398, line: 632, baseType: !2924, size: 64, offset: 384)
!3412 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !3407, file: !398, line: 636, baseType: !2924, size: 64, offset: 448)
!3413 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !3250, file: !398, line: 755, baseType: !3414, size: 704)
!3414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !398, line: 642, size: 704, elements: !3415)
!3415 = !{!3416, !3417, !3418, !3419}
!3416 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !3414, file: !398, line: 644, baseType: !3407, size: 512)
!3417 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !3414, file: !398, line: 648, baseType: !2924, size: 64, offset: 512)
!3418 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !3414, file: !398, line: 652, baseType: !2924, size: 64, offset: 576)
!3419 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !3414, file: !398, line: 653, baseType: !2924, size: 64, offset: 640)
!3420 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !3250, file: !398, line: 756, baseType: !3421, size: 448)
!3421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !398, line: 663, size: 448, elements: !3422)
!3422 = !{!3423, !3424, !3425}
!3423 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3421, file: !398, line: 665, baseType: !3315, size: 320)
!3424 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3421, file: !398, line: 668, baseType: !2924, size: 64, offset: 320)
!3425 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !3421, file: !398, line: 673, baseType: !2924, size: 64, offset: 384)
!3426 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !3250, file: !398, line: 757, baseType: !3427, size: 384)
!3427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !398, line: 694, size: 384, elements: !3428)
!3428 = !{!3429, !3430}
!3429 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !3427, file: !398, line: 696, baseType: !3315, size: 320)
!3430 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !3427, file: !398, line: 699, baseType: !2924, size: 64, offset: 320)
!3431 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !3250, file: !398, line: 758, baseType: !3432, size: 384)
!3432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !398, line: 681, size: 384, elements: !3433)
!3433 = !{!3434, !3435, !3436}
!3434 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3432, file: !398, line: 683, baseType: !3253, size: 256)
!3435 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !3432, file: !398, line: 686, baseType: !2924, size: 64, offset: 256)
!3436 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !3432, file: !398, line: 689, baseType: !2924, size: 64, offset: 320)
!3437 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !3250, file: !398, line: 759, baseType: !3438, size: 384)
!3438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !398, line: 707, size: 384, elements: !3439)
!3439 = !{!3440, !3441, !3442}
!3440 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3438, file: !398, line: 709, baseType: !3253, size: 256)
!3441 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !3438, file: !398, line: 712, baseType: !2924, size: 64, offset: 256)
!3442 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !3438, file: !398, line: 712, baseType: !2924, size: 64, offset: 320)
!3443 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !3250, file: !398, line: 760, baseType: !3444, size: 320)
!3444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !398, line: 718, size: 320, elements: !3445)
!3445 = !{!3446, !3447}
!3446 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !3444, file: !398, line: 720, baseType: !3253, size: 256)
!3447 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !3444, file: !398, line: 723, baseType: !2924, size: 64, offset: 256)
!3448 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3245, file: !398, line: 138, baseType: !3244, size: 64, offset: 64)
!3449 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3245, file: !398, line: 139, baseType: !3244, size: 64, offset: 128)
!3450 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !3240, file: !398, line: 146, baseType: !3243, size: 64, offset: 64)
!3451 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !3240, file: !398, line: 152, baseType: !3238, size: 64, offset: 128)
!3452 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !3235, file: !350, line: 130, baseType: !3099, size: 64)
!3453 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !3230, file: !350, line: 134, baseType: !2921, size: 64, offset: 192)
!3454 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !3230, file: !350, line: 137, baseType: !2924, size: 64, offset: 256)
!3455 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !3230, file: !350, line: 138, baseType: !3049, size: 32, offset: 320)
!3456 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !3230, file: !350, line: 142, baseType: !7, size: 32, offset: 352)
!3457 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3230, file: !350, line: 144, baseType: !2917, size: 32, offset: 384)
!3458 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !3230, file: !350, line: 145, baseType: !2917, size: 32, offset: 416)
!3459 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !3230, file: !350, line: 146, baseType: !3460, size: 64, offset: 448)
!3460 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !350, line: 119, baseType: !2980)
!3461 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !3213, file: !350, line: 220, baseType: !3216, size: 64, offset: 64)
!3462 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !3213, file: !350, line: 223, baseType: !2921, size: 64, offset: 128)
!3463 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !3213, file: !350, line: 226, baseType: !3464, size: 64, offset: 192)
!3464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3465, size: 64)
!3465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !3466)
!3466 = !{!3467, !3468, !3469, !3470, !3471, !3476, !3477, !3478, !3492, !3493, !3494, !3495, !3496, !3497, !3498, !3499, !3500, !3501, !3509, !3517, !3518}
!3467 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3465, file: !330, line: 102, baseType: !2917, size: 32)
!3468 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !3465, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!3469 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !3465, file: !330, line: 108, baseType: !3212, size: 64, offset: 64)
!3470 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !3465, file: !330, line: 111, baseType: !3212, size: 64, offset: 128)
!3471 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !3465, file: !330, line: 114, baseType: !3472, size: 64, offset: 192)
!3472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !3473)
!3473 = !{!3474, !3475}
!3474 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !3472, file: !330, line: 42, baseType: !329, size: 32)
!3475 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !3472, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!3476 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !3465, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!3477 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !3465, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!3478 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !3465, file: !330, line: 123, baseType: !3479, size: 64, offset: 320)
!3479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3480, size: 64)
!3480 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !3481)
!3481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !3482)
!3482 = !{!3483}
!3483 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3481, file: !330, line: 87, baseType: !3484, size: 128)
!3484 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !3485)
!3485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !3486)
!3486 = !{!3487, !3488, !3489}
!3487 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3485, file: !330, line: 85, baseType: !7, size: 32)
!3488 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3485, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!3489 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3485, file: !330, line: 85, baseType: !3490, size: 64, offset: 64)
!3490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3491, size: 64, elements: !3023)
!3491 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !3464)
!3492 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !3465, file: !330, line: 126, baseType: !3464, size: 64, offset: 384)
!3493 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3465, file: !330, line: 129, baseType: !3464, size: 64, offset: 448)
!3494 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !3465, file: !330, line: 132, baseType: !2921, size: 64, offset: 512)
!3495 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !3465, file: !330, line: 139, baseType: !2924, size: 64, offset: 576)
!3496 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !3465, file: !330, line: 143, baseType: !2973, size: 128, offset: 640)
!3497 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !3465, file: !330, line: 146, baseType: !2973, size: 128, offset: 768)
!3498 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !3465, file: !330, line: 148, baseType: !2916, size: 8, offset: 896)
!3499 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !3465, file: !330, line: 149, baseType: !2916, size: 8, offset: 904)
!3500 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !3465, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!3501 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !3465, file: !330, line: 156, baseType: !3502, size: 64, offset: 960)
!3502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3503, size: 64)
!3503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !3504)
!3504 = !{!3505, !3506, !3507, !3508}
!3505 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !3503, file: !330, line: 50, baseType: !3248, size: 64)
!3506 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !3503, file: !330, line: 59, baseType: !2973, size: 128, offset: 64)
!3507 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !3503, file: !330, line: 64, baseType: !2916, size: 8, offset: 192)
!3508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3503, file: !330, line: 67, baseType: !3502, size: 64, offset: 256)
!3509 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !3465, file: !330, line: 159, baseType: !3510, size: 64, offset: 1024)
!3510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3511, size: 64)
!3511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !3512)
!3512 = !{!3513, !3514, !3515, !3516}
!3513 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !3511, file: !330, line: 74, baseType: !3229, size: 64)
!3514 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !3511, file: !330, line: 77, baseType: !3510, size: 64, offset: 64)
!3515 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !3511, file: !330, line: 78, baseType: !3510, size: 64, offset: 128)
!3516 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !3511, file: !330, line: 81, baseType: !3510, size: 64, offset: 192)
!3517 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !3465, file: !330, line: 162, baseType: !2916, size: 8, offset: 1088)
!3518 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !3465, file: !330, line: 166, baseType: !2924, size: 64, offset: 1152)
!3519 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !3213, file: !350, line: 229, baseType: !3520, size: 128, offset: 256)
!3520 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3521, size: 128, elements: !3167)
!3521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3522, size: 64)
!3522 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !350, line: 229, flags: DIFlagFwdDecl)
!3523 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !3213, file: !350, line: 232, baseType: !3212, size: 64, offset: 384)
!3524 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !3213, file: !350, line: 233, baseType: !3212, size: 64, offset: 448)
!3525 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !3213, file: !350, line: 238, baseType: !3526, size: 64, offset: 512)
!3526 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !350, line: 235, size: 64, elements: !3527)
!3527 = !{!3528, !3534}
!3528 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !3526, file: !350, line: 236, baseType: !3529, size: 64)
!3529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3530, size: 64)
!3530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !350, line: 273, size: 128, elements: !3531)
!3531 = !{!3532, !3533}
!3532 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !3530, file: !350, line: 275, baseType: !3238, size: 64)
!3533 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !3530, file: !350, line: 278, baseType: !3238, size: 64, offset: 64)
!3534 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !3526, file: !350, line: 237, baseType: !3535, size: 64)
!3535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3536, size: 64)
!3536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !350, line: 259, size: 320, elements: !3537)
!3537 = !{!3538, !3539, !3540, !3541, !3542}
!3538 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !3536, file: !350, line: 261, baseType: !3099, size: 64)
!3539 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !3536, file: !350, line: 262, baseType: !3099, size: 64, offset: 64)
!3540 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !3536, file: !350, line: 266, baseType: !3099, size: 64, offset: 128)
!3541 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !3536, file: !350, line: 267, baseType: !3099, size: 64, offset: 192)
!3542 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !3536, file: !350, line: 270, baseType: !2917, size: 32, offset: 256)
!3543 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !3213, file: !350, line: 241, baseType: !3460, size: 64, offset: 576)
!3544 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !3213, file: !350, line: 244, baseType: !2917, size: 32, offset: 640)
!3545 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !3213, file: !350, line: 247, baseType: !2917, size: 32, offset: 672)
!3546 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !3213, file: !350, line: 250, baseType: !2917, size: 32, offset: 704)
!3547 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !3213, file: !350, line: 253, baseType: !2917, size: 32, offset: 736)
!3548 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !3213, file: !350, line: 256, baseType: !2917, size: 32, offset: 768)
!3549 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !3120, file: !3102, line: 179, baseType: !3550, size: 64)
!3550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3551, size: 64)
!3551 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !3102, line: 150, baseType: !3552)
!3552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !3102, line: 142, size: 320, elements: !3553)
!3553 = !{!3554, !3555, !3556, !3557, !3560, !3561}
!3554 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !3552, file: !3102, line: 144, baseType: !2924, size: 64)
!3555 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3552, file: !3102, line: 145, baseType: !3099, size: 64, offset: 64)
!3556 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3552, file: !3102, line: 146, baseType: !3099, size: 64, offset: 128)
!3557 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !3552, file: !3102, line: 147, baseType: !3558, size: 32, offset: 192)
!3558 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !3559, line: 31, baseType: !2917)
!3559 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3560 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3552, file: !3102, line: 148, baseType: !7, size: 32, offset: 224)
!3561 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !3552, file: !3102, line: 149, baseType: !2916, size: 8, offset: 256)
!3562 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !3120, file: !3102, line: 180, baseType: !3563, size: 64)
!3563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3564, size: 64)
!3564 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !3102, line: 162, baseType: !3565)
!3565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !3102, line: 159, size: 128, elements: !3566)
!3566 = !{!3567, !3568}
!3567 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !3565, file: !3102, line: 160, baseType: !2924, size: 64)
!3568 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3565, file: !3102, line: 161, baseType: !2980, size: 64, offset: 64)
!3569 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !3120, file: !3102, line: 181, baseType: !3570, size: 64)
!3570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3571, size: 64)
!3571 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !3102, line: 181, flags: DIFlagFwdDecl)
!3572 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !3115, file: !3102, line: 317, baseType: !3573, size: 64)
!3573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2980, size: 64, elements: !3023)
!3574 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !3115, file: !3102, line: 318, baseType: !3575, size: 320)
!3575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !3102, line: 188, size: 320, elements: !3576)
!3576 = !{!3577, !3579, !3602}
!3577 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !3575, file: !3102, line: 190, baseType: !3578, size: 192)
!3578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3119, size: 192, elements: !2998)
!3579 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !3575, file: !3102, line: 193, baseType: !3580, size: 64, offset: 192)
!3580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3581, size: 64)
!3581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !3102, line: 206, size: 320, elements: !3582)
!3582 = !{!3583, !3587, !3588, !3589, !3601}
!3583 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !3581, file: !3102, line: 208, baseType: !3584, size: 64)
!3584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3585, size: 64)
!3585 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !2925, line: 62, baseType: !3586)
!3586 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2925, line: 61, flags: DIFlagFwdDecl)
!3587 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !3581, file: !3102, line: 211, baseType: !7, size: 32, offset: 64)
!3588 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3581, file: !3102, line: 214, baseType: !2980, size: 64, offset: 128)
!3589 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !3581, file: !3102, line: 224, baseType: !3590, size: 64, offset: 192)
!3590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3591, size: 64)
!3591 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !3102, line: 202, baseType: !3592)
!3592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !3102, line: 202, size: 128, elements: !3593)
!3593 = !{!3594}
!3594 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3592, file: !3102, line: 202, baseType: !3595, size: 128)
!3595 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !3102, line: 200, baseType: !3596)
!3596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !3102, line: 200, size: 128, elements: !3597)
!3597 = !{!3598, !3599, !3600}
!3598 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3596, file: !3102, line: 200, baseType: !7, size: 32)
!3599 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3596, file: !3102, line: 200, baseType: !7, size: 32, offset: 32)
!3600 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3596, file: !3102, line: 200, baseType: !3133, size: 64, offset: 64)
!3601 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !3581, file: !3102, line: 234, baseType: !3590, size: 64, offset: 256)
!3602 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3575, file: !3102, line: 197, baseType: !2980, size: 64, offset: 256)
!3603 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !3115, file: !3102, line: 319, baseType: !2987, size: 256)
!3604 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !3115, file: !3102, line: 320, baseType: !3006, size: 192)
!3605 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2927, file: !135, line: 3384, baseType: !3606, size: 1472)
!3606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !3607)
!3607 = !{!3608, !3629, !3630, !3631, !3632}
!3608 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3606, file: !135, line: 3115, baseType: !3609, size: 1216)
!3609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !3610)
!3610 = !{!3611, !3612, !3613, !3614, !3615, !3616, !3617, !3618, !3619, !3620, !3621, !3622, !3623, !3624, !3625, !3626, !3627, !3628}
!3611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3609, file: !135, line: 2985, baseType: !3095, size: 960)
!3612 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !3609, file: !135, line: 2986, baseType: !2924, size: 64, offset: 960)
!3613 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !3609, file: !135, line: 2987, baseType: !2924, size: 64, offset: 1024)
!3614 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !3609, file: !135, line: 2988, baseType: !2924, size: 64, offset: 1088)
!3615 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !3609, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!3616 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !3609, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!3617 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !3609, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!3618 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !3609, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!3619 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !3609, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!3620 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !3609, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!3621 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !3609, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!3622 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !3609, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!3623 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !3609, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!3624 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !3609, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!3625 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !3609, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!3626 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !3609, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!3627 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !3609, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!3628 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !3609, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!3629 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !3606, file: !135, line: 3117, baseType: !2924, size: 64, offset: 1216)
!3630 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !3606, file: !135, line: 3119, baseType: !2924, size: 64, offset: 1280)
!3631 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !3606, file: !135, line: 3121, baseType: !2924, size: 64, offset: 1344)
!3632 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !3606, file: !135, line: 3123, baseType: !2924, size: 64, offset: 1408)
!3633 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2927, file: !135, line: 3385, baseType: !3634, size: 1088)
!3634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !3635)
!3635 = !{!3636, !3637, !3638}
!3636 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3634, file: !135, line: 2875, baseType: !3095, size: 960)
!3637 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !3634, file: !135, line: 2876, baseType: !3099, size: 64, offset: 960)
!3638 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3634, file: !135, line: 2877, baseType: !3639, size: 64, offset: 1024)
!3639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3640, size: 64)
!3640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !3641, line: 172, size: 128, elements: !3642)
!3641 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3642 = !{!3643, !3644, !3645, !3646, !3647, !3648, !3649}
!3643 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !3640, file: !3641, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!3644 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !3640, file: !3641, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!3645 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !3640, file: !3641, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!3646 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !3640, file: !3641, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!3647 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !3640, file: !3641, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!3648 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !3640, file: !3641, line: 195, baseType: !7, size: 32, offset: 32)
!3649 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !3640, file: !3641, line: 199, baseType: !2924, size: 64, offset: 64)
!3650 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2927, file: !135, line: 3386, baseType: !3609, size: 1216)
!3651 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2927, file: !135, line: 3387, baseType: !3652, size: 1280)
!3652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !3653)
!3653 = !{!3654, !3655}
!3654 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3652, file: !135, line: 3094, baseType: !3609, size: 1216)
!3655 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3652, file: !135, line: 3095, baseType: !3639, size: 64, offset: 1216)
!3656 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2927, file: !135, line: 3388, baseType: !3657, size: 1216)
!3657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !3658)
!3658 = !{!3659, !3660, !3661, !3662, !3663, !3664}
!3659 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3657, file: !135, line: 2825, baseType: !3057, size: 896)
!3660 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !3657, file: !135, line: 2827, baseType: !2924, size: 64, offset: 896)
!3661 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !3657, file: !135, line: 2828, baseType: !2924, size: 64, offset: 960)
!3662 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !3657, file: !135, line: 2829, baseType: !2924, size: 64, offset: 1024)
!3663 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !3657, file: !135, line: 2830, baseType: !2924, size: 64, offset: 1088)
!3664 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !3657, file: !135, line: 2831, baseType: !2924, size: 64, offset: 1152)
!3665 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2927, file: !135, line: 3389, baseType: !3666, size: 1024)
!3666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !3667)
!3667 = !{!3668, !3669, !3670}
!3668 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3666, file: !135, line: 2851, baseType: !3095, size: 960)
!3669 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !3666, file: !135, line: 2852, baseType: !2917, size: 32, offset: 960)
!3670 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !3666, file: !135, line: 2853, baseType: !2917, size: 32, offset: 992)
!3671 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2927, file: !135, line: 3390, baseType: !3672, size: 1024)
!3672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !3673)
!3673 = !{!3674, !3675}
!3674 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3672, file: !135, line: 2858, baseType: !3095, size: 960)
!3675 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !3672, file: !135, line: 2859, baseType: !3639, size: 64, offset: 960)
!3676 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2927, file: !135, line: 3391, baseType: !3677, size: 960)
!3677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !3678)
!3678 = !{!3679}
!3679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3677, file: !135, line: 2863, baseType: !3095, size: 960)
!3680 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2927, file: !135, line: 3392, baseType: !3681, size: 1472)
!3681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !3682)
!3682 = !{!3683}
!3683 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3681, file: !135, line: 3305, baseType: !3606, size: 1472)
!3684 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2927, file: !135, line: 3393, baseType: !3685, size: 1792)
!3685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !3686)
!3686 = !{!3687, !3688, !4005, !4006, !4007, !4008, !4009, !4010, !4011, !4012, !4013, !4014, !4015, !4016, !4017, !4018, !4019, !4020, !4021, !4022, !4023, !4024, !4025}
