; ModuleID = 'optabs.bc'
source_filename = "optabs.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.convert_optab_d = type { i32, i8*, void (%struct.convert_optab_d*, i8*, i32, i32)*, [87 x [87 x %struct.optab_handlers]] }
%struct.optab_handlers = type { i32 }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.optab_d = type { i32, i8*, i8, void (%struct.optab_d*, i8*, i8, i32)*, [87 x %struct.optab_handlers] }
%struct.insn_data = type { i8*, %union.anon.0, %struct.rtx_def* (%struct.rtx_def*, ...)*, %struct.insn_operand_data*, i8, i8, i8, i8 }
%union.anon.0 = type { i8* }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque

!2016 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapsi", value: 2954, isUnsigned: true)
!2017 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapdi", value: 2955, isUnsigned: true)
!2018 = !DIEnumerator(name: "CODE_FOR_nothing", value: 2956, isUnsigned: true)
!2019 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "optab_subtype", file: !2020, line: 723, baseType: !7, size: 32, elements: !2021)
!2020 = !DIFile(filename: "./optabs.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2021 = !{!2022, !2023, !2024}
!2022 = !DIEnumerator(name: "optab_default", value: 0, isUnsigned: true)
!2023 = !DIEnumerator(name: "optab_scalar", value: 1, isUnsigned: true)
!2024 = !DIEnumerator(name: "optab_vector", value: 2, isUnsigned: true)
!2025 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !2026, line: 36, baseType: !7, size: 32, elements: !2027)
!2026 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2027 = !{!2028, !2029, !2030, !2031, !2032, !2033, !2034, !2035, !2036, !2037, !2038, !2039, !2040, !2041, !2042, !2043, !2044, !2045, !2046}
!2028 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!2029 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!2030 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!2031 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!2032 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!2033 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!2034 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!2035 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!2036 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!2037 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!2038 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!2039 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!2040 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!2041 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!2042 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!2043 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!2044 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!2045 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!2046 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!2047 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "optab_methods", file: !2048, line: 291, baseType: !7, size: 32, elements: !2049)
!2048 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2049 = !{!2050, !2051, !2052, !2053, !2054}
!2050 = !DIEnumerator(name: "OPTAB_DIRECT", value: 0, isUnsigned: true)
!2051 = !DIEnumerator(name: "OPTAB_LIB", value: 1, isUnsigned: true)
!2052 = !DIEnumerator(name: "OPTAB_WIDEN", value: 2, isUnsigned: true)
!2053 = !DIEnumerator(name: "OPTAB_LIB_WIDEN", value: 3, isUnsigned: true)
!2054 = !DIEnumerator(name: "OPTAB_MUST_WIDEN", value: 4, isUnsigned: true)
!2055 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "can_compare_purpose", file: !2020, line: 737, baseType: !7, size: 32, elements: !2056)
!2056 = !{!2057, !2058, !2059}
!2057 = !DIEnumerator(name: "ccp_jump", value: 0, isUnsigned: true)
!2058 = !DIEnumerator(name: "ccp_cmov", value: 1, isUnsigned: true)
!2059 = !DIEnumerator(name: "ccp_store_flag", value: 2, isUnsigned: true)
!2060 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !2048, line: 52, baseType: !7, size: 32, elements: !2061)
!2061 = !{!2062, !2063, !2064, !2065, !2066, !2067, !2068}
!2062 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!2063 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!2064 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!2065 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!2066 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!2067 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!2068 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!2069 = !{!2070, !2071, !2072, !2073, !2076, !2077, !2079, !2082, !2025, !190, !5, !384, !3223, !2090, !7, !3224, !2176, !2327, !2205, !2083, !2537, !3226, !3233, !3236, !2074, !3238}
!2070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2071, size: 64)
!2071 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2072 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2074, size: 64)
!2074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2075, size: 64)
!2075 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2078, size: 64)
!2078 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2075)
!2079 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2080, line: 46, baseType: !2081)
!2080 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2081 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2083, size: 64)
!2083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2084, size: 64)
!2084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "libfunc_entry", file: !3, line: 114, size: 192, elements: !2085)
!2085 = !{!2086, !2087, !2088, !2089}
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "optab", scope: !2084, file: !3, line: 115, baseType: !2079, size: 64)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "mode1", scope: !2084, file: !3, line: 116, baseType: !5, size: 32, offset: 64)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "mode2", scope: !2084, file: !3, line: 116, baseType: !5, size: 32, offset: 96)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "libfunc", scope: !2084, file: !3, line: 117, baseType: !2090, size: 64, offset: 128)
!2090 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2091, line: 50, baseType: !2092)
!2091 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2093, size: 64)
!2093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !2094)
!2094 = !{!2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105}
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2093, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2093, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2093, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2093, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2093, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2093, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2093, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2093, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2093, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2093, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2093, file: !385, line: 321, baseType: !2106, size: 320, offset: 64)
!2106 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !2107)
!2107 = !{!2108, !3190, !3192, !3221, !3222}
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2106, file: !385, line: 316, baseType: !2109, size: 64)
!2109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2110, size: 64, elements: !2125)
!2110 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !2111)
!2111 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !2112)
!2112 = !{!2113, !2114, !2115, !2116, !2117, !2127, !2128, !2140, !2143, !2204, !3168, !3169, !3180, !3187}
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2111, file: !385, line: 168, baseType: !2072, size: 32)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2111, file: !385, line: 169, baseType: !7, size: 32)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2111, file: !385, line: 170, baseType: !2077, size: 64)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2111, file: !385, line: 171, baseType: !2090, size: 64)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2111, file: !385, line: 172, baseType: !2118, size: 64)
!2118 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2091, line: 53, baseType: !2119)
!2119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2120, size: 64)
!2120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !2121)
!2121 = !{!2122, !2123}
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2120, file: !385, line: 360, baseType: !2072, size: 32)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2120, file: !385, line: 361, baseType: !2124, size: 64, offset: 64)
!2124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2090, size: 64, elements: !2125)
!2125 = !{!2126}
!2126 = !DISubrange(count: 1)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2111, file: !385, line: 173, baseType: !5, size: 32)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2111, file: !385, line: 174, baseType: !2129, size: 32)
!2129 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !2130)
!2130 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !2131)
!2131 = !{!2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139}
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2130, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2130, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2130, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2130, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2130, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2130, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2138 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2130, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2130, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2111, file: !385, line: 175, baseType: !2141, size: 64)
!2141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2142, size: 64)
!2142 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2111, file: !385, line: 176, baseType: !2144, size: 64)
!2144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2145, size: 64)
!2145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2146, line: 75, size: 256, elements: !2147)
!2146 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2147 = !{!2148, !2162, !2163, !2164}
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2145, file: !2146, line: 76, baseType: !2149, size: 64)
!2149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2150, size: 64)
!2150 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2146, line: 68, baseType: !2151)
!2151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2146, line: 63, size: 320, elements: !2152)
!2152 = !{!2153, !2155, !2156, !2157}
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2151, file: !2146, line: 64, baseType: !2154, size: 64)
!2154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2151, size: 64)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2151, file: !2146, line: 65, baseType: !2154, size: 64, offset: 64)
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2151, file: !2146, line: 66, baseType: !7, size: 32, offset: 128)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2151, file: !2146, line: 67, baseType: !2158, size: 128, offset: 192)
!2158 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2159, size: 128, elements: !2160)
!2159 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2146, line: 29, baseType: !2081)
!2160 = !{!2161}
!2161 = !DISubrange(count: 2)
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2145, file: !2146, line: 77, baseType: !2149, size: 64, offset: 64)
!2163 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2145, file: !2146, line: 78, baseType: !7, size: 32, offset: 128)
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2145, file: !2146, line: 79, baseType: !2165, size: 64, offset: 192)
!2165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2166, size: 64)
!2166 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2146, line: 49, baseType: !2167)
!2167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2146, line: 45, size: 832, elements: !2168)
!2168 = !{!2169, !2170, !2171}
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2167, file: !2146, line: 46, baseType: !2154, size: 64)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2167, file: !2146, line: 47, baseType: !2144, size: 64, offset: 64)
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2167, file: !2146, line: 48, baseType: !2172, size: 704, offset: 128)
!2172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2173, line: 164, size: 704, elements: !2174)
!2173 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2174 = !{!2175, !2177, !2187, !2188, !2189, !2190, !2191, !2192, !2196, !2200, !2201, !2202, !2203}
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2172, file: !2173, line: 166, baseType: !2176, size: 64)
!2176 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2177 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2172, file: !2173, line: 167, baseType: !2178, size: 64, offset: 64)
!2178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2179, size: 64)
!2179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2173, line: 157, size: 192, elements: !2180)
!2180 = !{!2181, !2182, !2183}
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2179, file: !2173, line: 159, baseType: !2074, size: 64)
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2179, file: !2173, line: 160, baseType: !2178, size: 64, offset: 64)
!2183 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2179, file: !2173, line: 161, baseType: !2184, size: 32, offset: 128)
!2184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2075, size: 32, elements: !2185)
!2185 = !{!2186}
!2186 = !DISubrange(count: 4)
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2172, file: !2173, line: 168, baseType: !2074, size: 64, offset: 128)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2172, file: !2173, line: 169, baseType: !2074, size: 64, offset: 192)
!2189 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2172, file: !2173, line: 170, baseType: !2074, size: 64, offset: 256)
!2190 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2172, file: !2173, line: 171, baseType: !2176, size: 64, offset: 320)
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2172, file: !2173, line: 172, baseType: !2072, size: 32, offset: 384)
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2172, file: !2173, line: 176, baseType: !2193, size: 64, offset: 448)
!2193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2194, size: 64)
!2194 = !DISubroutineType(types: !2195)
!2195 = !{!2178, !2076, !2176}
!2196 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2172, file: !2173, line: 177, baseType: !2197, size: 64, offset: 512)
!2197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2198, size: 64)
!2198 = !DISubroutineType(types: !2199)
!2199 = !{null, !2076, !2178}
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2172, file: !2173, line: 178, baseType: !2076, size: 64, offset: 576)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2172, file: !2173, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2172, file: !2173, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2203 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2172, file: !2173, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2111, file: !385, line: 177, baseType: !2205, size: 64)
!2205 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2091, line: 56, baseType: !2206)
!2206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2207, size: 64)
!2207 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !2208)
!2208 = !{!2209, !2242, !2248, !2259, !2278, !2289, !2294, !2301, !2307, !2320, !2332, !2370, !2375, !2403, !2411, !2412, !2417, !2426, !2432, !2437, !2441, !2445, !2804, !2853, !2859, !2865, !2872, !2898, !2912, !2929, !2941, !2963, !2978, !3150}
!2209 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2207, file: !158, line: 3372, baseType: !2210, size: 64)
!2210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !2211)
!2211 = !{!2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241}
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2210, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2213 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2210, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2210, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2210, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2210, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2210, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2218 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2210, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2219 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2210, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2210, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2210, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2210, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2223 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2210, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2210, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2210, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2210, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2210, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2210, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2210, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2210, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2231 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2210, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2232 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2210, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2210, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2234 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2210, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2210, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2210, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2210, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2210, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2210, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2210, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2241 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2210, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2242 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2207, file: !158, line: 3373, baseType: !2243, size: 192)
!2243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !2244)
!2244 = !{!2245, !2246, !2247}
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2243, file: !158, line: 403, baseType: !2210, size: 64)
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2243, file: !158, line: 404, baseType: !2205, size: 64, offset: 64)
!2247 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2243, file: !158, line: 405, baseType: !2205, size: 64, offset: 128)
!2248 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2207, file: !158, line: 3374, baseType: !2249, size: 320)
!2249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !2250)
!2250 = !{!2251, !2252}
!2251 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2249, file: !158, line: 1385, baseType: !2243, size: 192)
!2252 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2249, file: !158, line: 1386, baseType: !2253, size: 128, offset: 192)
!2253 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2254, line: 58, baseType: !2255)
!2254 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2255 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2254, line: 54, size: 128, elements: !2256)
!2256 = !{!2257, !2258}
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2255, file: !2254, line: 56, baseType: !2081, size: 64)
!2258 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2255, file: !2254, line: 57, baseType: !2176, size: 64, offset: 64)
!2259 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2207, file: !158, line: 3375, baseType: !2260, size: 256)
!2260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !2261)
!2261 = !{!2262, !2263}
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2260, file: !158, line: 1398, baseType: !2243, size: 192)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2260, file: !158, line: 1399, baseType: !2264, size: 64, offset: 192)
!2264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2265, size: 64)
!2265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2266, line: 52, size: 256, elements: !2267)
!2266 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2267 = !{!2268, !2269, !2270, !2271, !2272, !2273, !2274}
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2265, file: !2266, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2265, file: !2266, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2265, file: !2266, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2265, file: !2266, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2272 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2265, file: !2266, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2265, file: !2266, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2265, file: !2266, line: 62, baseType: !2275, size: 192, offset: 64)
!2275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2081, size: 192, elements: !2276)
!2276 = !{!2277}
!2277 = !DISubrange(count: 3)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2207, file: !158, line: 3376, baseType: !2279, size: 256)
!2279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !2280)
!2280 = !{!2281, !2282}
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2279, file: !158, line: 1409, baseType: !2243, size: 192)
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2279, file: !158, line: 1410, baseType: !2283, size: 64, offset: 192)
!2283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2284, size: 64)
!2284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2285, line: 27, size: 192, elements: !2286)
!2285 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2286 = !{!2287, !2288}
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2284, file: !2285, line: 29, baseType: !2253, size: 128)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2284, file: !2285, line: 30, baseType: !5, size: 32, offset: 128)
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2207, file: !158, line: 3377, baseType: !2290, size: 256)
!2290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !2291)
!2291 = !{!2292, !2293}
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2290, file: !158, line: 1438, baseType: !2243, size: 192)
!2293 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2290, file: !158, line: 1439, baseType: !2205, size: 64, offset: 192)
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2207, file: !158, line: 3378, baseType: !2295, size: 256)
!2295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !2296)
!2296 = !{!2297, !2298, !2299}
!2297 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2295, file: !158, line: 1419, baseType: !2243, size: 192)
!2298 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2295, file: !158, line: 1420, baseType: !2072, size: 32, offset: 192)
!2299 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2295, file: !158, line: 1421, baseType: !2300, size: 8, offset: 224)
!2300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2075, size: 8, elements: !2125)
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2207, file: !158, line: 3379, baseType: !2302, size: 320)
!2302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !2303)
!2303 = !{!2304, !2305, !2306}
!2304 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2302, file: !158, line: 1429, baseType: !2243, size: 192)
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2302, file: !158, line: 1430, baseType: !2205, size: 64, offset: 192)
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2302, file: !158, line: 1431, baseType: !2205, size: 64, offset: 256)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2207, file: !158, line: 3380, baseType: !2308, size: 320)
!2308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !2309)
!2309 = !{!2310, !2311}
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2308, file: !158, line: 1461, baseType: !2243, size: 192)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2308, file: !158, line: 1462, baseType: !2312, size: 128, offset: 192)
!2312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2313, line: 31, size: 128, elements: !2314)
!2313 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2314 = !{!2315, !2318, !2319}
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2312, file: !2313, line: 32, baseType: !2316, size: 64)
!2316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2317, size: 64)
!2317 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2071)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2312, file: !2313, line: 33, baseType: !7, size: 32, offset: 64)
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2312, file: !2313, line: 34, baseType: !7, size: 32, offset: 96)
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2207, file: !158, line: 3381, baseType: !2321, size: 384)
!2321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !2322)
!2322 = !{!2323, !2324, !2329, !2330, !2331}
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2321, file: !158, line: 2508, baseType: !2243, size: 192)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2321, file: !158, line: 2509, baseType: !2325, size: 32, offset: 192)
!2325 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2326, line: 58, baseType: !2327)
!2326 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2327 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2328, line: 44, baseType: !7)
!2328 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2329 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2321, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2321, file: !158, line: 2511, baseType: !2205, size: 64, offset: 256)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2321, file: !158, line: 2512, baseType: !2205, size: 64, offset: 320)
!2332 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2207, file: !158, line: 3382, baseType: !2333, size: 896)
!2333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !2334)
!2334 = !{!2335, !2336, !2337, !2338, !2339, !2340, !2341, !2342, !2343, !2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367}
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2333, file: !158, line: 2653, baseType: !2321, size: 384)
!2336 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2333, file: !158, line: 2654, baseType: !2205, size: 64, offset: 384)
!2337 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2333, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2333, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2333, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2333, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2341 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2333, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2342 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2333, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2343 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2333, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2333, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2333, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2346 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2333, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2347 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2333, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2348 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2333, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2349 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2333, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2350 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2333, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2351 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2333, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2333, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2333, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2354 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2333, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2355 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2333, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2356 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2333, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2357 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2333, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2333, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2359 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2333, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2360 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2333, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2361 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2333, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2362 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2333, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!2363 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2333, file: !158, line: 2705, baseType: !2205, size: 64, offset: 576)
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2333, file: !158, line: 2706, baseType: !2205, size: 64, offset: 640)
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2333, file: !158, line: 2707, baseType: !2205, size: 64, offset: 704)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2333, file: !158, line: 2708, baseType: !2205, size: 64, offset: 768)
!2367 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2333, file: !158, line: 2711, baseType: !2368, size: 64, offset: 832)
!2368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2369, size: 64)
!2369 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!2370 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2207, file: !158, line: 3383, baseType: !2371, size: 960)
!2371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !2372)
!2372 = !{!2373, !2374}
!2373 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2371, file: !158, line: 2757, baseType: !2333, size: 896)
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2371, file: !158, line: 2758, baseType: !2090, size: 64, offset: 896)
!2375 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2207, file: !158, line: 3384, baseType: !2376, size: 1472)
!2376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !2377)
!2377 = !{!2378, !2399, !2400, !2401, !2402}
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2376, file: !158, line: 3115, baseType: !2379, size: 1216)
!2379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !2380)
!2380 = !{!2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398}
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2379, file: !158, line: 2985, baseType: !2371, size: 960)
!2382 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2379, file: !158, line: 2986, baseType: !2205, size: 64, offset: 960)
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2379, file: !158, line: 2987, baseType: !2205, size: 64, offset: 1024)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2379, file: !158, line: 2988, baseType: !2205, size: 64, offset: 1088)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2379, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2386 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2379, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2387 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2379, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2379, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2379, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2379, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2379, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2379, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2379, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2379, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2379, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2379, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2397 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2379, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2379, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2376, file: !158, line: 3117, baseType: !2205, size: 64, offset: 1216)
!2400 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2376, file: !158, line: 3119, baseType: !2205, size: 64, offset: 1280)
!2401 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2376, file: !158, line: 3121, baseType: !2205, size: 64, offset: 1344)
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2376, file: !158, line: 3123, baseType: !2205, size: 64, offset: 1408)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2207, file: !158, line: 3385, baseType: !2404, size: 1088)
!2404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !2405)
!2405 = !{!2406, !2407, !2408}
!2406 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2404, file: !158, line: 2875, baseType: !2371, size: 960)
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2404, file: !158, line: 2876, baseType: !2090, size: 64, offset: 960)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2404, file: !158, line: 2877, baseType: !2409, size: 64, offset: 1024)
!2409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2410, size: 64)
!2410 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2207, file: !158, line: 3386, baseType: !2379, size: 1216)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2207, file: !158, line: 3387, baseType: !2413, size: 1280)
!2413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !2414)
!2414 = !{!2415, !2416}
!2415 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2413, file: !158, line: 3094, baseType: !2379, size: 1216)
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2413, file: !158, line: 3095, baseType: !2409, size: 64, offset: 1216)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2207, file: !158, line: 3388, baseType: !2418, size: 1216)
!2418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !2419)
!2419 = !{!2420, !2421, !2422, !2423, !2424, !2425}
!2420 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2418, file: !158, line: 2825, baseType: !2333, size: 896)
!2421 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2418, file: !158, line: 2827, baseType: !2205, size: 64, offset: 896)
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2418, file: !158, line: 2828, baseType: !2205, size: 64, offset: 960)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2418, file: !158, line: 2829, baseType: !2205, size: 64, offset: 1024)
!2424 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2418, file: !158, line: 2830, baseType: !2205, size: 64, offset: 1088)
!2425 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2418, file: !158, line: 2831, baseType: !2205, size: 64, offset: 1152)
!2426 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2207, file: !158, line: 3389, baseType: !2427, size: 1024)
!2427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !2428)
!2428 = !{!2429, !2430, !2431}
!2429 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2427, file: !158, line: 2851, baseType: !2371, size: 960)
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2427, file: !158, line: 2852, baseType: !2072, size: 32, offset: 960)
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2427, file: !158, line: 2853, baseType: !2072, size: 32, offset: 992)
!2432 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2207, file: !158, line: 3390, baseType: !2433, size: 1024)
!2433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !2434)
!2434 = !{!2435, !2436}
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2433, file: !158, line: 2858, baseType: !2371, size: 960)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2433, file: !158, line: 2859, baseType: !2409, size: 64, offset: 960)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2207, file: !158, line: 3391, baseType: !2438, size: 960)
!2438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !2439)
!2439 = !{!2440}
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2438, file: !158, line: 2863, baseType: !2371, size: 960)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2207, file: !158, line: 3392, baseType: !2442, size: 1472)
!2442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !2443)
!2443 = !{!2444}
!2444 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2442, file: !158, line: 3305, baseType: !2376, size: 1472)
!2445 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2207, file: !158, line: 3393, baseType: !2446, size: 1792)
!2446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !2447)
!2447 = !{!2448, !2449, !2783, !2784, !2785, !2786, !2787, !2788, !2789, !2790, !2791, !2792, !2793, !2794, !2795, !2796, !2797, !2798, !2799, !2800, !2801, !2802, !2803}
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2446, file: !158, line: 3249, baseType: !2376, size: 1472)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2446, file: !158, line: 3251, baseType: !2450, size: 64, offset: 1472)
!2450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2451, size: 64)
!2451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2452, line: 463, size: 1152, elements: !2453)
!2452 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2453 = !{!2454, !2616, !2720, !2721, !2724, !2727, !2728, !2729, !2730, !2731, !2732, !2756, !2759, !2760, !2761, !2762, !2763, !2764, !2765, !2766, !2767, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776, !2777, !2778, !2779, !2780, !2781, !2782}
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2451, file: !2452, line: 464, baseType: !2455, size: 64)
!2455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2456, size: 64)
!2456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !2457)
!2457 = !{!2458, !2507, !2520, !2534, !2584, !2597}
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !2456, file: !135, line: 197, baseType: !2459, size: 64)
!2459 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !2460)
!2460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2461, size: 64)
!2461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !2462)
!2462 = !{!2463, !2464, !2465, !2466, !2467, !2468, !2495, !2504, !2505, !2506}
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !2461, file: !135, line: 119, baseType: !2460, size: 64)
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2461, file: !135, line: 122, baseType: !2460, size: 64, offset: 64)
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !2461, file: !135, line: 123, baseType: !2460, size: 64, offset: 128)
!2466 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2461, file: !135, line: 126, baseType: !2072, size: 32, offset: 192)
!2467 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2461, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!2468 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2461, file: !135, line: 165, baseType: !2469, size: 192, offset: 256)
!2469 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !2470)
!2470 = !{!2471, !2484, !2490}
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !2469, file: !135, line: 137, baseType: !2472, size: 128)
!2472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !2473)
!2473 = !{!2474, !2483}
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !2472, file: !135, line: 135, baseType: !2475, size: 64)
!2475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2476, size: 64)
!2476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !2477)
!2477 = !{!2478, !2479, !2480, !2481, !2482}
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !2476, file: !135, line: 96, baseType: !2475, size: 64)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !2476, file: !135, line: 97, baseType: !2475, size: 64, offset: 64)
!2480 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !2476, file: !135, line: 101, baseType: !2205, size: 64, offset: 128)
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !2476, file: !135, line: 106, baseType: !2205, size: 64, offset: 192)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !2476, file: !135, line: 111, baseType: !2205, size: 64, offset: 256)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !2472, file: !135, line: 136, baseType: !2475, size: 64, offset: 64)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !2469, file: !135, line: 151, baseType: !2485, size: 192)
!2485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !2486)
!2486 = !{!2487, !2488, !2489}
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !2485, file: !135, line: 141, baseType: !2205, size: 64)
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !2485, file: !135, line: 145, baseType: !2205, size: 64, offset: 64)
!2489 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !2485, file: !135, line: 150, baseType: !2072, size: 32, offset: 128)
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !2469, file: !135, line: 164, baseType: !2491, size: 128)
!2491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !2492)
!2492 = !{!2493, !2494}
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !2491, file: !135, line: 161, baseType: !2205, size: 64)
!2494 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !2491, file: !135, line: 163, baseType: !2325, size: 32, offset: 64)
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !2461, file: !135, line: 168, baseType: !2496, size: 64, offset: 448)
!2496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2497, size: 64)
!2497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !2498)
!2498 = !{!2499, !2500, !2501, !2502, !2503}
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !2497, file: !135, line: 70, baseType: !2496, size: 64)
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2497, file: !135, line: 73, baseType: !2460, size: 64, offset: 64)
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !2497, file: !135, line: 78, baseType: !2205, size: 64, offset: 128)
!2502 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !2497, file: !135, line: 85, baseType: !2090, size: 64, offset: 192)
!2503 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2497, file: !135, line: 88, baseType: !2072, size: 32, offset: 256)
!2504 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !2461, file: !135, line: 173, baseType: !2090, size: 64, offset: 512)
!2505 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !2461, file: !135, line: 173, baseType: !2090, size: 64, offset: 576)
!2506 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !2461, file: !135, line: 177, baseType: !2071, size: 8, offset: 640)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !2456, file: !135, line: 200, baseType: !2508, size: 64, offset: 64)
!2508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2509, size: 64)
!2509 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !2510)
!2510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !2511)
!2511 = !{!2512}
!2512 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2510, file: !135, line: 185, baseType: !2513, size: 128)
!2513 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !2514)
!2514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !2515)
!2515 = !{!2516, !2517, !2518}
!2516 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2514, file: !135, line: 184, baseType: !7, size: 32)
!2517 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2514, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2514, file: !135, line: 184, baseType: !2519, size: 64, offset: 64)
!2519 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2459, size: 64, elements: !2125)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !2456, file: !135, line: 203, baseType: !2521, size: 64, offset: 128)
!2521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2522, size: 64)
!2522 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !2523)
!2523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !2524)
!2524 = !{!2525}
!2525 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2523, file: !135, line: 189, baseType: !2526, size: 128)
!2526 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !2527)
!2527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !2528)
!2528 = !{!2529, !2530, !2531}
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2527, file: !135, line: 188, baseType: !7, size: 32)
!2530 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2527, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2527, file: !135, line: 188, baseType: !2532, size: 64, offset: 64)
!2532 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2533, size: 64, elements: !2125)
!2533 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !2496)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !2456, file: !135, line: 207, baseType: !2535, size: 64, offset: 192)
!2535 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2536, line: 144, baseType: !2537)
!2536 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2538, size: 64)
!2538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2536, line: 100, size: 896, elements: !2539)
!2539 = !{!2540, !2548, !2553, !2558, !2560, !2561, !2562, !2563, !2564, !2565, !2570, !2572, !2573, !2578, !2583}
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2538, file: !2536, line: 102, baseType: !2541, size: 64)
!2541 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2536, line: 52, baseType: !2542)
!2542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2543, size: 64)
!2543 = !DISubroutineType(types: !2544)
!2544 = !{!2545, !2546}
!2545 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2536, line: 47, baseType: !7)
!2546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2547, size: 64)
!2547 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2538, file: !2536, line: 105, baseType: !2549, size: 64, offset: 64)
!2549 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2536, line: 59, baseType: !2550)
!2550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2551, size: 64)
!2551 = !DISubroutineType(types: !2552)
!2552 = !{!2072, !2546, !2546}
!2553 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2538, file: !2536, line: 108, baseType: !2554, size: 64, offset: 128)
!2554 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2536, line: 63, baseType: !2555)
!2555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2556, size: 64)
!2556 = !DISubroutineType(types: !2557)
!2557 = !{null, !2076}
!2558 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2538, file: !2536, line: 111, baseType: !2559, size: 64, offset: 192)
!2559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2076, size: 64)
!2560 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2538, file: !2536, line: 114, baseType: !2079, size: 64, offset: 256)
!2561 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2538, file: !2536, line: 117, baseType: !2079, size: 64, offset: 320)
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2538, file: !2536, line: 120, baseType: !2079, size: 64, offset: 384)
!2563 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2538, file: !2536, line: 124, baseType: !7, size: 32, offset: 448)
!2564 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2538, file: !2536, line: 128, baseType: !7, size: 32, offset: 480)
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2538, file: !2536, line: 131, baseType: !2566, size: 64, offset: 512)
!2566 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2536, line: 75, baseType: !2567)
!2567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2568, size: 64)
!2568 = !DISubroutineType(types: !2569)
!2569 = !{!2076, !2079, !2079}
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2538, file: !2536, line: 132, baseType: !2571, size: 64, offset: 576)
!2571 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2536, line: 78, baseType: !2555)
!2572 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2538, file: !2536, line: 135, baseType: !2076, size: 64, offset: 640)
!2573 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2538, file: !2536, line: 136, baseType: !2574, size: 64, offset: 704)
!2574 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2536, line: 82, baseType: !2575)
!2575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2576, size: 64)
!2576 = !DISubroutineType(types: !2577)
!2577 = !{!2076, !2076, !2079, !2079}
!2578 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2538, file: !2536, line: 137, baseType: !2579, size: 64, offset: 768)
!2579 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2536, line: 83, baseType: !2580)
!2580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2581, size: 64)
!2581 = !DISubroutineType(types: !2582)
!2582 = !{null, !2076, !2076}
!2583 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2538, file: !2536, line: 141, baseType: !7, size: 32, offset: 832)
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !2456, file: !135, line: 211, baseType: !2585, size: 64, offset: 256)
!2585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2586, size: 64)
!2586 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !2587)
!2587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !2588)
!2588 = !{!2589}
!2589 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2587, file: !158, line: 183, baseType: !2590, size: 128)
!2590 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !2591)
!2591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !2592)
!2592 = !{!2593, !2594, !2595}
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2591, file: !158, line: 182, baseType: !7, size: 32)
!2594 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2591, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2591, file: !158, line: 182, baseType: !2596, size: 64, offset: 64)
!2596 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2205, size: 64, elements: !2125)
!2597 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !2456, file: !135, line: 220, baseType: !2598, size: 64, offset: 320)
!2598 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !2599)
!2599 = !{!2600, !2601}
!2600 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !2598, file: !135, line: 218, baseType: !2585, size: 64)
!2601 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !2598, file: !135, line: 219, baseType: !2602, size: 64)
!2602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2603, size: 64)
!2603 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !2604, line: 29, baseType: !2605)
!2604 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !2604, line: 29, size: 96, elements: !2606)
!2606 = !{!2607}
!2607 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2605, file: !2604, line: 29, baseType: !2608, size: 96)
!2608 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !2604, line: 27, baseType: !2609)
!2609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !2604, line: 27, size: 96, elements: !2610)
!2610 = !{!2611, !2612, !2613}
!2611 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2609, file: !2604, line: 27, baseType: !7, size: 32)
!2612 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2609, file: !2604, line: 27, baseType: !7, size: 32, offset: 32)
!2613 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2609, file: !2604, line: 27, baseType: !2614, size: 8, offset: 64)
!2614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2615, size: 8, elements: !2125)
!2615 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !2604, line: 26, baseType: !2071)
!2616 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2451, file: !2452, line: 467, baseType: !2617, size: 64, offset: 64)
!2617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2618, size: 64)
!2618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !2619)
!2619 = !{!2620, !2695, !2696, !2709, !2710, !2711, !2712, !2713, !2714, !2716, !2718, !2719}
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2618, file: !142, line: 377, baseType: !2621, size: 64)
!2621 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2091, line: 111, baseType: !2622)
!2622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2623, size: 64)
!2623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !2624)
!2624 = !{!2625, !2660, !2661, !2662, !2665, !2669, !2670, !2671, !2689, !2690, !2691, !2692, !2693, !2694}
!2625 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2623, file: !142, line: 219, baseType: !2626, size: 64)
!2626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2627, size: 64)
!2627 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !2628)
!2628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !2629)
!2629 = !{!2630}
!2630 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2628, file: !142, line: 151, baseType: !2631, size: 128)
!2631 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !2632)
!2632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !2633)
!2633 = !{!2634, !2635, !2636}
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2632, file: !142, line: 150, baseType: !7, size: 32)
!2635 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2632, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!2636 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2632, file: !142, line: 150, baseType: !2637, size: 64, offset: 64)
!2637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2638, size: 64, elements: !2125)
!2638 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2091, line: 108, baseType: !2639)
!2639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2640, size: 64)
!2640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !2641)
!2641 = !{!2642, !2643, !2644, !2652, !2653, !2654, !2655, !2656, !2657, !2658}
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2640, file: !142, line: 124, baseType: !2622, size: 64)
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2640, file: !142, line: 125, baseType: !2622, size: 64, offset: 64)
!2644 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2640, file: !142, line: 131, baseType: !2645, size: 64, offset: 128)
!2645 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !2646)
!2646 = !{!2647, !2651}
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2645, file: !142, line: 129, baseType: !2648, size: 64)
!2648 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2091, line: 66, baseType: !2649)
!2649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2650, size: 64)
!2650 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2091, line: 65, flags: DIFlagFwdDecl)
!2651 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2645, file: !142, line: 130, baseType: !2090, size: 64)
!2652 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2640, file: !142, line: 134, baseType: !2076, size: 64, offset: 192)
!2653 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !2640, file: !142, line: 137, baseType: !2205, size: 64, offset: 256)
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !2640, file: !142, line: 138, baseType: !2325, size: 32, offset: 320)
!2655 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !2640, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!2656 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2640, file: !142, line: 144, baseType: !2072, size: 32, offset: 384)
!2657 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !2640, file: !142, line: 145, baseType: !2072, size: 32, offset: 416)
!2658 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2640, file: !142, line: 146, baseType: !2659, size: 64, offset: 448)
!2659 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !2176)
!2660 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !2623, file: !142, line: 220, baseType: !2626, size: 64, offset: 64)
!2661 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2623, file: !142, line: 223, baseType: !2076, size: 64, offset: 128)
!2662 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !2623, file: !142, line: 226, baseType: !2663, size: 64, offset: 192)
!2663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2664, size: 64)
!2664 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !2623, file: !142, line: 229, baseType: !2666, size: 128, offset: 256)
!2666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2667, size: 128, elements: !2160)
!2667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2668, size: 64)
!2668 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!2669 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !2623, file: !142, line: 232, baseType: !2622, size: 64, offset: 384)
!2670 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !2623, file: !142, line: 233, baseType: !2622, size: 64, offset: 448)
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !2623, file: !142, line: 238, baseType: !2672, size: 64, offset: 512)
!2672 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !2673)
!2673 = !{!2674, !2680}
!2674 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2672, file: !142, line: 236, baseType: !2675, size: 64)
!2675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2676, size: 64)
!2676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !2677)
!2677 = !{!2678, !2679}
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2676, file: !142, line: 275, baseType: !2648, size: 64)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2676, file: !142, line: 278, baseType: !2648, size: 64, offset: 64)
!2680 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2672, file: !142, line: 237, baseType: !2681, size: 64)
!2681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2682, size: 64)
!2682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !2683)
!2683 = !{!2684, !2685, !2686, !2687, !2688}
!2684 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2682, file: !142, line: 261, baseType: !2090, size: 64)
!2685 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2682, file: !142, line: 262, baseType: !2090, size: 64, offset: 64)
!2686 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2682, file: !142, line: 266, baseType: !2090, size: 64, offset: 128)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2682, file: !142, line: 267, baseType: !2090, size: 64, offset: 192)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2682, file: !142, line: 270, baseType: !2072, size: 32, offset: 256)
!2689 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2623, file: !142, line: 241, baseType: !2659, size: 64, offset: 576)
!2690 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2623, file: !142, line: 244, baseType: !2072, size: 32, offset: 640)
!2691 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !2623, file: !142, line: 247, baseType: !2072, size: 32, offset: 672)
!2692 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !2623, file: !142, line: 250, baseType: !2072, size: 32, offset: 704)
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !2623, file: !142, line: 253, baseType: !2072, size: 32, offset: 736)
!2694 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2623, file: !142, line: 256, baseType: !2072, size: 32, offset: 768)
!2695 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2618, file: !142, line: 378, baseType: !2621, size: 64, offset: 64)
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2618, file: !142, line: 381, baseType: !2697, size: 64, offset: 128)
!2697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2698, size: 64)
!2698 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !2699)
!2699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !2700)
!2700 = !{!2701}
!2701 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2699, file: !142, line: 282, baseType: !2702, size: 128)
!2702 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !2703)
!2703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !2704)
!2704 = !{!2705, !2706, !2707}
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2703, file: !142, line: 281, baseType: !7, size: 32)
!2706 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2703, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!2707 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2703, file: !142, line: 281, baseType: !2708, size: 64, offset: 64)
!2708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2621, size: 64, elements: !2125)
!2709 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !2618, file: !142, line: 384, baseType: !2072, size: 32, offset: 192)
!2710 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !2618, file: !142, line: 387, baseType: !2072, size: 32, offset: 224)
!2711 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !2618, file: !142, line: 390, baseType: !2072, size: 32, offset: 256)
!2712 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !2618, file: !142, line: 394, baseType: !2697, size: 64, offset: 320)
!2713 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !2618, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!2714 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !2618, file: !142, line: 399, baseType: !2715, size: 64, offset: 416)
!2715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !2160)
!2716 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !2618, file: !142, line: 402, baseType: !2717, size: 64, offset: 480)
!2717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !2160)
!2718 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !2618, file: !142, line: 406, baseType: !2072, size: 32, offset: 544)
!2719 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !2618, file: !142, line: 409, baseType: !2072, size: 32, offset: 576)
!2720 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2451, file: !2452, line: 470, baseType: !2649, size: 64, offset: 128)
!2721 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2451, file: !2452, line: 473, baseType: !2722, size: 64, offset: 192)
!2722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2723, size: 64)
!2723 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2452, line: 166, flags: DIFlagFwdDecl)
!2724 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !2451, file: !2452, line: 476, baseType: !2725, size: 64, offset: 256)
!2725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2726, size: 64)
!2726 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !2452, line: 476, flags: DIFlagFwdDecl)
!2727 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !2451, file: !2452, line: 479, baseType: !2535, size: 64, offset: 320)
!2728 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2451, file: !2452, line: 484, baseType: !2205, size: 64, offset: 384)
!2729 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !2451, file: !2452, line: 488, baseType: !2205, size: 64, offset: 448)
!2730 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !2451, file: !2452, line: 493, baseType: !2205, size: 64, offset: 512)
!2731 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !2451, file: !2452, line: 496, baseType: !2205, size: 64, offset: 576)
!2732 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2451, file: !2452, line: 501, baseType: !2733, size: 64, offset: 640)
!2733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2734, size: 64)
!2734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !2735)
!2735 = !{!2736, !2739, !2740, !2741, !2742, !2744, !2745, !2750, !2751, !2752, !2753, !2754, !2755}
!2736 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2734, file: !153, line: 2356, baseType: !2737, size: 64)
!2737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2738, size: 64)
!2738 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!2739 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2734, file: !153, line: 2357, baseType: !2077, size: 64, offset: 64)
!2740 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2734, file: !153, line: 2358, baseType: !2072, size: 32, offset: 128)
!2741 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2734, file: !153, line: 2359, baseType: !2072, size: 32, offset: 160)
!2742 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2734, file: !153, line: 2360, baseType: !2743, size: 128, offset: 192)
!2743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2072, size: 128, elements: !2185)
!2744 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2734, file: !153, line: 2364, baseType: !2072, size: 32, offset: 320)
!2745 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2734, file: !153, line: 2367, baseType: !2746, size: 128, offset: 384)
!2746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !2747)
!2747 = !{!2748, !2749}
!2748 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2746, file: !153, line: 2351, baseType: !2090, size: 64)
!2749 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2746, file: !153, line: 2352, baseType: !2176, size: 64, offset: 64)
!2750 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2734, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!2751 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2734, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2752 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2734, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2753 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2734, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2754 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2734, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2755 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2734, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2756 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !2451, file: !2452, line: 504, baseType: !2757, size: 64, offset: 704)
!2757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2758, size: 64)
!2758 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !2452, line: 504, flags: DIFlagFwdDecl)
!2759 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !2451, file: !2452, line: 507, baseType: !2535, size: 64, offset: 768)
!2760 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !2451, file: !2452, line: 510, baseType: !2072, size: 32, offset: 832)
!2761 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !2451, file: !2452, line: 513, baseType: !2072, size: 32, offset: 864)
!2762 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !2451, file: !2452, line: 516, baseType: !2325, size: 32, offset: 896)
!2763 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !2451, file: !2452, line: 519, baseType: !2325, size: 32, offset: 928)
!2764 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !2451, file: !2452, line: 522, baseType: !7, size: 32, offset: 960)
!2765 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !2451, file: !2452, line: 523, baseType: !7, size: 32, offset: 992)
!2766 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !2451, file: !2452, line: 528, baseType: !2077, size: 64, offset: 1024)
!2767 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !2451, file: !2452, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2768 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !2451, file: !2452, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2769 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !2451, file: !2452, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2770 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !2451, file: !2452, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !2451, file: !2452, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2772 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !2451, file: !2452, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2773 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !2451, file: !2452, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !2451, file: !2452, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !2451, file: !2452, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !2451, file: !2452, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2777 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !2451, file: !2452, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2778 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !2451, file: !2452, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2779 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !2451, file: !2452, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2780 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !2451, file: !2452, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2781 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !2451, file: !2452, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !2451, file: !2452, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !2446, file: !158, line: 3254, baseType: !2205, size: 64, offset: 1536)
!2784 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !2446, file: !158, line: 3257, baseType: !2205, size: 64, offset: 1600)
!2785 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !2446, file: !158, line: 3258, baseType: !2205, size: 64, offset: 1664)
!2786 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !2446, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2787 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !2446, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2788 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !2446, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2789 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !2446, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2790 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !2446, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !2446, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2792 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !2446, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2793 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !2446, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2794 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !2446, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2795 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !2446, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!2796 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !2446, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !2446, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !2446, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!2799 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !2446, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!2800 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !2446, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!2801 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !2446, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!2802 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !2446, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!2803 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !2446, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!2804 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2207, file: !158, line: 3394, baseType: !2805, size: 1344)
!2805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !2806)
!2806 = !{!2807, !2808, !2809, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2832, !2833, !2834, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850}
!2807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2805, file: !158, line: 2280, baseType: !2243, size: 192)
!2808 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2805, file: !158, line: 2281, baseType: !2205, size: 64, offset: 192)
!2809 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2805, file: !158, line: 2282, baseType: !2205, size: 64, offset: 256)
!2810 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2805, file: !158, line: 2283, baseType: !2205, size: 64, offset: 320)
!2811 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2805, file: !158, line: 2284, baseType: !2205, size: 64, offset: 384)
!2812 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2805, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!2813 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !2805, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!2814 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !2805, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!2815 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !2805, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!2816 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !2805, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!2817 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !2805, file: !158, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!2818 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !2805, file: !158, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!2819 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2805, file: !158, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
