; ModuleID = 'opts-common.bc'
source_filename = "opts-common.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.cl_option = type { i8*, i8*, i16, i8, i32, i32, i8*, i32, i32 }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@cl_options_count = external dso_local local_unnamed_addr constant i32, align 4
@cl_options = external dso_local local_unnamed_addr constant [0 x %struct.cl_option], align 8

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !27 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !12, nameTableKind: None)
!1 = !DIFile(filename: "opts-common.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "cl_var_type", file: !4, line: 25, baseType: !5, size: 32, elements: !6)
!4 = !DIFile(filename: "./opts.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!5 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!6 = !{!7, !8, !9, !10, !11}
!7 = !DIEnumerator(name: "CLVC_BOOLEAN", value: 0, isUnsigned: true)
!8 = !DIEnumerator(name: "CLVC_EQUAL", value: 1, isUnsigned: true)
!9 = !DIEnumerator(name: "CLVC_BIT_CLEAR", value: 2, isUnsigned: true)
!10 = !DIEnumerator(name: "CLVC_BIT_SET", value: 3, isUnsigned: true)
!11 = !DIEnumerator(name: "CLVC_STRING", value: 4, isUnsigned: true)
!12 = !{!13, !14, !15, !16, !19, !20, !22, !17}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !18)
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!23 = !{i32 2, !"Dwarf Version", i32 4}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = !{i32 1, !"wchar_size", i32 4}
!26 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!27 = distinct !DISubprogram(name: "vprintf", scope: !28, file: !28, line: 39, type: !29, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !39)
!28 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!29 = !DISubroutineType(types: !30)
!30 = !{!15, !31, !32}
!31 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !20)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !34)
!34 = !{!35, !36, !37, !38}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !33, file: !1, baseType: !5, size: 32)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !33, file: !1, baseType: !5, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !33, file: !1, baseType: !19, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !33, file: !1, baseType: !19, size: 64, offset: 128)
!39 = !{!40, !41}
!40 = !DILocalVariable(name: "__fmt", arg: 1, scope: !27, file: !28, line: 39, type: !31)
!41 = !DILocalVariable(name: "__arg", arg: 2, scope: !27, file: !28, line: 39, type: !32)
!42 = !DILocation(line: 0, scope: !27)
!43 = !DILocation(line: 41, column: 20, scope: !27)
!44 = !DILocation(line: 41, column: 10, scope: !27)
!45 = !DILocation(line: 41, column: 3, scope: !27)
!46 = distinct !DISubprogram(name: "getchar", scope: !28, file: !28, line: 47, type: !47, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !49)
!47 = !DISubroutineType(types: !48)
!48 = !{!15}
!49 = !{}
!50 = !DILocation(line: 49, column: 16, scope: !46)
!51 = !DILocation(line: 49, column: 10, scope: !46)
!52 = !DILocation(line: 49, column: 3, scope: !46)
!53 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !28, file: !28, line: 56, type: !54, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !115)
!54 = !DISubroutineType(types: !55)
!55 = !{!15, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !58, line: 7, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !77, !79, !80, !81, !85, !87, !89, !93, !96, !98, !101, !104, !105, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 51, baseType: !15, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 54, baseType: !17, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 55, baseType: !17, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 56, baseType: !17, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 57, baseType: !17, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 58, baseType: !17, size: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 59, baseType: !17, size: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 60, baseType: !17, size: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 61, baseType: !17, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 64, baseType: !17, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 65, baseType: !17, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 66, baseType: !17, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 36, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 70, baseType: !78, size: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 72, baseType: !15, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 73, baseType: !15, size: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 74, baseType: !82, size: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 152, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!84 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 77, baseType: !86, size: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 78, baseType: !88, size: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 79, baseType: !90, size: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 81, baseType: !94, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 43, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 89, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !83, line: 153, baseType: !84)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !59, file: !60, line: 91, baseType: !99, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !60, line: 37, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !59, file: !60, line: 92, baseType: !102, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !60, line: 38, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !59, file: !60, line: 93, baseType: !78, size: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !59, file: !60, line: 94, baseType: !19, size: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!109 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 96, baseType: !15, size: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !{!116}
!116 = !DILocalVariable(name: "__fp", arg: 1, scope: !53, file: !28, line: 56, type: !56)
!117 = !DILocation(line: 0, scope: !53)
!118 = !DILocation(line: 58, column: 10, scope: !53)
!119 = !DILocation(line: 58, column: 3, scope: !53)
!120 = distinct !DISubprogram(name: "getc_unlocked", scope: !28, file: !28, line: 66, type: !54, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !121)
!121 = !{!122}
!122 = !DILocalVariable(name: "__fp", arg: 1, scope: !120, file: !28, line: 66, type: !56)
!123 = !DILocation(line: 0, scope: !120)
!124 = !DILocation(line: 68, column: 10, scope: !120)
!125 = !DILocation(line: 68, column: 3, scope: !120)
!126 = distinct !DISubprogram(name: "getchar_unlocked", scope: !28, file: !28, line: 73, type: !47, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !49)
!127 = !DILocation(line: 75, column: 10, scope: !126)
!128 = !DILocation(line: 75, column: 3, scope: !126)
!129 = distinct !DISubprogram(name: "putchar", scope: !28, file: !28, line: 82, type: !130, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{!15, !15}
!132 = !{!133}
!133 = !DILocalVariable(name: "__c", arg: 1, scope: !129, file: !28, line: 82, type: !15)
!134 = !DILocation(line: 0, scope: !129)
!135 = !DILocation(line: 84, column: 21, scope: !129)
!136 = !DILocation(line: 84, column: 10, scope: !129)
!137 = !DILocation(line: 84, column: 3, scope: !129)
!138 = distinct !DISubprogram(name: "fputc_unlocked", scope: !28, file: !28, line: 91, type: !139, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{!15, !15, !56}
!141 = !{!142, !143}
!142 = !DILocalVariable(name: "__c", arg: 1, scope: !138, file: !28, line: 91, type: !15)
!143 = !DILocalVariable(name: "__stream", arg: 2, scope: !138, file: !28, line: 91, type: !56)
!144 = !DILocation(line: 0, scope: !138)
!145 = !DILocation(line: 93, column: 10, scope: !138)
!146 = !DILocation(line: 93, column: 3, scope: !138)
!147 = distinct !DISubprogram(name: "putc_unlocked", scope: !28, file: !28, line: 101, type: !139, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !148)
!148 = !{!149, !150}
!149 = !DILocalVariable(name: "__c", arg: 1, scope: !147, file: !28, line: 101, type: !15)
!150 = !DILocalVariable(name: "__stream", arg: 2, scope: !147, file: !28, line: 101, type: !56)
!151 = !DILocation(line: 0, scope: !147)
!152 = !DILocation(line: 103, column: 10, scope: !147)
!153 = !DILocation(line: 103, column: 3, scope: !147)
!154 = distinct !DISubprogram(name: "putchar_unlocked", scope: !28, file: !28, line: 108, type: !130, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !155)
!155 = !{!156}
!156 = !DILocalVariable(name: "__c", arg: 1, scope: !154, file: !28, line: 108, type: !15)
!157 = !DILocation(line: 0, scope: !154)
!158 = !DILocation(line: 110, column: 10, scope: !154)
!159 = !DILocation(line: 110, column: 3, scope: !154)
!160 = distinct !DISubprogram(name: "getline", scope: !28, file: !28, line: 118, type: !161, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !165)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !16, !164, !56}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !83, line: 193, baseType: !84)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!165 = !{!166, !167, !168}
!166 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !160, file: !28, line: 118, type: !16)
!167 = !DILocalVariable(name: "__n", arg: 2, scope: !160, file: !28, line: 118, type: !164)
!168 = !DILocalVariable(name: "__stream", arg: 3, scope: !160, file: !28, line: 118, type: !56)
!169 = !DILocation(line: 0, scope: !160)
!170 = !DILocation(line: 120, column: 10, scope: !160)
!171 = !DILocation(line: 120, column: 3, scope: !160)
!172 = distinct !DISubprogram(name: "feof_unlocked", scope: !28, file: !28, line: 128, type: !54, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !173)
!173 = !{!174}
!174 = !DILocalVariable(name: "__stream", arg: 1, scope: !172, file: !28, line: 128, type: !56)
!175 = !DILocation(line: 0, scope: !172)
!176 = !DILocation(line: 130, column: 10, scope: !172)
!177 = !DILocation(line: 130, column: 3, scope: !172)
!178 = distinct !DISubprogram(name: "ferror_unlocked", scope: !28, file: !28, line: 135, type: !54, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !179)
!179 = !{!180}
!180 = !DILocalVariable(name: "__stream", arg: 1, scope: !178, file: !28, line: 135, type: !56)
!181 = !DILocation(line: 0, scope: !178)
!182 = !DILocation(line: 137, column: 10, scope: !178)
!183 = !DILocation(line: 137, column: 3, scope: !178)
!184 = distinct !DISubprogram(name: "tolower", scope: !185, file: !185, line: 207, type: !130, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !186)
!185 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!186 = !{!187}
!187 = !DILocalVariable(name: "__c", arg: 1, scope: !184, file: !185, line: 207, type: !15)
!188 = !DILocation(line: 0, scope: !184)
!189 = !DILocation(line: 209, column: 22, scope: !184)
!190 = !DILocation(line: 209, column: 39, scope: !184)
!191 = !DILocation(line: 209, column: 38, scope: !184)
!192 = !DILocation(line: 209, column: 37, scope: !184)
!193 = !DILocation(line: 209, column: 10, scope: !184)
!194 = !DILocation(line: 209, column: 3, scope: !184)
!195 = distinct !DISubprogram(name: "toupper", scope: !185, file: !185, line: 213, type: !130, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !196)
!196 = !{!197}
!197 = !DILocalVariable(name: "__c", arg: 1, scope: !195, file: !185, line: 213, type: !15)
!198 = !DILocation(line: 0, scope: !195)
!199 = !DILocation(line: 215, column: 22, scope: !195)
!200 = !DILocation(line: 215, column: 39, scope: !195)
!201 = !DILocation(line: 215, column: 38, scope: !195)
!202 = !DILocation(line: 215, column: 37, scope: !195)
!203 = !DILocation(line: 215, column: 10, scope: !195)
!204 = !DILocation(line: 215, column: 3, scope: !195)
!205 = distinct !DISubprogram(name: "atoi", scope: !206, file: !206, line: 361, type: !207, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !209)
!206 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!207 = !DISubroutineType(types: !208)
!208 = !{!15, !20}
!209 = !{!210}
!210 = !DILocalVariable(name: "__nptr", arg: 1, scope: !205, file: !206, line: 361, type: !20)
!211 = !DILocation(line: 0, scope: !205)
!212 = !DILocation(line: 363, column: 16, scope: !205)
!213 = !DILocation(line: 363, column: 10, scope: !205)
!214 = !DILocation(line: 363, column: 3, scope: !205)
!215 = distinct !DISubprogram(name: "atol", scope: !206, file: !206, line: 366, type: !216, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !218)
!216 = !DISubroutineType(types: !217)
!217 = !{!84, !20}
!218 = !{!219}
!219 = !DILocalVariable(name: "__nptr", arg: 1, scope: !215, file: !206, line: 366, type: !20)
!220 = !DILocation(line: 0, scope: !215)
!221 = !DILocation(line: 368, column: 10, scope: !215)
!222 = !DILocation(line: 368, column: 3, scope: !215)
!223 = distinct !DISubprogram(name: "atoll", scope: !206, file: !206, line: 373, type: !224, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !227)
!224 = !DISubroutineType(types: !225)
!225 = !{!226, !20}
!226 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!227 = !{!228}
!228 = !DILocalVariable(name: "__nptr", arg: 1, scope: !223, file: !206, line: 373, type: !20)
!229 = !DILocation(line: 0, scope: !223)
!230 = !DILocation(line: 375, column: 10, scope: !223)
!231 = !DILocation(line: 375, column: 3, scope: !223)
!232 = distinct !DISubprogram(name: "bsearch", scope: !233, file: !233, line: 20, type: !234, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !242)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!234 = !DISubroutineType(types: !235)
!235 = !{!19, !236, !236, !107, !107, !238}
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!238 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !206, line: 808, baseType: !239)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DISubroutineType(types: !241)
!241 = !{!15, !236, !236}
!242 = !{!243, !244, !245, !246, !247, !248, !249, !250, !251, !252}
!243 = !DILocalVariable(name: "__key", arg: 1, scope: !232, file: !233, line: 20, type: !236)
!244 = !DILocalVariable(name: "__base", arg: 2, scope: !232, file: !233, line: 20, type: !236)
!245 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !232, file: !233, line: 20, type: !107)
!246 = !DILocalVariable(name: "__size", arg: 4, scope: !232, file: !233, line: 20, type: !107)
!247 = !DILocalVariable(name: "__compar", arg: 5, scope: !232, file: !233, line: 21, type: !238)
!248 = !DILocalVariable(name: "__l", scope: !232, file: !233, line: 23, type: !107)
!249 = !DILocalVariable(name: "__u", scope: !232, file: !233, line: 23, type: !107)
!250 = !DILocalVariable(name: "__idx", scope: !232, file: !233, line: 23, type: !107)
!251 = !DILocalVariable(name: "__p", scope: !232, file: !233, line: 24, type: !236)
!252 = !DILocalVariable(name: "__comparison", scope: !232, file: !233, line: 25, type: !15)
!253 = !DILocation(line: 0, scope: !232)
!254 = !DILocation(line: 29, column: 3, scope: !232)
!255 = !DILocation(line: 27, column: 7, scope: !232)
!256 = !DILocation(line: 29, column: 14, scope: !232)
!257 = !DILocation(line: 31, column: 20, scope: !258)
!258 = distinct !DILexicalBlock(scope: !232, file: !233, line: 30, column: 5)
!259 = !DILocation(line: 31, column: 27, scope: !258)
!260 = !DILocation(line: 32, column: 56, scope: !258)
!261 = !DILocation(line: 32, column: 47, scope: !258)
!262 = !DILocation(line: 33, column: 22, scope: !258)
!263 = !DILocation(line: 34, column: 24, scope: !264)
!264 = distinct !DILexicalBlock(scope: !258, file: !233, line: 34, column: 11)
!265 = !DILocation(line: 34, column: 11, scope: !258)
!266 = !DILocation(line: 36, column: 29, scope: !267)
!267 = distinct !DILexicalBlock(scope: !264, file: !233, line: 36, column: 16)
!268 = !DILocation(line: 36, column: 16, scope: !264)
!269 = !DILocation(line: 37, column: 14, scope: !267)
!270 = distinct !{!270, !254, !271}
!271 = !DILocation(line: 40, column: 5, scope: !232)
!272 = !DILocation(line: 43, column: 1, scope: !232)
!273 = distinct !DISubprogram(name: "atof", scope: !274, file: !274, line: 25, type: !275, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !278)
!274 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !20}
!277 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!278 = !{!279}
!279 = !DILocalVariable(name: "__nptr", arg: 1, scope: !273, file: !274, line: 25, type: !20)
!280 = !DILocation(line: 0, scope: !273)
!281 = !DILocation(line: 27, column: 10, scope: !273)
!282 = !DILocation(line: 27, column: 3, scope: !273)
!283 = distinct !DISubprogram(name: "strtoimax", scope: !284, file: !284, line: 324, type: !285, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !291)
!284 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!285 = !DISubroutineType(types: !286)
!286 = !{!287, !31, !290, !15}
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !288, line: 101, baseType: !289)
!288 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!289 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !83, line: 72, baseType: !84)
!290 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !16)
!291 = !{!292, !293, !294}
!292 = !DILocalVariable(name: "nptr", arg: 1, scope: !283, file: !284, line: 324, type: !31)
!293 = !DILocalVariable(name: "endptr", arg: 2, scope: !283, file: !284, line: 324, type: !290)
!294 = !DILocalVariable(name: "base", arg: 3, scope: !283, file: !284, line: 324, type: !15)
!295 = !DILocation(line: 0, scope: !283)
!296 = !DILocation(line: 327, column: 10, scope: !283)
!297 = !DILocation(line: 327, column: 3, scope: !283)
!298 = distinct !DISubprogram(name: "strtoumax", scope: !284, file: !284, line: 336, type: !299, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !303)
!299 = !DISubroutineType(types: !300)
!300 = !{!301, !31, !290, !15}
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !288, line: 102, baseType: !302)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !83, line: 73, baseType: !109)
!303 = !{!304, !305, !306}
!304 = !DILocalVariable(name: "nptr", arg: 1, scope: !298, file: !284, line: 336, type: !31)
!305 = !DILocalVariable(name: "endptr", arg: 2, scope: !298, file: !284, line: 336, type: !290)
!306 = !DILocalVariable(name: "base", arg: 3, scope: !298, file: !284, line: 336, type: !15)
!307 = !DILocation(line: 0, scope: !298)
!308 = !DILocation(line: 339, column: 10, scope: !298)
!309 = !DILocation(line: 339, column: 3, scope: !298)
!310 = distinct !DISubprogram(name: "wcstoimax", scope: !284, file: !284, line: 348, type: !311, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !320)
!311 = !DISubroutineType(types: !312)
!312 = !{!287, !313, !317, !15}
!313 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !314)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !316)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !284, line: 34, baseType: !15)
!317 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !318)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!320 = !{!321, !322, !323}
!321 = !DILocalVariable(name: "nptr", arg: 1, scope: !310, file: !284, line: 348, type: !313)
!322 = !DILocalVariable(name: "endptr", arg: 2, scope: !310, file: !284, line: 348, type: !317)
!323 = !DILocalVariable(name: "base", arg: 3, scope: !310, file: !284, line: 348, type: !15)
!324 = !DILocation(line: 0, scope: !310)
!325 = !DILocation(line: 351, column: 10, scope: !310)
!326 = !DILocation(line: 351, column: 3, scope: !310)
!327 = distinct !DISubprogram(name: "wcstoumax", scope: !284, file: !284, line: 362, type: !328, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !330)
!328 = !DISubroutineType(types: !329)
!329 = !{!301, !313, !317, !15}
!330 = !{!331, !332, !333}
!331 = !DILocalVariable(name: "nptr", arg: 1, scope: !327, file: !284, line: 362, type: !313)
!332 = !DILocalVariable(name: "endptr", arg: 2, scope: !327, file: !284, line: 362, type: !317)
!333 = !DILocalVariable(name: "base", arg: 3, scope: !327, file: !284, line: 362, type: !15)
!334 = !DILocation(line: 0, scope: !327)
!335 = !DILocation(line: 365, column: 10, scope: !327)
!336 = !DILocation(line: 365, column: 3, scope: !327)
!337 = distinct !DISubprogram(name: "stat", scope: !338, file: !338, line: 453, type: !339, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !378)
!338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!339 = !DISubroutineType(types: !340)
!340 = !{!15, !20, !341}
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !343, line: 46, size: 1152, elements: !344)
!343 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!344 = !{!345, !347, !349, !351, !353, !355, !357, !358, !359, !360, !362, !364, !372, !373, !374}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !342, file: !343, line: 48, baseType: !346, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !83, line: 145, baseType: !109)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !342, file: !343, line: 53, baseType: !348, size: 64, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !83, line: 148, baseType: !109)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !342, file: !343, line: 61, baseType: !350, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !83, line: 151, baseType: !109)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !342, file: !343, line: 62, baseType: !352, size: 32, offset: 192)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !83, line: 150, baseType: !5)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !342, file: !343, line: 64, baseType: !354, size: 32, offset: 224)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !83, line: 146, baseType: !5)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !342, file: !343, line: 65, baseType: !356, size: 32, offset: 256)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !83, line: 147, baseType: !5)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !342, file: !343, line: 67, baseType: !15, size: 32, offset: 288)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !342, file: !343, line: 69, baseType: !346, size: 64, offset: 320)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !342, file: !343, line: 74, baseType: !82, size: 64, offset: 384)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !342, file: !343, line: 78, baseType: !361, size: 64, offset: 448)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !83, line: 174, baseType: !84)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !342, file: !343, line: 80, baseType: !363, size: 64, offset: 512)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !83, line: 179, baseType: !84)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !342, file: !343, line: 91, baseType: !365, size: 128, offset: 576)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !366, line: 10, size: 128, elements: !367)
!366 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!367 = !{!368, !370}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !365, file: !366, line: 12, baseType: !369, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !83, line: 160, baseType: !84)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !365, file: !366, line: 16, baseType: !371, size: 64, offset: 64)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !83, line: 196, baseType: !84)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !342, file: !343, line: 92, baseType: !365, size: 128, offset: 704)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !342, file: !343, line: 93, baseType: !365, size: 128, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !342, file: !343, line: 106, baseType: !375, size: 192, offset: 960)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !371, size: 192, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 3)
!378 = !{!379, !380}
!379 = !DILocalVariable(name: "__path", arg: 1, scope: !337, file: !338, line: 453, type: !20)
!380 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !337, file: !338, line: 453, type: !341)
!381 = !DILocation(line: 0, scope: !337)
!382 = !DILocation(line: 455, column: 10, scope: !337)
!383 = !DILocation(line: 455, column: 3, scope: !337)
!384 = distinct !DISubprogram(name: "lstat", scope: !338, file: !338, line: 460, type: !339, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !385)
!385 = !{!386, !387}
!386 = !DILocalVariable(name: "__path", arg: 1, scope: !384, file: !338, line: 460, type: !20)
!387 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !384, file: !338, line: 460, type: !341)
!388 = !DILocation(line: 0, scope: !384)
!389 = !DILocation(line: 462, column: 10, scope: !384)
!390 = !DILocation(line: 462, column: 3, scope: !384)
!391 = distinct !DISubprogram(name: "fstat", scope: !338, file: !338, line: 467, type: !392, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !394)
!392 = !DISubroutineType(types: !393)
!393 = !{!15, !15, !341}
!394 = !{!395, !396}
!395 = !DILocalVariable(name: "__fd", arg: 1, scope: !391, file: !338, line: 467, type: !15)
!396 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !391, file: !338, line: 467, type: !341)
!397 = !DILocation(line: 0, scope: !391)
!398 = !DILocation(line: 469, column: 10, scope: !391)
!399 = !DILocation(line: 469, column: 3, scope: !391)
!400 = distinct !DISubprogram(name: "fstatat", scope: !338, file: !338, line: 474, type: !401, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !403)
!401 = !DISubroutineType(types: !402)
!402 = !{!15, !15, !20, !341, !15}
!403 = !{!404, !405, !406, !407}
!404 = !DILocalVariable(name: "__fd", arg: 1, scope: !400, file: !338, line: 474, type: !15)
!405 = !DILocalVariable(name: "__filename", arg: 2, scope: !400, file: !338, line: 474, type: !20)
!406 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !400, file: !338, line: 474, type: !341)
!407 = !DILocalVariable(name: "__flag", arg: 4, scope: !400, file: !338, line: 474, type: !15)
!408 = !DILocation(line: 0, scope: !400)
!409 = !DILocation(line: 477, column: 10, scope: !400)
!410 = !DILocation(line: 477, column: 3, scope: !400)
!411 = distinct !DISubprogram(name: "mknod", scope: !338, file: !338, line: 483, type: !412, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!15, !20, !352, !346}
!414 = !{!415, !416, !417}
!415 = !DILocalVariable(name: "__path", arg: 1, scope: !411, file: !338, line: 483, type: !20)
!416 = !DILocalVariable(name: "__mode", arg: 2, scope: !411, file: !338, line: 483, type: !352)
!417 = !DILocalVariable(name: "__dev", arg: 3, scope: !411, file: !338, line: 483, type: !346)
!418 = !DILocation(line: 0, scope: !411)
!419 = !DILocation(line: 485, column: 10, scope: !411)
!420 = !DILocation(line: 485, column: 3, scope: !411)
!421 = distinct !DISubprogram(name: "mknodat", scope: !338, file: !338, line: 491, type: !422, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !424)
!422 = !DISubroutineType(types: !423)
!423 = !{!15, !15, !20, !352, !346}
!424 = !{!425, !426, !427, !428}
!425 = !DILocalVariable(name: "__fd", arg: 1, scope: !421, file: !338, line: 491, type: !15)
!426 = !DILocalVariable(name: "__path", arg: 2, scope: !421, file: !338, line: 491, type: !20)
!427 = !DILocalVariable(name: "__mode", arg: 3, scope: !421, file: !338, line: 491, type: !352)
!428 = !DILocalVariable(name: "__dev", arg: 4, scope: !421, file: !338, line: 491, type: !346)
!429 = !DILocation(line: 0, scope: !421)
!430 = !DILocation(line: 494, column: 10, scope: !421)
!431 = !DILocation(line: 494, column: 3, scope: !421)
!432 = distinct !DISubprogram(name: "stat64", scope: !338, file: !338, line: 502, type: !433, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !455)
!433 = !DISubroutineType(types: !434)
!434 = !{!15, !20, !435}
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !436, size: 64)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !343, line: 119, size: 1152, elements: !437)
!437 = !{!438, !439, !441, !442, !443, !444, !445, !446, !447, !448, !449, !451, !452, !453, !454}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !436, file: !343, line: 121, baseType: !346, size: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !436, file: !343, line: 123, baseType: !440, size: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !83, line: 149, baseType: !109)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !436, file: !343, line: 124, baseType: !350, size: 64, offset: 128)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !436, file: !343, line: 125, baseType: !352, size: 32, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !436, file: !343, line: 132, baseType: !354, size: 32, offset: 224)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !436, file: !343, line: 133, baseType: !356, size: 32, offset: 256)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !436, file: !343, line: 135, baseType: !15, size: 32, offset: 288)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !436, file: !343, line: 136, baseType: !346, size: 64, offset: 320)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !436, file: !343, line: 137, baseType: !82, size: 64, offset: 384)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !436, file: !343, line: 143, baseType: !361, size: 64, offset: 448)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !436, file: !343, line: 144, baseType: !450, size: 64, offset: 512)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !83, line: 180, baseType: !84)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !436, file: !343, line: 152, baseType: !365, size: 128, offset: 576)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !436, file: !343, line: 153, baseType: !365, size: 128, offset: 704)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !436, file: !343, line: 154, baseType: !365, size: 128, offset: 832)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !436, file: !343, line: 164, baseType: !375, size: 192, offset: 960)
!455 = !{!456, !457}
!456 = !DILocalVariable(name: "__path", arg: 1, scope: !432, file: !338, line: 502, type: !20)
!457 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !432, file: !338, line: 502, type: !435)
!458 = !DILocation(line: 0, scope: !432)
!459 = !DILocation(line: 504, column: 10, scope: !432)
!460 = !DILocation(line: 504, column: 3, scope: !432)
!461 = distinct !DISubprogram(name: "lstat64", scope: !338, file: !338, line: 509, type: !433, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !462)
!462 = !{!463, !464}
!463 = !DILocalVariable(name: "__path", arg: 1, scope: !461, file: !338, line: 509, type: !20)
!464 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !461, file: !338, line: 509, type: !435)
!465 = !DILocation(line: 0, scope: !461)
!466 = !DILocation(line: 511, column: 10, scope: !461)
!467 = !DILocation(line: 511, column: 3, scope: !461)
!468 = distinct !DISubprogram(name: "fstat64", scope: !338, file: !338, line: 516, type: !469, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !471)
!469 = !DISubroutineType(types: !470)
!470 = !{!15, !15, !435}
!471 = !{!472, !473}
!472 = !DILocalVariable(name: "__fd", arg: 1, scope: !468, file: !338, line: 516, type: !15)
!473 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !468, file: !338, line: 516, type: !435)
!474 = !DILocation(line: 0, scope: !468)
!475 = !DILocation(line: 518, column: 10, scope: !468)
!476 = !DILocation(line: 518, column: 3, scope: !468)
!477 = distinct !DISubprogram(name: "fstatat64", scope: !338, file: !338, line: 523, type: !478, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !480)
!478 = !DISubroutineType(types: !479)
!479 = !{!15, !15, !20, !435, !15}
!480 = !{!481, !482, !483, !484}
!481 = !DILocalVariable(name: "__fd", arg: 1, scope: !477, file: !338, line: 523, type: !15)
!482 = !DILocalVariable(name: "__filename", arg: 2, scope: !477, file: !338, line: 523, type: !20)
!483 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !477, file: !338, line: 523, type: !435)
!484 = !DILocalVariable(name: "__flag", arg: 4, scope: !477, file: !338, line: 523, type: !15)
!485 = !DILocation(line: 0, scope: !477)
!486 = !DILocation(line: 526, column: 10, scope: !477)
!487 = !DILocation(line: 526, column: 3, scope: !477)
!488 = distinct !DISubprogram(name: "find_opt", scope: !1, file: !1, line: 51, type: !489, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !491)
!489 = !DISubroutineType(types: !490)
!490 = !{!107, !20, !15}
!491 = !{!492, !493, !494, !495, !496, !497, !498, !499, !500}
!492 = !DILocalVariable(name: "input", arg: 1, scope: !488, file: !1, line: 51, type: !20)
!493 = !DILocalVariable(name: "lang_mask", arg: 2, scope: !488, file: !1, line: 51, type: !15)
!494 = !DILocalVariable(name: "mn", scope: !488, file: !1, line: 53, type: !107)
!495 = !DILocalVariable(name: "mx", scope: !488, file: !1, line: 53, type: !107)
!496 = !DILocalVariable(name: "md", scope: !488, file: !1, line: 53, type: !107)
!497 = !DILocalVariable(name: "opt_len", scope: !488, file: !1, line: 53, type: !107)
!498 = !DILocalVariable(name: "match_wrong_lang", scope: !488, file: !1, line: 54, type: !107)
!499 = !DILocalVariable(name: "comp", scope: !488, file: !1, line: 55, type: !15)
!500 = !DILocalVariable(name: "opt", scope: !501, file: !1, line: 83, type: !502)
!501 = distinct !DILexicalBlock(scope: !488, file: !1, line: 82, column: 5)
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !504)
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_option", file: !4, line: 43, size: 384, elements: !505)
!505 = !{!506, !507, !508, !509, !510, !511, !512, !513, !514}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "opt_text", scope: !504, file: !4, line: 45, baseType: !20, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !504, file: !4, line: 46, baseType: !20, size: 64, offset: 64)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "back_chain", scope: !504, file: !4, line: 47, baseType: !86, size: 16, offset: 128)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "opt_len", scope: !504, file: !4, line: 48, baseType: !14, size: 8, offset: 144)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "neg_index", scope: !504, file: !4, line: 49, baseType: !15, size: 32, offset: 160)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !504, file: !4, line: 50, baseType: !5, size: 32, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var", scope: !504, file: !4, line: 51, baseType: !19, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "var_type", scope: !504, file: !4, line: 52, baseType: !3, size: 32, offset: 320)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "var_value", scope: !504, file: !4, line: 53, baseType: !15, size: 32, offset: 352)
!515 = !DILocation(line: 0, scope: !488)
!516 = !DILocation(line: 58, column: 8, scope: !488)
!517 = !DILocation(line: 62, column: 3, scope: !488)
!518 = !DILocation(line: 57, column: 6, scope: !488)
!519 = !DILocation(line: 62, column: 13, scope: !488)
!520 = !DILocation(line: 62, column: 18, scope: !488)
!521 = !DILocation(line: 64, column: 16, scope: !522)
!522 = distinct !DILexicalBlock(scope: !488, file: !1, line: 63, column: 5)
!523 = !DILocation(line: 64, column: 22, scope: !522)
!524 = !DILocation(line: 65, column: 32, scope: !522)
!525 = !DILocation(line: 65, column: 17, scope: !522)
!526 = !DILocation(line: 66, column: 45, scope: !522)
!527 = !DILocation(line: 66, column: 54, scope: !522)
!528 = !DILocation(line: 66, column: 14, scope: !522)
!529 = !DILocation(line: 68, column: 16, scope: !530)
!530 = distinct !DILexicalBlock(scope: !522, file: !1, line: 68, column: 11)
!531 = distinct !{!531, !517, !532}
!532 = !DILocation(line: 72, column: 5, scope: !488)
!533 = !DILocation(line: 81, column: 3, scope: !488)
!534 = !DILocation(line: 76, column: 20, scope: !488)
!535 = !DILocation(line: 87, column: 33, scope: !536)
!536 = distinct !DILexicalBlock(scope: !501, file: !1, line: 87, column: 11)
!537 = !DILocation(line: 87, column: 42, scope: !536)
!538 = !DILocation(line: 87, column: 52, scope: !536)
!539 = !DILocation(line: 87, column: 47, scope: !536)
!540 = !DILocation(line: 87, column: 12, scope: !536)
!541 = !DILocation(line: 88, column: 4, scope: !536)
!542 = !DILocation(line: 88, column: 8, scope: !536)
!543 = !DILocation(line: 88, column: 28, scope: !536)
!544 = !DILocation(line: 88, column: 36, scope: !536)
!545 = !DILocation(line: 0, scope: !546)
!546 = distinct !DILexicalBlock(scope: !547, file: !1, line: 91, column: 8)
!547 = distinct !DILexicalBlock(scope: !536, file: !1, line: 89, column: 2)
!548 = !DILocation(line: 91, column: 13, scope: !546)
!549 = !DILocation(line: 88, column: 45, scope: !536)
!550 = !DILocation(line: 88, column: 51, scope: !536)
!551 = !DILocation(line: 87, column: 11, scope: !501)
!552 = !DILocation(line: 91, column: 19, scope: !546)
!553 = !DILocation(line: 91, column: 8, scope: !547)
!554 = !DILocation(line: 96, column: 25, scope: !555)
!555 = distinct !DILexicalBlock(scope: !547, file: !1, line: 96, column: 8)
!556 = !DILocation(line: 96, column: 8, scope: !547)
!557 = !DILocation(line: 98, column: 2, scope: !547)
!558 = !DILocation(line: 102, column: 17, scope: !501)
!559 = !DILocation(line: 102, column: 12, scope: !501)
!560 = !DILocation(line: 103, column: 5, scope: !488)
!561 = !DILocation(line: 104, column: 13, scope: !488)
!562 = !DILocation(line: 103, column: 5, scope: !501)
!563 = distinct !{!563, !533, !564}
!564 = !DILocation(line: 104, column: 32, scope: !488)
!565 = !DILocation(line: 108, column: 1, scope: !488)
!566 = distinct !DISubprogram(name: "prune_options", scope: !1, file: !1, line: 131, type: !567, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !570)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !22, !569}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!570 = !{!571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !585, !586, !589, !590, !594, !595, !598, !601, !604}
!571 = !DILocalVariable(name: "argcp", arg: 1, scope: !566, file: !1, line: 131, type: !22)
!572 = !DILocalVariable(name: "argvp", arg: 2, scope: !566, file: !1, line: 131, type: !569)
!573 = !DILocalVariable(name: "argc", scope: !566, file: !1, line: 133, type: !15)
!574 = !DILocalVariable(name: "options", scope: !566, file: !1, line: 134, type: !22)
!575 = !DILocalVariable(name: "argv", scope: !566, file: !1, line: 135, type: !16)
!576 = !DILocalVariable(name: "i", scope: !566, file: !1, line: 136, type: !15)
