; ModuleID = 'opts.bc'
source_filename = "opts.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!1262 = !DIEnumerator(name: "OPT_msseregparm", value: 817, isUnsigned: true)
!1263 = !DIEnumerator(name: "OPT_mssse3", value: 818, isUnsigned: true)
!1264 = !DIEnumerator(name: "OPT_mstack_arg_probe", value: 819, isUnsigned: true)
!1265 = !DIEnumerator(name: "OPT_mstackrealign", value: 820, isUnsigned: true)
!1266 = !DIEnumerator(name: "OPT_mstringop_strategy_", value: 821, isUnsigned: true)
!1267 = !DIEnumerator(name: "OPT_mtls_dialect_", value: 822, isUnsigned: true)
!1268 = !DIEnumerator(name: "OPT_mtls_direct_seg_refs", value: 823, isUnsigned: true)
!1269 = !DIEnumerator(name: "OPT_mtune_", value: 824, isUnsigned: true)
!1270 = !DIEnumerator(name: "OPT_muclibc", value: 825, isUnsigned: true)
!1271 = !DIEnumerator(name: "OPT_mveclibabi_", value: 826, isUnsigned: true)
!1272 = !DIEnumerator(name: "OPT_mxop", value: 827, isUnsigned: true)
!1273 = !DIEnumerator(name: "OPT_nocpp", value: 828, isUnsigned: true)
!1274 = !DIEnumerator(name: "OPT_nostdinc", value: 829, isUnsigned: true)
!1275 = !DIEnumerator(name: "OPT_nostdinc__", value: 830, isUnsigned: true)
!1276 = !DIEnumerator(name: "OPT_nostdlib", value: 831, isUnsigned: true)
!1277 = !DIEnumerator(name: "OPT_o", value: 832, isUnsigned: true)
!1278 = !DIEnumerator(name: "OPT_p", value: 833, isUnsigned: true)
!1279 = !DIEnumerator(name: "OPT_pedantic", value: 834, isUnsigned: true)
!1280 = !DIEnumerator(name: "OPT_pedantic_errors", value: 835, isUnsigned: true)
!1281 = !DIEnumerator(name: "OPT_pie", value: 836, isUnsigned: true)
!1282 = !DIEnumerator(name: "OPT_print_objc_runtime_info", value: 837, isUnsigned: true)
!1283 = !DIEnumerator(name: "OPT_print_pch_checksum", value: 838, isUnsigned: true)
!1284 = !DIEnumerator(name: "OPT_quiet", value: 839, isUnsigned: true)
!1285 = !DIEnumerator(name: "OPT_remap", value: 840, isUnsigned: true)
!1286 = !DIEnumerator(name: "OPT_shared", value: 841, isUnsigned: true)
!1287 = !DIEnumerator(name: "OPT_static_libgfortran", value: 842, isUnsigned: true)
!1288 = !DIEnumerator(name: "OPT_std_c__0x", value: 843, isUnsigned: true)
!1289 = !DIEnumerator(name: "OPT_std_c__98", value: 844, isUnsigned: true)
!1290 = !DIEnumerator(name: "OPT_std_c89", value: 845, isUnsigned: true)
!1291 = !DIEnumerator(name: "OPT_std_c90", value: 846, isUnsigned: true)
!1292 = !DIEnumerator(name: "OPT_std_c99", value: 847, isUnsigned: true)
!1293 = !DIEnumerator(name: "OPT_std_c9x", value: 848, isUnsigned: true)
!1294 = !DIEnumerator(name: "OPT_std_f2003", value: 849, isUnsigned: true)
!1295 = !DIEnumerator(name: "OPT_std_f2008", value: 850, isUnsigned: true)
!1296 = !DIEnumerator(name: "OPT_std_f95", value: 851, isUnsigned: true)
!1297 = !DIEnumerator(name: "OPT_std_gnu", value: 852, isUnsigned: true)
!1298 = !DIEnumerator(name: "OPT_std_gnu__0x", value: 853, isUnsigned: true)
!1299 = !DIEnumerator(name: "OPT_std_gnu__98", value: 854, isUnsigned: true)
!1300 = !DIEnumerator(name: "OPT_std_gnu89", value: 855, isUnsigned: true)
!1301 = !DIEnumerator(name: "OPT_std_gnu90", value: 856, isUnsigned: true)
!1302 = !DIEnumerator(name: "OPT_std_gnu99", value: 857, isUnsigned: true)
!1303 = !DIEnumerator(name: "OPT_std_gnu9x", value: 858, isUnsigned: true)
!1304 = !DIEnumerator(name: "OPT_std_iso9899_1990", value: 859, isUnsigned: true)
!1305 = !DIEnumerator(name: "OPT_std_iso9899_199409", value: 860, isUnsigned: true)
!1306 = !DIEnumerator(name: "OPT_std_iso9899_1999", value: 861, isUnsigned: true)
!1307 = !DIEnumerator(name: "OPT_std_iso9899_199x", value: 862, isUnsigned: true)
!1308 = !DIEnumerator(name: "OPT_std_legacy", value: 863, isUnsigned: true)
!1309 = !DIEnumerator(name: "OPT_traditional_cpp", value: 864, isUnsigned: true)
!1310 = !DIEnumerator(name: "OPT_trigraphs", value: 865, isUnsigned: true)
!1311 = !DIEnumerator(name: "OPT_undef", value: 866, isUnsigned: true)
!1312 = !DIEnumerator(name: "OPT_v", value: 867, isUnsigned: true)
!1313 = !DIEnumerator(name: "OPT_version", value: 868, isUnsigned: true)
!1314 = !DIEnumerator(name: "OPT_w", value: 869, isUnsigned: true)
!1315 = !DIEnumerator(name: "N_OPTS", value: 870, isUnsigned: true)
!1316 = !{!1317, !1318, !1319, !1320, !1323, !1324, !7, !1321, !1326, !1327, !1328, !1329, !1344, !442, !1345, !2705, !16}
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1319 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1322)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1324, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_p", file: !3, line: 354, baseType: !1321)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_const_char_p_heap", file: !3, line: 363, baseType: !1331)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_const_char_p_heap", file: !3, line: 363, size: 128, elements: !1332)
!1332 = !{!1333}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1331, file: !3, line: 363, baseType: !1334, size: 128)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_const_char_p_base", file: !3, line: 362, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_const_char_p_base", file: !3, line: 362, size: 128, elements: !1336)
!1336 = !{!1337, !1338, !1339}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1335, file: !3, line: 362, baseType: !7, size: 32)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1335, file: !3, line: 362, baseType: !7, size: 32, offset: 32)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1335, file: !3, line: 362, baseType: !1340, size: 64, offset: 64)
!1340 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1341, size: 64, elements: !1342)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_char_p", file: !3, line: 361, baseType: !1324)
!1342 = !{!1343}
!1343 = !DISubrange(count: 1)
!1344 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1345 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1346, line: 50, baseType: !1347)
!1346 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1349, line: 240, size: 384, elements: !1350)
!1349 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1350 = !{!1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1348, file: !1349, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1348, file: !1349, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1348, file: !1349, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1348, file: !1349, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1348, file: !1349, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1348, file: !1349, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1348, file: !1349, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1348, file: !1349, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1348, file: !1349, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1348, file: !1349, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1348, file: !1349, line: 321, baseType: !1362, size: 320, offset: 64)
!1362 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1349, line: 315, size: 320, elements: !1363)
!1363 = !{!1364, !2640, !2642, !2703, !2704}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1362, file: !1349, line: 316, baseType: !1365, size: 64)
!1365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1366, size: 64, elements: !1342)
!1366 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1349, line: 183, baseType: !1367)
!1367 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1349, line: 166, size: 64, elements: !1368)
!1368 = !{!1369, !1370, !1371, !1372, !1373, !1381, !1382, !1394, !1397, !1459, !2618, !2619, !2630, !2637}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1367, file: !1349, line: 168, baseType: !1319, size: 32)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1367, file: !1349, line: 169, baseType: !7, size: 32)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1367, file: !1349, line: 170, baseType: !1324, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1367, file: !1349, line: 171, baseType: !1345, size: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1367, file: !1349, line: 172, baseType: !1374, size: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1346, line: 53, baseType: !1375)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1349, line: 359, size: 128, elements: !1377)
!1377 = !{!1378, !1379}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1376, file: !1349, line: 360, baseType: !1319, size: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1376, file: !1349, line: 361, baseType: !1380, size: 64, offset: 64)
!1380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1345, size: 64, elements: !1342)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1367, file: !1349, line: 173, baseType: !34, size: 32)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1367, file: !1349, line: 174, baseType: !1383, size: 32)
!1383 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1349, line: 133, baseType: !1384)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1349, line: 115, size: 32, elements: !1385)
!1385 = !{!1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1384, file: !1349, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1384, file: !1349, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1384, file: !1349, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1384, file: !1349, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1384, file: !1349, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1384, file: !1349, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1384, file: !1349, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1384, file: !1349, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1367, file: !1349, line: 175, baseType: !1395, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1396, size: 64)
!1396 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1349, line: 175, flags: DIFlagFwdDecl)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1367, file: !1349, line: 176, baseType: !1398, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1400, line: 75, size: 256, elements: !1401)
!1400 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1401 = !{!1402, !1417, !1418, !1419}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1399, file: !1400, line: 76, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1400, line: 68, baseType: !1405)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1400, line: 63, size: 320, elements: !1406)
!1406 = !{!1407, !1409, !1410, !1411}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1405, file: !1400, line: 64, baseType: !1408, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1405, file: !1400, line: 65, baseType: !1408, size: 64, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1405, file: !1400, line: 66, baseType: !7, size: 32, offset: 128)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1405, file: !1400, line: 67, baseType: !1412, size: 128, offset: 192)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1413, size: 128, elements: !1415)
!1413 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1400, line: 29, baseType: !1414)
!1414 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1415 = !{!1416}
!1416 = !DISubrange(count: 2)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1399, file: !1400, line: 77, baseType: !1403, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1399, file: !1400, line: 78, baseType: !7, size: 32, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1399, file: !1400, line: 79, baseType: !1420, size: 64, offset: 192)
!1420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1421, size: 64)
!1421 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1400, line: 49, baseType: !1422)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1400, line: 45, size: 832, elements: !1423)
!1423 = !{!1424, !1425, !1426}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1422, file: !1400, line: 46, baseType: !1408, size: 64)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1422, file: !1400, line: 47, baseType: !1398, size: 64, offset: 64)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1422, file: !1400, line: 48, baseType: !1427, size: 704, offset: 128)
!1427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1428, line: 164, size: 704, elements: !1429)
!1428 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1429 = !{!1430, !1432, !1442, !1443, !1444, !1445, !1446, !1447, !1451, !1455, !1456, !1457, !1458}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1427, file: !1428, line: 166, baseType: !1431, size: 64)
!1431 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1427, file: !1428, line: 167, baseType: !1433, size: 64, offset: 64)
!1433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1434, size: 64)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1428, line: 157, size: 192, elements: !1435)
!1435 = !{!1436, !1437, !1438}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1434, file: !1428, line: 159, baseType: !1321, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1434, file: !1428, line: 160, baseType: !1433, size: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1434, file: !1428, line: 161, baseType: !1439, size: 32, offset: 128)
!1439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1322, size: 32, elements: !1440)
!1440 = !{!1441}
!1441 = !DISubrange(count: 4)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1427, file: !1428, line: 168, baseType: !1321, size: 64, offset: 128)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1427, file: !1428, line: 169, baseType: !1321, size: 64, offset: 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1427, file: !1428, line: 170, baseType: !1321, size: 64, offset: 256)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1427, file: !1428, line: 171, baseType: !1431, size: 64, offset: 320)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1427, file: !1428, line: 172, baseType: !1319, size: 32, offset: 384)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1427, file: !1428, line: 176, baseType: !1448, size: 64, offset: 448)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1449 = !DISubroutineType(types: !1450)
!1450 = !{!1433, !1323, !1431}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1427, file: !1428, line: 177, baseType: !1452, size: 64, offset: 512)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = !DISubroutineType(types: !1454)
!1454 = !{null, !1323, !1433}
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1427, file: !1428, line: 178, baseType: !1323, size: 64, offset: 576)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1427, file: !1428, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1427, file: !1428, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1427, file: !1428, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1367, file: !1349, line: 177, baseType: !1460, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1346, line: 56, baseType: !1461)
!1461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1462, size: 64)
!1462 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !163, line: 3371, size: 1792, elements: !1463)
!1463 = !{!1464, !1497, !1503, !1514, !1533, !1544, !1549, !1556, !1562, !1575, !1587, !1625, !1630, !1658, !1666, !1667, !1672, !1681, !1687, !1692, !1696, !1700, !2270, !2319, !2325, !2331, !2338, !2349, !2363, !2380, !2392, !2414, !2429, !2600}
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1462, file: !163, line: 3372, baseType: !1465, size: 64)
!1465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !163, line: 360, size: 64, elements: !1466)
!1466 = !{!1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496}
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1465, file: !163, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1465, file: !163, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1465, file: !163, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1465, file: !163, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1465, file: !163, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1465, file: !163, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1465, file: !163, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1465, file: !163, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1465, file: !163, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1465, file: !163, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1465, file: !163, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1465, file: !163, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1465, file: !163, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1465, file: !163, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1465, file: !163, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1465, file: !163, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1465, file: !163, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1465, file: !163, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1465, file: !163, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1465, file: !163, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1465, file: !163, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1465, file: !163, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1465, file: !163, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1465, file: !163, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1465, file: !163, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1465, file: !163, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1465, file: !163, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1465, file: !163, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1465, file: !163, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1465, file: !163, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1462, file: !163, line: 3373, baseType: !1498, size: 192)
!1498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !163, line: 402, size: 192, elements: !1499)
!1499 = !{!1500, !1501, !1502}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1498, file: !163, line: 403, baseType: !1465, size: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1498, file: !163, line: 404, baseType: !1460, size: 64, offset: 64)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1498, file: !163, line: 405, baseType: !1460, size: 64, offset: 128)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1462, file: !163, line: 3374, baseType: !1504, size: 320)
!1504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !163, line: 1384, size: 320, elements: !1505)
!1505 = !{!1506, !1507}
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1504, file: !163, line: 1385, baseType: !1498, size: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1504, file: !163, line: 1386, baseType: !1508, size: 128, offset: 192)
!1508 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1509, line: 58, baseType: !1510)
!1509 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1509, line: 54, size: 128, elements: !1511)
!1511 = !{!1512, !1513}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1510, file: !1509, line: 56, baseType: !1414, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1510, file: !1509, line: 57, baseType: !1431, size: 64, offset: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1462, file: !163, line: 3375, baseType: !1515, size: 256)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !163, line: 1397, size: 256, elements: !1516)
!1516 = !{!1517, !1518}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1515, file: !163, line: 1398, baseType: !1498, size: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1515, file: !163, line: 1399, baseType: !1519, size: 64, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1521, line: 52, size: 256, elements: !1522)
!1521 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1522 = !{!1523, !1524, !1525, !1526, !1527, !1528, !1529}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1520, file: !1521, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1520, file: !1521, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1520, file: !1521, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1520, file: !1521, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1520, file: !1521, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1520, file: !1521, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1520, file: !1521, line: 62, baseType: !1530, size: 192, offset: 64)
!1530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1414, size: 192, elements: !1531)
!1531 = !{!1532}
!1532 = !DISubrange(count: 3)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1462, file: !163, line: 3376, baseType: !1534, size: 256)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !163, line: 1408, size: 256, elements: !1535)
!1535 = !{!1536, !1537}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1534, file: !163, line: 1409, baseType: !1498, size: 192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1534, file: !163, line: 1410, baseType: !1538, size: 64, offset: 192)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1540, line: 27, size: 192, elements: !1541)
!1540 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1541 = !{!1542, !1543}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1539, file: !1540, line: 29, baseType: !1508, size: 128)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1539, file: !1540, line: 30, baseType: !34, size: 32, offset: 128)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1462, file: !163, line: 3377, baseType: !1545, size: 256)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !163, line: 1437, size: 256, elements: !1546)
!1546 = !{!1547, !1548}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1545, file: !163, line: 1438, baseType: !1498, size: 192)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1545, file: !163, line: 1439, baseType: !1460, size: 64, offset: 192)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1462, file: !163, line: 3378, baseType: !1550, size: 256)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !163, line: 1418, size: 256, elements: !1551)
!1551 = !{!1552, !1553, !1554}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1550, file: !163, line: 1419, baseType: !1498, size: 192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1550, file: !163, line: 1420, baseType: !1319, size: 32, offset: 192)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1550, file: !163, line: 1421, baseType: !1555, size: 8, offset: 224)
!1555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1322, size: 8, elements: !1342)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1462, file: !163, line: 3379, baseType: !1557, size: 320)
!1557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !163, line: 1428, size: 320, elements: !1558)
!1558 = !{!1559, !1560, !1561}
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1557, file: !163, line: 1429, baseType: !1498, size: 192)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1557, file: !163, line: 1430, baseType: !1460, size: 64, offset: 192)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1557, file: !163, line: 1431, baseType: !1460, size: 64, offset: 256)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1462, file: !163, line: 3380, baseType: !1563, size: 320)
!1563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !163, line: 1460, size: 320, elements: !1564)
!1564 = !{!1565, !1566}
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1563, file: !163, line: 1461, baseType: !1498, size: 192)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1563, file: !163, line: 1462, baseType: !1567, size: 128, offset: 192)
!1567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1568, line: 31, size: 128, elements: !1569)
!1568 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1569 = !{!1570, !1573, !1574}
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1567, file: !1568, line: 32, baseType: !1571, size: 64)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1318)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1567, file: !1568, line: 33, baseType: !7, size: 32, offset: 64)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1567, file: !1568, line: 34, baseType: !7, size: 32, offset: 96)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1462, file: !163, line: 3381, baseType: !1576, size: 384)
!1576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !163, line: 2507, size: 384, elements: !1577)
!1577 = !{!1578, !1579, !1584, !1585, !1586}
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1576, file: !163, line: 2508, baseType: !1498, size: 192)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1576, file: !163, line: 2509, baseType: !1580, size: 32, offset: 192)
!1580 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1581, line: 58, baseType: !1582)
!1581 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1583, line: 44, baseType: !7)
!1583 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1576, file: !163, line: 2510, baseType: !7, size: 32, offset: 224)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1576, file: !163, line: 2511, baseType: !1460, size: 64, offset: 256)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1576, file: !163, line: 2512, baseType: !1460, size: 64, offset: 320)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1462, file: !163, line: 3382, baseType: !1588, size: 896)
!1588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !163, line: 2652, size: 896, elements: !1589)
!1589 = !{!1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622}
!1590 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1588, file: !163, line: 2653, baseType: !1576, size: 384)
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1588, file: !163, line: 2654, baseType: !1460, size: 64, offset: 384)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1588, file: !163, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1588, file: !163, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1588, file: !163, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1588, file: !163, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1588, file: !163, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1588, file: !163, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1588, file: !163, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1588, file: !163, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1588, file: !163, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1588, file: !163, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1588, file: !163, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1588, file: !163, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1588, file: !163, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1588, file: !163, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1588, file: !163, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1588, file: !163, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1588, file: !163, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1588, file: !163, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1588, file: !163, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1588, file: !163, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1588, file: !163, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1588, file: !163, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1588, file: !163, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1588, file: !163, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1588, file: !163, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1588, file: !163, line: 2703, baseType: !7, size: 32, offset: 512)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1588, file: !163, line: 2705, baseType: !1460, size: 64, offset: 576)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1588, file: !163, line: 2706, baseType: !1460, size: 64, offset: 640)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1588, file: !163, line: 2707, baseType: !1460, size: 64, offset: 704)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1588, file: !163, line: 2708, baseType: !1460, size: 64, offset: 768)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1588, file: !163, line: 2711, baseType: !1623, size: 64, offset: 832)
!1623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1624, size: 64)
!1624 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !163, line: 2711, flags: DIFlagFwdDecl)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1462, file: !163, line: 3383, baseType: !1626, size: 960)
!1626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !163, line: 2756, size: 960, elements: !1627)
!1627 = !{!1628, !1629}
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1626, file: !163, line: 2757, baseType: !1588, size: 896)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1626, file: !163, line: 2758, baseType: !1345, size: 64, offset: 896)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1462, file: !163, line: 3384, baseType: !1631, size: 1472)
!1631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !163, line: 3114, size: 1472, elements: !1632)
!1632 = !{!1633, !1654, !1655, !1656, !1657}
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1631, file: !163, line: 3115, baseType: !1634, size: 1216)
!1634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !163, line: 2984, size: 1216, elements: !1635)
!1635 = !{!1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653}
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1634, file: !163, line: 2985, baseType: !1626, size: 960)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1634, file: !163, line: 2986, baseType: !1460, size: 64, offset: 960)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1634, file: !163, line: 2987, baseType: !1460, size: 64, offset: 1024)
!1639 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1634, file: !163, line: 2988, baseType: !1460, size: 64, offset: 1088)
!1640 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1634, file: !163, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1634, file: !163, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1634, file: !163, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1634, file: !163, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1634, file: !163, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1634, file: !163, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1634, file: !163, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1634, file: !163, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1634, file: !163, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1634, file: !163, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1634, file: !163, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1634, file: !163, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1634, file: !163, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1634, file: !163, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1631, file: !163, line: 3117, baseType: !1460, size: 64, offset: 1216)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1631, file: !163, line: 3119, baseType: !1460, size: 64, offset: 1280)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1631, file: !163, line: 3121, baseType: !1460, size: 64, offset: 1344)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1631, file: !163, line: 3123, baseType: !1460, size: 64, offset: 1408)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1462, file: !163, line: 3385, baseType: !1659, size: 1088)
!1659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !163, line: 2874, size: 1088, elements: !1660)
!1660 = !{!1661, !1662, !1663}
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1659, file: !163, line: 2875, baseType: !1626, size: 960)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1659, file: !163, line: 2876, baseType: !1345, size: 64, offset: 960)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1659, file: !163, line: 2877, baseType: !1664, size: 64, offset: 1024)
!1664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1665, size: 64)
!1665 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !163, line: 2856, flags: DIFlagFwdDecl)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1462, file: !163, line: 3386, baseType: !1634, size: 1216)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1462, file: !163, line: 3387, baseType: !1668, size: 1280)
!1668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !163, line: 3093, size: 1280, elements: !1669)
!1669 = !{!1670, !1671}
!1670 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1668, file: !163, line: 3094, baseType: !1634, size: 1216)
!1671 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1668, file: !163, line: 3095, baseType: !1664, size: 64, offset: 1216)
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1462, file: !163, line: 3388, baseType: !1673, size: 1216)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !163, line: 2824, size: 1216, elements: !1674)
!1674 = !{!1675, !1676, !1677, !1678, !1679, !1680}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1673, file: !163, line: 2825, baseType: !1588, size: 896)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1673, file: !163, line: 2827, baseType: !1460, size: 64, offset: 896)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1673, file: !163, line: 2828, baseType: !1460, size: 64, offset: 960)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1673, file: !163, line: 2829, baseType: !1460, size: 64, offset: 1024)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1673, file: !163, line: 2830, baseType: !1460, size: 64, offset: 1088)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1673, file: !163, line: 2831, baseType: !1460, size: 64, offset: 1152)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1462, file: !163, line: 3389, baseType: !1682, size: 1024)
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !163, line: 2850, size: 1024, elements: !1683)
!1683 = !{!1684, !1685, !1686}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1682, file: !163, line: 2851, baseType: !1626, size: 960)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1682, file: !163, line: 2852, baseType: !1319, size: 32, offset: 960)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1682, file: !163, line: 2853, baseType: !1319, size: 32, offset: 992)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1462, file: !163, line: 3390, baseType: !1688, size: 1024)
!1688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !163, line: 2857, size: 1024, elements: !1689)
!1689 = !{!1690, !1691}
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1688, file: !163, line: 2858, baseType: !1626, size: 960)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1688, file: !163, line: 2859, baseType: !1664, size: 64, offset: 960)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1462, file: !163, line: 3391, baseType: !1693, size: 960)
!1693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !163, line: 2862, size: 960, elements: !1694)
!1694 = !{!1695}
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1693, file: !163, line: 2863, baseType: !1626, size: 960)
!1696 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1462, file: !163, line: 3392, baseType: !1697, size: 1472)
!1697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !163, line: 3304, size: 1472, elements: !1698)
!1698 = !{!1699}
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1697, file: !163, line: 3305, baseType: !1631, size: 1472)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1462, file: !163, line: 3393, baseType: !1701, size: 1792)
!1701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !163, line: 3248, size: 1792, elements: !1702)
!1702 = !{!1703, !1704, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269}
!1703 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1701, file: !163, line: 3249, baseType: !1631, size: 1472)
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1701, file: !163, line: 3251, baseType: !1705, size: 64, offset: 1472)
!1705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1706, size: 64)
!1706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1707, line: 463, size: 1152, elements: !1708)
!1707 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1708 = !{!1709, !1873, !2186, !2187, !2190, !2193, !2194, !2195, !2196, !2197, !2198, !2222, !2225, !2226, !2227, !2228, !2229, !2230, !2231, !2232, !2233, !2234, !2235, !2236, !2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247, !2248}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1706, file: !1707, line: 464, baseType: !1710, size: 64)
!1710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1711, size: 64)
!1711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !358, line: 194, size: 384, elements: !1712)
!1712 = !{!1713, !1762, !1775, !1789, !1841, !1854}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1711, file: !358, line: 197, baseType: !1714, size: 64)
!1714 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !358, line: 182, baseType: !1715)
!1715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1716, size: 64)
!1716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !358, line: 116, size: 704, elements: !1717)
!1717 = !{!1718, !1719, !1720, !1721, !1722, !1723, !1750, !1759, !1760, !1761}
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1716, file: !358, line: 119, baseType: !1715, size: 64)
!1719 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1716, file: !358, line: 122, baseType: !1715, size: 64, offset: 64)
!1720 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1716, file: !358, line: 123, baseType: !1715, size: 64, offset: 128)
!1721 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1716, file: !358, line: 126, baseType: !1319, size: 32, offset: 192)
!1722 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1716, file: !358, line: 129, baseType: !357, size: 32, offset: 224)
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1716, file: !358, line: 165, baseType: !1724, size: 192, offset: 256)
!1724 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !358, line: 132, size: 192, elements: !1725)
!1725 = !{!1726, !1739, !1745}
!1726 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1724, file: !358, line: 137, baseType: !1727, size: 128)
!1727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !358, line: 133, size: 128, elements: !1728)
!1728 = !{!1729, !1738}
!1729 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1727, file: !358, line: 135, baseType: !1730, size: 64)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64)
!1731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !358, line: 93, size: 320, elements: !1732)
!1732 = !{!1733, !1734, !1735, !1736, !1737}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1731, file: !358, line: 96, baseType: !1730, size: 64)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1731, file: !358, line: 97, baseType: !1730, size: 64, offset: 64)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1731, file: !358, line: 101, baseType: !1460, size: 64, offset: 128)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1731, file: !358, line: 106, baseType: !1460, size: 64, offset: 192)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1731, file: !358, line: 111, baseType: !1460, size: 64, offset: 256)
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1727, file: !358, line: 136, baseType: !1730, size: 64, offset: 64)
!1739 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1724, file: !358, line: 151, baseType: !1740, size: 192)
!1740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !358, line: 139, size: 192, elements: !1741)
!1741 = !{!1742, !1743, !1744}
!1742 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1740, file: !358, line: 141, baseType: !1460, size: 64)
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1740, file: !358, line: 145, baseType: !1460, size: 64, offset: 64)
!1744 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1740, file: !358, line: 150, baseType: !1319, size: 32, offset: 128)
!1745 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1724, file: !358, line: 164, baseType: !1746, size: 128)
!1746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !358, line: 153, size: 128, elements: !1747)
!1747 = !{!1748, !1749}
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1746, file: !358, line: 161, baseType: !1460, size: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1746, file: !358, line: 163, baseType: !1580, size: 32, offset: 64)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1716, file: !358, line: 168, baseType: !1751, size: 64, offset: 448)
!1751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1752, size: 64)
!1752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !358, line: 67, size: 320, elements: !1753)
!1753 = !{!1754, !1755, !1756, !1757, !1758}
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1752, file: !358, line: 70, baseType: !1751, size: 64)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1752, file: !358, line: 73, baseType: !1715, size: 64, offset: 64)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1752, file: !358, line: 78, baseType: !1460, size: 64, offset: 128)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1752, file: !358, line: 85, baseType: !1345, size: 64, offset: 192)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1752, file: !358, line: 88, baseType: !1319, size: 32, offset: 256)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1716, file: !358, line: 173, baseType: !1345, size: 64, offset: 512)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1716, file: !358, line: 173, baseType: !1345, size: 64, offset: 576)
!1761 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1716, file: !358, line: 177, baseType: !1318, size: 8, offset: 640)
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1711, file: !358, line: 200, baseType: !1763, size: 64, offset: 64)
!1763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1764, size: 64)
!1764 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !358, line: 185, baseType: !1765)
!1765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !358, line: 185, size: 128, elements: !1766)
!1766 = !{!1767}
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1765, file: !358, line: 185, baseType: !1768, size: 128)
!1768 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !358, line: 184, baseType: !1769)
!1769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !358, line: 184, size: 128, elements: !1770)
!1770 = !{!1771, !1772, !1773}
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1769, file: !358, line: 184, baseType: !7, size: 32)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1769, file: !358, line: 184, baseType: !7, size: 32, offset: 32)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1769, file: !358, line: 184, baseType: !1774, size: 64, offset: 64)
!1774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1714, size: 64, elements: !1342)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1711, file: !358, line: 203, baseType: !1776, size: 64, offset: 128)
!1776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1777, size: 64)
!1777 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !358, line: 189, baseType: !1778)
!1778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !358, line: 189, size: 128, elements: !1779)
!1779 = !{!1780}
!1780 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1778, file: !358, line: 189, baseType: !1781, size: 128)
!1781 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !358, line: 188, baseType: !1782)
!1782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !358, line: 188, size: 128, elements: !1783)
!1783 = !{!1784, !1785, !1786}
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1782, file: !358, line: 188, baseType: !7, size: 32)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1782, file: !358, line: 188, baseType: !7, size: 32, offset: 32)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1782, file: !358, line: 188, baseType: !1787, size: 64, offset: 64)
!1787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1788, size: 64, elements: !1342)
!1788 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !358, line: 180, baseType: !1751)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1711, file: !358, line: 207, baseType: !1790, size: 64, offset: 192)
!1790 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1791, line: 144, baseType: !1792)
!1791 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1793, size: 64)
!1793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1791, line: 100, size: 896, elements: !1794)
!1794 = !{!1795, !1803, !1808, !1813, !1815, !1818, !1819, !1820, !1821, !1822, !1827, !1829, !1830, !1835, !1840}
!1795 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1793, file: !1791, line: 102, baseType: !1796, size: 64)
!1796 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1791, line: 52, baseType: !1797)
!1797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1798, size: 64)
!1798 = !DISubroutineType(types: !1799)
!1799 = !{!1800, !1801}
!1800 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1791, line: 47, baseType: !7)
!1801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1802, size: 64)
!1802 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1793, file: !1791, line: 105, baseType: !1804, size: 64, offset: 64)
!1804 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1791, line: 59, baseType: !1805)
!1805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1806, size: 64)
!1806 = !DISubroutineType(types: !1807)
!1807 = !{!1319, !1801, !1801}
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1793, file: !1791, line: 108, baseType: !1809, size: 64, offset: 128)
!1809 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1791, line: 63, baseType: !1810)
!1810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1811, size: 64)
!1811 = !DISubroutineType(types: !1812)
!1812 = !{null, !1323}
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1793, file: !1791, line: 111, baseType: !1814, size: 64, offset: 192)
!1814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1793, file: !1791, line: 114, baseType: !1816, size: 64, offset: 256)
!1816 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1817, line: 46, baseType: !1414)
!1817 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1818 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1793, file: !1791, line: 117, baseType: !1816, size: 64, offset: 320)
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1793, file: !1791, line: 120, baseType: !1816, size: 64, offset: 384)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1793, file: !1791, line: 124, baseType: !7, size: 32, offset: 448)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1793, file: !1791, line: 128, baseType: !7, size: 32, offset: 480)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1793, file: !1791, line: 131, baseType: !1823, size: 64, offset: 512)
!1823 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1791, line: 75, baseType: !1824)
!1824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1825, size: 64)
!1825 = !DISubroutineType(types: !1826)
!1826 = !{!1323, !1816, !1816}
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1793, file: !1791, line: 132, baseType: !1828, size: 64, offset: 576)
!1828 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1791, line: 78, baseType: !1810)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1793, file: !1791, line: 135, baseType: !1323, size: 64, offset: 640)
!1830 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1793, file: !1791, line: 136, baseType: !1831, size: 64, offset: 704)
!1831 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1791, line: 82, baseType: !1832)
!1832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1833, size: 64)
!1833 = !DISubroutineType(types: !1834)
!1834 = !{!1323, !1323, !1816, !1816}
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1793, file: !1791, line: 137, baseType: !1836, size: 64, offset: 768)
!1836 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1791, line: 83, baseType: !1837)
!1837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1838, size: 64)
!1838 = !DISubroutineType(types: !1839)
!1839 = !{null, !1323, !1323}
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1793, file: !1791, line: 141, baseType: !7, size: 32, offset: 832)
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1711, file: !358, line: 211, baseType: !1842, size: 64, offset: 256)
!1842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1843, size: 64)
!1843 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !163, line: 183, baseType: !1844)
!1844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !163, line: 183, size: 128, elements: !1845)
!1845 = !{!1846}
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1844, file: !163, line: 183, baseType: !1847, size: 128)
!1847 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !163, line: 182, baseType: !1848)
!1848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !163, line: 182, size: 128, elements: !1849)
!1849 = !{!1850, !1851, !1852}
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1848, file: !163, line: 182, baseType: !7, size: 32)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1848, file: !163, line: 182, baseType: !7, size: 32, offset: 32)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1848, file: !163, line: 182, baseType: !1853, size: 64, offset: 64)
!1853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1460, size: 64, elements: !1342)
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1711, file: !358, line: 220, baseType: !1855, size: 64, offset: 320)
!1855 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !358, line: 217, size: 64, elements: !1856)
!1856 = !{!1857, !1858}
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1855, file: !358, line: 218, baseType: !1842, size: 64)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1855, file: !358, line: 219, baseType: !1859, size: 64)
!1859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1860, size: 64)
!1860 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1861, line: 29, baseType: !1862)
!1861 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1861, line: 29, size: 96, elements: !1863)
!1863 = !{!1864}
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1862, file: !1861, line: 29, baseType: !1865, size: 96)
!1865 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1861, line: 27, baseType: !1866)
!1866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1861, line: 27, size: 96, elements: !1867)
!1867 = !{!1868, !1869, !1870}
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1866, file: !1861, line: 27, baseType: !7, size: 32)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1866, file: !1861, line: 27, baseType: !7, size: 32, offset: 32)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1866, file: !1861, line: 27, baseType: !1871, size: 8, offset: 64)
!1871 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1872, size: 8, elements: !1342)
!1872 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1861, line: 26, baseType: !1318)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1706, file: !1707, line: 467, baseType: !1874, size: 64, offset: 64)
!1874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1875, size: 64)
!1875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !365, line: 374, size: 640, elements: !1876)
!1876 = !{!1877, !2161, !2162, !2175, !2176, !2177, !2178, !2179, !2180, !2182, !2184, !2185}
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1875, file: !365, line: 377, baseType: !1878, size: 64)
!1878 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1346, line: 111, baseType: !1879)
!1879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1880, size: 64)
!1880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !365, line: 217, size: 832, elements: !1881)
!1881 = !{!1882, !2126, !2127, !2128, !2131, !2135, !2136, !2137, !2155, !2156, !2157, !2158, !2159, !2160}
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1880, file: !365, line: 219, baseType: !1883, size: 64)
!1883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1884, size: 64)
!1884 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !365, line: 151, baseType: !1885)
!1885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !365, line: 151, size: 128, elements: !1886)
!1886 = !{!1887}
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1885, file: !365, line: 151, baseType: !1888, size: 128)
!1888 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !365, line: 150, baseType: !1889)
!1889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !365, line: 150, size: 128, elements: !1890)
!1890 = !{!1891, !1892, !1893}
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1889, file: !365, line: 150, baseType: !7, size: 32)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1889, file: !365, line: 150, baseType: !7, size: 32, offset: 32)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1889, file: !365, line: 150, baseType: !1894, size: 64, offset: 64)
!1894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1895, size: 64, elements: !1342)
!1895 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1346, line: 108, baseType: !1896)
!1896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1897, size: 64)
!1897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !365, line: 122, size: 512, elements: !1898)
!1898 = !{!1899, !1900, !1901, !2118, !2119, !2120, !2121, !2122, !2123, !2124}
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1897, file: !365, line: 124, baseType: !1879, size: 64)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1897, file: !365, line: 125, baseType: !1879, size: 64, offset: 64)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1897, file: !365, line: 131, baseType: !1902, size: 64, offset: 128)
!1902 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !365, line: 128, size: 64, elements: !1903)
!1903 = !{!1904, !2117}
!1904 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1902, file: !365, line: 129, baseType: !1905, size: 64)
!1905 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1346, line: 66, baseType: !1906)
!1906 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1907, size: 64)
!1907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1908, line: 143, size: 192, elements: !1909)
!1908 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1909 = !{!1910, !2115, !2116}
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1907, file: !1908, line: 145, baseType: !1911, size: 64)
!1911 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1346, line: 69, baseType: !1912)
!1912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1913, size: 64)
!1913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1908, line: 136, size: 192, elements: !1914)
!1914 = !{!1915, !2113, !2114}
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1913, file: !1908, line: 137, baseType: !1916, size: 64)
!1916 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1346, line: 58, baseType: !1917)
!1917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1918, size: 64)
!1918 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1908, line: 737, size: 768, elements: !1919)
!1919 = !{!1920, !1937, !1970, !1976, !1981, !1986, !1993, !1999, !2005, !2010, !2024, !2029, !2035, !2040, !2050, !2055, !2071, !2078, !2085, !2091, !2096, !2102, !2108}
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1918, file: !1908, line: 738, baseType: !1921, size: 256)
!1921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1908, line: 271, size: 256, elements: !1922)
!1922 = !{!1923, !1924, !1925, !1926, !1927, !1928, !1929, !1930, !1931, !1932, !1933, !1934, !1935, !1936}
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1921, file: !1908, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1921, file: !1908, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1921, file: !1908, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1921, file: !1908, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1921, file: !1908, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1921, file: !1908, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1929 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1921, file: !1908, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1921, file: !1908, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1921, file: !1908, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1921, file: !1908, line: 312, baseType: !7, size: 32, offset: 32)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1921, file: !1908, line: 316, baseType: !1580, size: 32, offset: 64)
!1934 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1921, file: !1908, line: 319, baseType: !7, size: 32, offset: 96)
!1935 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1921, file: !1908, line: 323, baseType: !1879, size: 64, offset: 128)
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1921, file: !1908, line: 327, baseType: !1460, size: 64, offset: 192)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1918, file: !1908, line: 739, baseType: !1938, size: 448)
!1938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1908, line: 350, size: 448, elements: !1939)
!1939 = !{!1940, !1969}
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1938, file: !1908, line: 353, baseType: !1941, size: 384)
!1941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1908, line: 333, size: 384, elements: !1942)
!1942 = !{!1943, !1944, !1952}
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1941, file: !1908, line: 336, baseType: !1921, size: 256)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1941, file: !1908, line: 343, baseType: !1945, size: 64, offset: 256)
!1945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1946, size: 64)
!1946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1947, line: 37, size: 128, elements: !1948)
!1947 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1948 = !{!1949, !1950}
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1946, file: !1947, line: 39, baseType: !1945, size: 64)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1946, file: !1947, line: 40, baseType: !1951, size: 64, offset: 64)
!1951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1941, file: !1908, line: 344, baseType: !1953, size: 64, offset: 320)
!1953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1954, size: 64)
!1954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1947, line: 45, size: 320, elements: !1955)
!1955 = !{!1956, !1957}
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1954, file: !1947, line: 47, baseType: !1953, size: 64)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1954, file: !1947, line: 48, baseType: !1958, size: 256, offset: 64)
!1958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !163, line: 1883, size: 256, elements: !1959)
!1959 = !{!1960, !1962, !1963, !1968}
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1958, file: !163, line: 1884, baseType: !1961, size: 64)
!1961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1958, size: 64)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1958, file: !163, line: 1885, baseType: !1961, size: 64, offset: 64)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1958, file: !163, line: 1891, baseType: !1964, size: 64, offset: 128)
!1964 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1958, file: !163, line: 1891, size: 64, elements: !1965)
!1965 = !{!1966, !1967}
!1966 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1964, file: !163, line: 1891, baseType: !1916, size: 64)
!1967 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1964, file: !163, line: 1891, baseType: !1460, size: 64)
!1968 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1958, file: !163, line: 1892, baseType: !1951, size: 64, offset: 192)
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1938, file: !1908, line: 359, baseType: !1853, size: 64, offset: 384)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1918, file: !1908, line: 740, baseType: !1971, size: 512)
!1971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1908, line: 365, size: 512, elements: !1972)
!1972 = !{!1973, !1974, !1975}
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1971, file: !1908, line: 368, baseType: !1941, size: 384)
!1974 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1971, file: !1908, line: 373, baseType: !1460, size: 64, offset: 384)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1971, file: !1908, line: 374, baseType: !1460, size: 64, offset: 448)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1918, file: !1908, line: 741, baseType: !1977, size: 576)
!1977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1908, line: 380, size: 576, elements: !1978)
!1978 = !{!1979, !1980}
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1977, file: !1908, line: 383, baseType: !1971, size: 512)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1977, file: !1908, line: 389, baseType: !1853, size: 64, offset: 512)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1918, file: !1908, line: 742, baseType: !1982, size: 320)
!1982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1908, line: 395, size: 320, elements: !1983)
!1983 = !{!1984, !1985}
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1982, file: !1908, line: 397, baseType: !1921, size: 256)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1982, file: !1908, line: 400, baseType: !1905, size: 64, offset: 256)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1918, file: !1908, line: 743, baseType: !1987, size: 448)
!1987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1908, line: 406, size: 448, elements: !1988)
!1988 = !{!1989, !1990, !1991, !1992}
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1987, file: !1908, line: 408, baseType: !1921, size: 256)
!1990 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1987, file: !1908, line: 412, baseType: !1460, size: 64, offset: 256)
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1987, file: !1908, line: 420, baseType: !1460, size: 64, offset: 320)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1987, file: !1908, line: 423, baseType: !1905, size: 64, offset: 384)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1918, file: !1908, line: 744, baseType: !1994, size: 384)
!1994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1908, line: 429, size: 384, elements: !1995)
!1995 = !{!1996, !1997, !1998}
!1996 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1994, file: !1908, line: 431, baseType: !1921, size: 256)
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1994, file: !1908, line: 434, baseType: !1460, size: 64, offset: 256)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1994, file: !1908, line: 437, baseType: !1905, size: 64, offset: 320)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1918, file: !1908, line: 745, baseType: !2000, size: 384)
!2000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1908, line: 443, size: 384, elements: !2001)
!2001 = !{!2002, !2003, !2004}
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2000, file: !1908, line: 445, baseType: !1921, size: 256)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2000, file: !1908, line: 449, baseType: !1460, size: 64, offset: 256)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !2000, file: !1908, line: 453, baseType: !1905, size: 64, offset: 320)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1918, file: !1908, line: 746, baseType: !2006, size: 320)
!2006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1908, line: 459, size: 320, elements: !2007)
!2007 = !{!2008, !2009}
!2008 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2006, file: !1908, line: 461, baseType: !1921, size: 256)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !2006, file: !1908, line: 464, baseType: !1460, size: 64, offset: 256)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1918, file: !1908, line: 747, baseType: !2011, size: 768)
!2011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1908, line: 469, size: 768, elements: !2012)
!2012 = !{!2013, !2014, !2015, !2016, !2017}
!2013 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2011, file: !1908, line: 471, baseType: !1921, size: 256)
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !2011, file: !1908, line: 474, baseType: !7, size: 32, offset: 256)
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !2011, file: !1908, line: 475, baseType: !7, size: 32, offset: 288)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2011, file: !1908, line: 478, baseType: !1460, size: 64, offset: 320)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !2011, file: !1908, line: 481, baseType: !2018, size: 384, offset: 384)
!2018 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2019, size: 384, elements: !1342)
!2019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !163, line: 1917, size: 384, elements: !2020)
!2020 = !{!2021, !2022, !2023}
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !2019, file: !163, line: 1920, baseType: !1958, size: 256)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !2019, file: !163, line: 1921, baseType: !1460, size: 64, offset: 256)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2019, file: !163, line: 1922, baseType: !1580, size: 32, offset: 320)
!2024 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1918, file: !1908, line: 748, baseType: !2025, size: 320)
!2025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1908, line: 487, size: 320, elements: !2026)
!2026 = !{!2027, !2028}
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2025, file: !1908, line: 490, baseType: !1921, size: 256)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2025, file: !1908, line: 494, baseType: !1319, size: 32, offset: 256)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1918, file: !1908, line: 749, baseType: !2030, size: 384)
!2030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1908, line: 500, size: 384, elements: !2031)
!2031 = !{!2032, !2033, !2034}
!2032 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2030, file: !1908, line: 502, baseType: !1921, size: 256)
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !2030, file: !1908, line: 506, baseType: !1905, size: 64, offset: 256)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2030, file: !1908, line: 510, baseType: !1905, size: 64, offset: 320)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1918, file: !1908, line: 750, baseType: !2036, size: 320)
!2036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1908, line: 529, size: 320, elements: !2037)
!2037 = !{!2038, !2039}
!2038 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2036, file: !1908, line: 531, baseType: !1921, size: 256)
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2036, file: !1908, line: 540, baseType: !1905, size: 64, offset: 256)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1918, file: !1908, line: 751, baseType: !2041, size: 704)
!2041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1908, line: 546, size: 704, elements: !2042)
!2042 = !{!2043, !2044, !2045, !2046, !2047, !2048, !2049}
!2043 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2041, file: !1908, line: 549, baseType: !1971, size: 512)
!2044 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2041, file: !1908, line: 553, baseType: !1324, size: 64, offset: 512)
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !2041, file: !1908, line: 557, baseType: !1318, size: 8, offset: 576)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !2041, file: !1908, line: 558, baseType: !1318, size: 8, offset: 584)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !2041, file: !1908, line: 559, baseType: !1318, size: 8, offset: 592)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !2041, file: !1908, line: 560, baseType: !1318, size: 8, offset: 600)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2041, file: !1908, line: 566, baseType: !1853, size: 64, offset: 640)
!2050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1918, file: !1908, line: 752, baseType: !2051, size: 384)
!2051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1908, line: 571, size: 384, elements: !2052)
!2052 = !{!2053, !2054}
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2051, file: !1908, line: 573, baseType: !1982, size: 320)
!2054 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2051, file: !1908, line: 577, baseType: !1460, size: 64, offset: 320)
!2055 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1918, file: !1908, line: 753, baseType: !2056, size: 576)
!2056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1908, line: 600, size: 576, elements: !2057)
!2057 = !{!2058, !2059, !2060, !2061, !2070}
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2056, file: !1908, line: 602, baseType: !1982, size: 320)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2056, file: !1908, line: 605, baseType: !1460, size: 64, offset: 320)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !2056, file: !1908, line: 609, baseType: !1816, size: 64, offset: 384)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !2056, file: !1908, line: 612, baseType: !2062, size: 64, offset: 448)
!2062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2063, size: 64)
!2063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1908, line: 581, size: 320, elements: !2064)
!2064 = !{!2065, !2066, !2067, !2068, !2069}
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !2063, file: !1908, line: 583, baseType: !162, size: 32)
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2063, file: !1908, line: 586, baseType: !1460, size: 64, offset: 64)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2063, file: !1908, line: 589, baseType: !1460, size: 64, offset: 128)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !2063, file: !1908, line: 592, baseType: !1460, size: 64, offset: 192)
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !2063, file: !1908, line: 595, baseType: !1460, size: 64, offset: 256)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !2056, file: !1908, line: 616, baseType: !1905, size: 64, offset: 512)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1918, file: !1908, line: 754, baseType: !2072, size: 512)
!2072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1908, line: 622, size: 512, elements: !2073)
!2073 = !{!2074, !2075, !2076, !2077}
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2072, file: !1908, line: 624, baseType: !1982, size: 320)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2072, file: !1908, line: 628, baseType: !1460, size: 64, offset: 320)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !2072, file: !1908, line: 632, baseType: !1460, size: 64, offset: 384)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !2072, file: !1908, line: 636, baseType: !1460, size: 64, offset: 448)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1918, file: !1908, line: 755, baseType: !2079, size: 704)
!2079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1908, line: 642, size: 704, elements: !2080)
!2080 = !{!2081, !2082, !2083, !2084}
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !2079, file: !1908, line: 644, baseType: !2072, size: 512)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !2079, file: !1908, line: 648, baseType: !1460, size: 64, offset: 512)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !2079, file: !1908, line: 652, baseType: !1460, size: 64, offset: 576)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !2079, file: !1908, line: 653, baseType: !1460, size: 64, offset: 640)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1918, file: !1908, line: 756, baseType: !2086, size: 448)
!2086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1908, line: 663, size: 448, elements: !2087)
!2087 = !{!2088, !2089, !2090}
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2086, file: !1908, line: 665, baseType: !1982, size: 320)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2086, file: !1908, line: 668, baseType: !1460, size: 64, offset: 320)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !2086, file: !1908, line: 673, baseType: !1460, size: 64, offset: 384)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1918, file: !1908, line: 757, baseType: !2092, size: 384)
!2092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1908, line: 694, size: 384, elements: !2093)
!2093 = !{!2094, !2095}
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2092, file: !1908, line: 696, baseType: !1982, size: 320)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2092, file: !1908, line: 699, baseType: !1460, size: 64, offset: 320)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1918, file: !1908, line: 758, baseType: !2097, size: 384)
!2097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1908, line: 681, size: 384, elements: !2098)
!2098 = !{!2099, !2100, !2101}
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2097, file: !1908, line: 683, baseType: !1921, size: 256)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !2097, file: !1908, line: 686, baseType: !1460, size: 64, offset: 256)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !2097, file: !1908, line: 689, baseType: !1460, size: 64, offset: 320)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1918, file: !1908, line: 759, baseType: !2103, size: 384)
!2103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1908, line: 707, size: 384, elements: !2104)
!2104 = !{!2105, !2106, !2107}
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2103, file: !1908, line: 709, baseType: !1921, size: 256)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !2103, file: !1908, line: 712, baseType: !1460, size: 64, offset: 256)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !2103, file: !1908, line: 712, baseType: !1460, size: 64, offset: 320)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1918, file: !1908, line: 760, baseType: !2109, size: 320)
!2109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1908, line: 718, size: 320, elements: !2110)
!2110 = !{!2111, !2112}
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2109, file: !1908, line: 720, baseType: !1921, size: 256)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !2109, file: !1908, line: 723, baseType: !1460, size: 64, offset: 256)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1913, file: !1908, line: 138, baseType: !1912, size: 64, offset: 64)
