; ModuleID = 'partition.bc'
source_filename = "partition.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.partition_def = type { i32, [1 x %struct.partition_elem] }
%struct.partition_elem = type { i32, %struct.partition_elem*, i32 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [4 x i8] c" %d\00", align 1

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @atoi(i8* %__nptr) local_unnamed_addr #0 !dbg !37 {
entry:
  call void @llvm.dbg.value(metadata i8* %__nptr, metadata !42, metadata !DIExpression()), !dbg !43
  %call = tail call i64 @strtol(i8* %__nptr, i8** null, i32 10) #5, !dbg !44
  %conv = trunc i64 %call to i32, !dbg !45
  ret i32 %conv, !dbg !46
}

declare dso_local i64 @strtol(i8*, i8**, i32) local_unnamed_addr #1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "partition.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !8, !9, !11, !12, !13, !6, !30, !31}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "partition", file: !14, line: 65, baseType: !15)
!14 = !DIFile(filename: "./include/partition.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partition_def", file: !14, line: 59, size: 256, elements: !17)
!17 = !{!18, !19}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "num_elements", scope: !16, file: !14, line: 62, baseType: !4, size: 32)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !16, file: !14, line: 64, baseType: !20, size: 192, offset: 64)
!20 = !DICompositeType(tag: DW_TAG_array_type, baseType: !21, size: 192, elements: !28)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partition_elem", file: !14, line: 46, size: 192, elements: !22)
!22 = !{!23, !24, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "class_element", scope: !21, file: !14, line: 50, baseType: !4, size: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !21, file: !14, line: 53, baseType: !25, size: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "class_count", scope: !21, file: !14, line: 56, baseType: !27, size: 32, offset: 128)
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !{!29}
!29 = !DISubrange(count: 1)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!33 = !{i32 2, !"Dwarf Version", i32 4}
!34 = !{i32 2, !"Debug Info Version", i32 3}
!35 = !{i32 1, !"wchar_size", i32 4}
!36 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!37 = distinct !DISubprogram(name: "atoi", scope: !38, file: !38, line: 361, type: !39, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !41)
!38 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!39 = !DISubroutineType(types: !40)
!40 = !{!4, !9}
!41 = !{!42}
!42 = !DILocalVariable(name: "__nptr", arg: 1, scope: !37, file: !38, line: 361, type: !9)
!43 = !DILocation(line: 0, scope: !37)
!44 = !DILocation(line: 363, column: 16, scope: !37)
!45 = !DILocation(line: 363, column: 10, scope: !37)
!46 = !DILocation(line: 363, column: 3, scope: !37)
!47 = distinct !DISubprogram(name: "atol", scope: !38, file: !38, line: 366, type: !48, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !51)
!48 = !DISubroutineType(types: !49)
!49 = !{!50, !9}
!50 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!51 = !{!52}
!52 = !DILocalVariable(name: "__nptr", arg: 1, scope: !47, file: !38, line: 366, type: !9)
!53 = !DILocation(line: 0, scope: !47)
!54 = !DILocation(line: 368, column: 10, scope: !47)
!55 = !DILocation(line: 368, column: 3, scope: !47)
!56 = distinct !DISubprogram(name: "atoll", scope: !38, file: !38, line: 373, type: !57, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !60)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !9}
!59 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!60 = !{!61}
!61 = !DILocalVariable(name: "__nptr", arg: 1, scope: !56, file: !38, line: 373, type: !9)
!62 = !DILocation(line: 0, scope: !56)
!63 = !DILocation(line: 375, column: 10, scope: !56)
!64 = !DILocation(line: 375, column: 3, scope: !56)
!65 = distinct !DISubprogram(name: "bsearch", scope: !66, file: !66, line: 20, type: !67, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !78)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!67 = !DISubroutineType(types: !68)
!68 = !{!8, !69, !69, !71, !71, !74}
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 46, baseType: !73)
!72 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !38, line: 808, baseType: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DISubroutineType(types: !77)
!77 = !{!4, !69, !69}
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88}
!79 = !DILocalVariable(name: "__key", arg: 1, scope: !65, file: !66, line: 20, type: !69)
!80 = !DILocalVariable(name: "__base", arg: 2, scope: !65, file: !66, line: 20, type: !69)
!81 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !65, file: !66, line: 20, type: !71)
!82 = !DILocalVariable(name: "__size", arg: 4, scope: !65, file: !66, line: 20, type: !71)
!83 = !DILocalVariable(name: "__compar", arg: 5, scope: !65, file: !66, line: 21, type: !74)
!84 = !DILocalVariable(name: "__l", scope: !65, file: !66, line: 23, type: !71)
!85 = !DILocalVariable(name: "__u", scope: !65, file: !66, line: 23, type: !71)
!86 = !DILocalVariable(name: "__idx", scope: !65, file: !66, line: 23, type: !71)
!87 = !DILocalVariable(name: "__p", scope: !65, file: !66, line: 24, type: !69)
!88 = !DILocalVariable(name: "__comparison", scope: !65, file: !66, line: 25, type: !4)
!89 = !DILocation(line: 0, scope: !65)
!90 = !DILocation(line: 29, column: 3, scope: !65)
!91 = !DILocation(line: 27, column: 7, scope: !65)
!92 = !DILocation(line: 29, column: 14, scope: !65)
!93 = !DILocation(line: 31, column: 20, scope: !94)
!94 = distinct !DILexicalBlock(scope: !65, file: !66, line: 30, column: 5)
!95 = !DILocation(line: 31, column: 27, scope: !94)
!96 = !DILocation(line: 32, column: 56, scope: !94)
!97 = !DILocation(line: 32, column: 47, scope: !94)
!98 = !DILocation(line: 33, column: 22, scope: !94)
!99 = !DILocation(line: 34, column: 24, scope: !100)
!100 = distinct !DILexicalBlock(scope: !94, file: !66, line: 34, column: 11)
!101 = !DILocation(line: 34, column: 11, scope: !94)
!102 = !DILocation(line: 36, column: 29, scope: !103)
!103 = distinct !DILexicalBlock(scope: !100, file: !66, line: 36, column: 16)
!104 = !DILocation(line: 36, column: 16, scope: !100)
!105 = !DILocation(line: 37, column: 14, scope: !103)
!106 = distinct !{!106, !90, !107}
!107 = !DILocation(line: 40, column: 5, scope: !65)
!108 = !DILocation(line: 43, column: 1, scope: !65)
!109 = distinct !DISubprogram(name: "atof", scope: !110, file: !110, line: 25, type: !111, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !114)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!111 = !DISubroutineType(types: !112)
!112 = !{!113, !9}
!113 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!114 = !{!115}
!115 = !DILocalVariable(name: "__nptr", arg: 1, scope: !109, file: !110, line: 25, type: !9)
!116 = !DILocation(line: 0, scope: !109)
!117 = !DILocation(line: 27, column: 10, scope: !109)
!118 = !DILocation(line: 27, column: 3, scope: !109)
!119 = distinct !DISubprogram(name: "vprintf", scope: !120, file: !120, line: 39, type: !121, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !131)
!120 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!121 = !DISubroutineType(types: !122)
!122 = !{!4, !123, !124}
!123 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 28, size: 192, elements: !126)
!126 = !{!127, !128, !129, !130}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !125, file: !1, line: 28, baseType: !27, size: 32)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !125, file: !1, line: 28, baseType: !27, size: 32, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !125, file: !1, line: 28, baseType: !8, size: 64, offset: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !125, file: !1, line: 28, baseType: !8, size: 64, offset: 128)
!131 = !{!132, !133}
!132 = !DILocalVariable(name: "__fmt", arg: 1, scope: !119, file: !120, line: 39, type: !123)
!133 = !DILocalVariable(name: "__arg", arg: 2, scope: !119, file: !120, line: 39, type: !124)
!134 = !DILocation(line: 0, scope: !119)
!135 = !DILocation(line: 41, column: 20, scope: !119)
!136 = !DILocation(line: 41, column: 10, scope: !119)
!137 = !DILocation(line: 41, column: 3, scope: !119)
!138 = distinct !DISubprogram(name: "getchar", scope: !120, file: !120, line: 47, type: !139, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!139 = !DISubroutineType(types: !140)
!140 = !{!4}
!141 = !DILocation(line: 49, column: 16, scope: !138)
!142 = !DILocation(line: 49, column: 10, scope: !138)
!143 = !DILocation(line: 49, column: 3, scope: !138)
!144 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !120, file: !120, line: 56, type: !145, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !200)
!145 = !DISubroutineType(types: !146)
!146 = !{!4, !147}
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !149, line: 7, baseType: !150)
!149 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !151, line: 49, size: 1728, elements: !152)
!151 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!152 = !{!153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !168, !170, !171, !172, !175, !177, !179, !181, !184, !186, !189, !192, !193, !194, !195, !196}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !150, file: !151, line: 51, baseType: !4, size: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !150, file: !151, line: 54, baseType: !6, size: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !150, file: !151, line: 55, baseType: !6, size: 64, offset: 128)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !150, file: !151, line: 56, baseType: !6, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !150, file: !151, line: 57, baseType: !6, size: 64, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !150, file: !151, line: 58, baseType: !6, size: 64, offset: 320)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !150, file: !151, line: 59, baseType: !6, size: 64, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !150, file: !151, line: 60, baseType: !6, size: 64, offset: 448)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !150, file: !151, line: 61, baseType: !6, size: 64, offset: 512)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !150, file: !151, line: 64, baseType: !6, size: 64, offset: 576)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !150, file: !151, line: 65, baseType: !6, size: 64, offset: 640)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !150, file: !151, line: 66, baseType: !6, size: 64, offset: 704)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !150, file: !151, line: 68, baseType: !166, size: 64, offset: 768)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !151, line: 36, flags: DIFlagFwdDecl)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !150, file: !151, line: 70, baseType: !169, size: 64, offset: 832)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !150, file: !151, line: 72, baseType: !4, size: 32, offset: 896)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !150, file: !151, line: 73, baseType: !4, size: 32, offset: 928)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !150, file: !151, line: 74, baseType: !173, size: 64, offset: 960)
!173 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !174, line: 152, baseType: !50)
!174 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!175 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !150, file: !151, line: 77, baseType: !176, size: 16, offset: 1024)
!176 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !150, file: !151, line: 78, baseType: !178, size: 8, offset: 1040)
!178 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !150, file: !151, line: 79, baseType: !180, size: 8, offset: 1048)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !28)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !150, file: !151, line: 81, baseType: !182, size: 64, offset: 1088)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !151, line: 43, baseType: null)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !150, file: !151, line: 89, baseType: !185, size: 64, offset: 1152)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !174, line: 153, baseType: !50)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !150, file: !151, line: 91, baseType: !187, size: 64, offset: 1216)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !151, line: 37, flags: DIFlagFwdDecl)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !150, file: !151, line: 92, baseType: !190, size: 64, offset: 1280)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !151, line: 38, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !150, file: !151, line: 93, baseType: !169, size: 64, offset: 1344)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !150, file: !151, line: 94, baseType: !8, size: 64, offset: 1408)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !150, file: !151, line: 95, baseType: !71, size: 64, offset: 1472)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !150, file: !151, line: 96, baseType: !4, size: 32, offset: 1536)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !150, file: !151, line: 98, baseType: !197, size: 160, offset: 1568)
!197 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !198)
!198 = !{!199}
!199 = !DISubrange(count: 20)
!200 = !{!201}
!201 = !DILocalVariable(name: "__fp", arg: 1, scope: !144, file: !120, line: 56, type: !147)
!202 = !DILocation(line: 0, scope: !144)
!203 = !DILocation(line: 58, column: 10, scope: !144)
!204 = !DILocation(line: 58, column: 3, scope: !144)
!205 = distinct !DISubprogram(name: "getc_unlocked", scope: !120, file: !120, line: 66, type: !145, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !206)
!206 = !{!207}
!207 = !DILocalVariable(name: "__fp", arg: 1, scope: !205, file: !120, line: 66, type: !147)
!208 = !DILocation(line: 0, scope: !205)
!209 = !DILocation(line: 68, column: 10, scope: !205)
!210 = !DILocation(line: 68, column: 3, scope: !205)
!211 = distinct !DISubprogram(name: "getchar_unlocked", scope: !120, file: !120, line: 73, type: !139, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!212 = !DILocation(line: 75, column: 10, scope: !211)
!213 = !DILocation(line: 75, column: 3, scope: !211)
!214 = distinct !DISubprogram(name: "putchar", scope: !120, file: !120, line: 82, type: !215, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !217)
!215 = !DISubroutineType(types: !216)
!216 = !{!4, !4}
!217 = !{!218}
!218 = !DILocalVariable(name: "__c", arg: 1, scope: !214, file: !120, line: 82, type: !4)
!219 = !DILocation(line: 0, scope: !214)
!220 = !DILocation(line: 84, column: 21, scope: !214)
!221 = !DILocation(line: 84, column: 10, scope: !214)
!222 = !DILocation(line: 84, column: 3, scope: !214)
!223 = distinct !DISubprogram(name: "fputc_unlocked", scope: !120, file: !120, line: 91, type: !224, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !226)
!224 = !DISubroutineType(types: !225)
!225 = !{!4, !4, !147}
!226 = !{!227, !228}
!227 = !DILocalVariable(name: "__c", arg: 1, scope: !223, file: !120, line: 91, type: !4)
!228 = !DILocalVariable(name: "__stream", arg: 2, scope: !223, file: !120, line: 91, type: !147)
!229 = !DILocation(line: 0, scope: !223)
!230 = !DILocation(line: 93, column: 10, scope: !223)
!231 = !DILocation(line: 93, column: 3, scope: !223)
!232 = distinct !DISubprogram(name: "putc_unlocked", scope: !120, file: !120, line: 101, type: !224, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !233)
!233 = !{!234, !235}
!234 = !DILocalVariable(name: "__c", arg: 1, scope: !232, file: !120, line: 101, type: !4)
!235 = !DILocalVariable(name: "__stream", arg: 2, scope: !232, file: !120, line: 101, type: !147)
!236 = !DILocation(line: 0, scope: !232)
!237 = !DILocation(line: 103, column: 10, scope: !232)
!238 = !DILocation(line: 103, column: 3, scope: !232)
!239 = distinct !DISubprogram(name: "putchar_unlocked", scope: !120, file: !120, line: 108, type: !215, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !240)
!240 = !{!241}
!241 = !DILocalVariable(name: "__c", arg: 1, scope: !239, file: !120, line: 108, type: !4)
!242 = !DILocation(line: 0, scope: !239)
!243 = !DILocation(line: 110, column: 10, scope: !239)
!244 = !DILocation(line: 110, column: 3, scope: !239)
!245 = distinct !DISubprogram(name: "getline", scope: !120, file: !120, line: 118, type: !246, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !250)
!246 = !DISubroutineType(types: !247)
!247 = !{!248, !5, !249, !147}
!248 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !174, line: 193, baseType: !50)
