; ModuleID = 'passes.bc'
source_filename = "passes.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }

!574 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!575 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!576 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!577 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!578 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!579 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!580 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pass_positioning_ops", file: !398, line: 319, baseType: !7, size: 32, elements: !581)
!581 = !{!582, !583, !584}
!582 = !DIEnumerator(name: "PASS_POS_INSERT_AFTER", value: 0, isUnsigned: true)
!583 = !DIEnumerator(name: "PASS_POS_INSERT_BEFORE", value: 1, isUnsigned: true)
!584 = !DIEnumerator(name: "PASS_POS_REPLACE", value: 2, isUnsigned: true)
!585 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_dump_index", file: !398, line: 30, baseType: !7, size: 32, elements: !586)
!586 = !{!587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598}
!587 = !DIEnumerator(name: "TDI_none", value: 0, isUnsigned: true)
!588 = !DIEnumerator(name: "TDI_cgraph", value: 1, isUnsigned: true)
!589 = !DIEnumerator(name: "TDI_tu", value: 2, isUnsigned: true)
!590 = !DIEnumerator(name: "TDI_class", value: 3, isUnsigned: true)
!591 = !DIEnumerator(name: "TDI_original", value: 4, isUnsigned: true)
!592 = !DIEnumerator(name: "TDI_generic", value: 5, isUnsigned: true)
!593 = !DIEnumerator(name: "TDI_nested", value: 6, isUnsigned: true)
!594 = !DIEnumerator(name: "TDI_vcg", value: 7, isUnsigned: true)
!595 = !DIEnumerator(name: "TDI_tree_all", value: 8, isUnsigned: true)
!596 = !DIEnumerator(name: "TDI_rtl_all", value: 9, isUnsigned: true)
!597 = !DIEnumerator(name: "TDI_ipa_all", value: 10, isUnsigned: true)
!598 = !DIEnumerator(name: "TDI_end", value: 11, isUnsigned: true)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !600, line: 309, baseType: !7, size: 32, elements: !601)
!600 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!601 = !{!602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621}
!602 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!603 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!604 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!605 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!606 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!607 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!608 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!609 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!610 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!611 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!612 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!613 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!614 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!615 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!616 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!617 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!618 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!619 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!620 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!621 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!622 = !{!623, !624, !625, !626, !629, !630, !134, !632, !2115, !627, !2172, !1535, !2378, !2379, !2189, !1103, !2159, !7}
!623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !624, size: 64)
!624 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!625 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !633, line: 56, baseType: !634)
!633 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !636)
!636 = !{!637, !670, !676, !689, !708, !719, !724, !733, !739, !752, !764, !802, !1348, !1376, !1393, !1394, !1399, !1408, !1414, !1419, !1423, !1427, !1766, !1813, !1819, !1825, !1832, !1845, !1859, !1876, !1888, !1910, !1925, !2097}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !635, file: !135, line: 3372, baseType: !638, size: 64)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !639)
!639 = !{!640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !638, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !638, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !638, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !638, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !638, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !638, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !638, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !638, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !638, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !638, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !638, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !638, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !638, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !638, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !638, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !638, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !638, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !638, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !638, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !638, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !638, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !638, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !638, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !638, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !638, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !638, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !638, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !638, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !638, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !638, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !635, file: !135, line: 3373, baseType: !671, size: 192)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !672)
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !671, file: !135, line: 403, baseType: !638, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !671, file: !135, line: 404, baseType: !632, size: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !671, file: !135, line: 405, baseType: !632, size: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !635, file: !135, line: 3374, baseType: !677, size: 320)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !135, line: 1385, baseType: !671, size: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !677, file: !135, line: 1386, baseType: !681, size: 128, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !682, line: 58, baseType: !683)
!682 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !682, line: 54, size: 128, elements: !684)
!684 = !{!685, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !683, file: !682, line: 56, baseType: !686, size: 64)
!686 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !683, file: !682, line: 57, baseType: !688, size: 64, offset: 64)
!688 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !635, file: !135, line: 3375, baseType: !690, size: 256)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !691)
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !690, file: !135, line: 1398, baseType: !671, size: 192)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !690, file: !135, line: 1399, baseType: !694, size: 64, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !696, line: 52, size: 256, elements: !697)
!696 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!697 = !{!698, !699, !700, !701, !702, !703, !704}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !695, file: !696, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !695, file: !696, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !695, file: !696, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !695, file: !696, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !695, file: !696, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !695, file: !696, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !695, file: !696, line: 62, baseType: !705, size: 192, offset: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 192, elements: !706)
!706 = !{!707}
!707 = !DISubrange(count: 3)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !635, file: !135, line: 3376, baseType: !709, size: 256)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !709, file: !135, line: 1409, baseType: !671, size: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !709, file: !135, line: 1410, baseType: !713, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !715, line: 27, size: 192, elements: !716)
!715 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!716 = !{!717, !718}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !714, file: !715, line: 29, baseType: !681, size: 128)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !714, file: !715, line: 30, baseType: !5, size: 32, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !635, file: !135, line: 3377, baseType: !720, size: 256)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !721)
!721 = !{!722, !723}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !720, file: !135, line: 1438, baseType: !671, size: 192)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !720, file: !135, line: 1439, baseType: !632, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !635, file: !135, line: 3378, baseType: !725, size: 256)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !726)
!726 = !{!727, !728, !729}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !725, file: !135, line: 1419, baseType: !671, size: 192)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !725, file: !135, line: 1420, baseType: !625, size: 32, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !725, file: !135, line: 1421, baseType: !730, size: 8, offset: 224)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 8, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 1)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !635, file: !135, line: 3379, baseType: !734, size: 320)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !734, file: !135, line: 1429, baseType: !671, size: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !734, file: !135, line: 1430, baseType: !632, size: 64, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !734, file: !135, line: 1431, baseType: !632, size: 64, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !635, file: !135, line: 3380, baseType: !740, size: 320)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !740, file: !135, line: 1461, baseType: !671, size: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !740, file: !135, line: 1462, baseType: !744, size: 128, offset: 192)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !745, line: 31, size: 128, elements: !746)
!745 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!746 = !{!747, !750, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !744, file: !745, line: 32, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !624)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !744, file: !745, line: 33, baseType: !7, size: 32, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !744, file: !745, line: 34, baseType: !7, size: 32, offset: 96)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !635, file: !135, line: 3381, baseType: !753, size: 384)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !754)
!754 = !{!755, !756, !761, !762, !763}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !135, line: 2508, baseType: !671, size: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !753, file: !135, line: 2509, baseType: !757, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !758, line: 58, baseType: !759)
!758 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !760, line: 44, baseType: !7)
!760 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!761 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !753, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !753, file: !135, line: 2511, baseType: !632, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !753, file: !135, line: 2512, baseType: !632, size: 64, offset: 320)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !635, file: !135, line: 3382, baseType: !765, size: 896)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !135, line: 2653, baseType: !753, size: 384)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !765, file: !135, line: 2654, baseType: !632, size: 64, offset: 384)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !765, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !765, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !765, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !765, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !765, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !765, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !765, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !765, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !765, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !765, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !765, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !765, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !765, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !765, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !765, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !765, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !765, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !765, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !765, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !765, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !765, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !765, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !765, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !765, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !765, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !765, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !765, file: !135, line: 2705, baseType: !632, size: 64, offset: 576)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !765, file: !135, line: 2706, baseType: !632, size: 64, offset: 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !765, file: !135, line: 2707, baseType: !632, size: 64, offset: 704)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !765, file: !135, line: 2708, baseType: !632, size: 64, offset: 768)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !765, file: !135, line: 2711, baseType: !800, size: 64, offset: 832)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !635, file: !135, line: 3383, baseType: !803, size: 960)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !135, line: 2757, baseType: !765, size: 896)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !803, file: !135, line: 2758, baseType: !807, size: 64, offset: 896)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !633, line: 50, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !810, line: 240, size: 384, elements: !811)
!810 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!811 = !{!812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !809, file: !810, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !809, file: !810, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !809, file: !810, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !809, file: !810, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !809, file: !810, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !809, file: !810, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !809, file: !810, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !809, file: !810, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !809, file: !810, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !809, file: !810, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !809, file: !810, line: 321, baseType: !823, size: 320, offset: 64)
!823 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !810, line: 315, size: 320, elements: !824)
!824 = !{!825, !1281, !1283, !1346, !1347}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !823, file: !810, line: 316, baseType: !826, size: 64)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 64, elements: !731)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !810, line: 183, baseType: !828)
!828 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !810, line: 166, size: 64, elements: !829)
!829 = !{!830, !831, !832, !833, !834, !842, !843, !855, !858, !918, !919, !1258, !1271, !1278}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !828, file: !810, line: 168, baseType: !625, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !828, file: !810, line: 169, baseType: !7, size: 32)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !828, file: !810, line: 170, baseType: !630, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !828, file: !810, line: 171, baseType: !807, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !828, file: !810, line: 172, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !633, line: 53, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !810, line: 359, size: 128, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !837, file: !810, line: 360, baseType: !625, size: 32)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !837, file: !810, line: 361, baseType: !841, size: 64, offset: 64)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !807, size: 64, elements: !731)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !828, file: !810, line: 173, baseType: !5, size: 32)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !828, file: !810, line: 174, baseType: !844, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !810, line: 133, baseType: !845)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !810, line: 115, size: 32, elements: !846)
!846 = !{!847, !848, !849, !850, !851, !852, !853, !854}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !845, file: !810, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !845, file: !810, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !845, file: !810, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !845, file: !810, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !845, file: !810, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !845, file: !810, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !845, file: !810, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !845, file: !810, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !828, file: !810, line: 175, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !810, line: 175, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !828, file: !810, line: 176, baseType: !859, size: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !861, line: 75, size: 256, elements: !862)
!861 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!862 = !{!863, !877, !878, !879}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !860, file: !861, line: 76, baseType: !864, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !861, line: 68, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !861, line: 63, size: 320, elements: !867)
!867 = !{!868, !870, !871, !872}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !866, file: !861, line: 64, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !866, file: !861, line: 65, baseType: !869, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !866, file: !861, line: 66, baseType: !7, size: 32, offset: 128)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !866, file: !861, line: 67, baseType: !873, size: 128, offset: 192)
!873 = !DICompositeType(tag: DW_TAG_array_type, baseType: !874, size: 128, elements: !875)
!874 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !861, line: 29, baseType: !686)
!875 = !{!876}
!876 = !DISubrange(count: 2)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !860, file: !861, line: 77, baseType: !864, size: 64, offset: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !860, file: !861, line: 78, baseType: !7, size: 32, offset: 128)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !860, file: !861, line: 79, baseType: !880, size: 64, offset: 192)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !861, line: 49, baseType: !882)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !861, line: 45, size: 832, elements: !883)
!883 = !{!884, !885, !886}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !882, file: !861, line: 46, baseType: !869, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !882, file: !861, line: 47, baseType: !859, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !882, file: !861, line: 48, baseType: !887, size: 704, offset: 128)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !888, line: 164, size: 704, elements: !889)
!888 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!889 = !{!890, !891, !901, !902, !903, !904, !905, !906, !910, !914, !915, !916, !917}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !887, file: !888, line: 166, baseType: !688, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !887, file: !888, line: 167, baseType: !892, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !888, line: 157, size: 192, elements: !894)
!894 = !{!895, !896, !897}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !893, file: !888, line: 159, baseType: !627, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !893, file: !888, line: 160, baseType: !892, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !893, file: !888, line: 161, baseType: !898, size: 32, offset: 128)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 32, elements: !899)
!899 = !{!900}
!900 = !DISubrange(count: 4)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !887, file: !888, line: 168, baseType: !627, size: 64, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !887, file: !888, line: 169, baseType: !627, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !887, file: !888, line: 170, baseType: !627, size: 64, offset: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !887, file: !888, line: 171, baseType: !688, size: 64, offset: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !887, file: !888, line: 172, baseType: !625, size: 32, offset: 384)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !887, file: !888, line: 176, baseType: !907, size: 64, offset: 448)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DISubroutineType(types: !909)
!909 = !{!892, !629, !688}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !887, file: !888, line: 177, baseType: !911, size: 64, offset: 512)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DISubroutineType(types: !913)
!913 = !{null, !629, !892}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !887, file: !888, line: 178, baseType: !629, size: 64, offset: 576)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !887, file: !888, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !887, file: !888, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !887, file: !888, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !828, file: !810, line: 177, baseType: !632, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !828, file: !810, line: 178, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !350, line: 217, size: 832, elements: !922)
!922 = !{!923, !1170, !1171, !1172, !1228, !1232, !1233, !1234, !1252, !1253, !1254, !1255, !1256, !1257}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !921, file: !350, line: 219, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !350, line: 151, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !350, line: 151, size: 128, elements: !927)
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !926, file: !350, line: 151, baseType: !929, size: 128)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !350, line: 150, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !350, line: 150, size: 128, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !930, file: !350, line: 150, baseType: !7, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !930, file: !350, line: 150, baseType: !7, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !930, file: !350, line: 150, baseType: !935, size: 64, offset: 64)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !936, size: 64, elements: !731)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !633, line: 108, baseType: !937)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !350, line: 122, size: 512, elements: !939)
!939 = !{!940, !941, !942, !1162, !1163, !1164, !1165, !1166, !1167, !1168}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !938, file: !350, line: 124, baseType: !920, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !938, file: !350, line: 125, baseType: !920, size: 64, offset: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !938, file: !350, line: 131, baseType: !943, size: 64, offset: 128)
!943 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !350, line: 128, size: 64, elements: !944)
!944 = !{!945, !1161}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !943, file: !350, line: 129, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !633, line: 66, baseType: !947)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !949, line: 143, size: 192, elements: !950)
!949 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!950 = !{!951, !1159, !1160}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !948, file: !949, line: 145, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !633, line: 69, baseType: !953)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !949, line: 136, size: 192, elements: !955)
!955 = !{!956, !1157, !1158}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !954, file: !949, line: 137, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !633, line: 58, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !949, line: 737, size: 768, elements: !960)
!960 = !{!961, !978, !1012, !1018, !1023, !1028, !1035, !1041, !1047, !1052, !1066, !1071, !1077, !1082, !1092, !1097, !1115, !1122, !1129, !1135, !1140, !1146, !1152}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !959, file: !949, line: 738, baseType: !962, size: 256)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !949, line: 271, size: 256, elements: !963)
!963 = !{!964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !962, file: !949, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !962, file: !949, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !962, file: !949, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !962, file: !949, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !962, file: !949, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !962, file: !949, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !962, file: !949, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !962, file: !949, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !962, file: !949, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !962, file: !949, line: 312, baseType: !7, size: 32, offset: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !962, file: !949, line: 316, baseType: !757, size: 32, offset: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !962, file: !949, line: 319, baseType: !7, size: 32, offset: 96)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !962, file: !949, line: 323, baseType: !920, size: 64, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !962, file: !949, line: 327, baseType: !632, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !959, file: !949, line: 739, baseType: !979, size: 448)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !949, line: 350, size: 448, elements: !980)
!980 = !{!981, !1010}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !979, file: !949, line: 353, baseType: !982, size: 384)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !949, line: 333, size: 384, elements: !983)
!983 = !{!984, !985, !993}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !982, file: !949, line: 336, baseType: !962, size: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !982, file: !949, line: 343, baseType: !986, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !988, line: 37, size: 128, elements: !989)
!988 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!989 = !{!990, !991}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !987, file: !988, line: 39, baseType: !986, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !987, file: !988, line: 40, baseType: !992, size: 64, offset: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !982, file: !949, line: 344, baseType: !994, size: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !995, size: 64)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !988, line: 45, size: 320, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !995, file: !988, line: 47, baseType: !994, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !995, file: !988, line: 48, baseType: !999, size: 256, offset: 64)
!999 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1000)
!1000 = !{!1001, !1003, !1004, !1009}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !999, file: !135, line: 1884, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !999, file: !135, line: 1885, baseType: !1002, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !999, file: !135, line: 1891, baseType: !1005, size: 64, offset: 128)
!1005 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !999, file: !135, line: 1891, size: 64, elements: !1006)
!1006 = !{!1007, !1008}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1005, file: !135, line: 1891, baseType: !957, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1005, file: !135, line: 1891, baseType: !632, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !999, file: !135, line: 1892, baseType: !992, size: 64, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !979, file: !949, line: 359, baseType: !1011, size: 64, offset: 384)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !632, size: 64, elements: !731)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !959, file: !949, line: 740, baseType: !1013, size: 512)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !949, line: 365, size: 512, elements: !1014)
!1014 = !{!1015, !1016, !1017}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1013, file: !949, line: 368, baseType: !982, size: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1013, file: !949, line: 373, baseType: !632, size: 64, offset: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1013, file: !949, line: 374, baseType: !632, size: 64, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !959, file: !949, line: 741, baseType: !1019, size: 576)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !949, line: 380, size: 576, elements: !1020)
!1020 = !{!1021, !1022}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1019, file: !949, line: 383, baseType: !1013, size: 512)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1019, file: !949, line: 389, baseType: !1011, size: 64, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !959, file: !949, line: 742, baseType: !1024, size: 320)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !949, line: 395, size: 320, elements: !1025)
!1025 = !{!1026, !1027}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1024, file: !949, line: 397, baseType: !962, size: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1024, file: !949, line: 400, baseType: !946, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !959, file: !949, line: 743, baseType: !1029, size: 448)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !949, line: 406, size: 448, elements: !1030)
!1030 = !{!1031, !1032, !1033, !1034}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1029, file: !949, line: 408, baseType: !962, size: 256)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1029, file: !949, line: 412, baseType: !632, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1029, file: !949, line: 420, baseType: !632, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1029, file: !949, line: 423, baseType: !946, size: 64, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !959, file: !949, line: 744, baseType: !1036, size: 384)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !949, line: 429, size: 384, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1036, file: !949, line: 431, baseType: !962, size: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1036, file: !949, line: 434, baseType: !632, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1036, file: !949, line: 437, baseType: !946, size: 64, offset: 320)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !959, file: !949, line: 745, baseType: !1042, size: 384)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !949, line: 443, size: 384, elements: !1043)
!1043 = !{!1044, !1045, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1042, file: !949, line: 445, baseType: !962, size: 256)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1042, file: !949, line: 449, baseType: !632, size: 64, offset: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1042, file: !949, line: 453, baseType: !946, size: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !959, file: !949, line: 746, baseType: !1048, size: 320)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !949, line: 459, size: 320, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1048, file: !949, line: 461, baseType: !962, size: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1048, file: !949, line: 464, baseType: !632, size: 64, offset: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !959, file: !949, line: 747, baseType: !1053, size: 768)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !949, line: 469, size: 768, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1053, file: !949, line: 471, baseType: !962, size: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1053, file: !949, line: 474, baseType: !7, size: 32, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1053, file: !949, line: 475, baseType: !7, size: 32, offset: 288)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1053, file: !949, line: 478, baseType: !632, size: 64, offset: 320)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1053, file: !949, line: 481, baseType: !1060, size: 384, offset: 384)
!1060 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1061, size: 384, elements: !731)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1062)
!1062 = !{!1063, !1064, !1065}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1061, file: !135, line: 1920, baseType: !999, size: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1061, file: !135, line: 1921, baseType: !632, size: 64, offset: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1061, file: !135, line: 1922, baseType: !757, size: 32, offset: 320)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !959, file: !949, line: 748, baseType: !1067, size: 320)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !949, line: 487, size: 320, elements: !1068)
!1068 = !{!1069, !1070}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1067, file: !949, line: 490, baseType: !962, size: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1067, file: !949, line: 494, baseType: !625, size: 32, offset: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !959, file: !949, line: 749, baseType: !1072, size: 384)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !949, line: 500, size: 384, elements: !1073)
!1073 = !{!1074, !1075, !1076}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1072, file: !949, line: 502, baseType: !962, size: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1072, file: !949, line: 506, baseType: !946, size: 64, offset: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1072, file: !949, line: 510, baseType: !946, size: 64, offset: 320)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !959, file: !949, line: 750, baseType: !1078, size: 320)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !949, line: 529, size: 320, elements: !1079)
!1079 = !{!1080, !1081}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1078, file: !949, line: 531, baseType: !962, size: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1078, file: !949, line: 540, baseType: !946, size: 64, offset: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !959, file: !949, line: 751, baseType: !1083, size: 704)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !949, line: 546, size: 704, elements: !1084)
!1084 = !{!1085, !1086, !1087, !1088, !1089, !1090, !1091}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1083, file: !949, line: 549, baseType: !1013, size: 512)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1083, file: !949, line: 553, baseType: !630, size: 64, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1083, file: !949, line: 557, baseType: !624, size: 8, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1083, file: !949, line: 558, baseType: !624, size: 8, offset: 584)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1083, file: !949, line: 559, baseType: !624, size: 8, offset: 592)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1083, file: !949, line: 560, baseType: !624, size: 8, offset: 600)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1083, file: !949, line: 566, baseType: !1011, size: 64, offset: 640)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !959, file: !949, line: 752, baseType: !1093, size: 384)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !949, line: 571, size: 384, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1093, file: !949, line: 573, baseType: !1024, size: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1093, file: !949, line: 577, baseType: !632, size: 64, offset: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !959, file: !949, line: 753, baseType: !1098, size: 576)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !949, line: 600, size: 576, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1105, !1114}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1098, file: !949, line: 602, baseType: !1024, size: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1098, file: !949, line: 605, baseType: !632, size: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1098, file: !949, line: 609, baseType: !1103, size: 64, offset: 384)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1104, line: 46, baseType: !686)
!1104 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1098, file: !949, line: 612, baseType: !1106, size: 64, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !949, line: 581, size: 320, elements: !1108)
!1108 = !{!1109, !1110, !1111, !1112, !1113}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1107, file: !949, line: 583, baseType: !134, size: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1107, file: !949, line: 586, baseType: !632, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1107, file: !949, line: 589, baseType: !632, size: 64, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1107, file: !949, line: 592, baseType: !632, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1107, file: !949, line: 595, baseType: !632, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1098, file: !949, line: 616, baseType: !946, size: 64, offset: 512)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !959, file: !949, line: 754, baseType: !1116, size: 512)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !949, line: 622, size: 512, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1121}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1116, file: !949, line: 624, baseType: !1024, size: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1116, file: !949, line: 628, baseType: !632, size: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1116, file: !949, line: 632, baseType: !632, size: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1116, file: !949, line: 636, baseType: !632, size: 64, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !959, file: !949, line: 755, baseType: !1123, size: 704)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !949, line: 642, size: 704, elements: !1124)
!1124 = !{!1125, !1126, !1127, !1128}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1123, file: !949, line: 644, baseType: !1116, size: 512)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1123, file: !949, line: 648, baseType: !632, size: 64, offset: 512)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1123, file: !949, line: 652, baseType: !632, size: 64, offset: 576)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1123, file: !949, line: 653, baseType: !632, size: 64, offset: 640)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !959, file: !949, line: 756, baseType: !1130, size: 448)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !949, line: 663, size: 448, elements: !1131)
!1131 = !{!1132, !1133, !1134}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1130, file: !949, line: 665, baseType: !1024, size: 320)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1130, file: !949, line: 668, baseType: !632, size: 64, offset: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1130, file: !949, line: 673, baseType: !632, size: 64, offset: 384)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !959, file: !949, line: 757, baseType: !1136, size: 384)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !949, line: 694, size: 384, elements: !1137)
!1137 = !{!1138, !1139}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1136, file: !949, line: 696, baseType: !1024, size: 320)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1136, file: !949, line: 699, baseType: !632, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !959, file: !949, line: 758, baseType: !1141, size: 384)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !949, line: 681, size: 384, elements: !1142)
!1142 = !{!1143, !1144, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1141, file: !949, line: 683, baseType: !962, size: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1141, file: !949, line: 686, baseType: !632, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1141, file: !949, line: 689, baseType: !632, size: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !959, file: !949, line: 759, baseType: !1147, size: 384)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !949, line: 707, size: 384, elements: !1148)
!1148 = !{!1149, !1150, !1151}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1147, file: !949, line: 709, baseType: !962, size: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1147, file: !949, line: 712, baseType: !632, size: 64, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1147, file: !949, line: 712, baseType: !632, size: 64, offset: 320)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !959, file: !949, line: 760, baseType: !1153, size: 320)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !949, line: 718, size: 320, elements: !1154)
!1154 = !{!1155, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1153, file: !949, line: 720, baseType: !962, size: 256)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1153, file: !949, line: 723, baseType: !632, size: 64, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !954, file: !949, line: 138, baseType: !953, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !954, file: !949, line: 139, baseType: !953, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !948, file: !949, line: 146, baseType: !952, size: 64, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !948, file: !949, line: 152, baseType: !946, size: 64, offset: 128)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !943, file: !350, line: 130, baseType: !807, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !938, file: !350, line: 134, baseType: !629, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !938, file: !350, line: 137, baseType: !632, size: 64, offset: 256)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !938, file: !350, line: 138, baseType: !757, size: 32, offset: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !938, file: !350, line: 142, baseType: !7, size: 32, offset: 352)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !938, file: !350, line: 144, baseType: !625, size: 32, offset: 384)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !938, file: !350, line: 145, baseType: !625, size: 32, offset: 416)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !938, file: !350, line: 146, baseType: !1169, size: 64, offset: 448)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !350, line: 119, baseType: !688)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !921, file: !350, line: 220, baseType: !924, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !921, file: !350, line: 223, baseType: !629, size: 64, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !921, file: !350, line: 226, baseType: !1173, size: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1174, size: 64)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1185, !1186, !1187, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1218, !1226, !1227}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1174, file: !330, line: 102, baseType: !625, size: 32)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1174, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1174, file: !330, line: 108, baseType: !920, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1174, file: !330, line: 111, baseType: !920, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1174, file: !330, line: 114, baseType: !1181, size: 64, offset: 192)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1182)
!1182 = !{!1183, !1184}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1181, file: !330, line: 42, baseType: !329, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1181, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1174, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1174, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1174, file: !330, line: 123, baseType: !1188, size: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1191)
!1191 = !{!1192}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1190, file: !330, line: 87, baseType: !1193, size: 128)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1195)
!1195 = !{!1196, !1197, !1198}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1194, file: !330, line: 85, baseType: !7, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1194, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1194, file: !330, line: 85, baseType: !1199, size: 64, offset: 64)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 64, elements: !731)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1173)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1174, file: !330, line: 126, baseType: !1173, size: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1174, file: !330, line: 129, baseType: !1173, size: 64, offset: 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1174, file: !330, line: 132, baseType: !629, size: 64, offset: 512)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1174, file: !330, line: 139, baseType: !632, size: 64, offset: 576)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1174, file: !330, line: 143, baseType: !681, size: 128, offset: 640)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1174, file: !330, line: 146, baseType: !681, size: 128, offset: 768)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1174, file: !330, line: 148, baseType: !624, size: 8, offset: 896)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1174, file: !330, line: 149, baseType: !624, size: 8, offset: 904)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1174, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1174, file: !330, line: 156, baseType: !1211, size: 64, offset: 960)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1213)
!1213 = !{!1214, !1215, !1216, !1217}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1212, file: !330, line: 50, baseType: !957, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1212, file: !330, line: 59, baseType: !681, size: 128, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1212, file: !330, line: 64, baseType: !624, size: 8, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1212, file: !330, line: 67, baseType: !1211, size: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1174, file: !330, line: 159, baseType: !1219, size: 64, offset: 1024)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1221)
!1221 = !{!1222, !1223, !1224, !1225}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1220, file: !330, line: 74, baseType: !937, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1220, file: !330, line: 77, baseType: !1219, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1220, file: !330, line: 78, baseType: !1219, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1220, file: !330, line: 81, baseType: !1219, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1174, file: !330, line: 162, baseType: !624, size: 8, offset: 1088)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1174, file: !330, line: 166, baseType: !632, size: 64, offset: 1152)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !921, file: !350, line: 229, baseType: !1229, size: 128, offset: 256)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1230, size: 128, elements: !875)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !350, line: 229, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !921, file: !350, line: 232, baseType: !920, size: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !921, file: !350, line: 233, baseType: !920, size: 64, offset: 448)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !921, file: !350, line: 238, baseType: !1235, size: 64, offset: 512)
!1235 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !350, line: 235, size: 64, elements: !1236)
!1236 = !{!1237, !1243}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1235, file: !350, line: 236, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !350, line: 273, size: 128, elements: !1240)
!1240 = !{!1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1239, file: !350, line: 275, baseType: !946, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1239, file: !350, line: 278, baseType: !946, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1235, file: !350, line: 237, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !350, line: 259, size: 320, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1251}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1245, file: !350, line: 261, baseType: !807, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1245, file: !350, line: 262, baseType: !807, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1245, file: !350, line: 266, baseType: !807, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1245, file: !350, line: 267, baseType: !807, size: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1245, file: !350, line: 270, baseType: !625, size: 32, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !921, file: !350, line: 241, baseType: !1169, size: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !921, file: !350, line: 244, baseType: !625, size: 32, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !921, file: !350, line: 247, baseType: !625, size: 32, offset: 672)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !921, file: !350, line: 250, baseType: !625, size: 32, offset: 704)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !921, file: !350, line: 253, baseType: !625, size: 32, offset: 736)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !921, file: !350, line: 256, baseType: !625, size: 32, offset: 768)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !828, file: !810, line: 179, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !810, line: 150, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !810, line: 142, size: 320, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1269, !1270}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1261, file: !810, line: 144, baseType: !632, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1261, file: !810, line: 145, baseType: !807, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1261, file: !810, line: 146, baseType: !807, size: 64, offset: 128)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1261, file: !810, line: 147, baseType: !1267, size: 32, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1268, line: 31, baseType: !625)
!1268 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1261, file: !810, line: 148, baseType: !7, size: 32, offset: 224)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1261, file: !810, line: 149, baseType: !624, size: 8, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !828, file: !810, line: 180, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !810, line: 162, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !810, line: 159, size: 128, elements: !1275)
!1275 = !{!1276, !1277}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1274, file: !810, line: 160, baseType: !632, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1274, file: !810, line: 161, baseType: !688, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !828, file: !810, line: 181, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !810, line: 181, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !823, file: !810, line: 317, baseType: !1282, size: 64)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 64, elements: !731)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !823, file: !810, line: 318, baseType: !1284, size: 320)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !810, line: 188, size: 320, elements: !1285)
!1285 = !{!1286, !1288, !1345}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1284, file: !810, line: 190, baseType: !1287, size: 192)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 192, elements: !706)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1284, file: !810, line: 193, baseType: !1289, size: 64, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !810, line: 206, size: 320, elements: !1291)
!1291 = !{!1292, !1330, !1331, !1332, !1344}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1290, file: !810, line: 208, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !633, line: 62, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1296, line: 538, size: 256, elements: !1297)
!1296 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1297 = !{!1298, !1302, !1308, !1321}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1295, file: !1296, line: 539, baseType: !1299, size: 32)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1296, line: 482, size: 32, elements: !1300)
!1300 = !{!1301}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1299, file: !1296, line: 484, baseType: !7, size: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1295, file: !1296, line: 540, baseType: !1303, size: 192)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1296, line: 488, size: 192, elements: !1304)
!1304 = !{!1305, !1306, !1307}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1303, file: !1296, line: 489, baseType: !1299, size: 32)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1303, file: !1296, line: 492, baseType: !630, size: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1303, file: !1296, line: 496, baseType: !632, size: 64, offset: 128)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1295, file: !1296, line: 541, baseType: !1309, size: 256)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1296, line: 504, size: 256, elements: !1310)
!1310 = !{!1311, !1312, !1319, !1320}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1309, file: !1296, line: 505, baseType: !1299, size: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1309, file: !1296, line: 509, baseType: !1313, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1296, line: 501, baseType: !1314)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DISubroutineType(types: !1316)
!1316 = !{null, !1317}
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1309, file: !1296, line: 510, baseType: !1317, size: 64, offset: 128)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1309, file: !1296, line: 513, baseType: !1293, size: 64, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1295, file: !1296, line: 542, baseType: !1322, size: 128)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1296, line: 530, size: 128, elements: !1323)
!1323 = !{!1324, !1325}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1322, file: !1296, line: 531, baseType: !1299, size: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1322, file: !1296, line: 534, baseType: !1326, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1296, line: 525, baseType: !1327)
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DISubroutineType(types: !1329)
!1329 = !{!624, !632, !630, !686, !686}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1290, file: !810, line: 211, baseType: !7, size: 32, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1290, file: !810, line: 214, baseType: !688, size: 64, offset: 128)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1290, file: !810, line: 224, baseType: !1333, size: 64, offset: 192)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !810, line: 202, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !810, line: 202, size: 128, elements: !1336)
!1336 = !{!1337}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1335, file: !810, line: 202, baseType: !1338, size: 128)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !810, line: 200, baseType: !1339)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !810, line: 200, size: 128, elements: !1340)
!1340 = !{!1341, !1342, !1343}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1339, file: !810, line: 200, baseType: !7, size: 32)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1339, file: !810, line: 200, baseType: !7, size: 32, offset: 32)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1339, file: !810, line: 200, baseType: !841, size: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1290, file: !810, line: 234, baseType: !1333, size: 64, offset: 256)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1284, file: !810, line: 197, baseType: !688, size: 64, offset: 256)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !823, file: !810, line: 319, baseType: !695, size: 256)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !823, file: !810, line: 320, baseType: !714, size: 192)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !635, file: !135, line: 3384, baseType: !1349, size: 1472)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1350)
!1350 = !{!1351, !1372, !1373, !1374, !1375}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1349, file: !135, line: 3115, baseType: !1352, size: 1216)
!1352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1353)
!1353 = !{!1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371}
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1352, file: !135, line: 2985, baseType: !803, size: 960)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1352, file: !135, line: 2986, baseType: !632, size: 64, offset: 960)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1352, file: !135, line: 2987, baseType: !632, size: 64, offset: 1024)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1352, file: !135, line: 2988, baseType: !632, size: 64, offset: 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1352, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1352, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1352, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1352, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1352, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1352, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1352, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1352, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1352, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1352, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1352, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1352, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1352, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1352, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1349, file: !135, line: 3117, baseType: !632, size: 64, offset: 1216)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1349, file: !135, line: 3119, baseType: !632, size: 64, offset: 1280)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1349, file: !135, line: 3121, baseType: !632, size: 64, offset: 1344)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1349, file: !135, line: 3123, baseType: !632, size: 64, offset: 1408)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !635, file: !135, line: 3385, baseType: !1377, size: 1088)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1378)
!1378 = !{!1379, !1380, !1381}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1377, file: !135, line: 2875, baseType: !803, size: 960)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1377, file: !135, line: 2876, baseType: !807, size: 64, offset: 960)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1377, file: !135, line: 2877, baseType: !1382, size: 64, offset: 1024)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1384, line: 172, size: 128, elements: !1385)
!1384 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1385 = !{!1386, !1387, !1388, !1389, !1390, !1391, !1392}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1383, file: !1384, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1383, file: !1384, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1383, file: !1384, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1383, file: !1384, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1383, file: !1384, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1383, file: !1384, line: 195, baseType: !7, size: 32, offset: 32)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1383, file: !1384, line: 199, baseType: !632, size: 64, offset: 64)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !635, file: !135, line: 3386, baseType: !1352, size: 1216)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !635, file: !135, line: 3387, baseType: !1395, size: 1280)
!1395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1396)
!1396 = !{!1397, !1398}
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1395, file: !135, line: 3094, baseType: !1352, size: 1216)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1395, file: !135, line: 3095, baseType: !1382, size: 64, offset: 1216)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !635, file: !135, line: 3388, baseType: !1400, size: 1216)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1401)
!1401 = !{!1402, !1403, !1404, !1405, !1406, !1407}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1400, file: !135, line: 2825, baseType: !765, size: 896)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1400, file: !135, line: 2827, baseType: !632, size: 64, offset: 896)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1400, file: !135, line: 2828, baseType: !632, size: 64, offset: 960)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1400, file: !135, line: 2829, baseType: !632, size: 64, offset: 1024)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1400, file: !135, line: 2830, baseType: !632, size: 64, offset: 1088)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1400, file: !135, line: 2831, baseType: !632, size: 64, offset: 1152)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !635, file: !135, line: 3389, baseType: !1409, size: 1024)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1410)
!1410 = !{!1411, !1412, !1413}
