; ModuleID = 'plugin.bc'
source_filename = "plugin.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.callback_info = type { i8*, void (i8*, i8*)*, i8*, %struct.callback_info* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.plugin_name_args = type { i8*, i8*, i32, %struct.plugin_argument*, i8*, i8* }
%struct.plugin_argument = type { i8*, i8* }
%struct.register_pass_info = type { %struct.opt_pass*, i8*, i32, i32 }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }

!135 = !DIEnumerator(name: "TV_OVERLOAD", value: 114, isUnsigned: true)
!136 = !DIEnumerator(name: "TV_TEMPLATE_INSTANTIATION", value: 115, isUnsigned: true)
!137 = !DIEnumerator(name: "TV_EXPAND", value: 116, isUnsigned: true)
!138 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!139 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!140 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!141 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!142 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!143 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!144 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!145 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!146 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!147 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!148 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!149 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!150 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!151 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!152 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!153 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!154 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!155 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!156 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!157 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!158 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!159 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!160 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!161 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!162 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!163 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!164 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!165 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!166 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!167 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!168 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!169 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!170 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!171 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!172 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!173 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!174 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!175 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!176 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!177 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!178 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!179 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!180 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!181 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!182 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!183 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!184 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!185 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!186 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!187 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!188 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!189 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!190 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!191 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!192 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!193 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!194 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pass_positioning_ops", file: !12, line: 319, baseType: !7, size: 32, elements: !195)
!195 = !{!196, !197, !198}
!196 = !DIEnumerator(name: "PASS_POS_INSERT_AFTER", value: 0, isUnsigned: true)
!197 = !DIEnumerator(name: "PASS_POS_INSERT_BEFORE", value: 1, isUnsigned: true)
!198 = !DIEnumerator(name: "PASS_POS_REPLACE", value: 2, isUnsigned: true)
!199 = !{!200, !201, !202, !203, !206, !207, !209, !204, !217, !224, !225, !237, !267, !272, !289, !226, !344, !346, !348}
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!201 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!202 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!208 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !205)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !210, size: 64)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_name_args", file: !211, line: 69, size: 384, elements: !212)
!211 = !DIFile(filename: "./gcc-plugin.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!212 = !{!213, !214, !215, !216, !222, !223}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "base_name", scope: !210, file: !211, line: 71, baseType: !204, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "full_name", scope: !210, file: !211, line: 73, baseType: !207, size: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "argc", scope: !210, file: !211, line: 75, baseType: !202, size: 32, offset: 128)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "argv", scope: !210, file: !211, line: 77, baseType: !217, size: 64, offset: 192)
!217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !218, size: 64)
!218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_argument", file: !211, line: 43, size: 128, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !218, file: !211, line: 45, baseType: !204, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !218, file: !211, line: 46, baseType: !204, size: 64, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !210, file: !211, line: 78, baseType: !207, size: 64, offset: 256)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !210, file: !211, line: 79, baseType: !207, size: 64, offset: 320)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "callback_info", file: !3, line: 77, size: 256, elements: !228)
!228 = !{!229, !230, !235, !236}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "plugin_name", scope: !227, file: !3, line: 79, baseType: !207, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !227, file: !3, line: 80, baseType: !231, size: 64, offset: 64)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "plugin_callback_func", file: !211, line: 115, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !206, !206}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "user_data", scope: !227, file: !3, line: 81, baseType: !206, size: 64, offset: 128)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !227, file: !3, line: 82, baseType: !226, size: 64, offset: 192)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "register_pass_info", file: !12, line: 326, size: 192, elements: !239)
!239 = !{!240, !264, !265, !266}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !238, file: !12, line: 328, baseType: !241, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opt_pass", file: !12, line: 114, size: 640, elements: !243)
!243 = !{!244, !245, !246, !250, !254, !255, !256, !257, !259, !260, !261, !262, !263}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !242, file: !12, line: 117, baseType: !11, size: 32)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !242, file: !12, line: 121, baseType: !207, size: 64, offset: 64)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gate", scope: !242, file: !12, line: 125, baseType: !247, size: 64, offset: 128)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DISubroutineType(types: !249)
!249 = !{!201}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !242, file: !12, line: 130, baseType: !251, size: 64, offset: 192)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = !DISubroutineType(types: !253)
!253 = !{!7}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !242, file: !12, line: 133, baseType: !241, size: 64, offset: 256)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !242, file: !12, line: 136, baseType: !241, size: 64, offset: 320)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "static_pass_number", scope: !242, file: !12, line: 139, baseType: !202, size: 32, offset: 384)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tv_id", scope: !242, file: !12, line: 143, baseType: !258, size: 32, offset: 416)
!258 = !DIDerivedType(tag: DW_TAG_typedef, name: "timevar_id_t", file: !19, line: 80, baseType: !18)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "properties_required", scope: !242, file: !12, line: 146, baseType: !7, size: 32, offset: 448)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "properties_provided", scope: !242, file: !12, line: 147, baseType: !7, size: 32, offset: 480)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "properties_destroyed", scope: !242, file: !12, line: 148, baseType: !7, size: 32, offset: 512)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_start", scope: !242, file: !12, line: 151, baseType: !7, size: 32, offset: 544)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_finish", scope: !242, file: !12, line: 152, baseType: !7, size: 32, offset: 576)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "reference_pass_name", scope: !238, file: !12, line: 329, baseType: !207, size: 64, offset: 64)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "ref_pass_instance_number", scope: !238, file: !12, line: 331, baseType: !202, size: 32, offset: 128)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "pos_op", scope: !238, file: !12, line: 334, baseType: !194, size: 32, offset: 160)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "plugin_info", file: !211, line: 51, size: 128, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !268, file: !211, line: 53, baseType: !207, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "help", scope: !268, file: !211, line: 54, baseType: !207, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !274)
!274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_root_tab", file: !275, line: 69, size: 320, elements: !276)
!275 = !DIFile(filename: "./ggc.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!276 = !{!277, !278, !282, !283, !288}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !274, file: !275, line: 70, baseType: !206, size: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "nelt", scope: !274, file: !275, line: 71, baseType: !279, size: 64, offset: 64)
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !280, line: 46, baseType: !281)
!280 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!281 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !274, file: !275, line: 72, baseType: !279, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !274, file: !275, line: 73, baseType: !284, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_typedef, name: "gt_pointer_walker", file: !275, line: 65, baseType: !285)
!285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !286, size: 64)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !206}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pchw", scope: !274, file: !275, line: 74, baseType: !284, size: 64, offset: 256)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !291)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_cache_tab", file: !275, line: 85, size: 384, elements: !292)
!292 = !{!293, !336, !337, !338, !339, !340}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !291, file: !275, line: 86, baseType: !294, size: 64)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !6, line: 100, size: 896, elements: !297)
!297 = !{!298, !306, !311, !313, !315, !316, !317, !318, !319, !320, !325, !327, !328, !333, !335}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !296, file: !6, line: 102, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !6, line: 52, baseType: !300)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DISubroutineType(types: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !6, line: 47, baseType: !7)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !296, file: !6, line: 105, baseType: !307, size: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !6, line: 59, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DISubroutineType(types: !310)
!310 = !{!202, !304, !304}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !296, file: !6, line: 108, baseType: !312, size: 64, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !6, line: 63, baseType: !285)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !296, file: !6, line: 111, baseType: !314, size: 64, offset: 192)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !296, file: !6, line: 114, baseType: !279, size: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !296, file: !6, line: 117, baseType: !279, size: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !296, file: !6, line: 120, baseType: !279, size: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !296, file: !6, line: 124, baseType: !7, size: 32, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !296, file: !6, line: 128, baseType: !7, size: 32, offset: 480)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !296, file: !6, line: 131, baseType: !321, size: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !6, line: 75, baseType: !322)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!323 = !DISubroutineType(types: !324)
!324 = !{!206, !279, !279}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !296, file: !6, line: 132, baseType: !326, size: 64, offset: 576)
!326 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !6, line: 78, baseType: !285)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !296, file: !6, line: 135, baseType: !206, size: 64, offset: 640)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !296, file: !6, line: 136, baseType: !329, size: 64, offset: 704)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !6, line: 82, baseType: !330)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DISubroutineType(types: !332)
!332 = !{!206, !206, !279, !279}
!333 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !296, file: !6, line: 137, baseType: !334, size: 64, offset: 768)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !6, line: 83, baseType: !232)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !296, file: !6, line: 141, baseType: !7, size: 32, offset: 832)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "nelt", scope: !291, file: !275, line: 87, baseType: !279, size: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !291, file: !275, line: 88, baseType: !279, size: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !291, file: !275, line: 89, baseType: !284, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "pchw", scope: !291, file: !275, line: 90, baseType: !284, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "marked_p", scope: !291, file: !275, line: 91, baseType: !341, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!202, !304}
!344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !210)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "print_options", file: !3, line: 659, size: 128, elements: !350)
!350 = !{!351, !408}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !349, file: !3, line: 661, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !354, line: 7, baseType: !355)
!354 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !356, line: 49, size: 1728, elements: !357)
!356 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !373, !375, !376, !377, !381, !383, !385, !389, !392, !394, !397, !400, !401, !402, !403, !404}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !355, file: !356, line: 51, baseType: !202, size: 32)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !355, file: !356, line: 54, baseType: !204, size: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !355, file: !356, line: 55, baseType: !204, size: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !355, file: !356, line: 56, baseType: !204, size: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !355, file: !356, line: 57, baseType: !204, size: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !355, file: !356, line: 58, baseType: !204, size: 64, offset: 320)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !355, file: !356, line: 59, baseType: !204, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !355, file: !356, line: 60, baseType: !204, size: 64, offset: 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !355, file: !356, line: 61, baseType: !204, size: 64, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !355, file: !356, line: 64, baseType: !204, size: 64, offset: 576)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !355, file: !356, line: 65, baseType: !204, size: 64, offset: 640)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !355, file: !356, line: 66, baseType: !204, size: 64, offset: 704)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !355, file: !356, line: 68, baseType: !371, size: 64, offset: 768)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !356, line: 36, flags: DIFlagFwdDecl)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !355, file: !356, line: 70, baseType: !374, size: 64, offset: 832)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !355, file: !356, line: 72, baseType: !202, size: 32, offset: 896)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !355, file: !356, line: 73, baseType: !202, size: 32, offset: 928)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !355, file: !356, line: 74, baseType: !378, size: 64, offset: 960)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !379, line: 152, baseType: !380)
!379 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!380 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !355, file: !356, line: 77, baseType: !382, size: 16, offset: 1024)
!382 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !355, file: !356, line: 78, baseType: !384, size: 8, offset: 1040)
!384 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !355, file: !356, line: 79, baseType: !386, size: 8, offset: 1048)
!386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 8, elements: !387)
!387 = !{!388}
!388 = !DISubrange(count: 1)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !355, file: !356, line: 81, baseType: !390, size: 64, offset: 1088)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !356, line: 43, baseType: null)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !355, file: !356, line: 89, baseType: !393, size: 64, offset: 1152)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !379, line: 153, baseType: !380)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !355, file: !356, line: 91, baseType: !395, size: 64, offset: 1216)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !356, line: 37, flags: DIFlagFwdDecl)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !355, file: !356, line: 92, baseType: !398, size: 64, offset: 1280)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !356, line: 38, flags: DIFlagFwdDecl)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !355, file: !356, line: 93, baseType: !374, size: 64, offset: 1344)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !355, file: !356, line: 94, baseType: !206, size: 64, offset: 1408)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !355, file: !356, line: 95, baseType: !279, size: 64, offset: 1472)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !355, file: !356, line: 96, baseType: !202, size: 32, offset: 1536)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !355, file: !356, line: 98, baseType: !405, size: 160, offset: 1568)
!405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 160, elements: !406)
!406 = !{!407}
!407 = !DISubrange(count: 20)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "indent", scope: !349, file: !3, line: 662, baseType: !207, size: 64, offset: 64)
!409 = !{!410, !412, !415, !0, !420, !422, !424, !426}
!410 = !DIGlobalVariableExpression(var: !411, expr: !DIExpression())
!411 = distinct !DIGlobalVariable(name: "plugin_event_name", scope: !2, file: !3, line: 61, type: !224, isLocal: false, isDefinition: true)
!412 = !DIGlobalVariableExpression(var: !413, expr: !DIExpression())
!413 = distinct !DIGlobalVariable(name: "event_tab", scope: !2, file: !3, line: 65, type: !414, isLocal: true, isDefinition: true)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !6, line: 144, baseType: !295)
!415 = !DIGlobalVariableExpression(var: !416, expr: !DIExpression())
!416 = distinct !DIGlobalVariable(name: "plugin_callbacks_init", scope: !2, file: !3, line: 86, type: !417, isLocal: true, isDefinition: true)
!417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, size: 1472, elements: !418)
!418 = !{!419}
!419 = !DISubrange(count: 23)
!420 = !DIGlobalVariableExpression(var: !421, expr: !DIExpression())
!421 = distinct !DIGlobalVariable(name: "plugin_name_args_tab", scope: !2, file: !3, line: 74, type: !414, isLocal: true, isDefinition: true)
!422 = !DIGlobalVariableExpression(var: !423, expr: !DIExpression())
!423 = distinct !DIGlobalVariable(name: "event_last", scope: !2, file: !3, line: 69, type: !202, isLocal: true, isDefinition: true)
!424 = !DIGlobalVariableExpression(var: !425, expr: !DIExpression())
!425 = distinct !DIGlobalVariable(name: "event_horizon", scope: !2, file: !3, line: 70, type: !202, isLocal: true, isDefinition: true)
!426 = !DIGlobalVariableExpression(var: !427, expr: !DIExpression())
!427 = distinct !DIGlobalVariable(name: "plugin_callbacks", scope: !2, file: !3, line: 87, type: !225, isLocal: true, isDefinition: true)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 1472, elements: !418)
!429 = !{i32 2, !"Dwarf Version", i32 4}
!430 = !{i32 2, !"Debug Info Version", i32 3}
!431 = !{i32 1, !"wchar_size", i32 4}
!432 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!433 = distinct !DISubprogram(name: "vprintf", scope: !434, file: !434, line: 39, type: !435, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !445)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!435 = !DISubroutineType(types: !436)
!436 = !{!202, !437, !438}
!437 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !207)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !440)
!440 = !{!441, !442, !443, !444}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !439, file: !3, baseType: !7, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !439, file: !3, baseType: !7, size: 32, offset: 32)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !439, file: !3, baseType: !206, size: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !439, file: !3, baseType: !206, size: 64, offset: 128)
!445 = !{!446, !447}
!446 = !DILocalVariable(name: "__fmt", arg: 1, scope: !433, file: !434, line: 39, type: !437)
!447 = !DILocalVariable(name: "__arg", arg: 2, scope: !433, file: !434, line: 39, type: !438)
!448 = !DILocation(line: 0, scope: !433)
!449 = !DILocation(line: 41, column: 20, scope: !433)
!450 = !DILocation(line: 41, column: 10, scope: !433)
!451 = !DILocation(line: 41, column: 3, scope: !433)
!452 = distinct !DISubprogram(name: "getchar", scope: !434, file: !434, line: 47, type: !453, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!453 = !DISubroutineType(types: !454)
!454 = !{!202}
!455 = !{}
!456 = !DILocation(line: 49, column: 16, scope: !452)
!457 = !DILocation(line: 49, column: 10, scope: !452)
!458 = !DILocation(line: 49, column: 3, scope: !452)
!459 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !434, file: !434, line: 56, type: !460, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !462)
!460 = !DISubroutineType(types: !461)
!461 = !{!202, !352}
!462 = !{!463}
!463 = !DILocalVariable(name: "__fp", arg: 1, scope: !459, file: !434, line: 56, type: !352)
!464 = !DILocation(line: 0, scope: !459)
!465 = !DILocation(line: 58, column: 10, scope: !459)
!466 = !DILocation(line: 58, column: 3, scope: !459)
!467 = distinct !DISubprogram(name: "getc_unlocked", scope: !434, file: !434, line: 66, type: !460, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !468)
!468 = !{!469}
!469 = !DILocalVariable(name: "__fp", arg: 1, scope: !467, file: !434, line: 66, type: !352)
!470 = !DILocation(line: 0, scope: !467)
!471 = !DILocation(line: 68, column: 10, scope: !467)
!472 = !DILocation(line: 68, column: 3, scope: !467)
!473 = distinct !DISubprogram(name: "getchar_unlocked", scope: !434, file: !434, line: 73, type: !453, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!474 = !DILocation(line: 75, column: 10, scope: !473)
!475 = !DILocation(line: 75, column: 3, scope: !473)
!476 = distinct !DISubprogram(name: "putchar", scope: !434, file: !434, line: 82, type: !477, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !479)
!477 = !DISubroutineType(types: !478)
!478 = !{!202, !202}
!479 = !{!480}
!480 = !DILocalVariable(name: "__c", arg: 1, scope: !476, file: !434, line: 82, type: !202)
!481 = !DILocation(line: 0, scope: !476)
!482 = !DILocation(line: 84, column: 21, scope: !476)
!483 = !DILocation(line: 84, column: 10, scope: !476)
!484 = !DILocation(line: 84, column: 3, scope: !476)
!485 = distinct !DISubprogram(name: "fputc_unlocked", scope: !434, file: !434, line: 91, type: !486, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !488)
!486 = !DISubroutineType(types: !487)
!487 = !{!202, !202, !352}
!488 = !{!489, !490}
!489 = !DILocalVariable(name: "__c", arg: 1, scope: !485, file: !434, line: 91, type: !202)
!490 = !DILocalVariable(name: "__stream", arg: 2, scope: !485, file: !434, line: 91, type: !352)
!491 = !DILocation(line: 0, scope: !485)
!492 = !DILocation(line: 93, column: 10, scope: !485)
!493 = !DILocation(line: 93, column: 3, scope: !485)
!494 = distinct !DISubprogram(name: "putc_unlocked", scope: !434, file: !434, line: 101, type: !486, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !495)
!495 = !{!496, !497}
!496 = !DILocalVariable(name: "__c", arg: 1, scope: !494, file: !434, line: 101, type: !202)
!497 = !DILocalVariable(name: "__stream", arg: 2, scope: !494, file: !434, line: 101, type: !352)
!498 = !DILocation(line: 0, scope: !494)
!499 = !DILocation(line: 103, column: 10, scope: !494)
!500 = !DILocation(line: 103, column: 3, scope: !494)
!501 = distinct !DISubprogram(name: "putchar_unlocked", scope: !434, file: !434, line: 108, type: !477, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !502)
!502 = !{!503}
!503 = !DILocalVariable(name: "__c", arg: 1, scope: !501, file: !434, line: 108, type: !202)
!504 = !DILocation(line: 0, scope: !501)
!505 = !DILocation(line: 110, column: 10, scope: !501)
!506 = !DILocation(line: 110, column: 3, scope: !501)
!507 = distinct !DISubprogram(name: "getline", scope: !434, file: !434, line: 118, type: !508, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !512)
!508 = !DISubroutineType(types: !509)
!509 = !{!510, !203, !511, !352}
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !379, line: 193, baseType: !380)
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64)
!512 = !{!513, !514, !515}
!513 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !507, file: !434, line: 118, type: !203)
!514 = !DILocalVariable(name: "__n", arg: 2, scope: !507, file: !434, line: 118, type: !511)
!515 = !DILocalVariable(name: "__stream", arg: 3, scope: !507, file: !434, line: 118, type: !352)
!516 = !DILocation(line: 0, scope: !507)
!517 = !DILocation(line: 120, column: 10, scope: !507)
!518 = !DILocation(line: 120, column: 3, scope: !507)
!519 = distinct !DISubprogram(name: "feof_unlocked", scope: !434, file: !434, line: 128, type: !460, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !520)
!520 = !{!521}
!521 = !DILocalVariable(name: "__stream", arg: 1, scope: !519, file: !434, line: 128, type: !352)
!522 = !DILocation(line: 0, scope: !519)
!523 = !DILocation(line: 130, column: 10, scope: !519)
!524 = !DILocation(line: 130, column: 3, scope: !519)
!525 = distinct !DISubprogram(name: "ferror_unlocked", scope: !434, file: !434, line: 135, type: !460, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !526)
!526 = !{!527}
!527 = !DILocalVariable(name: "__stream", arg: 1, scope: !525, file: !434, line: 135, type: !352)
!528 = !DILocation(line: 0, scope: !525)
!529 = !DILocation(line: 137, column: 10, scope: !525)
!530 = !DILocation(line: 137, column: 3, scope: !525)
!531 = distinct !DISubprogram(name: "tolower", scope: !532, file: !532, line: 207, type: !477, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !533)
!532 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!533 = !{!534}
!534 = !DILocalVariable(name: "__c", arg: 1, scope: !531, file: !532, line: 207, type: !202)
!535 = !DILocation(line: 0, scope: !531)
!536 = !DILocation(line: 209, column: 22, scope: !531)
!537 = !DILocation(line: 209, column: 39, scope: !531)
!538 = !DILocation(line: 209, column: 38, scope: !531)
!539 = !DILocation(line: 209, column: 37, scope: !531)
!540 = !DILocation(line: 209, column: 10, scope: !531)
!541 = !DILocation(line: 209, column: 3, scope: !531)
!542 = distinct !DISubprogram(name: "toupper", scope: !532, file: !532, line: 213, type: !477, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !543)
!543 = !{!544}
!544 = !DILocalVariable(name: "__c", arg: 1, scope: !542, file: !532, line: 213, type: !202)
!545 = !DILocation(line: 0, scope: !542)
!546 = !DILocation(line: 215, column: 22, scope: !542)
!547 = !DILocation(line: 215, column: 39, scope: !542)
!548 = !DILocation(line: 215, column: 38, scope: !542)
!549 = !DILocation(line: 215, column: 37, scope: !542)
!550 = !DILocation(line: 215, column: 10, scope: !542)
!551 = !DILocation(line: 215, column: 3, scope: !542)
!552 = distinct !DISubprogram(name: "atoi", scope: !553, file: !553, line: 361, type: !554, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !556)
!553 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!554 = !DISubroutineType(types: !555)
!555 = !{!202, !207}
!556 = !{!557}
!557 = !DILocalVariable(name: "__nptr", arg: 1, scope: !552, file: !553, line: 361, type: !207)
!558 = !DILocation(line: 0, scope: !552)
!559 = !DILocation(line: 363, column: 16, scope: !552)
!560 = !DILocation(line: 363, column: 10, scope: !552)
!561 = !DILocation(line: 363, column: 3, scope: !552)
!562 = distinct !DISubprogram(name: "atol", scope: !553, file: !553, line: 366, type: !563, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !565)
!563 = !DISubroutineType(types: !564)
!564 = !{!380, !207}
!565 = !{!566}
!566 = !DILocalVariable(name: "__nptr", arg: 1, scope: !562, file: !553, line: 366, type: !207)
!567 = !DILocation(line: 0, scope: !562)
!568 = !DILocation(line: 368, column: 10, scope: !562)
!569 = !DILocation(line: 368, column: 3, scope: !562)
!570 = distinct !DISubprogram(name: "atoll", scope: !553, file: !553, line: 373, type: !571, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !574)
!571 = !DISubroutineType(types: !572)
!572 = !{!573, !207}
!573 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!574 = !{!575}
!575 = !DILocalVariable(name: "__nptr", arg: 1, scope: !570, file: !553, line: 373, type: !207)
!576 = !DILocation(line: 0, scope: !570)
!577 = !DILocation(line: 375, column: 10, scope: !570)
!578 = !DILocation(line: 375, column: 3, scope: !570)
!579 = distinct !DISubprogram(name: "bsearch", scope: !580, file: !580, line: 20, type: !581, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !584)
!580 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!581 = !DISubroutineType(types: !582)
!582 = !{!206, !304, !304, !279, !279, !583}
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !553, line: 808, baseType: !308)
!584 = !{!585, !586, !587, !588, !589, !590, !591, !592, !593, !594}
!585 = !DILocalVariable(name: "__key", arg: 1, scope: !579, file: !580, line: 20, type: !304)
!586 = !DILocalVariable(name: "__base", arg: 2, scope: !579, file: !580, line: 20, type: !304)
!587 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !579, file: !580, line: 20, type: !279)
!588 = !DILocalVariable(name: "__size", arg: 4, scope: !579, file: !580, line: 20, type: !279)
!589 = !DILocalVariable(name: "__compar", arg: 5, scope: !579, file: !580, line: 21, type: !583)
!590 = !DILocalVariable(name: "__l", scope: !579, file: !580, line: 23, type: !279)
!591 = !DILocalVariable(name: "__u", scope: !579, file: !580, line: 23, type: !279)
!592 = !DILocalVariable(name: "__idx", scope: !579, file: !580, line: 23, type: !279)
!593 = !DILocalVariable(name: "__p", scope: !579, file: !580, line: 24, type: !304)
!594 = !DILocalVariable(name: "__comparison", scope: !579, file: !580, line: 25, type: !202)
!595 = !DILocation(line: 0, scope: !579)
!596 = !DILocation(line: 29, column: 3, scope: !579)
!597 = !DILocation(line: 27, column: 7, scope: !579)
!598 = !DILocation(line: 29, column: 14, scope: !579)
!599 = !DILocation(line: 31, column: 20, scope: !600)
!600 = distinct !DILexicalBlock(scope: !579, file: !580, line: 30, column: 5)
!601 = !DILocation(line: 31, column: 27, scope: !600)
!602 = !DILocation(line: 32, column: 56, scope: !600)
!603 = !DILocation(line: 32, column: 47, scope: !600)
!604 = !DILocation(line: 33, column: 22, scope: !600)
!605 = !DILocation(line: 34, column: 24, scope: !606)
!606 = distinct !DILexicalBlock(scope: !600, file: !580, line: 34, column: 11)
!607 = !DILocation(line: 34, column: 11, scope: !600)
!608 = !DILocation(line: 36, column: 29, scope: !609)
!609 = distinct !DILexicalBlock(scope: !606, file: !580, line: 36, column: 16)
!610 = !DILocation(line: 36, column: 16, scope: !606)
!611 = !DILocation(line: 37, column: 14, scope: !609)
!612 = distinct !{!612, !596, !613}
!613 = !DILocation(line: 40, column: 5, scope: !579)
!614 = !DILocation(line: 43, column: 1, scope: !579)
!615 = distinct !DISubprogram(name: "atof", scope: !616, file: !616, line: 25, type: !617, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !620)
!616 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!617 = !DISubroutineType(types: !618)
!618 = !{!619, !207}
!619 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!620 = !{!621}
!621 = !DILocalVariable(name: "__nptr", arg: 1, scope: !615, file: !616, line: 25, type: !207)
!622 = !DILocation(line: 0, scope: !615)
!623 = !DILocation(line: 27, column: 10, scope: !615)
!624 = !DILocation(line: 27, column: 3, scope: !615)
!625 = distinct !DISubprogram(name: "strtoimax", scope: !626, file: !626, line: 324, type: !627, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !633)
!626 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!627 = !DISubroutineType(types: !628)
!628 = !{!629, !437, !632, !202}
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !630, line: 101, baseType: !631)
!630 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !379, line: 72, baseType: !380)
!632 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !203)
!633 = !{!634, !635, !636}
!634 = !DILocalVariable(name: "nptr", arg: 1, scope: !625, file: !626, line: 324, type: !437)
!635 = !DILocalVariable(name: "endptr", arg: 2, scope: !625, file: !626, line: 324, type: !632)
!636 = !DILocalVariable(name: "base", arg: 3, scope: !625, file: !626, line: 324, type: !202)
!637 = !DILocation(line: 0, scope: !625)
!638 = !DILocation(line: 327, column: 10, scope: !625)
!639 = !DILocation(line: 327, column: 3, scope: !625)
!640 = distinct !DISubprogram(name: "strtoumax", scope: !626, file: !626, line: 336, type: !641, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !645)
!641 = !DISubroutineType(types: !642)
!642 = !{!643, !437, !632, !202}
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !630, line: 102, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !379, line: 73, baseType: !281)
!645 = !{!646, !647, !648}
!646 = !DILocalVariable(name: "nptr", arg: 1, scope: !640, file: !626, line: 336, type: !437)
!647 = !DILocalVariable(name: "endptr", arg: 2, scope: !640, file: !626, line: 336, type: !632)
!648 = !DILocalVariable(name: "base", arg: 3, scope: !640, file: !626, line: 336, type: !202)
!649 = !DILocation(line: 0, scope: !640)
!650 = !DILocation(line: 339, column: 10, scope: !640)
!651 = !DILocation(line: 339, column: 3, scope: !640)
!652 = distinct !DISubprogram(name: "wcstoimax", scope: !626, file: !626, line: 348, type: !653, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !662)
!653 = !DISubroutineType(types: !654)
!654 = !{!629, !655, !659, !202}
!655 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !656)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !626, line: 34, baseType: !202)
!659 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!662 = !{!663, !664, !665}
!663 = !DILocalVariable(name: "nptr", arg: 1, scope: !652, file: !626, line: 348, type: !655)
!664 = !DILocalVariable(name: "endptr", arg: 2, scope: !652, file: !626, line: 348, type: !659)
!665 = !DILocalVariable(name: "base", arg: 3, scope: !652, file: !626, line: 348, type: !202)
!666 = !DILocation(line: 0, scope: !652)
!667 = !DILocation(line: 351, column: 10, scope: !652)
!668 = !DILocation(line: 351, column: 3, scope: !652)
!669 = distinct !DISubprogram(name: "wcstoumax", scope: !626, file: !626, line: 362, type: !670, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !672)
!670 = !DISubroutineType(types: !671)
!671 = !{!643, !655, !659, !202}
!672 = !{!673, !674, !675}
!673 = !DILocalVariable(name: "nptr", arg: 1, scope: !669, file: !626, line: 362, type: !655)
!674 = !DILocalVariable(name: "endptr", arg: 2, scope: !669, file: !626, line: 362, type: !659)
!675 = !DILocalVariable(name: "base", arg: 3, scope: !669, file: !626, line: 362, type: !202)
!676 = !DILocation(line: 0, scope: !669)
!677 = !DILocation(line: 365, column: 10, scope: !669)
!678 = !DILocation(line: 365, column: 3, scope: !669)
!679 = distinct !DISubprogram(name: "stat", scope: !680, file: !680, line: 453, type: !681, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !720)
!680 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!681 = !DISubroutineType(types: !682)
!682 = !{!202, !207, !683}
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !685, line: 46, size: 1152, elements: !686)
!685 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!686 = !{!687, !689, !691, !693, !695, !697, !699, !700, !701, !702, !704, !706, !714, !715, !716}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !684, file: !685, line: 48, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !379, line: 145, baseType: !281)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !684, file: !685, line: 53, baseType: !690, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !379, line: 148, baseType: !281)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !684, file: !685, line: 61, baseType: !692, size: 64, offset: 128)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !379, line: 151, baseType: !281)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !684, file: !685, line: 62, baseType: !694, size: 32, offset: 192)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !379, line: 150, baseType: !7)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !684, file: !685, line: 64, baseType: !696, size: 32, offset: 224)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !379, line: 146, baseType: !7)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !684, file: !685, line: 65, baseType: !698, size: 32, offset: 256)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !379, line: 147, baseType: !7)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !684, file: !685, line: 67, baseType: !202, size: 32, offset: 288)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !684, file: !685, line: 69, baseType: !688, size: 64, offset: 320)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !684, file: !685, line: 74, baseType: !378, size: 64, offset: 384)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !684, file: !685, line: 78, baseType: !703, size: 64, offset: 448)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !379, line: 174, baseType: !380)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !684, file: !685, line: 80, baseType: !705, size: 64, offset: 512)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !379, line: 179, baseType: !380)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !684, file: !685, line: 91, baseType: !707, size: 128, offset: 576)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !708, line: 10, size: 128, elements: !709)
!708 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!709 = !{!710, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !707, file: !708, line: 12, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !379, line: 160, baseType: !380)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !707, file: !708, line: 16, baseType: !713, size: 64, offset: 64)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !379, line: 196, baseType: !380)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !684, file: !685, line: 92, baseType: !707, size: 128, offset: 704)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !684, file: !685, line: 93, baseType: !707, size: 128, offset: 832)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !684, file: !685, line: 106, baseType: !717, size: 192, offset: 960)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 192, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 3)
!720 = !{!721, !722}
!721 = !DILocalVariable(name: "__path", arg: 1, scope: !679, file: !680, line: 453, type: !207)
!722 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !679, file: !680, line: 453, type: !683)
!723 = !DILocation(line: 0, scope: !679)
!724 = !DILocation(line: 455, column: 10, scope: !679)
!725 = !DILocation(line: 455, column: 3, scope: !679)
!726 = distinct !DISubprogram(name: "lstat", scope: !680, file: !680, line: 460, type: !681, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !727)
!727 = !{!728, !729}
!728 = !DILocalVariable(name: "__path", arg: 1, scope: !726, file: !680, line: 460, type: !207)
!729 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !726, file: !680, line: 460, type: !683)
!730 = !DILocation(line: 0, scope: !726)
!731 = !DILocation(line: 462, column: 10, scope: !726)
!732 = !DILocation(line: 462, column: 3, scope: !726)
!733 = distinct !DISubprogram(name: "fstat", scope: !680, file: !680, line: 467, type: !734, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !736)
!734 = !DISubroutineType(types: !735)
!735 = !{!202, !202, !683}
!736 = !{!737, !738}
!737 = !DILocalVariable(name: "__fd", arg: 1, scope: !733, file: !680, line: 467, type: !202)
!738 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !733, file: !680, line: 467, type: !683)
!739 = !DILocation(line: 0, scope: !733)
!740 = !DILocation(line: 469, column: 10, scope: !733)
!741 = !DILocation(line: 469, column: 3, scope: !733)
!742 = distinct !DISubprogram(name: "fstatat", scope: !680, file: !680, line: 474, type: !743, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !745)
!743 = !DISubroutineType(types: !744)
!744 = !{!202, !202, !207, !683, !202}
!745 = !{!746, !747, !748, !749}
!746 = !DILocalVariable(name: "__fd", arg: 1, scope: !742, file: !680, line: 474, type: !202)
!747 = !DILocalVariable(name: "__filename", arg: 2, scope: !742, file: !680, line: 474, type: !207)
!748 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !742, file: !680, line: 474, type: !683)
!749 = !DILocalVariable(name: "__flag", arg: 4, scope: !742, file: !680, line: 474, type: !202)
!750 = !DILocation(line: 0, scope: !742)
!751 = !DILocation(line: 477, column: 10, scope: !742)
!752 = !DILocation(line: 477, column: 3, scope: !742)
!753 = distinct !DISubprogram(name: "mknod", scope: !680, file: !680, line: 483, type: !754, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!202, !207, !694, !688}
!756 = !{!757, !758, !759}
!757 = !DILocalVariable(name: "__path", arg: 1, scope: !753, file: !680, line: 483, type: !207)
!758 = !DILocalVariable(name: "__mode", arg: 2, scope: !753, file: !680, line: 483, type: !694)
!759 = !DILocalVariable(name: "__dev", arg: 3, scope: !753, file: !680, line: 483, type: !688)
!760 = !DILocation(line: 0, scope: !753)
!761 = !DILocation(line: 485, column: 10, scope: !753)
!762 = !DILocation(line: 485, column: 3, scope: !753)
!763 = distinct !DISubprogram(name: "mknodat", scope: !680, file: !680, line: 491, type: !764, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{!202, !202, !207, !694, !688}
!766 = !{!767, !768, !769, !770}
!767 = !DILocalVariable(name: "__fd", arg: 1, scope: !763, file: !680, line: 491, type: !202)
!768 = !DILocalVariable(name: "__path", arg: 2, scope: !763, file: !680, line: 491, type: !207)
!769 = !DILocalVariable(name: "__mode", arg: 3, scope: !763, file: !680, line: 491, type: !694)
!770 = !DILocalVariable(name: "__dev", arg: 4, scope: !763, file: !680, line: 491, type: !688)
!771 = !DILocation(line: 0, scope: !763)
!772 = !DILocation(line: 494, column: 10, scope: !763)
!773 = !DILocation(line: 494, column: 3, scope: !763)
!774 = distinct !DISubprogram(name: "stat64", scope: !680, file: !680, line: 502, type: !775, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !797)
!775 = !DISubroutineType(types: !776)
!776 = !{!202, !207, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !685, line: 119, size: 1152, elements: !779)
!779 = !{!780, !781, !783, !784, !785, !786, !787, !788, !789, !790, !791, !793, !794, !795, !796}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !778, file: !685, line: 121, baseType: !688, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !778, file: !685, line: 123, baseType: !782, size: 64, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !379, line: 149, baseType: !281)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !778, file: !685, line: 124, baseType: !692, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !778, file: !685, line: 125, baseType: !694, size: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !778, file: !685, line: 132, baseType: !696, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !778, file: !685, line: 133, baseType: !698, size: 32, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !778, file: !685, line: 135, baseType: !202, size: 32, offset: 288)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !778, file: !685, line: 136, baseType: !688, size: 64, offset: 320)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !778, file: !685, line: 137, baseType: !378, size: 64, offset: 384)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !778, file: !685, line: 143, baseType: !703, size: 64, offset: 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !778, file: !685, line: 144, baseType: !792, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !379, line: 180, baseType: !380)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !778, file: !685, line: 152, baseType: !707, size: 128, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !778, file: !685, line: 153, baseType: !707, size: 128, offset: 704)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !778, file: !685, line: 154, baseType: !707, size: 128, offset: 832)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !778, file: !685, line: 164, baseType: !717, size: 192, offset: 960)
!797 = !{!798, !799}
!798 = !DILocalVariable(name: "__path", arg: 1, scope: !774, file: !680, line: 502, type: !207)
!799 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !774, file: !680, line: 502, type: !777)
!800 = !DILocation(line: 0, scope: !774)
!801 = !DILocation(line: 504, column: 10, scope: !774)
!802 = !DILocation(line: 504, column: 3, scope: !774)
!803 = distinct !DISubprogram(name: "lstat64", scope: !680, file: !680, line: 509, type: !775, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !804)
!804 = !{!805, !806}
!805 = !DILocalVariable(name: "__path", arg: 1, scope: !803, file: !680, line: 509, type: !207)
!806 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !803, file: !680, line: 509, type: !777)
!807 = !DILocation(line: 0, scope: !803)
!808 = !DILocation(line: 511, column: 10, scope: !803)
!809 = !DILocation(line: 511, column: 3, scope: !803)
!810 = distinct !DISubprogram(name: "fstat64", scope: !680, file: !680, line: 516, type: !811, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !813)
!811 = !DISubroutineType(types: !812)
!812 = !{!202, !202, !777}
!813 = !{!814, !815}
!814 = !DILocalVariable(name: "__fd", arg: 1, scope: !810, file: !680, line: 516, type: !202)
!815 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !810, file: !680, line: 516, type: !777)
!816 = !DILocation(line: 0, scope: !810)
!817 = !DILocation(line: 518, column: 10, scope: !810)
!818 = !DILocation(line: 518, column: 3, scope: !810)
!819 = distinct !DISubprogram(name: "fstatat64", scope: !680, file: !680, line: 523, type: !820, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !822)
!820 = !DISubroutineType(types: !821)
!821 = !{!202, !202, !207, !777, !202}
!822 = !{!823, !824, !825, !826}
!823 = !DILocalVariable(name: "__fd", arg: 1, scope: !819, file: !680, line: 523, type: !202)
!824 = !DILocalVariable(name: "__filename", arg: 2, scope: !819, file: !680, line: 523, type: !207)
!825 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !819, file: !680, line: 523, type: !777)
!826 = !DILocalVariable(name: "__flag", arg: 4, scope: !819, file: !680, line: 523, type: !202)
!827 = !DILocation(line: 0, scope: !819)
!828 = !DILocation(line: 526, column: 10, scope: !819)
!829 = !DILocation(line: 526, column: 3, scope: !819)
!830 = distinct !DISubprogram(name: "add_new_plugin", scope: !3, file: !3, line: 132, type: !831, scopeLine: 133, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !833)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !207}
!833 = !{!834, !835, !836, !837}
!834 = !DILocalVariable(name: "plugin_name", arg: 1, scope: !830, file: !3, line: 132, type: !207)
!835 = !DILocalVariable(name: "plugin", scope: !830, file: !3, line: 134, type: !209)
!836 = !DILocalVariable(name: "slot", scope: !830, file: !3, line: 135, type: !314)
!837 = !DILocalVariable(name: "base_name", scope: !830, file: !3, line: 136, type: !204)
!838 = !DILocation(line: 0, scope: !830)
!839 = !DILocation(line: 136, column: 21, scope: !830)
!840 = !DILocation(line: 140, column: 8, scope: !841)
!841 = distinct !DILexicalBlock(scope: !830, file: !3, line: 140, column: 7)
!842 = !DILocation(line: 140, column: 7, scope: !830)
!843 = !DILocation(line: 141, column: 28, scope: !841)
!844 = !DILocation(line: 141, column: 26, scope: !841)
!845 = !DILocation(line: 141, column: 5, scope: !841)
!846 = !DILocation(line: 144, column: 26, scope: !830)
!847 = !DILocation(line: 144, column: 10, scope: !830)
!848 = !DILocation(line: 149, column: 7, scope: !849)
!849 = distinct !DILexicalBlock(scope: !830, file: !3, line: 149, column: 7)
!850 = !DILocation(line: 149, column: 7, scope: !830)
!851 = !DILocation(line: 152, column: 27, scope: !852)
!852 = distinct !DILexicalBlock(scope: !853, file: !3, line: 152, column: 11)
!853 = distinct !DILexicalBlock(scope: !849, file: !3, line: 150, column: 5)
!854 = !DILocation(line: 152, column: 11, scope: !852)
!855 = !DILocation(line: 152, column: 11, scope: !853)
!856 = !DILocation(line: 154, column: 24, scope: !852)
!857 = !DILocation(line: 154, column: 43, scope: !852)
!858 = !DILocation(line: 153, column: 9, scope: !852)
!859 = !DILocation(line: 158, column: 12, scope: !830)
!860 = !DILocation(line: 159, column: 11, scope: !830)
!861 = !DILocation(line: 159, column: 21, scope: !830)
!862 = !DILocation(line: 160, column: 11, scope: !830)
!863 = !DILocation(line: 160, column: 21, scope: !830)
!864 = !DILocation(line: 162, column: 9, scope: !830)
!865 = !DILocation(line: 163, column: 1, scope: !830)
!866 = distinct !DISubprogram(name: "get_plugin_base_name", scope: !3, file: !3, line: 115, type: !867, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !869)
!867 = !DISubroutineType(types: !868)
!868 = !{!204, !207}
!869 = !{!870, !871}
!870 = !DILocalVariable(name: "full_name", arg: 1, scope: !866, file: !3, line: 115, type: !207)
!871 = !DILocalVariable(name: "base_name", scope: !866, file: !3, line: 118, type: !204)
!872 = !DILocation(line: 0, scope: !866)
!873 = !DILocation(line: 118, column: 30, scope: !866)
!874 = !DILocation(line: 118, column: 21, scope: !866)
!875 = !DILocation(line: 121, column: 32, scope: !866)
!876 = !DILocation(line: 121, column: 3, scope: !866)
!877 = !DILocation(line: 123, column: 3, scope: !866)
!878 = distinct !DISubprogram(name: "htab_str_eq", scope: !3, file: !3, line: 104, type: !309, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !879)
!879 = !{!880, !881, !882}
!880 = !DILocalVariable(name: "s1", arg: 1, scope: !878, file: !3, line: 104, type: !304)
!881 = !DILocalVariable(name: "s2", arg: 2, scope: !878, file: !3, line: 104, type: !304)
!882 = !DILocalVariable(name: "plugin", scope: !878, file: !3, line: 106, type: !344)
!883 = !DILocation(line: 0, scope: !878)
!884 = !DILocation(line: 107, column: 27, scope: !878)
!885 = !DILocation(line: 107, column: 11, scope: !878)
!886 = !DILocation(line: 107, column: 10, scope: !878)
!887 = !DILocation(line: 107, column: 3, scope: !878)
!888 = distinct !DISubprogram(name: "parse_plugin_arg_opt", scope: !3, file: !3, line: 171, type: !831, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !889)
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !908}
!890 = !DILocalVariable(name: "arg", arg: 1, scope: !888, file: !3, line: 171, type: !207)
!891 = !DILocalVariable(name: "len", scope: !888, file: !3, line: 173, type: !279)
!892 = !DILocalVariable(name: "name_len", scope: !888, file: !3, line: 173, type: !279)
!893 = !DILocalVariable(name: "key_len", scope: !888, file: !3, line: 173, type: !279)
!894 = !DILocalVariable(name: "value_len", scope: !888, file: !3, line: 173, type: !279)
!895 = !DILocalVariable(name: "ptr", scope: !888, file: !3, line: 174, type: !207)
!896 = !DILocalVariable(name: "name_start", scope: !888, file: !3, line: 174, type: !207)
!897 = !DILocalVariable(name: "key_start", scope: !888, file: !3, line: 174, type: !207)
!898 = !DILocalVariable(name: "value_start", scope: !888, file: !3, line: 174, type: !207)
!899 = !DILocalVariable(name: "name", scope: !888, file: !3, line: 175, type: !204)
!900 = !DILocalVariable(name: "key", scope: !888, file: !3, line: 175, type: !204)
!901 = !DILocalVariable(name: "value", scope: !888, file: !3, line: 175, type: !204)
!902 = !DILocalVariable(name: "slot", scope: !888, file: !3, line: 176, type: !314)
!903 = !DILocalVariable(name: "name_parsed", scope: !888, file: !3, line: 177, type: !201)
!904 = !DILocalVariable(name: "key_parsed", scope: !888, file: !3, line: 177, type: !201)
!905 = !DILocalVariable(name: "plugin", scope: !906, file: !3, line: 237, type: !209)
!906 = distinct !DILexicalBlock(scope: !907, file: !3, line: 236, column: 5)
!907 = distinct !DILexicalBlock(scope: !888, file: !3, line: 233, column: 7)
!908 = !DILocalVariable(name: "args", scope: !909, file: !3, line: 258, type: !217)
!909 = distinct !DILexicalBlock(scope: !910, file: !3, line: 257, column: 9)
!910 = distinct !DILexicalBlock(scope: !906, file: !3, line: 256, column: 11)
!911 = !DILocation(line: 0, scope: !888)
!912 = !DILocation(line: 181, column: 8, scope: !913)
!913 = distinct !DILexicalBlock(scope: !888, file: !3, line: 181, column: 3)
!914 = !DILocation(line: 177, column: 8, scope: !888)
!915 = !DILocation(line: 174, column: 40, scope: !888)
!916 = !DILocation(line: 0, scope: !913)
!917 = !DILocation(line: 173, column: 19, scope: !888)
!918 = !DILocation(line: 181, column: 19, scope: !919)
!919 = distinct !DILexicalBlock(scope: !913, file: !3, line: 181, column: 3)
!920 = !DILocation(line: 181, column: 3, scope: !913)
!921 = !DILocation(line: 187, column: 16, scope: !922)
!922 = distinct !DILexicalBlock(scope: !923, file: !3, line: 187, column: 11)
!923 = distinct !DILexicalBlock(scope: !919, file: !3, line: 182, column: 5)
!924 = !DILocation(line: 187, column: 27, scope: !922)
!925 = !DILocation(line: 187, column: 23, scope: !922)
!926 = !DILocation(line: 191, column: 27, scope: !927)
!927 = distinct !DILexicalBlock(scope: !922, file: !3, line: 188, column: 9)
!928 = !DILocation(line: 193, column: 11, scope: !927)
!929 = !DILocation(line: 195, column: 21, scope: !930)
!930 = distinct !DILexicalBlock(scope: !922, file: !3, line: 195, column: 16)
!931 = !DILocation(line: 195, column: 16, scope: !922)
!932 = !DILocation(line: 197, column: 15, scope: !933)
!933 = distinct !DILexicalBlock(scope: !934, file: !3, line: 197, column: 15)
!934 = distinct !DILexicalBlock(scope: !930, file: !3, line: 196, column: 9)
!935 = !DILocation(line: 197, column: 15, scope: !934)
!936 = !DILocation(line: 199, column: 15, scope: !937)
!937 = distinct !DILexicalBlock(scope: !933, file: !3, line: 198, column: 13)
!938 = !DILocation(line: 201, column: 15, scope: !937)
!939 = !DILocation(line: 205, column: 29, scope: !934)
!940 = !DILocation(line: 207, column: 11, scope: !934)
!941 = !DILocation(line: 210, column: 9, scope: !930)
!942 = !DILocation(line: 211, column: 5, scope: !923)
!943 = !DILocation(line: 0, scope: !922)
!944 = !DILocation(line: 181, column: 25, scope: !919)
!945 = !DILocation(line: 181, column: 3, scope: !919)
!946 = distinct !{!946, !920, !947}
!947 = !DILocation(line: 211, column: 5, scope: !913)
!948 = !DILocation(line: 213, column: 8, scope: !949)
!949 = distinct !DILexicalBlock(scope: !888, file: !3, line: 213, column: 7)
!950 = !DILocation(line: 213, column: 7, scope: !888)
!951 = !DILocation(line: 215, column: 7, scope: !952)
!952 = distinct !DILexicalBlock(scope: !949, file: !3, line: 214, column: 5)
!953 = !DILocation(line: 217, column: 7, scope: !952)
!954 = !DILocation(line: 222, column: 8, scope: !955)
!955 = distinct !DILexicalBlock(scope: !888, file: !3, line: 222, column: 7)
!956 = !DILocation(line: 227, column: 10, scope: !888)
!957 = !DILocation(line: 228, column: 3, scope: !888)
!958 = !DILocation(line: 229, column: 3, scope: !888)
!959 = !DILocation(line: 229, column: 18, scope: !888)
!960 = !DILocation(line: 233, column: 7, scope: !907)
!961 = !DILocation(line: 234, column: 7, scope: !907)
!962 = !DILocation(line: 234, column: 19, scope: !907)
!963 = !DILocation(line: 235, column: 11, scope: !907)
!964 = !DILocation(line: 233, column: 7, scope: !888)
!965 = !DILocation(line: 237, column: 69, scope: !906)
!966 = !DILocation(line: 0, scope: !906)
!967 = !DILocation(line: 239, column: 13, scope: !906)
!968 = !DILocation(line: 240, column: 7, scope: !906)
!969 = !DILocation(line: 241, column: 7, scope: !906)
!970 = !DILocation(line: 241, column: 20, scope: !906)
!971 = !DILocation(line: 242, column: 11, scope: !972)
!972 = distinct !DILexicalBlock(scope: !906, file: !3, line: 242, column: 11)
!973 = !DILocation(line: 242, column: 11, scope: !906)
!974 = !DILocation(line: 244, column: 19, scope: !975)
!975 = distinct !DILexicalBlock(scope: !972, file: !3, line: 243, column: 9)
!976 = !DILocation(line: 245, column: 11, scope: !975)
!977 = !DILocation(line: 246, column: 11, scope: !975)
!978 = !DILocation(line: 246, column: 28, scope: !975)
!979 = !DILocation(line: 247, column: 9, scope: !975)
!980 = !DILocation(line: 0, scope: !972)
!981 = !DILocation(line: 256, column: 19, scope: !910)
!982 = !DILocation(line: 256, column: 24, scope: !910)
!983 = !DILocation(line: 256, column: 11, scope: !906)
!984 = !DILocation(line: 258, column: 42, scope: !909)
!985 = !DILocation(line: 0, scope: !909)
!986 = !DILocation(line: 260, column: 33, scope: !909)
!987 = !DILocation(line: 261, column: 61, scope: !909)
!988 = !DILocation(line: 261, column: 53, scope: !909)
!989 = !DILocation(line: 261, column: 51, scope: !909)
!990 = !DILocation(line: 260, column: 11, scope: !909)
!991 = !DILocation(line: 262, column: 11, scope: !909)
!992 = !DILocation(line: 263, column: 24, scope: !909)
!993 = !DILocation(line: 264, column: 11, scope: !909)
!994 = !DILocation(line: 265, column: 9, scope: !909)
!995 = !DILocation(line: 268, column: 11, scope: !996)
!996 = distinct !DILexicalBlock(scope: !910, file: !3, line: 267, column: 9)
!997 = !DILocation(line: 269, column: 26, scope: !996)
!998 = !DILocation(line: 269, column: 24, scope: !996)
!999 = !DILocation(line: 0, scope: !910)
!1000 = !DILocation(line: 273, column: 15, scope: !906)
!1001 = !DILocation(line: 273, column: 38, scope: !906)
!1002 = !DILocation(line: 273, column: 42, scope: !906)
!1003 = !DILocation(line: 274, column: 15, scope: !906)
!1004 = !DILocation(line: 274, column: 28, scope: !906)
!1005 = !DILocation(line: 274, column: 33, scope: !906)
!1006 = !DILocation(line: 274, column: 7, scope: !906)
!1007 = !DILocation(line: 274, column: 38, scope: !906)
!1008 = !DILocation(line: 274, column: 44, scope: !906)
!1009 = !DILocation(line: 275, column: 5, scope: !906)
!1010 = !DILocation(line: 277, column: 5, scope: !907)
!1011 = !DILocation(line: 281, column: 3, scope: !888)
!1012 = !DILocation(line: 282, column: 1, scope: !888)
!1013 = distinct !DISubprogram(name: "get_named_event_id", scope: !3, file: !3, line: 310, type: !1014, scopeLine: 311, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1016)
!1014 = !DISubroutineType(types: !1015)
!1015 = !{!202, !207, !5}
!1016 = !{!1017, !1018, !1019, !1020}
!1017 = !DILocalVariable(name: "name", arg: 1, scope: !1013, file: !3, line: 310, type: !207)
!1018 = !DILocalVariable(name: "insert", arg: 2, scope: !1013, file: !3, line: 310, type: !5)
!1019 = !DILocalVariable(name: "slot", scope: !1013, file: !3, line: 312, type: !314)
!1020 = !DILocalVariable(name: "i", scope: !1021, file: !3, line: 316, type: !202)
!1021 = distinct !DILexicalBlock(scope: !1022, file: !3, line: 315, column: 5)
!1022 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 314, column: 7)
!1023 = !DILocation(line: 0, scope: !1013)
!1024 = !DILocation(line: 314, column: 8, scope: !1022)
!1025 = !DILocation(line: 314, column: 7, scope: !1013)
!1026 = !DILocation(line: 318, column: 19, scope: !1021)
!1027 = !DILocation(line: 318, column: 17, scope: !1021)
!1028 = !DILocation(line: 0, scope: !1021)
!1029 = !DILocation(line: 319, column: 12, scope: !1030)
!1030 = distinct !DILexicalBlock(scope: !1021, file: !3, line: 319, column: 7)
!1031 = !DILocation(line: 0, scope: !1030)
!1032 = !DILocation(line: 319, column: 23, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 319, column: 7)
!1034 = !DILocation(line: 319, column: 21, scope: !1033)
!1035 = !DILocation(line: 319, column: 7, scope: !1030)
!1036 = !DILocation(line: 321, column: 27, scope: !1037)
!1037 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 320, column: 2)
!1038 = !DILocation(line: 321, column: 38, scope: !1037)
!1039 = !DILocation(line: 321, column: 11, scope: !1037)
!1040 = !DILocation(line: 322, column: 4, scope: !1037)
!1041 = !DILocation(line: 323, column: 13, scope: !1037)
!1042 = !DILocation(line: 323, column: 10, scope: !1037)
!1043 = !DILocation(line: 319, column: 36, scope: !1033)
!1044 = !DILocation(line: 319, column: 7, scope: !1033)
!1045 = distinct !{!1045, !1035, !1046}
!1046 = !DILocation(line: 324, column: 2, scope: !1030)
!1047 = !DILocation(line: 326, column: 26, scope: !1013)
!1048 = !DILocation(line: 326, column: 10, scope: !1013)
!1049 = !DILocation(line: 327, column: 12, scope: !1050)
!1050 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 327, column: 7)
!1051 = !DILocation(line: 327, column: 7, scope: !1013)
!1052 = !DILocation(line: 329, column: 7, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 329, column: 7)
!1054 = !DILocation(line: 329, column: 13, scope: !1053)
!1055 = !DILocation(line: 329, column: 7, scope: !1013)
!1056 = !DILocation(line: 330, column: 37, scope: !1053)
!1057 = !DILocation(line: 330, column: 34, scope: !1053)
!1058 = !DILocation(line: 330, column: 12, scope: !1053)
!1059 = !DILocation(line: 330, column: 5, scope: !1053)
!1060 = !DILocation(line: 332, column: 7, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1013, file: !3, line: 332, column: 7)
!1062 = !DILocation(line: 332, column: 21, scope: !1061)
!1063 = !DILocation(line: 332, column: 18, scope: !1061)
!1064 = !DILocation(line: 332, column: 7, scope: !1013)
!1065 = !DILocation(line: 334, column: 34, scope: !1066)
!1066 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 333, column: 5)
!1067 = !DILocation(line: 334, column: 21, scope: !1066)
!1068 = !DILocation(line: 335, column: 11, scope: !1069)
!1069 = distinct !DILexicalBlock(scope: !1066, file: !3, line: 335, column: 11)
!1070 = !DILocation(line: 335, column: 29, scope: !1069)
!1071 = !DILocation(line: 335, column: 11, scope: !1066)
!1072 = !DILocation(line: 337, column: 24, scope: !1073)
!1073 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 336, column: 2)
!1074 = !DILocation(line: 337, column: 22, scope: !1073)
!1075 = !DILocation(line: 338, column: 4, scope: !1073)
!1076 = !DILocation(line: 340, column: 23, scope: !1073)
!1077 = !DILocation(line: 340, column: 21, scope: !1073)
!1078 = !DILocation(line: 341, column: 4, scope: !1073)
!1079 = !DILocation(line: 343, column: 2, scope: !1073)
!1080 = !DILocation(line: 347, column: 8, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !1069, file: !3, line: 345, column: 2)
!1082 = !DILocation(line: 347, column: 6, scope: !1081)
!1083 = !DILocation(line: 348, column: 23, scope: !1081)
!1084 = !DILocation(line: 348, column: 21, scope: !1081)
!1085 = !DILocation(line: 352, column: 20, scope: !1066)
!1086 = !DILocation(line: 352, column: 7, scope: !1066)
!1087 = !DILocation(line: 353, column: 17, scope: !1066)
!1088 = !DILocation(line: 357, column: 21, scope: !1013)
!1089 = !DILocation(line: 357, column: 3, scope: !1013)
!1090 = !DILocation(line: 354, column: 5, scope: !1066)
!1091 = !DILocation(line: 356, column: 14, scope: !1061)
!1092 = !DILocation(line: 356, column: 11, scope: !1061)
!1093 = !DILocation(line: 357, column: 33, scope: !1013)
!1094 = !DILocation(line: 358, column: 20, scope: !1013)
!1095 = !DILocation(line: 358, column: 3, scope: !1013)
!1096 = !DILocation(line: 359, column: 1, scope: !1013)
!1097 = distinct !DISubprogram(name: "htab_event_eq", scope: !3, file: !3, line: 300, type: !309, scopeLine: 301, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DILocalVariable(name: "e1", arg: 1, scope: !1097, file: !3, line: 300, type: !304)
!1100 = !DILocalVariable(name: "s2", arg: 2, scope: !1097, file: !3, line: 300, type: !304)
!1101 = !DILocalVariable(name: "s1", scope: !1097, file: !3, line: 302, type: !207)
!1102 = !DILocation(line: 0, scope: !1097)
!1103 = !DILocation(line: 302, column: 20, scope: !1097)
!1104 = !DILocation(line: 302, column: 19, scope: !1097)
!1105 = !DILocation(line: 303, column: 11, scope: !1097)
!1106 = !DILocation(line: 303, column: 10, scope: !1097)
!1107 = !DILocation(line: 303, column: 3, scope: !1097)
!1108 = distinct !DISubprogram(name: "register_callback", scope: !3, file: !3, line: 370, type: !1109, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1111)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{null, !207, !202, !231, !206}
!1111 = !{!1112, !1113, !1114, !1115, !1116}
!1112 = !DILocalVariable(name: "plugin_name", arg: 1, scope: !1108, file: !3, line: 370, type: !207)
!1113 = !DILocalVariable(name: "event", arg: 2, scope: !1108, file: !3, line: 371, type: !202)
!1114 = !DILocalVariable(name: "callback", arg: 3, scope: !1108, file: !3, line: 372, type: !231)
!1115 = !DILocalVariable(name: "user_data", arg: 4, scope: !1108, file: !3, line: 373, type: !206)
!1116 = !DILocalVariable(name: "new_callback", scope: !1117, file: !3, line: 422, type: !226)
!1117 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 421, column: 9)
!1118 = distinct !DILexicalBlock(scope: !1108, file: !3, line: 376, column: 5)
!1119 = !DILocation(line: 0, scope: !1108)
!1120 = !DILocation(line: 375, column: 3, scope: !1108)
!1121 = !DILocation(line: 378, column: 2, scope: !1118)
!1122 = !DILocation(line: 379, column: 24, scope: !1118)
!1123 = !DILocation(line: 379, column: 9, scope: !1118)
!1124 = !DILocation(line: 380, column: 9, scope: !1118)
!1125 = !DILocation(line: 382, column: 2, scope: !1118)
!1126 = !DILocation(line: 383, column: 37, scope: !1118)
!1127 = !DILocation(line: 383, column: 2, scope: !1118)
!1128 = !DILocation(line: 384, column: 2, scope: !1118)
!1129 = !DILocation(line: 386, column: 2, scope: !1118)
!1130 = !DILocation(line: 387, column: 32, scope: !1118)
!1131 = !DILocation(line: 387, column: 9, scope: !1118)
!1132 = !DILocation(line: 388, column: 2, scope: !1118)
!1133 = !DILocation(line: 390, column: 2, scope: !1118)
!1134 = !DILocation(line: 391, column: 33, scope: !1118)
!1135 = !DILocation(line: 391, column: 9, scope: !1118)
!1136 = !DILocation(line: 392, column: 2, scope: !1118)
!1137 = !DILocation(line: 395, column: 12, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1118, file: !3, line: 395, column: 6)
!1139 = !DILocation(line: 395, column: 53, scope: !1138)
!1140 = !DILocation(line: 395, column: 50, scope: !1138)
!1141 = !DILocation(line: 395, column: 41, scope: !1138)
!1142 = !DILocation(line: 397, column: 6, scope: !1143)
!1143 = distinct !DILexicalBlock(scope: !1138, file: !3, line: 396, column: 4)
!1144 = !DILocation(line: 399, column: 6, scope: !1143)
!1145 = !DILocation(line: 423, column: 16, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1117, file: !3, line: 423, column: 15)
!1147 = !DILocation(line: 423, column: 15, scope: !1117)
!1148 = !DILocation(line: 426, column: 37, scope: !1149)
!1149 = distinct !DILexicalBlock(scope: !1146, file: !3, line: 424, column: 13)
!1150 = !DILocation(line: 425, column: 15, scope: !1149)
!1151 = !DILocation(line: 427, column: 15, scope: !1149)
!1152 = !DILocation(line: 429, column: 26, scope: !1117)
!1153 = !DILocation(line: 0, scope: !1117)
!1154 = !DILocation(line: 430, column: 25, scope: !1117)
!1155 = !DILocation(line: 430, column: 37, scope: !1117)
!1156 = !DILocation(line: 431, column: 25, scope: !1117)
!1157 = !DILocation(line: 431, column: 30, scope: !1117)
!1158 = !DILocation(line: 432, column: 25, scope: !1117)
!1159 = !DILocation(line: 432, column: 35, scope: !1117)
!1160 = !DILocation(line: 433, column: 32, scope: !1117)
!1161 = !DILocation(line: 433, column: 25, scope: !1117)
!1162 = !DILocation(line: 433, column: 30, scope: !1117)
!1163 = !DILocation(line: 434, column: 35, scope: !1117)
!1164 = !DILocation(line: 435, column: 9, scope: !1118)
!1165 = !DILocation(line: 438, column: 1, scope: !1108)
!1166 = distinct !DISubprogram(name: "register_plugin_info", scope: !3, file: !3, line: 288, type: !1167, scopeLine: 289, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1169)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{null, !207, !267}
!1169 = !{!1170, !1171, !1172, !1173}
!1170 = !DILocalVariable(name: "name", arg: 1, scope: !1166, file: !3, line: 288, type: !207)
!1171 = !DILocalVariable(name: "info", arg: 2, scope: !1166, file: !3, line: 288, type: !267)
!1172 = !DILocalVariable(name: "slot", scope: !1166, file: !3, line: 290, type: !314)
!1173 = !DILocalVariable(name: "plugin", scope: !1166, file: !3, line: 291, type: !209)
!1174 = !DILocation(line: 0, scope: !1166)
!1175 = !DILocation(line: 290, column: 33, scope: !1166)
!1176 = !DILocation(line: 290, column: 17, scope: !1166)
!1177 = !DILocation(line: 291, column: 65, scope: !1166)
!1178 = !DILocation(line: 292, column: 27, scope: !1166)
!1179 = !DILocation(line: 292, column: 11, scope: !1166)
!1180 = !DILocation(line: 292, column: 19, scope: !1166)
!1181 = !DILocation(line: 293, column: 24, scope: !1166)
!1182 = !DILocation(line: 293, column: 11, scope: !1166)
!1183 = !DILocation(line: 293, column: 16, scope: !1166)
!1184 = !DILocation(line: 294, column: 1, scope: !1166)
!1185 = distinct !DISubprogram(name: "unregister_callback", scope: !3, file: !3, line: 445, type: !1186, scopeLine: 446, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1188)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!202, !207, !202}
!1188 = !{!1189, !1190, !1191, !1192}
!1189 = !DILocalVariable(name: "plugin_name", arg: 1, scope: !1185, file: !3, line: 445, type: !207)
!1190 = !DILocalVariable(name: "event", arg: 2, scope: !1185, file: !3, line: 445, type: !202)
!1191 = !DILocalVariable(name: "callback", scope: !1185, file: !3, line: 447, type: !226)
!1192 = !DILocalVariable(name: "cbp", scope: !1185, file: !3, line: 447, type: !225)
!1193 = !DILocation(line: 0, scope: !1185)
!1194 = !DILocation(line: 449, column: 16, scope: !1195)
!1195 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 449, column: 7)
!1196 = !DILocation(line: 449, column: 13, scope: !1195)
!1197 = !DILocation(line: 449, column: 7, scope: !1185)
!1198 = !DILocation(line: 452, column: 15, scope: !1199)
!1199 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 452, column: 3)
!1200 = !DILocation(line: 452, column: 8, scope: !1199)
!1201 = !DILocation(line: 0, scope: !1199)
!1202 = !DILocation(line: 452, column: 52, scope: !1203)
!1203 = distinct !DILexicalBlock(scope: !1199, file: !3, line: 452, column: 3)
!1204 = !DILocation(line: 452, column: 3, scope: !1199)
!1205 = !DILocation(line: 453, column: 27, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1203, file: !3, line: 453, column: 9)
!1207 = !DILocation(line: 453, column: 9, scope: !1206)
!1208 = !DILocation(line: 453, column: 53, scope: !1206)
!1209 = !DILocation(line: 0, scope: !1203)
!1210 = !DILocation(line: 453, column: 9, scope: !1203)
!1211 = distinct !{!1211, !1204, !1212}
!1212 = !DILocation(line: 457, column: 7, scope: !1199)
!1213 = !DILocation(line: 455, column: 19, scope: !1214)
!1214 = distinct !DILexicalBlock(scope: !1206, file: !3, line: 454, column: 7)
!1215 = !DILocation(line: 455, column: 7, scope: !1214)
!1216 = !DILocation(line: 456, column: 2, scope: !1214)
!1217 = !DILocation(line: 459, column: 1, scope: !1185)
!1218 = distinct !DISubprogram(name: "invoke_plugin_callbacks", scope: !3, file: !3, line: 470, type: !1219, scopeLine: 471, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1221)
!1219 = !DISubroutineType(types: !1220)
!1220 = !{!202, !202, !206}
!1221 = !{!1222, !1223, !1224, !1225}
!1222 = !DILocalVariable(name: "event", arg: 1, scope: !1218, file: !3, line: 470, type: !202)
!1223 = !DILocalVariable(name: "gcc_data", arg: 2, scope: !1218, file: !3, line: 470, type: !206)
!1224 = !DILocalVariable(name: "retval", scope: !1218, file: !3, line: 472, type: !202)
!1225 = !DILocalVariable(name: "callback", scope: !1226, file: !3, line: 505, type: !226)
!1226 = distinct !DILexicalBlock(scope: !1227, file: !3, line: 502, column: 9)
!1227 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 477, column: 5)
!1228 = !DILocation(line: 0, scope: !1218)
!1229 = !DILocation(line: 474, column: 3, scope: !1230)
!1230 = distinct !DILexicalBlock(scope: !1231, file: !3, line: 474, column: 3)
!1231 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 474, column: 3)
!1232 = !DILocation(line: 474, column: 3, scope: !1231)
!1233 = !DILocation(line: 476, column: 3, scope: !1218)
!1234 = !DILocation(line: 480, column: 2, scope: !1227)
!1235 = !DILocation(line: 481, column: 2, scope: !1227)
!1236 = !DILocation(line: 505, column: 44, scope: !1226)
!1237 = !DILocation(line: 0, scope: !1226)
!1238 = !DILocation(line: 509, column: 11, scope: !1226)
!1239 = !DILocation(line: 509, column: 11, scope: !1240)
!1240 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 509, column: 11)
!1241 = !DILocation(line: 510, column: 25, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1240, file: !3, line: 509, column: 11)
!1243 = !DILocation(line: 510, column: 52, scope: !1242)
!1244 = !DILocation(line: 510, column: 13, scope: !1242)
!1245 = !DILocation(line: 509, column: 50, scope: !1242)
!1246 = !DILocation(line: 509, column: 11, scope: !1242)
!1247 = distinct !{!1247, !1239, !1248}
!1248 = !DILocation(line: 510, column: 61, scope: !1240)
!1249 = !DILocation(line: 517, column: 9, scope: !1227)
!1250 = !DILocation(line: 518, column: 5, scope: !1227)
!1251 = !DILocation(line: 507, column: 9, scope: !1252)
!1252 = distinct !DILexicalBlock(scope: !1226, file: !3, line: 507, column: 8)
!1253 = !DILocation(line: 507, column: 8, scope: !1226)
!1254 = !DILocation(line: 520, column: 3, scope: !1255)
!1255 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 520, column: 3)
!1256 = distinct !DILexicalBlock(scope: !1218, file: !3, line: 520, column: 3)
!1257 = !DILocation(line: 472, column: 7, scope: !1218)
!1258 = !DILocation(line: 520, column: 3, scope: !1256)
!1259 = !DILocation(line: 521, column: 3, scope: !1218)
!1260 = distinct !DISubprogram(name: "initialize_plugins", scope: !3, file: !3, line: 611, type: !1261, scopeLine: 612, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{null}
!1263 = !DILocation(line: 614, column: 8, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 614, column: 7)
!1265 = !DILocation(line: 614, column: 7, scope: !1260)
!1266 = !DILocation(line: 617, column: 3, scope: !1267)
!1267 = distinct !DILexicalBlock(scope: !1268, file: !3, line: 617, column: 3)
!1268 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 617, column: 3)
!1269 = !DILocation(line: 617, column: 3, scope: !1268)
!1270 = !DILocation(line: 624, column: 3, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 624, column: 3)
!1272 = distinct !DILexicalBlock(scope: !1260, file: !3, line: 624, column: 3)
!1273 = !DILocation(line: 624, column: 3, scope: !1272)
!1274 = !DILocation(line: 625, column: 1, scope: !1260)
!1275 = distinct !DISubprogram(name: "finalize_plugins", scope: !3, file: !3, line: 640, type: !1261, scopeLine: 641, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!1276 = !DILocation(line: 642, column: 8, scope: !1277)
!1277 = distinct !DILexicalBlock(scope: !1275, file: !3, line: 642, column: 7)
!1278 = !DILocation(line: 642, column: 7, scope: !1275)
!1279 = !DILocation(line: 650, column: 3, scope: !1275)
!1280 = !DILocation(line: 653, column: 16, scope: !1275)
!1281 = !DILocation(line: 653, column: 3, scope: !1275)
!1282 = !DILocation(line: 654, column: 24, scope: !1275)
!1283 = !DILocation(line: 655, column: 1, scope: !1275)
!1284 = distinct !DISubprogram(name: "finalize_one_plugin", scope: !3, file: !3, line: 630, type: !1285, scopeLine: 631, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1287)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{!202, !314, !206}
!1287 = !{!1288, !1289, !1290}
!1288 = !DILocalVariable(name: "slot", arg: 1, scope: !1284, file: !3, line: 630, type: !314)
!1289 = !DILocalVariable(name: "info", arg: 2, scope: !1284, file: !3, line: 630, type: !206)
!1290 = !DILocalVariable(name: "plugin", scope: !1284, file: !3, line: 632, type: !209)
!1291 = !DILocation(line: 0, scope: !1284)
!1292 = !DILocation(line: 632, column: 65, scope: !1284)
!1293 = !DILocation(line: 633, column: 3, scope: !1284)
!1294 = !DILocation(line: 634, column: 3, scope: !1284)
!1295 = distinct !DISubprogram(name: "print_plugins_versions", scope: !3, file: !3, line: 681, type: !1296, scopeLine: 682, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1298)
!1296 = !DISubroutineType(types: !1297)
!1297 = !{null, !352, !207}
!1298 = !{!1299, !1300, !1301}
!1299 = !DILocalVariable(name: "file", arg: 1, scope: !1295, file: !3, line: 681, type: !352)
!1300 = !DILocalVariable(name: "indent", arg: 2, scope: !1295, file: !3, line: 681, type: !207)
!1301 = !DILocalVariable(name: "opt", scope: !1295, file: !3, line: 683, type: !349)
!1302 = !DILocation(line: 0, scope: !1295)
!1303 = !DILocation(line: 683, column: 3, scope: !1295)
!1304 = !DILocation(line: 684, column: 7, scope: !1295)
!1305 = !DILocation(line: 684, column: 12, scope: !1295)
!1306 = !DILocation(line: 685, column: 7, scope: !1295)
!1307 = !DILocation(line: 685, column: 14, scope: !1295)
!1308 = !DILocation(line: 686, column: 8, scope: !1309)
!1309 = distinct !DILexicalBlock(scope: !1295, file: !3, line: 686, column: 7)
!1310 = !DILocation(line: 686, column: 29, scope: !1309)
!1311 = !DILocation(line: 686, column: 32, scope: !1309)
!1312 = !DILocation(line: 686, column: 69, scope: !1309)
!1313 = !DILocation(line: 686, column: 7, scope: !1295)
!1314 = !DILocation(line: 689, column: 3, scope: !1295)
!1315 = !DILocation(line: 690, column: 27, scope: !1295)
!1316 = !DILocation(line: 690, column: 3, scope: !1295)
!1317 = !DILocation(line: 691, column: 1, scope: !1295)
!1318 = distinct !DISubprogram(name: "print_version_one_plugin", scope: !3, file: !3, line: 668, type: !1285, scopeLine: 669, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1324}
!1320 = !DILocalVariable(name: "slot", arg: 1, scope: !1318, file: !3, line: 668, type: !314)
!1321 = !DILocalVariable(name: "data", arg: 2, scope: !1318, file: !3, line: 668, type: !206)
!1322 = !DILocalVariable(name: "opt", scope: !1318, file: !3, line: 670, type: !348)
!1323 = !DILocalVariable(name: "plugin", scope: !1318, file: !3, line: 671, type: !209)
!1324 = !DILocalVariable(name: "version", scope: !1318, file: !3, line: 672, type: !207)
!1325 = !DILocation(line: 0, scope: !1318)
!1326 = !DILocation(line: 671, column: 65, scope: !1318)
!1327 = !DILocation(line: 672, column: 33, scope: !1318)
!1328 = !DILocation(line: 672, column: 25, scope: !1318)
!1329 = !DILocation(line: 674, column: 17, scope: !1318)
!1330 = !DILocation(line: 674, column: 43, scope: !1318)
!1331 = !DILocation(line: 674, column: 59, scope: !1318)
!1332 = !DILocation(line: 674, column: 3, scope: !1318)
!1333 = !DILocation(line: 675, column: 3, scope: !1318)
!1334 = distinct !DISubprogram(name: "print_plugins_help", scope: !3, file: !3, line: 726, type: !1296, scopeLine: 727, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1335)
!1335 = !{!1336, !1337, !1338}
!1336 = !DILocalVariable(name: "file", arg: 1, scope: !1334, file: !3, line: 726, type: !352)
!1337 = !DILocalVariable(name: "indent", arg: 2, scope: !1334, file: !3, line: 726, type: !207)
!1338 = !DILocalVariable(name: "opt", scope: !1334, file: !3, line: 728, type: !349)
!1339 = !DILocation(line: 0, scope: !1334)
!1340 = !DILocation(line: 728, column: 3, scope: !1334)
!1341 = !DILocation(line: 729, column: 7, scope: !1334)
!1342 = !DILocation(line: 729, column: 12, scope: !1334)
!1343 = !DILocation(line: 730, column: 7, scope: !1334)
!1344 = !DILocation(line: 730, column: 14, scope: !1334)
!1345 = !DILocation(line: 731, column: 8, scope: !1346)
!1346 = distinct !DILexicalBlock(scope: !1334, file: !3, line: 731, column: 7)
!1347 = !DILocation(line: 731, column: 29, scope: !1346)
!1348 = !DILocation(line: 731, column: 32, scope: !1346)
!1349 = !DILocation(line: 731, column: 69, scope: !1346)
!1350 = !DILocation(line: 731, column: 7, scope: !1334)
!1351 = !DILocation(line: 734, column: 3, scope: !1334)
!1352 = !DILocation(line: 735, column: 27, scope: !1334)
!1353 = !DILocation(line: 735, column: 3, scope: !1334)
!1354 = !DILocation(line: 736, column: 1, scope: !1334)
!1355 = distinct !DISubprogram(name: "print_help_one_plugin", scope: !3, file: !3, line: 697, type: !1285, scopeLine: 698, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1356)
!1356 = !{!1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364}
!1357 = !DILocalVariable(name: "slot", arg: 1, scope: !1355, file: !3, line: 697, type: !314)
!1358 = !DILocalVariable(name: "data", arg: 2, scope: !1355, file: !3, line: 697, type: !206)
!1359 = !DILocalVariable(name: "opt", scope: !1355, file: !3, line: 699, type: !348)
!1360 = !DILocalVariable(name: "plugin", scope: !1355, file: !3, line: 700, type: !209)
!1361 = !DILocalVariable(name: "help", scope: !1355, file: !3, line: 701, type: !207)
!1362 = !DILocalVariable(name: "dup", scope: !1355, file: !3, line: 703, type: !204)
!1363 = !DILocalVariable(name: "p", scope: !1355, file: !3, line: 704, type: !204)
!1364 = !DILocalVariable(name: "nl", scope: !1355, file: !3, line: 704, type: !204)
!1365 = !DILocation(line: 0, scope: !1355)
!1366 = !DILocation(line: 700, column: 65, scope: !1355)
!1367 = !DILocation(line: 701, column: 30, scope: !1355)
!1368 = !DILocation(line: 701, column: 22, scope: !1355)
!1369 = !DILocation(line: 703, column: 15, scope: !1355)
!1370 = !DILocation(line: 705, column: 17, scope: !1355)
!1371 = !DILocation(line: 705, column: 40, scope: !1355)
!1372 = !DILocation(line: 705, column: 56, scope: !1355)
!1373 = !DILocation(line: 705, column: 3, scope: !1355)
!1374 = !DILocation(line: 707, column: 8, scope: !1375)
!1375 = distinct !DILexicalBlock(scope: !1355, file: !3, line: 707, column: 3)
!1376 = !DILocation(line: 0, scope: !1375)
!1377 = !DILocation(line: 707, column: 3, scope: !1375)
!1378 = !DILocation(line: 709, column: 12, scope: !1379)
!1379 = distinct !DILexicalBlock(scope: !1380, file: !3, line: 708, column: 5)
!1380 = distinct !DILexicalBlock(scope: !1375, file: !3, line: 707, column: 3)
!1381 = !DILocation(line: 710, column: 11, scope: !1382)
!1382 = distinct !DILexicalBlock(scope: !1379, file: !3, line: 710, column: 11)
!1383 = !DILocation(line: 710, column: 11, scope: !1379)
!1384 = !DILocation(line: 712, column: 8, scope: !1385)
!1385 = distinct !DILexicalBlock(scope: !1382, file: !3, line: 711, column: 2)
!1386 = !DILocation(line: 713, column: 6, scope: !1385)
!1387 = !DILocation(line: 714, column: 2, scope: !1385)
!1388 = !DILocation(line: 0, scope: !1379)
!1389 = !DILocation(line: 715, column: 21, scope: !1379)
!1390 = !DILocation(line: 715, column: 46, scope: !1379)
!1391 = !DILocation(line: 715, column: 7, scope: !1379)
!1392 = !DILocation(line: 707, column: 3, scope: !1380)
!1393 = distinct !{!1393, !1377, !1394}
!1394 = !DILocation(line: 716, column: 5, scope: !1375)
!1395 = !DILocation(line: 718, column: 3, scope: !1355)
!1396 = !DILocation(line: 719, column: 3, scope: !1355)
!1397 = distinct !DISubprogram(name: "plugins_active_p", scope: !3, file: !3, line: 742, type: !248, scopeLine: 743, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1398)
!1398 = !{!1399}
!1399 = !DILocalVariable(name: "event", scope: !1397, file: !3, line: 744, type: !202)
!1400 = !DILocation(line: 0, scope: !1397)
!1401 = !DILocation(line: 0, scope: !1402)
!1402 = distinct !DILexicalBlock(scope: !1403, file: !3, line: 746, column: 3)
!1403 = distinct !DILexicalBlock(scope: !1397, file: !3, line: 746, column: 3)
!1404 = !DILocation(line: 0, scope: !1405)
!1405 = distinct !DILexicalBlock(scope: !1402, file: !3, line: 747, column: 9)
!1406 = !DILocation(line: 746, column: 8, scope: !1403)
!1407 = !DILocation(line: 0, scope: !1403)
!1408 = !DILocation(line: 746, column: 49, scope: !1402)
!1409 = !DILocation(line: 746, column: 3, scope: !1403)
!1410 = !DILocation(line: 747, column: 9, scope: !1405)
!1411 = !DILocation(line: 747, column: 9, scope: !1402)
!1412 = !DILocation(line: 746, column: 68, scope: !1402)
!1413 = !DILocation(line: 746, column: 3, scope: !1402)
!1414 = distinct !{!1414, !1409, !1415}
!1415 = !DILocation(line: 748, column: 14, scope: !1403)
!1416 = !DILocation(line: 751, column: 1, scope: !1397)
