; ModuleID = 'pointer-set.bc'
source_filename = "pointer-set.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.pointer_set_t = type { i64, i64, i64, i8** }
%struct.pointer_map_t = type { i64, i64, i64, i8**, i8** }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !39 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !53, metadata !DIExpression()), !dbg !55

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "pointer-set.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13, !17, !23, !26, !34, !19}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_set_t", file: !1, line: 31, size: 256, elements: !15)
!15 = !{!16, !20, !21, !22}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "log_slots", scope: !14, file: !1, line: 33, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !18, line: 46, baseType: !19)
!18 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!19 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "n_slots", scope: !14, file: !1, line: 34, baseType: !17, size: 64, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !14, file: !1, line: 35, baseType: !17, size: 64, offset: 128)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "slots", scope: !14, file: !1, line: 37, baseType: !23, size: 64, offset: 192)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!25 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !27, size: 64)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1, line: 191, size: 320, elements: !28)
!28 = !{!29, !30, !31, !32, !33}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "log_slots", scope: !27, file: !1, line: 193, baseType: !17, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "n_slots", scope: !27, file: !1, line: 194, baseType: !17, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !27, file: !1, line: 195, baseType: !17, size: 64, offset: 128)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "keys", scope: !27, file: !1, line: 197, baseType: !23, size: 64, offset: 192)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !27, file: !1, line: 198, baseType: !34, size: 64, offset: 256)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!35 = !{i32 2, !"Dwarf Version", i32 4}
!36 = !{i32 2, !"Debug Info Version", i32 3}
!37 = !{i32 1, !"wchar_size", i32 4}
!38 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!39 = distinct !DISubprogram(name: "vprintf", scope: !40, file: !40, line: 39, type: !41, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !52)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!41 = !DISubroutineType(types: !42)
!42 = !{!6, !43, !44}
!43 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !46)
!46 = !{!47, !49, !50, !51}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !45, file: !1, baseType: !48, size: 32)
!48 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !45, file: !1, baseType: !48, size: 32, offset: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !45, file: !1, baseType: !10, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !45, file: !1, baseType: !10, size: 64, offset: 128)
!52 = !{!53, !54}
!53 = !DILocalVariable(name: "__fmt", arg: 1, scope: !39, file: !40, line: 39, type: !43)
!54 = !DILocalVariable(name: "__arg", arg: 2, scope: !39, file: !40, line: 39, type: !44)
!55 = !DILocation(line: 0, scope: !39)
!56 = !DILocation(line: 41, column: 20, scope: !39)
!57 = !DILocation(line: 41, column: 10, scope: !39)
!58 = !DILocation(line: 41, column: 3, scope: !39)
!59 = distinct !DISubprogram(name: "getchar", scope: !40, file: !40, line: 47, type: !60, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!60 = !DISubroutineType(types: !61)
!61 = !{!6}
!62 = !DILocation(line: 49, column: 16, scope: !59)
!63 = !DILocation(line: 49, column: 10, scope: !59)
!64 = !DILocation(line: 49, column: 3, scope: !59)
!65 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !40, file: !40, line: 56, type: !66, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !124)
!66 = !DISubroutineType(types: !67)
!67 = !{!6, !68}
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !70, line: 7, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!71 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !72, line: 49, size: 1728, elements: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!73 = !{!74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !89, !91, !92, !93, !97, !99, !101, !105, !108, !110, !113, !116, !117, !118, !119, !120}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !71, file: !72, line: 51, baseType: !6, size: 32)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !71, file: !72, line: 54, baseType: !8, size: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !71, file: !72, line: 55, baseType: !8, size: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !71, file: !72, line: 56, baseType: !8, size: 64, offset: 192)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !71, file: !72, line: 57, baseType: !8, size: 64, offset: 256)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !71, file: !72, line: 58, baseType: !8, size: 64, offset: 320)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !71, file: !72, line: 59, baseType: !8, size: 64, offset: 384)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !71, file: !72, line: 60, baseType: !8, size: 64, offset: 448)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !71, file: !72, line: 61, baseType: !8, size: 64, offset: 512)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !71, file: !72, line: 64, baseType: !8, size: 64, offset: 576)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !71, file: !72, line: 65, baseType: !8, size: 64, offset: 640)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !71, file: !72, line: 66, baseType: !8, size: 64, offset: 704)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !71, file: !72, line: 68, baseType: !87, size: 64, offset: 768)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !72, line: 36, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !71, file: !72, line: 70, baseType: !90, size: 64, offset: 832)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !71, file: !72, line: 72, baseType: !6, size: 32, offset: 896)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !71, file: !72, line: 73, baseType: !6, size: 32, offset: 928)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !71, file: !72, line: 74, baseType: !94, size: 64, offset: 960)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !95, line: 152, baseType: !96)
!95 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!96 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !71, file: !72, line: 77, baseType: !98, size: 16, offset: 1024)
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !71, file: !72, line: 78, baseType: !100, size: 8, offset: 1040)
!100 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !71, file: !72, line: 79, baseType: !102, size: 8, offset: 1048)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 1)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !71, file: !72, line: 81, baseType: !106, size: 64, offset: 1088)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !72, line: 43, baseType: null)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !71, file: !72, line: 89, baseType: !109, size: 64, offset: 1152)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !95, line: 153, baseType: !96)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !71, file: !72, line: 91, baseType: !111, size: 64, offset: 1216)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !72, line: 37, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !71, file: !72, line: 92, baseType: !114, size: 64, offset: 1280)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !72, line: 38, flags: DIFlagFwdDecl)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !71, file: !72, line: 93, baseType: !90, size: 64, offset: 1344)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !71, file: !72, line: 94, baseType: !10, size: 64, offset: 1408)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !71, file: !72, line: 95, baseType: !17, size: 64, offset: 1472)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !71, file: !72, line: 96, baseType: !6, size: 32, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !71, file: !72, line: 98, baseType: !121, size: 160, offset: 1568)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 20)
!124 = !{!125}
!125 = !DILocalVariable(name: "__fp", arg: 1, scope: !65, file: !40, line: 56, type: !68)
!126 = !DILocation(line: 0, scope: !65)
!127 = !DILocation(line: 58, column: 10, scope: !65)
!128 = !DILocation(line: 58, column: 3, scope: !65)
!129 = distinct !DISubprogram(name: "getc_unlocked", scope: !40, file: !40, line: 66, type: !66, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !130)
!130 = !{!131}
!131 = !DILocalVariable(name: "__fp", arg: 1, scope: !129, file: !40, line: 66, type: !68)
!132 = !DILocation(line: 0, scope: !129)
!133 = !DILocation(line: 68, column: 10, scope: !129)
!134 = !DILocation(line: 68, column: 3, scope: !129)
!135 = distinct !DISubprogram(name: "getchar_unlocked", scope: !40, file: !40, line: 73, type: !60, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!136 = !DILocation(line: 75, column: 10, scope: !135)
!137 = !DILocation(line: 75, column: 3, scope: !135)
!138 = distinct !DISubprogram(name: "putchar", scope: !40, file: !40, line: 82, type: !139, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{!6, !6}
!141 = !{!142}
!142 = !DILocalVariable(name: "__c", arg: 1, scope: !138, file: !40, line: 82, type: !6)
!143 = !DILocation(line: 0, scope: !138)
!144 = !DILocation(line: 84, column: 21, scope: !138)
!145 = !DILocation(line: 84, column: 10, scope: !138)
!146 = !DILocation(line: 84, column: 3, scope: !138)
!147 = distinct !DISubprogram(name: "fputc_unlocked", scope: !40, file: !40, line: 91, type: !148, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !150)
!148 = !DISubroutineType(types: !149)
!149 = !{!6, !6, !68}
!150 = !{!151, !152}
!151 = !DILocalVariable(name: "__c", arg: 1, scope: !147, file: !40, line: 91, type: !6)
!152 = !DILocalVariable(name: "__stream", arg: 2, scope: !147, file: !40, line: 91, type: !68)
!153 = !DILocation(line: 0, scope: !147)
!154 = !DILocation(line: 93, column: 10, scope: !147)
!155 = !DILocation(line: 93, column: 3, scope: !147)
!156 = distinct !DISubprogram(name: "putc_unlocked", scope: !40, file: !40, line: 101, type: !148, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !157)
!157 = !{!158, !159}
!158 = !DILocalVariable(name: "__c", arg: 1, scope: !156, file: !40, line: 101, type: !6)
!159 = !DILocalVariable(name: "__stream", arg: 2, scope: !156, file: !40, line: 101, type: !68)
!160 = !DILocation(line: 0, scope: !156)
!161 = !DILocation(line: 103, column: 10, scope: !156)
!162 = !DILocation(line: 103, column: 3, scope: !156)
!163 = distinct !DISubprogram(name: "putchar_unlocked", scope: !40, file: !40, line: 108, type: !139, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !164)
!164 = !{!165}
!165 = !DILocalVariable(name: "__c", arg: 1, scope: !163, file: !40, line: 108, type: !6)
!166 = !DILocation(line: 0, scope: !163)
!167 = !DILocation(line: 110, column: 10, scope: !163)
!168 = !DILocation(line: 110, column: 3, scope: !163)
!169 = distinct !DISubprogram(name: "getline", scope: !40, file: !40, line: 118, type: !170, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !174)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !7, !173, !68}
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !95, line: 193, baseType: !96)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!174 = !{!175, !176, !177}
!175 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !169, file: !40, line: 118, type: !7)
!176 = !DILocalVariable(name: "__n", arg: 2, scope: !169, file: !40, line: 118, type: !173)
!177 = !DILocalVariable(name: "__stream", arg: 3, scope: !169, file: !40, line: 118, type: !68)
!178 = !DILocation(line: 0, scope: !169)
!179 = !DILocation(line: 120, column: 10, scope: !169)
!180 = !DILocation(line: 120, column: 3, scope: !169)
!181 = distinct !DISubprogram(name: "feof_unlocked", scope: !40, file: !40, line: 128, type: !66, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !182)
!182 = !{!183}
!183 = !DILocalVariable(name: "__stream", arg: 1, scope: !181, file: !40, line: 128, type: !68)
!184 = !DILocation(line: 0, scope: !181)
!185 = !DILocation(line: 130, column: 10, scope: !181)
!186 = !DILocation(line: 130, column: 3, scope: !181)
!187 = distinct !DISubprogram(name: "ferror_unlocked", scope: !40, file: !40, line: 135, type: !66, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !188)
!188 = !{!189}
!189 = !DILocalVariable(name: "__stream", arg: 1, scope: !187, file: !40, line: 135, type: !68)
!190 = !DILocation(line: 0, scope: !187)
!191 = !DILocation(line: 137, column: 10, scope: !187)
!192 = !DILocation(line: 137, column: 3, scope: !187)
!193 = distinct !DISubprogram(name: "tolower", scope: !194, file: !194, line: 207, type: !139, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !195)
!194 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!195 = !{!196}
!196 = !DILocalVariable(name: "__c", arg: 1, scope: !193, file: !194, line: 207, type: !6)
!197 = !DILocation(line: 0, scope: !193)
!198 = !DILocation(line: 209, column: 22, scope: !193)
!199 = !DILocation(line: 209, column: 39, scope: !193)
!200 = !DILocation(line: 209, column: 38, scope: !193)
!201 = !DILocation(line: 209, column: 37, scope: !193)
!202 = !DILocation(line: 209, column: 10, scope: !193)
!203 = !DILocation(line: 209, column: 3, scope: !193)
!204 = distinct !DISubprogram(name: "toupper", scope: !194, file: !194, line: 213, type: !139, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !205)
!205 = !{!206}
!206 = !DILocalVariable(name: "__c", arg: 1, scope: !204, file: !194, line: 213, type: !6)
!207 = !DILocation(line: 0, scope: !204)
!208 = !DILocation(line: 215, column: 22, scope: !204)
!209 = !DILocation(line: 215, column: 39, scope: !204)
!210 = !DILocation(line: 215, column: 38, scope: !204)
!211 = !DILocation(line: 215, column: 37, scope: !204)
!212 = !DILocation(line: 215, column: 10, scope: !204)
!213 = !DILocation(line: 215, column: 3, scope: !204)
!214 = distinct !DISubprogram(name: "atoi", scope: !215, file: !215, line: 361, type: !216, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !218)
!215 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!216 = !DISubroutineType(types: !217)
!217 = !{!6, !11}
!218 = !{!219}
!219 = !DILocalVariable(name: "__nptr", arg: 1, scope: !214, file: !215, line: 361, type: !11)
!220 = !DILocation(line: 0, scope: !214)
!221 = !DILocation(line: 363, column: 16, scope: !214)
!222 = !DILocation(line: 363, column: 10, scope: !214)
!223 = !DILocation(line: 363, column: 3, scope: !214)
!224 = distinct !DISubprogram(name: "atol", scope: !215, file: !215, line: 366, type: !225, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !227)
!225 = !DISubroutineType(types: !226)
!226 = !{!96, !11}
!227 = !{!228}
!228 = !DILocalVariable(name: "__nptr", arg: 1, scope: !224, file: !215, line: 366, type: !11)
!229 = !DILocation(line: 0, scope: !224)
!230 = !DILocation(line: 368, column: 10, scope: !224)
!231 = !DILocation(line: 368, column: 3, scope: !224)
!232 = distinct !DISubprogram(name: "atoll", scope: !215, file: !215, line: 373, type: !233, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !236)
!233 = !DISubroutineType(types: !234)
!234 = !{!235, !11}
!235 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!236 = !{!237}
!237 = !DILocalVariable(name: "__nptr", arg: 1, scope: !232, file: !215, line: 373, type: !11)
!238 = !DILocation(line: 0, scope: !232)
!239 = !DILocation(line: 375, column: 10, scope: !232)
!240 = !DILocation(line: 375, column: 3, scope: !232)
!241 = distinct !DISubprogram(name: "bsearch", scope: !242, file: !242, line: 20, type: !243, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !249)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!243 = !DISubroutineType(types: !244)
!244 = !{!10, !24, !24, !17, !17, !245}
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !215, line: 808, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!6, !24, !24}
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!250 = !DILocalVariable(name: "__key", arg: 1, scope: !241, file: !242, line: 20, type: !24)
!251 = !DILocalVariable(name: "__base", arg: 2, scope: !241, file: !242, line: 20, type: !24)
!252 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !241, file: !242, line: 20, type: !17)
!253 = !DILocalVariable(name: "__size", arg: 4, scope: !241, file: !242, line: 20, type: !17)
!254 = !DILocalVariable(name: "__compar", arg: 5, scope: !241, file: !242, line: 21, type: !245)
!255 = !DILocalVariable(name: "__l", scope: !241, file: !242, line: 23, type: !17)
!256 = !DILocalVariable(name: "__u", scope: !241, file: !242, line: 23, type: !17)
!257 = !DILocalVariable(name: "__idx", scope: !241, file: !242, line: 23, type: !17)
!258 = !DILocalVariable(name: "__p", scope: !241, file: !242, line: 24, type: !24)
!259 = !DILocalVariable(name: "__comparison", scope: !241, file: !242, line: 25, type: !6)
!260 = !DILocation(line: 0, scope: !241)
!261 = !DILocation(line: 29, column: 3, scope: !241)
!262 = !DILocation(line: 27, column: 7, scope: !241)
!263 = !DILocation(line: 29, column: 14, scope: !241)
!264 = !DILocation(line: 31, column: 20, scope: !265)
!265 = distinct !DILexicalBlock(scope: !241, file: !242, line: 30, column: 5)
!266 = !DILocation(line: 31, column: 27, scope: !265)
!267 = !DILocation(line: 32, column: 56, scope: !265)
!268 = !DILocation(line: 32, column: 47, scope: !265)
!269 = !DILocation(line: 33, column: 22, scope: !265)
!270 = !DILocation(line: 34, column: 24, scope: !271)
!271 = distinct !DILexicalBlock(scope: !265, file: !242, line: 34, column: 11)
!272 = !DILocation(line: 34, column: 11, scope: !265)
!273 = !DILocation(line: 36, column: 29, scope: !274)
!274 = distinct !DILexicalBlock(scope: !271, file: !242, line: 36, column: 16)
!275 = !DILocation(line: 36, column: 16, scope: !271)
!276 = !DILocation(line: 37, column: 14, scope: !274)
!277 = distinct !{!277, !261, !278}
!278 = !DILocation(line: 40, column: 5, scope: !241)
!279 = !DILocation(line: 43, column: 1, scope: !241)
!280 = distinct !DISubprogram(name: "atof", scope: !281, file: !281, line: 25, type: !282, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !285)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !11}
!284 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!285 = !{!286}
!286 = !DILocalVariable(name: "__nptr", arg: 1, scope: !280, file: !281, line: 25, type: !11)
!287 = !DILocation(line: 0, scope: !280)
!288 = !DILocation(line: 27, column: 10, scope: !280)
!289 = !DILocation(line: 27, column: 3, scope: !280)
!290 = distinct !DISubprogram(name: "strtoimax", scope: !291, file: !291, line: 324, type: !292, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !298)
!291 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !43, !297, !6}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !295, line: 101, baseType: !296)
!295 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !95, line: 72, baseType: !96)
!297 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !7)
!298 = !{!299, !300, !301}
!299 = !DILocalVariable(name: "nptr", arg: 1, scope: !290, file: !291, line: 324, type: !43)
!300 = !DILocalVariable(name: "endptr", arg: 2, scope: !290, file: !291, line: 324, type: !297)
!301 = !DILocalVariable(name: "base", arg: 3, scope: !290, file: !291, line: 324, type: !6)
!302 = !DILocation(line: 0, scope: !290)
!303 = !DILocation(line: 327, column: 10, scope: !290)
!304 = !DILocation(line: 327, column: 3, scope: !290)
!305 = distinct !DISubprogram(name: "strtoumax", scope: !291, file: !291, line: 336, type: !306, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !310)
!306 = !DISubroutineType(types: !307)
!307 = !{!308, !43, !297, !6}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !295, line: 102, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !95, line: 73, baseType: !19)
!310 = !{!311, !312, !313}
!311 = !DILocalVariable(name: "nptr", arg: 1, scope: !305, file: !291, line: 336, type: !43)
!312 = !DILocalVariable(name: "endptr", arg: 2, scope: !305, file: !291, line: 336, type: !297)
!313 = !DILocalVariable(name: "base", arg: 3, scope: !305, file: !291, line: 336, type: !6)
!314 = !DILocation(line: 0, scope: !305)
!315 = !DILocation(line: 339, column: 10, scope: !305)
!316 = !DILocation(line: 339, column: 3, scope: !305)
!317 = distinct !DISubprogram(name: "wcstoimax", scope: !291, file: !291, line: 348, type: !318, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !327)
!318 = !DISubroutineType(types: !319)
!319 = !{!294, !320, !324, !6}
!320 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !291, line: 34, baseType: !6)
!324 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!327 = !{!328, !329, !330}
!328 = !DILocalVariable(name: "nptr", arg: 1, scope: !317, file: !291, line: 348, type: !320)
!329 = !DILocalVariable(name: "endptr", arg: 2, scope: !317, file: !291, line: 348, type: !324)
!330 = !DILocalVariable(name: "base", arg: 3, scope: !317, file: !291, line: 348, type: !6)
!331 = !DILocation(line: 0, scope: !317)
!332 = !DILocation(line: 351, column: 10, scope: !317)
!333 = !DILocation(line: 351, column: 3, scope: !317)
!334 = distinct !DISubprogram(name: "wcstoumax", scope: !291, file: !291, line: 362, type: !335, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!308, !320, !324, !6}
!337 = !{!338, !339, !340}
!338 = !DILocalVariable(name: "nptr", arg: 1, scope: !334, file: !291, line: 362, type: !320)
!339 = !DILocalVariable(name: "endptr", arg: 2, scope: !334, file: !291, line: 362, type: !324)
!340 = !DILocalVariable(name: "base", arg: 3, scope: !334, file: !291, line: 362, type: !6)
!341 = !DILocation(line: 0, scope: !334)
!342 = !DILocation(line: 365, column: 10, scope: !334)
!343 = !DILocation(line: 365, column: 3, scope: !334)
!344 = distinct !DISubprogram(name: "stat", scope: !345, file: !345, line: 453, type: !346, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !385)
!345 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!346 = !DISubroutineType(types: !347)
!347 = !{!6, !11, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !350, line: 46, size: 1152, elements: !351)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!351 = !{!352, !354, !356, !358, !360, !362, !364, !365, !366, !367, !369, !371, !379, !380, !381}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !349, file: !350, line: 48, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !95, line: 145, baseType: !19)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !349, file: !350, line: 53, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !95, line: 148, baseType: !19)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !349, file: !350, line: 61, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !95, line: 151, baseType: !19)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !349, file: !350, line: 62, baseType: !359, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !95, line: 150, baseType: !48)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !349, file: !350, line: 64, baseType: !361, size: 32, offset: 224)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !95, line: 146, baseType: !48)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !349, file: !350, line: 65, baseType: !363, size: 32, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !95, line: 147, baseType: !48)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !349, file: !350, line: 67, baseType: !6, size: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !349, file: !350, line: 69, baseType: !353, size: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !349, file: !350, line: 74, baseType: !94, size: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !349, file: !350, line: 78, baseType: !368, size: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !95, line: 174, baseType: !96)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !349, file: !350, line: 80, baseType: !370, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !95, line: 179, baseType: !96)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !349, file: !350, line: 91, baseType: !372, size: 128, offset: 576)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !373, line: 10, size: 128, elements: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!374 = !{!375, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !372, file: !373, line: 12, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !95, line: 160, baseType: !96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !372, file: !373, line: 16, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !95, line: 196, baseType: !96)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !349, file: !350, line: 92, baseType: !372, size: 128, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !349, file: !350, line: 93, baseType: !372, size: 128, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !349, file: !350, line: 106, baseType: !382, size: 192, offset: 960)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 192, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 3)
!385 = !{!386, !387}
!386 = !DILocalVariable(name: "__path", arg: 1, scope: !344, file: !345, line: 453, type: !11)
!387 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !344, file: !345, line: 453, type: !348)
!388 = !DILocation(line: 0, scope: !344)
!389 = !DILocation(line: 455, column: 10, scope: !344)
!390 = !DILocation(line: 455, column: 3, scope: !344)
!391 = distinct !DISubprogram(name: "lstat", scope: !345, file: !345, line: 460, type: !346, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !392)
!392 = !{!393, !394}
!393 = !DILocalVariable(name: "__path", arg: 1, scope: !391, file: !345, line: 460, type: !11)
!394 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !391, file: !345, line: 460, type: !348)
!395 = !DILocation(line: 0, scope: !391)
!396 = !DILocation(line: 462, column: 10, scope: !391)
!397 = !DILocation(line: 462, column: 3, scope: !391)
!398 = distinct !DISubprogram(name: "fstat", scope: !345, file: !345, line: 467, type: !399, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!6, !6, !348}
!401 = !{!402, !403}
!402 = !DILocalVariable(name: "__fd", arg: 1, scope: !398, file: !345, line: 467, type: !6)
!403 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !398, file: !345, line: 467, type: !348)
!404 = !DILocation(line: 0, scope: !398)
!405 = !DILocation(line: 469, column: 10, scope: !398)
!406 = !DILocation(line: 469, column: 3, scope: !398)
!407 = distinct !DISubprogram(name: "fstatat", scope: !345, file: !345, line: 474, type: !408, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{!6, !6, !11, !348, !6}
!410 = !{!411, !412, !413, !414}
!411 = !DILocalVariable(name: "__fd", arg: 1, scope: !407, file: !345, line: 474, type: !6)
!412 = !DILocalVariable(name: "__filename", arg: 2, scope: !407, file: !345, line: 474, type: !11)
!413 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !407, file: !345, line: 474, type: !348)
!414 = !DILocalVariable(name: "__flag", arg: 4, scope: !407, file: !345, line: 474, type: !6)
!415 = !DILocation(line: 0, scope: !407)
!416 = !DILocation(line: 477, column: 10, scope: !407)
!417 = !DILocation(line: 477, column: 3, scope: !407)
!418 = distinct !DISubprogram(name: "mknod", scope: !345, file: !345, line: 483, type: !419, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !421)
!419 = !DISubroutineType(types: !420)
!420 = !{!6, !11, !359, !353}
!421 = !{!422, !423, !424}
!422 = !DILocalVariable(name: "__path", arg: 1, scope: !418, file: !345, line: 483, type: !11)
!423 = !DILocalVariable(name: "__mode", arg: 2, scope: !418, file: !345, line: 483, type: !359)
!424 = !DILocalVariable(name: "__dev", arg: 3, scope: !418, file: !345, line: 483, type: !353)
!425 = !DILocation(line: 0, scope: !418)
!426 = !DILocation(line: 485, column: 10, scope: !418)
!427 = !DILocation(line: 485, column: 3, scope: !418)
!428 = distinct !DISubprogram(name: "mknodat", scope: !345, file: !345, line: 491, type: !429, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{!6, !6, !11, !359, !353}
!431 = !{!432, !433, !434, !435}
!432 = !DILocalVariable(name: "__fd", arg: 1, scope: !428, file: !345, line: 491, type: !6)
!433 = !DILocalVariable(name: "__path", arg: 2, scope: !428, file: !345, line: 491, type: !11)
!434 = !DILocalVariable(name: "__mode", arg: 3, scope: !428, file: !345, line: 491, type: !359)
!435 = !DILocalVariable(name: "__dev", arg: 4, scope: !428, file: !345, line: 491, type: !353)
!436 = !DILocation(line: 0, scope: !428)
!437 = !DILocation(line: 494, column: 10, scope: !428)
!438 = !DILocation(line: 494, column: 3, scope: !428)
!439 = distinct !DISubprogram(name: "stat64", scope: !345, file: !345, line: 502, type: !440, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !462)
!440 = !DISubroutineType(types: !441)
!441 = !{!6, !11, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !350, line: 119, size: 1152, elements: !444)
!444 = !{!445, !446, !448, !449, !450, !451, !452, !453, !454, !455, !456, !458, !459, !460, !461}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !443, file: !350, line: 121, baseType: !353, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !443, file: !350, line: 123, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !95, line: 149, baseType: !19)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !443, file: !350, line: 124, baseType: !357, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !443, file: !350, line: 125, baseType: !359, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !443, file: !350, line: 132, baseType: !361, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !443, file: !350, line: 133, baseType: !363, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !443, file: !350, line: 135, baseType: !6, size: 32, offset: 288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !443, file: !350, line: 136, baseType: !353, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !443, file: !350, line: 137, baseType: !94, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !443, file: !350, line: 143, baseType: !368, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !443, file: !350, line: 144, baseType: !457, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !95, line: 180, baseType: !96)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !443, file: !350, line: 152, baseType: !372, size: 128, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !443, file: !350, line: 153, baseType: !372, size: 128, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !443, file: !350, line: 154, baseType: !372, size: 128, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !443, file: !350, line: 164, baseType: !382, size: 192, offset: 960)
!462 = !{!463, !464}
!463 = !DILocalVariable(name: "__path", arg: 1, scope: !439, file: !345, line: 502, type: !11)
!464 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !439, file: !345, line: 502, type: !442)
!465 = !DILocation(line: 0, scope: !439)
!466 = !DILocation(line: 504, column: 10, scope: !439)
!467 = !DILocation(line: 504, column: 3, scope: !439)
!468 = distinct !DISubprogram(name: "lstat64", scope: !345, file: !345, line: 509, type: !440, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !469)
!469 = !{!470, !471}
!470 = !DILocalVariable(name: "__path", arg: 1, scope: !468, file: !345, line: 509, type: !11)
!471 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !468, file: !345, line: 509, type: !442)
!472 = !DILocation(line: 0, scope: !468)
!473 = !DILocation(line: 511, column: 10, scope: !468)
!474 = !DILocation(line: 511, column: 3, scope: !468)
!475 = distinct !DISubprogram(name: "fstat64", scope: !345, file: !345, line: 516, type: !476, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !478)
!476 = !DISubroutineType(types: !477)
!477 = !{!6, !6, !442}
!478 = !{!479, !480}
!479 = !DILocalVariable(name: "__fd", arg: 1, scope: !475, file: !345, line: 516, type: !6)
!480 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !475, file: !345, line: 516, type: !442)
!481 = !DILocation(line: 0, scope: !475)
!482 = !DILocation(line: 518, column: 10, scope: !475)
!483 = !DILocation(line: 518, column: 3, scope: !475)
!484 = distinct !DISubprogram(name: "fstatat64", scope: !345, file: !345, line: 523, type: !485, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !487)
!485 = !DISubroutineType(types: !486)
!486 = !{!6, !6, !11, !442, !6}
!487 = !{!488, !489, !490, !491}
!488 = !DILocalVariable(name: "__fd", arg: 1, scope: !484, file: !345, line: 523, type: !6)
!489 = !DILocalVariable(name: "__filename", arg: 2, scope: !484, file: !345, line: 523, type: !11)
!490 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !484, file: !345, line: 523, type: !442)
!491 = !DILocalVariable(name: "__flag", arg: 4, scope: !484, file: !345, line: 523, type: !6)
!492 = !DILocation(line: 0, scope: !484)
!493 = !DILocation(line: 526, column: 10, scope: !484)
!494 = !DILocation(line: 526, column: 3, scope: !484)
!495 = distinct !DISubprogram(name: "pointer_set_create", scope: !1, file: !1, line: 72, type: !496, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{!13}
!498 = !{!499}
!499 = !DILocalVariable(name: "result", scope: !495, file: !1, line: 74, type: !13)
!500 = !DILocation(line: 74, column: 34, scope: !495)
!501 = !DILocation(line: 0, scope: !495)
!502 = !DILocation(line: 76, column: 11, scope: !495)
!503 = !DILocation(line: 76, column: 22, scope: !495)
!504 = !DILocation(line: 77, column: 11, scope: !495)
!505 = !DILocation(line: 77, column: 21, scope: !495)
!506 = !DILocation(line: 78, column: 11, scope: !495)
!507 = !DILocation(line: 78, column: 19, scope: !495)
!508 = !DILocation(line: 80, column: 19, scope: !495)
!509 = !DILocation(line: 80, column: 11, scope: !495)
!510 = !DILocation(line: 80, column: 17, scope: !495)
!511 = !DILocation(line: 81, column: 3, scope: !495)
!512 = distinct !DISubprogram(name: "pointer_set_destroy", scope: !1, file: !1, line: 86, type: !513, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !515)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !13}
!515 = !{!516}
!516 = !DILocalVariable(name: "pset", arg: 1, scope: !512, file: !1, line: 86, type: !13)
!517 = !DILocation(line: 0, scope: !512)
