; ModuleID = 'predict.bc'
source_filename = "predict.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }

!850 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!851 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!852 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!853 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!854 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!855 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!856 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!857 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!858 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!859 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!860 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!861 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!862 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!863 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!864 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!865 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_code", file: !839, line: 51, baseType: !7, size: 32, elements: !866)
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902}
!867 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!868 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!869 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!870 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!871 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!872 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!873 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!874 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!875 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!876 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!877 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!878 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!879 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!880 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!881 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!882 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!883 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!884 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!885 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!886 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!887 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!888 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!889 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!890 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!891 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!892 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!893 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!894 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!895 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!896 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!897 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!898 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!899 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!900 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!901 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!902 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!903 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !839, line: 80, baseType: !7, size: 32, elements: !904)
!904 = !{!905, !906, !907, !908}
!905 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!906 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!907 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!908 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!909 = !{!910, !911, !912, !913, !916, !917, !635, !778, !5, !919, !2407, !2408, !2420, !816, !603, !2427, !203, !1649, !2428, !984, !1683, !914, !2430, !979, !925, !1881, !1108, !903}
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!912 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !915)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_prediction", file: !921, line: 307, size: 192, elements: !922)
!921 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!922 = !{!923, !924, !2405, !2406}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ep_next", scope: !920, file: !921, line: 308, baseType: !919, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ep_edge", scope: !920, file: !921, line: 309, baseType: !925, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !926, line: 108, baseType: !927)
!926 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !929)
!929 = !{!930, !2392, !2393, !2398, !2399, !2400, !2401, !2402, !2403, !2404}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !928, file: !142, line: 124, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !933)
!933 = !{!934, !949, !950, !951, !2361, !2365, !2366, !2367, !2385, !2387, !2388, !2389, !2390, !2391}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !932, file: !142, line: 219, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !938)
!938 = !{!939}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !937, file: !142, line: 151, baseType: !940, size: 128)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !941)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !942)
!942 = !{!943, !944, !945}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !941, file: !142, line: 150, baseType: !7, size: 32)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !941, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !941, file: !142, line: 150, baseType: !946, size: 64, offset: 64)
!946 = !DICompositeType(tag: DW_TAG_array_type, baseType: !925, size: 64, elements: !947)
!947 = !{!948}
!948 = !DISubrange(count: 1)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !932, file: !142, line: 220, baseType: !935, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !932, file: !142, line: 223, baseType: !916, size: 64, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !932, file: !142, line: 226, baseType: !952, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !153, line: 100, size: 1216, elements: !954)
!954 = !{!955, !956, !957, !958, !959, !964, !965, !966, !980, !981, !982, !983, !2338, !2339, !2340, !2341, !2342, !2343, !2351, !2359, !2360}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !953, file: !153, line: 102, baseType: !912, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !953, file: !153, line: 105, baseType: !7, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !953, file: !153, line: 108, baseType: !931, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !953, file: !153, line: 111, baseType: !931, size: 64, offset: 128)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !953, file: !153, line: 114, baseType: !960, size: 64, offset: 192)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !153, line: 41, size: 64, elements: !961)
!961 = !{!962, !963}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !960, file: !153, line: 42, baseType: !152, size: 32)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !960, file: !153, line: 43, baseType: !7, size: 32, offset: 32)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !953, file: !153, line: 117, baseType: !7, size: 32, offset: 256)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !953, file: !153, line: 120, baseType: !7, size: 32, offset: 288)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !953, file: !153, line: 123, baseType: !967, size: 64, offset: 320)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !153, line: 87, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !153, line: 87, size: 128, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !969, file: !153, line: 87, baseType: !972, size: 128)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !153, line: 85, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !153, line: 85, size: 128, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !973, file: !153, line: 85, baseType: !7, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !973, file: !153, line: 85, baseType: !7, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !973, file: !153, line: 85, baseType: !978, size: 64, offset: 64)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 64, elements: !947)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !153, line: 84, baseType: !952)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !953, file: !153, line: 126, baseType: !952, size: 64, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !953, file: !153, line: 129, baseType: !952, size: 64, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !953, file: !153, line: 132, baseType: !916, size: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !953, file: !153, line: 139, baseType: !984, size: 64, offset: 576)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !926, line: 56, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !171, line: 3371, size: 1792, elements: !987)
!987 = !{!988, !1021, !1027, !1040, !1059, !1070, !1075, !1082, !1088, !1101, !1113, !1151, !1358, !1386, !1402, !1403, !1408, !1417, !1423, !1428, !1432, !1436, !1989, !2036, !2042, !2048, !2055, !2068, !2082, !2099, !2111, !2133, !2148, !2320}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !986, file: !171, line: 3372, baseType: !989, size: 64)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !171, line: 360, size: 64, elements: !990)
!990 = !{!991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !989, file: !171, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !989, file: !171, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !989, file: !171, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !989, file: !171, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !989, file: !171, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !989, file: !171, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !989, file: !171, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !989, file: !171, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !989, file: !171, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !989, file: !171, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !989, file: !171, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !989, file: !171, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !989, file: !171, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !989, file: !171, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !989, file: !171, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !989, file: !171, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !989, file: !171, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !989, file: !171, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !989, file: !171, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !989, file: !171, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !989, file: !171, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !989, file: !171, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !989, file: !171, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !989, file: !171, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !989, file: !171, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !989, file: !171, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !989, file: !171, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !989, file: !171, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !989, file: !171, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !989, file: !171, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !986, file: !171, line: 3373, baseType: !1022, size: 192)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !171, line: 402, size: 192, elements: !1023)
!1023 = !{!1024, !1025, !1026}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1022, file: !171, line: 403, baseType: !989, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1022, file: !171, line: 404, baseType: !984, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1022, file: !171, line: 405, baseType: !984, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !986, file: !171, line: 3374, baseType: !1028, size: 320)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !171, line: 1384, size: 320, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1028, file: !171, line: 1385, baseType: !1022, size: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1028, file: !171, line: 1386, baseType: !1032, size: 128, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1033, line: 58, baseType: !1034)
!1033 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1033, line: 54, size: 128, elements: !1035)
!1035 = !{!1036, !1038}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1034, file: !1033, line: 56, baseType: !1037, size: 64)
!1037 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1034, file: !1033, line: 57, baseType: !1039, size: 64, offset: 64)
!1039 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !986, file: !171, line: 3375, baseType: !1041, size: 256)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !171, line: 1397, size: 256, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1041, file: !171, line: 1398, baseType: !1022, size: 192)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1041, file: !171, line: 1399, baseType: !1045, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1047, line: 52, size: 256, elements: !1048)
!1047 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1048 = !{!1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1046, file: !1047, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1046, file: !1047, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1046, file: !1047, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1046, file: !1047, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1046, file: !1047, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1046, file: !1047, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1046, file: !1047, line: 62, baseType: !1056, size: 192, offset: 64)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1037, size: 192, elements: !1057)
!1057 = !{!1058}
!1058 = !DISubrange(count: 3)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !986, file: !171, line: 3376, baseType: !1060, size: 256)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !171, line: 1408, size: 256, elements: !1061)
!1061 = !{!1062, !1063}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1060, file: !171, line: 1409, baseType: !1022, size: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1060, file: !171, line: 1410, baseType: !1064, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1066, line: 27, size: 192, elements: !1067)
!1066 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1065, file: !1066, line: 29, baseType: !1032, size: 128)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1065, file: !1066, line: 30, baseType: !5, size: 32, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !986, file: !171, line: 3377, baseType: !1071, size: 256)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !171, line: 1437, size: 256, elements: !1072)
!1072 = !{!1073, !1074}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !171, line: 1438, baseType: !1022, size: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1071, file: !171, line: 1439, baseType: !984, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !986, file: !171, line: 3378, baseType: !1076, size: 256)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !171, line: 1418, size: 256, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1076, file: !171, line: 1419, baseType: !1022, size: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1076, file: !171, line: 1420, baseType: !912, size: 32, offset: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1076, file: !171, line: 1421, baseType: !1081, size: 8, offset: 224)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 8, elements: !947)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !986, file: !171, line: 3379, baseType: !1083, size: 320)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !171, line: 1428, size: 320, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1083, file: !171, line: 1429, baseType: !1022, size: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1083, file: !171, line: 1430, baseType: !984, size: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1083, file: !171, line: 1431, baseType: !984, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !986, file: !171, line: 3380, baseType: !1089, size: 320)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !171, line: 1460, size: 320, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1089, file: !171, line: 1461, baseType: !1022, size: 192)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1089, file: !171, line: 1462, baseType: !1093, size: 128, offset: 192)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1094, line: 31, size: 128, elements: !1095)
!1094 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1095 = !{!1096, !1099, !1100}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1093, file: !1094, line: 32, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !911)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1093, file: !1094, line: 33, baseType: !7, size: 32, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1093, file: !1094, line: 34, baseType: !7, size: 32, offset: 96)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !986, file: !171, line: 3381, baseType: !1102, size: 384)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !171, line: 2507, size: 384, elements: !1103)
!1103 = !{!1104, !1105, !1110, !1111, !1112}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1102, file: !171, line: 2508, baseType: !1022, size: 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1102, file: !171, line: 2509, baseType: !1106, size: 32, offset: 192)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1107, line: 58, baseType: !1108)
!1107 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1109, line: 44, baseType: !7)
!1109 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1102, file: !171, line: 2510, baseType: !7, size: 32, offset: 224)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1102, file: !171, line: 2511, baseType: !984, size: 64, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1102, file: !171, line: 2512, baseType: !984, size: 64, offset: 320)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !986, file: !171, line: 3382, baseType: !1114, size: 896)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !171, line: 2652, size: 896, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !171, line: 2653, baseType: !1102, size: 384)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !171, line: 2654, baseType: !984, size: 64, offset: 384)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1114, file: !171, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1114, file: !171, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1114, file: !171, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1114, file: !171, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1114, file: !171, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1114, file: !171, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1114, file: !171, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1114, file: !171, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1114, file: !171, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1114, file: !171, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1114, file: !171, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1114, file: !171, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1114, file: !171, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1114, file: !171, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1114, file: !171, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1114, file: !171, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1114, file: !171, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1114, file: !171, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1114, file: !171, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1114, file: !171, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1114, file: !171, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1114, file: !171, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1114, file: !171, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1114, file: !171, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1114, file: !171, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1114, file: !171, line: 2703, baseType: !7, size: 32, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1114, file: !171, line: 2705, baseType: !984, size: 64, offset: 576)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1114, file: !171, line: 2706, baseType: !984, size: 64, offset: 640)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1114, file: !171, line: 2707, baseType: !984, size: 64, offset: 704)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1114, file: !171, line: 2708, baseType: !984, size: 64, offset: 768)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1114, file: !171, line: 2711, baseType: !1149, size: 64, offset: 832)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !171, line: 2711, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !986, file: !171, line: 3383, baseType: !1152, size: 960)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !171, line: 2756, size: 960, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1152, file: !171, line: 2757, baseType: !1114, size: 896)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1152, file: !171, line: 2758, baseType: !1156, size: 64, offset: 896)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !926, line: 50, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !636, line: 240, size: 384, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1158, file: !636, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1158, file: !636, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1158, file: !636, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1158, file: !636, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1158, file: !636, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1158, file: !636, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1158, file: !636, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1158, file: !636, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1158, file: !636, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1158, file: !636, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1158, file: !636, line: 321, baseType: !1171, size: 320, offset: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !636, line: 315, size: 320, elements: !1172)
!1172 = !{!1173, !1291, !1293, !1356, !1357}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1171, file: !636, line: 316, baseType: !1174, size: 64)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 64, elements: !947)
!1175 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !636, line: 183, baseType: !1176)
!1176 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !636, line: 166, size: 64, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182, !1190, !1191, !1203, !1206, !1266, !1267, !1268, !1281, !1288}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1176, file: !636, line: 168, baseType: !912, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1176, file: !636, line: 169, baseType: !7, size: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1176, file: !636, line: 170, baseType: !917, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1176, file: !636, line: 171, baseType: !1156, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1176, file: !636, line: 172, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !926, line: 53, baseType: !1184)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !636, line: 359, size: 128, elements: !1186)
!1186 = !{!1187, !1188}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1185, file: !636, line: 360, baseType: !912, size: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1185, file: !636, line: 361, baseType: !1189, size: 64, offset: 64)
!1189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1156, size: 64, elements: !947)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1176, file: !636, line: 173, baseType: !5, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1176, file: !636, line: 174, baseType: !1192, size: 32)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !636, line: 133, baseType: !1193)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !636, line: 115, size: 32, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1193, file: !636, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1193, file: !636, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1193, file: !636, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1193, file: !636, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1193, file: !636, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1193, file: !636, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1193, file: !636, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1193, file: !636, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1176, file: !636, line: 175, baseType: !1204, size: 64)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !636, line: 175, flags: DIFlagFwdDecl)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1176, file: !636, line: 176, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1209, line: 75, size: 256, elements: !1210)
!1209 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1210 = !{!1211, !1225, !1226, !1227}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1208, file: !1209, line: 76, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1209, line: 68, baseType: !1214)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1209, line: 63, size: 320, elements: !1215)
!1215 = !{!1216, !1218, !1219, !1220}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1214, file: !1209, line: 64, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1214, file: !1209, line: 65, baseType: !1217, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1214, file: !1209, line: 66, baseType: !7, size: 32, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1214, file: !1209, line: 67, baseType: !1221, size: 128, offset: 192)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 128, elements: !1223)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1209, line: 29, baseType: !1037)
!1223 = !{!1224}
!1224 = !DISubrange(count: 2)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1208, file: !1209, line: 77, baseType: !1212, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1208, file: !1209, line: 78, baseType: !7, size: 32, offset: 128)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1208, file: !1209, line: 79, baseType: !1228, size: 64, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1209, line: 49, baseType: !1230)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1209, line: 45, size: 832, elements: !1231)
!1231 = !{!1232, !1233, !1234}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1230, file: !1209, line: 46, baseType: !1217, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1230, file: !1209, line: 47, baseType: !1207, size: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1230, file: !1209, line: 48, baseType: !1235, size: 704, offset: 128)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1236, line: 164, size: 704, elements: !1237)
!1236 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1237 = !{!1238, !1239, !1249, !1250, !1251, !1252, !1253, !1254, !1258, !1262, !1263, !1264, !1265}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1235, file: !1236, line: 166, baseType: !1039, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1235, file: !1236, line: 167, baseType: !1240, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1236, line: 157, size: 192, elements: !1242)
!1242 = !{!1243, !1244, !1245}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1241, file: !1236, line: 159, baseType: !914, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1241, file: !1236, line: 160, baseType: !1240, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1241, file: !1236, line: 161, baseType: !1246, size: 32, offset: 128)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !915, size: 32, elements: !1247)
!1247 = !{!1248}
!1248 = !DISubrange(count: 4)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1235, file: !1236, line: 168, baseType: !914, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1235, file: !1236, line: 169, baseType: !914, size: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1235, file: !1236, line: 170, baseType: !914, size: 64, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1235, file: !1236, line: 171, baseType: !1039, size: 64, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1235, file: !1236, line: 172, baseType: !912, size: 32, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1235, file: !1236, line: 176, baseType: !1255, size: 64, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DISubroutineType(types: !1257)
!1257 = !{!1240, !916, !1039}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1235, file: !1236, line: 177, baseType: !1259, size: 64, offset: 512)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !916, !1240}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1235, file: !1236, line: 178, baseType: !916, size: 64, offset: 576)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1235, file: !1236, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1235, file: !1236, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1235, file: !1236, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1176, file: !636, line: 177, baseType: !984, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1176, file: !636, line: 178, baseType: !931, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1176, file: !636, line: 179, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1270, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !636, line: 150, baseType: !1271)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !636, line: 142, size: 320, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276, !1279, !1280}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1271, file: !636, line: 144, baseType: !984, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1271, file: !636, line: 145, baseType: !1156, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1271, file: !636, line: 146, baseType: !1156, size: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1271, file: !636, line: 147, baseType: !1277, size: 32, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1278, line: 31, baseType: !912)
!1278 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1271, file: !636, line: 148, baseType: !7, size: 32, offset: 224)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1271, file: !636, line: 149, baseType: !911, size: 8, offset: 256)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1176, file: !636, line: 180, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !636, line: 162, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !636, line: 159, size: 128, elements: !1285)
!1285 = !{!1286, !1287}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1284, file: !636, line: 160, baseType: !984, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1284, file: !636, line: 161, baseType: !1039, size: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1176, file: !636, line: 181, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !636, line: 181, flags: DIFlagFwdDecl)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1171, file: !636, line: 317, baseType: !1292, size: 64)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 64, elements: !947)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1171, file: !636, line: 318, baseType: !1294, size: 320)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !636, line: 188, size: 320, elements: !1295)
!1295 = !{!1296, !1298, !1355}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1294, file: !636, line: 190, baseType: !1297, size: 192)
!1297 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 192, elements: !1057)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1294, file: !636, line: 193, baseType: !1299, size: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !636, line: 206, size: 320, elements: !1301)
!1301 = !{!1302, !1340, !1341, !1342, !1354}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1300, file: !636, line: 208, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !926, line: 62, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1306, line: 538, size: 256, elements: !1307)
!1306 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1307 = !{!1308, !1312, !1318, !1331}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1305, file: !1306, line: 539, baseType: !1309, size: 32)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1306, line: 482, size: 32, elements: !1310)
!1310 = !{!1311}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1309, file: !1306, line: 484, baseType: !7, size: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1305, file: !1306, line: 540, baseType: !1313, size: 192)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1306, line: 488, size: 192, elements: !1314)
!1314 = !{!1315, !1316, !1317}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1313, file: !1306, line: 489, baseType: !1309, size: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1313, file: !1306, line: 492, baseType: !917, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1313, file: !1306, line: 496, baseType: !984, size: 64, offset: 128)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1305, file: !1306, line: 541, baseType: !1319, size: 256)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1306, line: 504, size: 256, elements: !1320)
!1320 = !{!1321, !1322, !1329, !1330}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1319, file: !1306, line: 505, baseType: !1309, size: 32)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1319, file: !1306, line: 509, baseType: !1323, size: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1306, line: 501, baseType: !1324)
!1324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1325, size: 64)
!1325 = !DISubroutineType(types: !1326)
!1326 = !{null, !1327}
!1327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1328, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1319, file: !1306, line: 510, baseType: !1327, size: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1319, file: !1306, line: 513, baseType: !1303, size: 64, offset: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1305, file: !1306, line: 542, baseType: !1332, size: 128)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1306, line: 530, size: 128, elements: !1333)
!1333 = !{!1334, !1335}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1332, file: !1306, line: 531, baseType: !1309, size: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1332, file: !1306, line: 534, baseType: !1336, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1306, line: 525, baseType: !1337)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{!911, !984, !917, !1037, !1037}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1300, file: !636, line: 211, baseType: !7, size: 32, offset: 64)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1300, file: !636, line: 214, baseType: !1039, size: 64, offset: 128)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1300, file: !636, line: 224, baseType: !1343, size: 64, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !636, line: 202, baseType: !1345)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !636, line: 202, size: 128, elements: !1346)
!1346 = !{!1347}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1345, file: !636, line: 202, baseType: !1348, size: 128)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !636, line: 200, baseType: !1349)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !636, line: 200, size: 128, elements: !1350)
!1350 = !{!1351, !1352, !1353}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1349, file: !636, line: 200, baseType: !7, size: 32)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1349, file: !636, line: 200, baseType: !7, size: 32, offset: 32)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1349, file: !636, line: 200, baseType: !1189, size: 64, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1300, file: !636, line: 234, baseType: !1343, size: 64, offset: 256)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1294, file: !636, line: 197, baseType: !1039, size: 64, offset: 256)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1171, file: !636, line: 319, baseType: !1046, size: 256)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1171, file: !636, line: 320, baseType: !1065, size: 192)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !986, file: !171, line: 3384, baseType: !1359, size: 1472)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !171, line: 3114, size: 1472, elements: !1360)
!1360 = !{!1361, !1382, !1383, !1384, !1385}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1359, file: !171, line: 3115, baseType: !1362, size: 1216)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !171, line: 2984, size: 1216, elements: !1363)
!1363 = !{!1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1362, file: !171, line: 2985, baseType: !1152, size: 960)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1362, file: !171, line: 2986, baseType: !984, size: 64, offset: 960)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1362, file: !171, line: 2987, baseType: !984, size: 64, offset: 1024)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1362, file: !171, line: 2988, baseType: !984, size: 64, offset: 1088)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1362, file: !171, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1362, file: !171, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1362, file: !171, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1362, file: !171, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1362, file: !171, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1362, file: !171, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1362, file: !171, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1362, file: !171, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1362, file: !171, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1362, file: !171, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1362, file: !171, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1362, file: !171, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1362, file: !171, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1362, file: !171, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1359, file: !171, line: 3117, baseType: !984, size: 64, offset: 1216)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1359, file: !171, line: 3119, baseType: !984, size: 64, offset: 1280)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1359, file: !171, line: 3121, baseType: !984, size: 64, offset: 1344)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1359, file: !171, line: 3123, baseType: !984, size: 64, offset: 1408)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !986, file: !171, line: 3385, baseType: !1387, size: 1088)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !171, line: 2874, size: 1088, elements: !1388)
!1388 = !{!1389, !1390, !1391}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1387, file: !171, line: 2875, baseType: !1152, size: 960)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1387, file: !171, line: 2876, baseType: !1156, size: 64, offset: 960)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1387, file: !171, line: 2877, baseType: !1392, size: 64, offset: 1024)
!1392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1393, size: 64)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !921, line: 172, size: 128, elements: !1394)
!1394 = !{!1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1393, file: !921, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1393, file: !921, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1393, file: !921, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1393, file: !921, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1393, file: !921, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1393, file: !921, line: 195, baseType: !7, size: 32, offset: 32)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1393, file: !921, line: 199, baseType: !984, size: 64, offset: 64)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !986, file: !171, line: 3386, baseType: !1362, size: 1216)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !986, file: !171, line: 3387, baseType: !1404, size: 1280)
!1404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !171, line: 3093, size: 1280, elements: !1405)
!1405 = !{!1406, !1407}
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1404, file: !171, line: 3094, baseType: !1362, size: 1216)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1404, file: !171, line: 3095, baseType: !1392, size: 64, offset: 1216)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !986, file: !171, line: 3388, baseType: !1409, size: 1216)
!1409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !171, line: 2824, size: 1216, elements: !1410)
!1410 = !{!1411, !1412, !1413, !1414, !1415, !1416}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1409, file: !171, line: 2825, baseType: !1114, size: 896)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1409, file: !171, line: 2827, baseType: !984, size: 64, offset: 896)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1409, file: !171, line: 2828, baseType: !984, size: 64, offset: 960)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1409, file: !171, line: 2829, baseType: !984, size: 64, offset: 1024)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1409, file: !171, line: 2830, baseType: !984, size: 64, offset: 1088)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1409, file: !171, line: 2831, baseType: !984, size: 64, offset: 1152)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !986, file: !171, line: 3389, baseType: !1418, size: 1024)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !171, line: 2850, size: 1024, elements: !1419)
!1419 = !{!1420, !1421, !1422}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1418, file: !171, line: 2851, baseType: !1152, size: 960)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1418, file: !171, line: 2852, baseType: !912, size: 32, offset: 960)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1418, file: !171, line: 2853, baseType: !912, size: 32, offset: 992)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !986, file: !171, line: 3390, baseType: !1424, size: 1024)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !171, line: 2857, size: 1024, elements: !1425)
!1425 = !{!1426, !1427}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1424, file: !171, line: 2858, baseType: !1152, size: 960)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1424, file: !171, line: 2859, baseType: !1392, size: 64, offset: 960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !986, file: !171, line: 3391, baseType: !1429, size: 960)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !171, line: 2862, size: 960, elements: !1430)
!1430 = !{!1431}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1429, file: !171, line: 2863, baseType: !1152, size: 960)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !986, file: !171, line: 3392, baseType: !1433, size: 1472)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !171, line: 3304, size: 1472, elements: !1434)
!1434 = !{!1435}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1433, file: !171, line: 3305, baseType: !1359, size: 1472)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !986, file: !171, line: 3393, baseType: !1437, size: 1792)
!1437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !171, line: 3248, size: 1792, elements: !1438)
!1438 = !{!1439, !1440, !1968, !1969, !1970, !1971, !1972, !1973, !1974, !1975, !1976, !1977, !1978, !1979, !1980, !1981, !1982, !1983, !1984, !1985, !1986, !1987, !1988}
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1437, file: !171, line: 3249, baseType: !1359, size: 1472)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1437, file: !171, line: 3251, baseType: !1441, size: 64, offset: 1472)
!1441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1442, size: 64)
!1442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1443, line: 463, size: 1152, elements: !1444)
!1443 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1444 = !{!1445, !1607, !1638, !1850, !1904, !1912, !1913, !1914, !1915, !1916, !1917, !1941, !1944, !1945, !1946, !1947, !1948, !1949, !1950, !1951, !1952, !1953, !1954, !1955, !1956, !1957, !1958, !1959, !1960, !1961, !1962, !1963, !1964, !1965, !1966, !1967}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1442, file: !1443, line: 464, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1447, size: 64)
!1447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1448)
!1448 = !{!1449, !1498, !1511, !1525, !1575, !1588}
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1447, file: !135, line: 197, baseType: !1450, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1451)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1453)
!1453 = !{!1454, !1455, !1456, !1457, !1458, !1459, !1486, !1495, !1496, !1497}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1452, file: !135, line: 119, baseType: !1451, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1452, file: !135, line: 122, baseType: !1451, size: 64, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1452, file: !135, line: 123, baseType: !1451, size: 64, offset: 128)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1452, file: !135, line: 126, baseType: !912, size: 32, offset: 192)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1452, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1452, file: !135, line: 165, baseType: !1460, size: 192, offset: 256)
!1460 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1461)
!1461 = !{!1462, !1475, !1481}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1460, file: !135, line: 137, baseType: !1463, size: 128)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1464)
!1464 = !{!1465, !1474}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1463, file: !135, line: 135, baseType: !1466, size: 64)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1467, size: 64)
!1467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1468)
!1468 = !{!1469, !1470, !1471, !1472, !1473}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1467, file: !135, line: 96, baseType: !1466, size: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1467, file: !135, line: 97, baseType: !1466, size: 64, offset: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1467, file: !135, line: 101, baseType: !984, size: 64, offset: 128)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1467, file: !135, line: 106, baseType: !984, size: 64, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1467, file: !135, line: 111, baseType: !984, size: 64, offset: 256)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1463, file: !135, line: 136, baseType: !1466, size: 64, offset: 64)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1460, file: !135, line: 151, baseType: !1476, size: 192)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1477)
!1477 = !{!1478, !1479, !1480}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1476, file: !135, line: 141, baseType: !984, size: 64)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1476, file: !135, line: 145, baseType: !984, size: 64, offset: 64)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1476, file: !135, line: 150, baseType: !912, size: 32, offset: 128)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1460, file: !135, line: 164, baseType: !1482, size: 128)
!1482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1483)
!1483 = !{!1484, !1485}
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1482, file: !135, line: 161, baseType: !984, size: 64)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1482, file: !135, line: 163, baseType: !1106, size: 32, offset: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1452, file: !135, line: 168, baseType: !1487, size: 64, offset: 448)
!1487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1488, size: 64)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1489)
!1489 = !{!1490, !1491, !1492, !1493, !1494}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1488, file: !135, line: 70, baseType: !1487, size: 64)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1488, file: !135, line: 73, baseType: !1451, size: 64, offset: 64)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1488, file: !135, line: 78, baseType: !984, size: 64, offset: 128)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1488, file: !135, line: 85, baseType: !1156, size: 64, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1488, file: !135, line: 88, baseType: !912, size: 32, offset: 256)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1452, file: !135, line: 173, baseType: !1156, size: 64, offset: 512)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1452, file: !135, line: 173, baseType: !1156, size: 64, offset: 576)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1452, file: !135, line: 177, baseType: !911, size: 8, offset: 640)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1447, file: !135, line: 200, baseType: !1499, size: 64, offset: 64)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1500, size: 64)
!1500 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1501)
!1501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1502)
!1502 = !{!1503}
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1501, file: !135, line: 185, baseType: !1504, size: 128)
!1504 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1505)
!1505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1506)
!1506 = !{!1507, !1508, !1509}
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1505, file: !135, line: 184, baseType: !7, size: 32)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1505, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1505, file: !135, line: 184, baseType: !1510, size: 64, offset: 64)
!1510 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1450, size: 64, elements: !947)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1447, file: !135, line: 203, baseType: !1512, size: 64, offset: 128)
!1512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1513, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1514)
!1514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1515)
!1515 = !{!1516}
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1514, file: !135, line: 189, baseType: !1517, size: 128)
!1517 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1518)
!1518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1519)
!1519 = !{!1520, !1521, !1522}
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1518, file: !135, line: 188, baseType: !7, size: 32)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1518, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1518, file: !135, line: 188, baseType: !1523, size: 64, offset: 64)
!1523 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1524, size: 64, elements: !947)
!1524 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1487)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1447, file: !135, line: 207, baseType: !1526, size: 64, offset: 192)
!1526 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1527, line: 144, baseType: !1528)
!1527 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1529, size: 64)
!1529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1527, line: 100, size: 896, elements: !1530)
!1530 = !{!1531, !1537, !1542, !1547, !1549, !1552, !1553, !1554, !1555, !1556, !1561, !1563, !1564, !1569, !1574}
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1529, file: !1527, line: 102, baseType: !1532, size: 64)
!1532 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1527, line: 52, baseType: !1533)
!1533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1534, size: 64)
!1534 = !DISubroutineType(types: !1535)
!1535 = !{!1536, !1327}
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1527, line: 47, baseType: !7)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1529, file: !1527, line: 105, baseType: !1538, size: 64, offset: 64)
!1538 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1527, line: 59, baseType: !1539)
!1539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1540, size: 64)
!1540 = !DISubroutineType(types: !1541)
!1541 = !{!912, !1327, !1327}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1529, file: !1527, line: 108, baseType: !1543, size: 64, offset: 128)
!1543 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1527, line: 63, baseType: !1544)
!1544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1545, size: 64)
!1545 = !DISubroutineType(types: !1546)
!1546 = !{null, !916}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1529, file: !1527, line: 111, baseType: !1548, size: 64, offset: 192)
!1548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1529, file: !1527, line: 114, baseType: !1550, size: 64, offset: 256)
!1550 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1551, line: 46, baseType: !1037)
!1551 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1529, file: !1527, line: 117, baseType: !1550, size: 64, offset: 320)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1529, file: !1527, line: 120, baseType: !1550, size: 64, offset: 384)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1529, file: !1527, line: 124, baseType: !7, size: 32, offset: 448)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1529, file: !1527, line: 128, baseType: !7, size: 32, offset: 480)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1529, file: !1527, line: 131, baseType: !1557, size: 64, offset: 512)
!1557 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1527, line: 75, baseType: !1558)
!1558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1559, size: 64)
!1559 = !DISubroutineType(types: !1560)
!1560 = !{!916, !1550, !1550}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1529, file: !1527, line: 132, baseType: !1562, size: 64, offset: 576)
!1562 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1527, line: 78, baseType: !1544)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1529, file: !1527, line: 135, baseType: !916, size: 64, offset: 640)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1529, file: !1527, line: 136, baseType: !1565, size: 64, offset: 704)
!1565 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1527, line: 82, baseType: !1566)
!1566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1567, size: 64)
!1567 = !DISubroutineType(types: !1568)
!1568 = !{!916, !916, !1550, !1550}
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1529, file: !1527, line: 137, baseType: !1570, size: 64, offset: 768)
!1570 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1527, line: 83, baseType: !1571)
!1571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1572, size: 64)
!1572 = !DISubroutineType(types: !1573)
!1573 = !{null, !916, !916}
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1529, file: !1527, line: 141, baseType: !7, size: 32, offset: 832)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1447, file: !135, line: 211, baseType: !1576, size: 64, offset: 256)
!1576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1577, size: 64)
!1577 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !171, line: 183, baseType: !1578)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !171, line: 183, size: 128, elements: !1579)
!1579 = !{!1580}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1578, file: !171, line: 183, baseType: !1581, size: 128)
!1581 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !171, line: 182, baseType: !1582)
!1582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !171, line: 182, size: 128, elements: !1583)
!1583 = !{!1584, !1585, !1586}
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1582, file: !171, line: 182, baseType: !7, size: 32)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1582, file: !171, line: 182, baseType: !7, size: 32, offset: 32)
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1582, file: !171, line: 182, baseType: !1587, size: 64, offset: 64)
!1587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !984, size: 64, elements: !947)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1447, file: !135, line: 220, baseType: !1589, size: 64, offset: 320)
!1589 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1590)
!1590 = !{!1591, !1592}
!1591 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1589, file: !135, line: 218, baseType: !1576, size: 64)
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1589, file: !135, line: 219, baseType: !1593, size: 64)
!1593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1594, size: 64)
!1594 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1595, line: 29, baseType: !1596)
!1595 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1595, line: 29, size: 96, elements: !1597)
!1597 = !{!1598}
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1596, file: !1595, line: 29, baseType: !1599, size: 96)
!1599 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1595, line: 27, baseType: !1600)
!1600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1595, line: 27, size: 96, elements: !1601)
!1601 = !{!1602, !1603, !1604}
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1600, file: !1595, line: 27, baseType: !7, size: 32)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1600, file: !1595, line: 27, baseType: !7, size: 32, offset: 32)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1600, file: !1595, line: 27, baseType: !1605, size: 8, offset: 64)
!1605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1606, size: 8, elements: !947)
!1606 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1595, line: 26, baseType: !911)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1442, file: !1443, line: 467, baseType: !1608, size: 64, offset: 64)
!1608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1609, size: 64)
!1609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1610)
!1610 = !{!1611, !1613, !1614, !1627, !1628, !1629, !1630, !1631, !1632, !1634, !1636, !1637}
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1609, file: !142, line: 377, baseType: !1612, size: 64)
!1612 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !926, line: 111, baseType: !931)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1609, file: !142, line: 378, baseType: !1612, size: 64, offset: 64)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1609, file: !142, line: 381, baseType: !1615, size: 64, offset: 128)
!1615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1616, size: 64)
!1616 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1617)
!1617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1618)
!1618 = !{!1619}
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1617, file: !142, line: 282, baseType: !1620, size: 128)
!1620 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1621)
!1621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1622)
!1622 = !{!1623, !1624, !1625}
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1621, file: !142, line: 281, baseType: !7, size: 32)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1621, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1621, file: !142, line: 281, baseType: !1626, size: 64, offset: 64)
!1626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1612, size: 64, elements: !947)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1609, file: !142, line: 384, baseType: !912, size: 32, offset: 192)
!1628 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1609, file: !142, line: 387, baseType: !912, size: 32, offset: 224)
!1629 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1609, file: !142, line: 390, baseType: !912, size: 32, offset: 256)
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1609, file: !142, line: 394, baseType: !1615, size: 64, offset: 320)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1609, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1609, file: !142, line: 399, baseType: !1633, size: 64, offset: 416)
!1633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !1223)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1609, file: !142, line: 402, baseType: !1635, size: 64, offset: 480)
!1635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !1223)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1609, file: !142, line: 406, baseType: !912, size: 32, offset: 544)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1609, file: !142, line: 409, baseType: !912, size: 32, offset: 576)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1442, file: !1443, line: 470, baseType: !1639, size: 64, offset: 128)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64)
!1640 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !839, line: 143, size: 192, elements: !1641)
!1641 = !{!1642, !1848, !1849}
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1640, file: !839, line: 145, baseType: !1643, size: 64)
!1643 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !926, line: 69, baseType: !1644)
!1644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1645, size: 64)
!1645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !839, line: 136, size: 192, elements: !1646)
!1646 = !{!1647, !1846, !1847}
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1645, file: !839, line: 137, baseType: !1648, size: 64)
!1648 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !926, line: 58, baseType: !1649)
!1649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1650, size: 64)
!1650 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !839, line: 737, size: 768, elements: !1651)
!1651 = !{!1652, !1669, !1702, !1708, !1713, !1719, !1726, !1732, !1738, !1743, !1757, !1762, !1768, !1773, !1783, !1788, !1804, !1811, !1818, !1824, !1829, !1835, !1841}
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1650, file: !839, line: 738, baseType: !1653, size: 256)
!1653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !839, line: 271, size: 256, elements: !1654)
!1654 = !{!1655, !1656, !1657, !1658, !1659, !1660, !1661, !1662, !1663, !1664, !1665, !1666, !1667, !1668}
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1653, file: !839, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1653, file: !839, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1653, file: !839, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1653, file: !839, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1653, file: !839, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1653, file: !839, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1653, file: !839, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1653, file: !839, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1653, file: !839, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1664 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1653, file: !839, line: 312, baseType: !7, size: 32, offset: 32)
!1665 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1653, file: !839, line: 316, baseType: !1106, size: 32, offset: 64)
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1653, file: !839, line: 319, baseType: !7, size: 32, offset: 96)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1653, file: !839, line: 323, baseType: !931, size: 64, offset: 128)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1653, file: !839, line: 327, baseType: !984, size: 64, offset: 192)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1650, file: !839, line: 739, baseType: !1670, size: 448)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !839, line: 350, size: 448, elements: !1671)
!1671 = !{!1672, !1701}
!1672 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1670, file: !839, line: 353, baseType: !1673, size: 384)
!1673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !839, line: 333, size: 384, elements: !1674)
!1674 = !{!1675, !1676, !1684}
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1673, file: !839, line: 336, baseType: !1653, size: 256)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1673, file: !839, line: 343, baseType: !1677, size: 64, offset: 256)
!1677 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1678, size: 64)
!1678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1679, line: 37, size: 128, elements: !1680)
!1679 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1680 = !{!1681, !1682}
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1678, file: !1679, line: 39, baseType: !1677, size: 64)
!1682 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1678, file: !1679, line: 40, baseType: !1683, size: 64, offset: 64)
!1683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1673, file: !839, line: 344, baseType: !1685, size: 64, offset: 320)
!1685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1686, size: 64)
!1686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1679, line: 45, size: 320, elements: !1687)
!1687 = !{!1688, !1689}
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1686, file: !1679, line: 47, baseType: !1685, size: 64)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1686, file: !1679, line: 48, baseType: !1690, size: 256, offset: 64)
!1690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !171, line: 1883, size: 256, elements: !1691)
!1691 = !{!1692, !1694, !1695, !1700}
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1690, file: !171, line: 1884, baseType: !1693, size: 64)
!1693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1690, size: 64)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1690, file: !171, line: 1885, baseType: !1693, size: 64, offset: 64)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1690, file: !171, line: 1891, baseType: !1696, size: 64, offset: 128)
!1696 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1690, file: !171, line: 1891, size: 64, elements: !1697)
!1697 = !{!1698, !1699}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1696, file: !171, line: 1891, baseType: !1648, size: 64)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1696, file: !171, line: 1891, baseType: !984, size: 64)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1690, file: !171, line: 1892, baseType: !1683, size: 64, offset: 192)
