; ModuleID = 'prefix.bc'
source_filename = "prefix.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@std_prefix = internal unnamed_addr global i8* getelementptr inbounds ([1 x i8], [1 x i8]* @.str.1, i64 0, i64 0), align 8, !dbg !0
@.str = private unnamed_addr constant [2 x i8] c"@\00", align 1
@.str.1 = private unnamed_addr constant [1 x i8] zeroinitializer, align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"_ROOT\00", align 1

; Function Attrs: inlinehint nounwind uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "std_prefix", scope: !2, file: !3, line: 77, type: !13, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !15, nameTableKind: None)
!3 = !DIFile(filename: "prefix.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{}
!5 = !{!6, !7, !8, !9, !12, !13, !10}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!15 = !{!0}
!16 = !{i32 2, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!20 = distinct !DISubprogram(name: "vprintf", scope: !21, file: !21, line: 39, type: !22, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !33)
!21 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!22 = !DISubroutineType(types: !23)
!23 = !{!8, !24, !25}
!24 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !13)
!25 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !26, size: 64)
!26 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !27)
!27 = !{!28, !30, !31, !32}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !26, file: !3, baseType: !29, size: 32)
!29 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !26, file: !3, baseType: !29, size: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !26, file: !3, baseType: !12, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !26, file: !3, baseType: !12, size: 64, offset: 128)
!33 = !{!34, !35}
!34 = !DILocalVariable(name: "__fmt", arg: 1, scope: !20, file: !21, line: 39, type: !24)
!35 = !DILocalVariable(name: "__arg", arg: 2, scope: !20, file: !21, line: 39, type: !25)
!36 = !DILocation(line: 0, scope: !20)
!37 = !DILocation(line: 41, column: 20, scope: !20)
!38 = !DILocation(line: 41, column: 10, scope: !20)
!39 = !DILocation(line: 41, column: 3, scope: !20)
!40 = distinct !DISubprogram(name: "getchar", scope: !21, file: !21, line: 47, type: !41, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!41 = !DISubroutineType(types: !42)
!42 = !{!8}
!43 = !DILocation(line: 49, column: 16, scope: !40)
!44 = !DILocation(line: 49, column: 10, scope: !40)
!45 = !DILocation(line: 49, column: 3, scope: !40)
!46 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !21, file: !21, line: 56, type: !47, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !108)
!47 = !DISubroutineType(types: !48)
!48 = !{!8, !49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !51, line: 7, baseType: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !53, line: 49, size: 1728, elements: !54)
!53 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!54 = !{!55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !70, !72, !73, !74, !78, !80, !82, !86, !89, !91, !94, !97, !98, !99, !103, !104}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !52, file: !53, line: 51, baseType: !8, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !52, file: !53, line: 54, baseType: !10, size: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !52, file: !53, line: 55, baseType: !10, size: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !52, file: !53, line: 56, baseType: !10, size: 64, offset: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !52, file: !53, line: 57, baseType: !10, size: 64, offset: 256)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !52, file: !53, line: 58, baseType: !10, size: 64, offset: 320)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !52, file: !53, line: 59, baseType: !10, size: 64, offset: 384)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !52, file: !53, line: 60, baseType: !10, size: 64, offset: 448)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !52, file: !53, line: 61, baseType: !10, size: 64, offset: 512)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !52, file: !53, line: 64, baseType: !10, size: 64, offset: 576)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !52, file: !53, line: 65, baseType: !10, size: 64, offset: 640)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !52, file: !53, line: 66, baseType: !10, size: 64, offset: 704)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !52, file: !53, line: 68, baseType: !68, size: 64, offset: 768)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !53, line: 36, flags: DIFlagFwdDecl)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !52, file: !53, line: 70, baseType: !71, size: 64, offset: 832)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !52, file: !53, line: 72, baseType: !8, size: 32, offset: 896)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !52, file: !53, line: 73, baseType: !8, size: 32, offset: 928)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !52, file: !53, line: 74, baseType: !75, size: 64, offset: 960)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !76, line: 152, baseType: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!77 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !52, file: !53, line: 77, baseType: !79, size: 16, offset: 1024)
!79 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !52, file: !53, line: 78, baseType: !81, size: 8, offset: 1040)
!81 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !52, file: !53, line: 79, baseType: !83, size: 8, offset: 1048)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !84)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !52, file: !53, line: 81, baseType: !87, size: 64, offset: 1088)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !53, line: 43, baseType: null)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !52, file: !53, line: 89, baseType: !90, size: 64, offset: 1152)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !76, line: 153, baseType: !77)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !52, file: !53, line: 91, baseType: !92, size: 64, offset: 1216)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !53, line: 37, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !52, file: !53, line: 92, baseType: !95, size: 64, offset: 1280)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !53, line: 38, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !52, file: !53, line: 93, baseType: !71, size: 64, offset: 1344)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !52, file: !53, line: 94, baseType: !12, size: 64, offset: 1408)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !52, file: !53, line: 95, baseType: !100, size: 64, offset: 1472)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !101, line: 46, baseType: !102)
!101 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!102 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !52, file: !53, line: 96, baseType: !8, size: 32, offset: 1536)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !52, file: !53, line: 98, baseType: !105, size: 160, offset: 1568)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !106)
!106 = !{!107}
!107 = !DISubrange(count: 20)
!108 = !{!109}
!109 = !DILocalVariable(name: "__fp", arg: 1, scope: !46, file: !21, line: 56, type: !49)
!110 = !DILocation(line: 0, scope: !46)
!111 = !DILocation(line: 58, column: 10, scope: !46)
!112 = !DILocation(line: 58, column: 3, scope: !46)
!113 = distinct !DISubprogram(name: "getc_unlocked", scope: !21, file: !21, line: 66, type: !47, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !114)
!114 = !{!115}
!115 = !DILocalVariable(name: "__fp", arg: 1, scope: !113, file: !21, line: 66, type: !49)
!116 = !DILocation(line: 0, scope: !113)
!117 = !DILocation(line: 68, column: 10, scope: !113)
!118 = !DILocation(line: 68, column: 3, scope: !113)
!119 = distinct !DISubprogram(name: "getchar_unlocked", scope: !21, file: !21, line: 73, type: !41, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!120 = !DILocation(line: 75, column: 10, scope: !119)
!121 = !DILocation(line: 75, column: 3, scope: !119)
!122 = distinct !DISubprogram(name: "putchar", scope: !21, file: !21, line: 82, type: !123, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !125)
!123 = !DISubroutineType(types: !124)
!124 = !{!8, !8}
!125 = !{!126}
!126 = !DILocalVariable(name: "__c", arg: 1, scope: !122, file: !21, line: 82, type: !8)
!127 = !DILocation(line: 0, scope: !122)
!128 = !DILocation(line: 84, column: 21, scope: !122)
!129 = !DILocation(line: 84, column: 10, scope: !122)
!130 = !DILocation(line: 84, column: 3, scope: !122)
!131 = distinct !DISubprogram(name: "fputc_unlocked", scope: !21, file: !21, line: 91, type: !132, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !134)
!132 = !DISubroutineType(types: !133)
!133 = !{!8, !8, !49}
!134 = !{!135, !136}
!135 = !DILocalVariable(name: "__c", arg: 1, scope: !131, file: !21, line: 91, type: !8)
!136 = !DILocalVariable(name: "__stream", arg: 2, scope: !131, file: !21, line: 91, type: !49)
!137 = !DILocation(line: 0, scope: !131)
!138 = !DILocation(line: 93, column: 10, scope: !131)
!139 = !DILocation(line: 93, column: 3, scope: !131)
!140 = distinct !DISubprogram(name: "putc_unlocked", scope: !21, file: !21, line: 101, type: !132, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !141)
!141 = !{!142, !143}
!142 = !DILocalVariable(name: "__c", arg: 1, scope: !140, file: !21, line: 101, type: !8)
!143 = !DILocalVariable(name: "__stream", arg: 2, scope: !140, file: !21, line: 101, type: !49)
!144 = !DILocation(line: 0, scope: !140)
!145 = !DILocation(line: 103, column: 10, scope: !140)
!146 = !DILocation(line: 103, column: 3, scope: !140)
!147 = distinct !DISubprogram(name: "putchar_unlocked", scope: !21, file: !21, line: 108, type: !123, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !148)
!148 = !{!149}
!149 = !DILocalVariable(name: "__c", arg: 1, scope: !147, file: !21, line: 108, type: !8)
!150 = !DILocation(line: 0, scope: !147)
!151 = !DILocation(line: 110, column: 10, scope: !147)
!152 = !DILocation(line: 110, column: 3, scope: !147)
!153 = distinct !DISubprogram(name: "getline", scope: !21, file: !21, line: 118, type: !154, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !158)
!154 = !DISubroutineType(types: !155)
!155 = !{!156, !9, !157, !49}
!156 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !76, line: 193, baseType: !77)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!158 = !{!159, !160, !161}
!159 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !153, file: !21, line: 118, type: !9)
!160 = !DILocalVariable(name: "__n", arg: 2, scope: !153, file: !21, line: 118, type: !157)
!161 = !DILocalVariable(name: "__stream", arg: 3, scope: !153, file: !21, line: 118, type: !49)
!162 = !DILocation(line: 0, scope: !153)
!163 = !DILocation(line: 120, column: 10, scope: !153)
!164 = !DILocation(line: 120, column: 3, scope: !153)
!165 = distinct !DISubprogram(name: "feof_unlocked", scope: !21, file: !21, line: 128, type: !47, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !166)
!166 = !{!167}
!167 = !DILocalVariable(name: "__stream", arg: 1, scope: !165, file: !21, line: 128, type: !49)
!168 = !DILocation(line: 0, scope: !165)
!169 = !DILocation(line: 130, column: 10, scope: !165)
!170 = !DILocation(line: 130, column: 3, scope: !165)
!171 = distinct !DISubprogram(name: "ferror_unlocked", scope: !21, file: !21, line: 135, type: !47, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !172)
!172 = !{!173}
!173 = !DILocalVariable(name: "__stream", arg: 1, scope: !171, file: !21, line: 135, type: !49)
!174 = !DILocation(line: 0, scope: !171)
!175 = !DILocation(line: 137, column: 10, scope: !171)
!176 = !DILocation(line: 137, column: 3, scope: !171)
!177 = distinct !DISubprogram(name: "tolower", scope: !178, file: !178, line: 207, type: !123, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !179)
!178 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!179 = !{!180}
!180 = !DILocalVariable(name: "__c", arg: 1, scope: !177, file: !178, line: 207, type: !8)
!181 = !DILocation(line: 0, scope: !177)
!182 = !DILocation(line: 209, column: 22, scope: !177)
!183 = !DILocation(line: 209, column: 39, scope: !177)
!184 = !DILocation(line: 209, column: 38, scope: !177)
!185 = !DILocation(line: 209, column: 37, scope: !177)
!186 = !DILocation(line: 209, column: 10, scope: !177)
!187 = !DILocation(line: 209, column: 3, scope: !177)
!188 = distinct !DISubprogram(name: "toupper", scope: !178, file: !178, line: 213, type: !123, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !189)
!189 = !{!190}
!190 = !DILocalVariable(name: "__c", arg: 1, scope: !188, file: !178, line: 213, type: !8)
!191 = !DILocation(line: 0, scope: !188)
!192 = !DILocation(line: 215, column: 22, scope: !188)
!193 = !DILocation(line: 215, column: 39, scope: !188)
!194 = !DILocation(line: 215, column: 38, scope: !188)
!195 = !DILocation(line: 215, column: 37, scope: !188)
!196 = !DILocation(line: 215, column: 10, scope: !188)
!197 = !DILocation(line: 215, column: 3, scope: !188)
!198 = distinct !DISubprogram(name: "atoi", scope: !199, file: !199, line: 361, type: !200, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !202)
!199 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!200 = !DISubroutineType(types: !201)
!201 = !{!8, !13}
!202 = !{!203}
!203 = !DILocalVariable(name: "__nptr", arg: 1, scope: !198, file: !199, line: 361, type: !13)
!204 = !DILocation(line: 0, scope: !198)
!205 = !DILocation(line: 363, column: 16, scope: !198)
!206 = !DILocation(line: 363, column: 10, scope: !198)
!207 = !DILocation(line: 363, column: 3, scope: !198)
!208 = distinct !DISubprogram(name: "atol", scope: !199, file: !199, line: 366, type: !209, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !211)
!209 = !DISubroutineType(types: !210)
!210 = !{!77, !13}
!211 = !{!212}
!212 = !DILocalVariable(name: "__nptr", arg: 1, scope: !208, file: !199, line: 366, type: !13)
!213 = !DILocation(line: 0, scope: !208)
!214 = !DILocation(line: 368, column: 10, scope: !208)
!215 = !DILocation(line: 368, column: 3, scope: !208)
!216 = distinct !DISubprogram(name: "atoll", scope: !199, file: !199, line: 373, type: !217, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !220)
!217 = !DISubroutineType(types: !218)
!218 = !{!219, !13}
!219 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!220 = !{!221}
!221 = !DILocalVariable(name: "__nptr", arg: 1, scope: !216, file: !199, line: 373, type: !13)
!222 = !DILocation(line: 0, scope: !216)
!223 = !DILocation(line: 375, column: 10, scope: !216)
!224 = !DILocation(line: 375, column: 3, scope: !216)
!225 = distinct !DISubprogram(name: "bsearch", scope: !226, file: !226, line: 20, type: !227, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !235)
!226 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!227 = !DISubroutineType(types: !228)
!228 = !{!12, !229, !229, !100, !100, !231}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!231 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !199, line: 808, baseType: !232)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DISubroutineType(types: !234)
!234 = !{!8, !229, !229}
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245}
!236 = !DILocalVariable(name: "__key", arg: 1, scope: !225, file: !226, line: 20, type: !229)
!237 = !DILocalVariable(name: "__base", arg: 2, scope: !225, file: !226, line: 20, type: !229)
!238 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !225, file: !226, line: 20, type: !100)
!239 = !DILocalVariable(name: "__size", arg: 4, scope: !225, file: !226, line: 20, type: !100)
!240 = !DILocalVariable(name: "__compar", arg: 5, scope: !225, file: !226, line: 21, type: !231)
!241 = !DILocalVariable(name: "__l", scope: !225, file: !226, line: 23, type: !100)
!242 = !DILocalVariable(name: "__u", scope: !225, file: !226, line: 23, type: !100)
!243 = !DILocalVariable(name: "__idx", scope: !225, file: !226, line: 23, type: !100)
!244 = !DILocalVariable(name: "__p", scope: !225, file: !226, line: 24, type: !229)
!245 = !DILocalVariable(name: "__comparison", scope: !225, file: !226, line: 25, type: !8)
!246 = !DILocation(line: 0, scope: !225)
!247 = !DILocation(line: 29, column: 3, scope: !225)
!248 = !DILocation(line: 27, column: 7, scope: !225)
!249 = !DILocation(line: 29, column: 14, scope: !225)
!250 = !DILocation(line: 31, column: 20, scope: !251)
!251 = distinct !DILexicalBlock(scope: !225, file: !226, line: 30, column: 5)
!252 = !DILocation(line: 31, column: 27, scope: !251)
!253 = !DILocation(line: 32, column: 56, scope: !251)
!254 = !DILocation(line: 32, column: 47, scope: !251)
!255 = !DILocation(line: 33, column: 22, scope: !251)
!256 = !DILocation(line: 34, column: 24, scope: !257)
!257 = distinct !DILexicalBlock(scope: !251, file: !226, line: 34, column: 11)
!258 = !DILocation(line: 34, column: 11, scope: !251)
!259 = !DILocation(line: 36, column: 29, scope: !260)
!260 = distinct !DILexicalBlock(scope: !257, file: !226, line: 36, column: 16)
!261 = !DILocation(line: 36, column: 16, scope: !257)
!262 = !DILocation(line: 37, column: 14, scope: !260)
!263 = distinct !{!263, !247, !264}
!264 = !DILocation(line: 40, column: 5, scope: !225)
!265 = !DILocation(line: 43, column: 1, scope: !225)
!266 = distinct !DISubprogram(name: "atof", scope: !267, file: !267, line: 25, type: !268, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !271)
!267 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!268 = !DISubroutineType(types: !269)
!269 = !{!270, !13}
!270 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!271 = !{!272}
!272 = !DILocalVariable(name: "__nptr", arg: 1, scope: !266, file: !267, line: 25, type: !13)
!273 = !DILocation(line: 0, scope: !266)
!274 = !DILocation(line: 27, column: 10, scope: !266)
!275 = !DILocation(line: 27, column: 3, scope: !266)
!276 = distinct !DISubprogram(name: "strtoimax", scope: !277, file: !277, line: 324, type: !278, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !284)
!277 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!278 = !DISubroutineType(types: !279)
!279 = !{!280, !24, !283, !8}
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !281, line: 101, baseType: !282)
!281 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!282 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !76, line: 72, baseType: !77)
!283 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!284 = !{!285, !286, !287}
!285 = !DILocalVariable(name: "nptr", arg: 1, scope: !276, file: !277, line: 324, type: !24)
!286 = !DILocalVariable(name: "endptr", arg: 2, scope: !276, file: !277, line: 324, type: !283)
!287 = !DILocalVariable(name: "base", arg: 3, scope: !276, file: !277, line: 324, type: !8)
!288 = !DILocation(line: 0, scope: !276)
!289 = !DILocation(line: 327, column: 10, scope: !276)
!290 = !DILocation(line: 327, column: 3, scope: !276)
!291 = distinct !DISubprogram(name: "strtoumax", scope: !277, file: !277, line: 336, type: !292, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !296)
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !24, !283, !8}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !281, line: 102, baseType: !295)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !76, line: 73, baseType: !102)
!296 = !{!297, !298, !299}
!297 = !DILocalVariable(name: "nptr", arg: 1, scope: !291, file: !277, line: 336, type: !24)
!298 = !DILocalVariable(name: "endptr", arg: 2, scope: !291, file: !277, line: 336, type: !283)
!299 = !DILocalVariable(name: "base", arg: 3, scope: !291, file: !277, line: 336, type: !8)
!300 = !DILocation(line: 0, scope: !291)
!301 = !DILocation(line: 339, column: 10, scope: !291)
!302 = !DILocation(line: 339, column: 3, scope: !291)
!303 = distinct !DISubprogram(name: "wcstoimax", scope: !277, file: !277, line: 348, type: !304, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !313)
!304 = !DISubroutineType(types: !305)
!305 = !{!280, !306, !310, !8}
!306 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !307)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !277, line: 34, baseType: !8)
!310 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!313 = !{!314, !315, !316}
!314 = !DILocalVariable(name: "nptr", arg: 1, scope: !303, file: !277, line: 348, type: !306)
!315 = !DILocalVariable(name: "endptr", arg: 2, scope: !303, file: !277, line: 348, type: !310)
!316 = !DILocalVariable(name: "base", arg: 3, scope: !303, file: !277, line: 348, type: !8)
!317 = !DILocation(line: 0, scope: !303)
!318 = !DILocation(line: 351, column: 10, scope: !303)
!319 = !DILocation(line: 351, column: 3, scope: !303)
!320 = distinct !DISubprogram(name: "wcstoumax", scope: !277, file: !277, line: 362, type: !321, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !323)
!321 = !DISubroutineType(types: !322)
!322 = !{!294, !306, !310, !8}
!323 = !{!324, !325, !326}
!324 = !DILocalVariable(name: "nptr", arg: 1, scope: !320, file: !277, line: 362, type: !306)
!325 = !DILocalVariable(name: "endptr", arg: 2, scope: !320, file: !277, line: 362, type: !310)
!326 = !DILocalVariable(name: "base", arg: 3, scope: !320, file: !277, line: 362, type: !8)
!327 = !DILocation(line: 0, scope: !320)
!328 = !DILocation(line: 365, column: 10, scope: !320)
!329 = !DILocation(line: 365, column: 3, scope: !320)
!330 = distinct !DISubprogram(name: "stat", scope: !331, file: !331, line: 453, type: !332, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !371)
!331 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!332 = !DISubroutineType(types: !333)
!333 = !{!8, !13, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !336, line: 46, size: 1152, elements: !337)
!336 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!337 = !{!338, !340, !342, !344, !346, !348, !350, !351, !352, !353, !355, !357, !365, !366, !367}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !335, file: !336, line: 48, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !76, line: 145, baseType: !102)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !335, file: !336, line: 53, baseType: !341, size: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !76, line: 148, baseType: !102)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !335, file: !336, line: 61, baseType: !343, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !76, line: 151, baseType: !102)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !335, file: !336, line: 62, baseType: !345, size: 32, offset: 192)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !76, line: 150, baseType: !29)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !335, file: !336, line: 64, baseType: !347, size: 32, offset: 224)
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !76, line: 146, baseType: !29)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !335, file: !336, line: 65, baseType: !349, size: 32, offset: 256)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !76, line: 147, baseType: !29)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !335, file: !336, line: 67, baseType: !8, size: 32, offset: 288)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !335, file: !336, line: 69, baseType: !339, size: 64, offset: 320)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !335, file: !336, line: 74, baseType: !75, size: 64, offset: 384)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !335, file: !336, line: 78, baseType: !354, size: 64, offset: 448)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !76, line: 174, baseType: !77)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !335, file: !336, line: 80, baseType: !356, size: 64, offset: 512)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !76, line: 179, baseType: !77)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !335, file: !336, line: 91, baseType: !358, size: 128, offset: 576)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !359, line: 10, size: 128, elements: !360)
!359 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!360 = !{!361, !363}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !358, file: !359, line: 12, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !76, line: 160, baseType: !77)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !358, file: !359, line: 16, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !76, line: 196, baseType: !77)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !335, file: !336, line: 92, baseType: !358, size: 128, offset: 704)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !335, file: !336, line: 93, baseType: !358, size: 128, offset: 832)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !335, file: !336, line: 106, baseType: !368, size: 192, offset: 960)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !364, size: 192, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 3)
!371 = !{!372, !373}
!372 = !DILocalVariable(name: "__path", arg: 1, scope: !330, file: !331, line: 453, type: !13)
!373 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !330, file: !331, line: 453, type: !334)
!374 = !DILocation(line: 0, scope: !330)
!375 = !DILocation(line: 455, column: 10, scope: !330)
!376 = !DILocation(line: 455, column: 3, scope: !330)
!377 = distinct !DISubprogram(name: "lstat", scope: !331, file: !331, line: 460, type: !332, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !378)
!378 = !{!379, !380}
!379 = !DILocalVariable(name: "__path", arg: 1, scope: !377, file: !331, line: 460, type: !13)
!380 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !377, file: !331, line: 460, type: !334)
!381 = !DILocation(line: 0, scope: !377)
!382 = !DILocation(line: 462, column: 10, scope: !377)
!383 = !DILocation(line: 462, column: 3, scope: !377)
!384 = distinct !DISubprogram(name: "fstat", scope: !331, file: !331, line: 467, type: !385, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !387)
!385 = !DISubroutineType(types: !386)
!386 = !{!8, !8, !334}
!387 = !{!388, !389}
!388 = !DILocalVariable(name: "__fd", arg: 1, scope: !384, file: !331, line: 467, type: !8)
!389 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !384, file: !331, line: 467, type: !334)
!390 = !DILocation(line: 0, scope: !384)
!391 = !DILocation(line: 469, column: 10, scope: !384)
!392 = !DILocation(line: 469, column: 3, scope: !384)
!393 = distinct !DISubprogram(name: "fstatat", scope: !331, file: !331, line: 474, type: !394, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !396)
!394 = !DISubroutineType(types: !395)
!395 = !{!8, !8, !13, !334, !8}
!396 = !{!397, !398, !399, !400}
!397 = !DILocalVariable(name: "__fd", arg: 1, scope: !393, file: !331, line: 474, type: !8)
!398 = !DILocalVariable(name: "__filename", arg: 2, scope: !393, file: !331, line: 474, type: !13)
!399 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !393, file: !331, line: 474, type: !334)
!400 = !DILocalVariable(name: "__flag", arg: 4, scope: !393, file: !331, line: 474, type: !8)
!401 = !DILocation(line: 0, scope: !393)
!402 = !DILocation(line: 477, column: 10, scope: !393)
!403 = !DILocation(line: 477, column: 3, scope: !393)
!404 = distinct !DISubprogram(name: "mknod", scope: !331, file: !331, line: 483, type: !405, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !407)
!405 = !DISubroutineType(types: !406)
!406 = !{!8, !13, !345, !339}
!407 = !{!408, !409, !410}
!408 = !DILocalVariable(name: "__path", arg: 1, scope: !404, file: !331, line: 483, type: !13)
!409 = !DILocalVariable(name: "__mode", arg: 2, scope: !404, file: !331, line: 483, type: !345)
!410 = !DILocalVariable(name: "__dev", arg: 3, scope: !404, file: !331, line: 483, type: !339)
!411 = !DILocation(line: 0, scope: !404)
!412 = !DILocation(line: 485, column: 10, scope: !404)
!413 = !DILocation(line: 485, column: 3, scope: !404)
!414 = distinct !DISubprogram(name: "mknodat", scope: !331, file: !331, line: 491, type: !415, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !417)
!415 = !DISubroutineType(types: !416)
!416 = !{!8, !8, !13, !345, !339}
!417 = !{!418, !419, !420, !421}
!418 = !DILocalVariable(name: "__fd", arg: 1, scope: !414, file: !331, line: 491, type: !8)
!419 = !DILocalVariable(name: "__path", arg: 2, scope: !414, file: !331, line: 491, type: !13)
!420 = !DILocalVariable(name: "__mode", arg: 3, scope: !414, file: !331, line: 491, type: !345)
!421 = !DILocalVariable(name: "__dev", arg: 4, scope: !414, file: !331, line: 491, type: !339)
!422 = !DILocation(line: 0, scope: !414)
!423 = !DILocation(line: 494, column: 10, scope: !414)
!424 = !DILocation(line: 494, column: 3, scope: !414)
!425 = distinct !DISubprogram(name: "stat64", scope: !331, file: !331, line: 502, type: !426, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !448)
!426 = !DISubroutineType(types: !427)
!427 = !{!8, !13, !428}
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !336, line: 119, size: 1152, elements: !430)
!430 = !{!431, !432, !434, !435, !436, !437, !438, !439, !440, !441, !442, !444, !445, !446, !447}
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !429, file: !336, line: 121, baseType: !339, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !429, file: !336, line: 123, baseType: !433, size: 64, offset: 64)
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !76, line: 149, baseType: !102)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !429, file: !336, line: 124, baseType: !343, size: 64, offset: 128)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !429, file: !336, line: 125, baseType: !345, size: 32, offset: 192)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !429, file: !336, line: 132, baseType: !347, size: 32, offset: 224)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !429, file: !336, line: 133, baseType: !349, size: 32, offset: 256)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !429, file: !336, line: 135, baseType: !8, size: 32, offset: 288)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !429, file: !336, line: 136, baseType: !339, size: 64, offset: 320)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !429, file: !336, line: 137, baseType: !75, size: 64, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !429, file: !336, line: 143, baseType: !354, size: 64, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !429, file: !336, line: 144, baseType: !443, size: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !76, line: 180, baseType: !77)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !429, file: !336, line: 152, baseType: !358, size: 128, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !429, file: !336, line: 153, baseType: !358, size: 128, offset: 704)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !429, file: !336, line: 154, baseType: !358, size: 128, offset: 832)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !429, file: !336, line: 164, baseType: !368, size: 192, offset: 960)
!448 = !{!449, !450}
!449 = !DILocalVariable(name: "__path", arg: 1, scope: !425, file: !331, line: 502, type: !13)
!450 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !425, file: !331, line: 502, type: !428)
!451 = !DILocation(line: 0, scope: !425)
!452 = !DILocation(line: 504, column: 10, scope: !425)
!453 = !DILocation(line: 504, column: 3, scope: !425)
!454 = distinct !DISubprogram(name: "lstat64", scope: !331, file: !331, line: 509, type: !426, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !455)
!455 = !{!456, !457}
!456 = !DILocalVariable(name: "__path", arg: 1, scope: !454, file: !331, line: 509, type: !13)
!457 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !454, file: !331, line: 509, type: !428)
!458 = !DILocation(line: 0, scope: !454)
!459 = !DILocation(line: 511, column: 10, scope: !454)
!460 = !DILocation(line: 511, column: 3, scope: !454)
!461 = distinct !DISubprogram(name: "fstat64", scope: !331, file: !331, line: 516, type: !462, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !464)
!462 = !DISubroutineType(types: !463)
!463 = !{!8, !8, !428}
!464 = !{!465, !466}
!465 = !DILocalVariable(name: "__fd", arg: 1, scope: !461, file: !331, line: 516, type: !8)
!466 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !461, file: !331, line: 516, type: !428)
!467 = !DILocation(line: 0, scope: !461)
!468 = !DILocation(line: 518, column: 10, scope: !461)
!469 = !DILocation(line: 518, column: 3, scope: !461)
!470 = distinct !DISubprogram(name: "fstatat64", scope: !331, file: !331, line: 523, type: !471, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !473)
!471 = !DISubroutineType(types: !472)
!472 = !{!8, !8, !13, !428, !8}
!473 = !{!474, !475, !476, !477}
!474 = !DILocalVariable(name: "__fd", arg: 1, scope: !470, file: !331, line: 523, type: !8)
!475 = !DILocalVariable(name: "__filename", arg: 2, scope: !470, file: !331, line: 523, type: !13)
!476 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !470, file: !331, line: 523, type: !428)
!477 = !DILocalVariable(name: "__flag", arg: 4, scope: !470, file: !331, line: 523, type: !8)
!478 = !DILocation(line: 0, scope: !470)
!479 = !DILocation(line: 526, column: 10, scope: !470)
!480 = !DILocation(line: 526, column: 3, scope: !470)
!481 = distinct !DISubprogram(name: "update_path", scope: !3, file: !3, line: 250, type: !482, scopeLine: 251, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !484)
!482 = !DISubroutineType(types: !483)
!483 = !{!10, !13, !13}
!484 = !{!485, !486, !487, !488, !489, !491, !494, !496}
!485 = !DILocalVariable(name: "path", arg: 1, scope: !481, file: !3, line: 250, type: !13)
!486 = !DILocalVariable(name: "key", arg: 2, scope: !481, file: !3, line: 250, type: !13)
!487 = !DILocalVariable(name: "result", scope: !481, file: !3, line: 252, type: !10)
!488 = !DILocalVariable(name: "p", scope: !481, file: !3, line: 252, type: !10)
!489 = !DILocalVariable(name: "len", scope: !481, file: !3, line: 253, type: !490)
!490 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!491 = !DILocalVariable(name: "free_key", scope: !492, file: !3, line: 260, type: !7)
!492 = distinct !DILexicalBlock(scope: !493, file: !3, line: 259, column: 5)
!493 = distinct !DILexicalBlock(scope: !481, file: !3, line: 255, column: 7)
!494 = !DILocalVariable(name: "src", scope: !495, file: !3, line: 283, type: !10)
!495 = distinct !DILexicalBlock(scope: !481, file: !3, line: 282, column: 5)
!496 = !DILocalVariable(name: "dest", scope: !495, file: !3, line: 283, type: !10)
!497 = !DILocation(line: 0, scope: !481)
!498 = !DILocation(line: 253, column: 27, scope: !481)
