; ModuleID = 'pretty-print.bc'
source_filename = "pretty-print.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.pretty_print_info = type { %struct.output_buffer*, i8*, i32, i32, i32, %struct.pp_wrapping_mode_t, i8 (%struct.pretty_print_info*, %struct.text_info*, i8*, i32, i8, i8, i8)*, i8, i8, i8 }
%struct.output_buffer = type { %struct.obstack, %struct.obstack, %struct.obstack*, %struct.chunk_info*, %struct._IO_FILE*, i32, [128 x i8] }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }

!177 = !DIEnumerator(name: "POSTDECREMENT_EXPR", value: 127, isUnsigned: true)
!178 = !DIEnumerator(name: "POSTINCREMENT_EXPR", value: 128, isUnsigned: true)
!179 = !DIEnumerator(name: "VA_ARG_EXPR", value: 129, isUnsigned: true)
!180 = !DIEnumerator(name: "TRY_CATCH_EXPR", value: 130, isUnsigned: true)
!181 = !DIEnumerator(name: "TRY_FINALLY_EXPR", value: 131, isUnsigned: true)
!182 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!183 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!184 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!185 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!186 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!187 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!188 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!189 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!190 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!191 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!192 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!193 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!194 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!195 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!196 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!197 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!198 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!199 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!200 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!201 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!202 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!203 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!204 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!205 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!206 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!207 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!208 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!209 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!210 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!211 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!212 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!213 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!214 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!215 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!216 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!217 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!218 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!219 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!224 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!226 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!227 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!228 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!229 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!230 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!231 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!232 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!233 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!234 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!235 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!236 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!237 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!238 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!239 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!240 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!241 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!242 = !{!243, !244, !245, !246, !249, !250, !252, !247, !260, !261, !48, !262, !264, !266, !368, !371, !374, !5}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!245 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !248, size: 64)
!248 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !248)
!252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !253, size: 64)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "chunk_info", file: !4, line: 58, size: 3904, elements: !254)
!254 = !{!255, !256}
!255 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !253, file: !4, line: 61, baseType: !252, size: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !253, file: !4, line: 69, baseType: !257, size: 3840, offset: 64)
!257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !250, size: 3840, elements: !258)
!258 = !{!259}
!259 = !DISubrange(count: 60)
!260 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!261 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !263, line: 44, baseType: !5)
!263 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !265, line: 35, baseType: !261)
!265 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_typedef, name: "output_buffer", file: !4, line: 99, baseType: !268)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 74, size: 2688, elements: !269)
!269 = !{!270, !302, !303, !305, !306, !363, !364}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "formatted_obstack", scope: !268, file: !4, line: 77, baseType: !271, size: 704)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !272, line: 164, size: 704, elements: !273)
!272 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!273 = !{!274, !275, !285, !286, !287, !288, !289, !290, !294, !298, !299, !300, !301}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !271, file: !272, line: 166, baseType: !261, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !271, file: !272, line: 167, baseType: !276, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !272, line: 157, size: 192, elements: !278)
!278 = !{!279, !280, !281}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !277, file: !272, line: 159, baseType: !247, size: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !277, file: !272, line: 160, baseType: !276, size: 64, offset: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !277, file: !272, line: 161, baseType: !282, size: 32, offset: 128)
!282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 32, elements: !283)
!283 = !{!284}
!284 = !DISubrange(count: 4)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !271, file: !272, line: 168, baseType: !247, size: 64, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !271, file: !272, line: 169, baseType: !247, size: 64, offset: 192)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !271, file: !272, line: 170, baseType: !247, size: 64, offset: 256)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !271, file: !272, line: 171, baseType: !261, size: 64, offset: 320)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !271, file: !272, line: 172, baseType: !245, size: 32, offset: 384)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !271, file: !272, line: 176, baseType: !291, size: 64, offset: 448)
!291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !292, size: 64)
!292 = !DISubroutineType(types: !293)
!293 = !{!276, !249, !261}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !271, file: !272, line: 177, baseType: !295, size: 64, offset: 512)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !249, !276}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !271, file: !272, line: 178, baseType: !249, size: 64, offset: 576)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !271, file: !272, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !271, file: !272, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !271, file: !272, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_obstack", scope: !268, file: !4, line: 81, baseType: !271, size: 704, offset: 704)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !268, file: !4, line: 85, baseType: !304, size: 64, offset: 1408)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "cur_chunk_array", scope: !268, file: !4, line: 88, baseType: !252, size: 64, offset: 1472)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !268, file: !4, line: 91, baseType: !307, size: 64, offset: 1536)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !309, line: 7, baseType: !310)
!309 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !311, line: 49, size: 1728, elements: !312)
!311 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!312 = !{!313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !328, !330, !331, !332, !335, !336, !338, !342, !345, !347, !350, !353, !354, !355, !358, !359}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !310, file: !311, line: 51, baseType: !245, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !310, file: !311, line: 54, baseType: !247, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !310, file: !311, line: 55, baseType: !247, size: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !310, file: !311, line: 56, baseType: !247, size: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !310, file: !311, line: 57, baseType: !247, size: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !310, file: !311, line: 58, baseType: !247, size: 64, offset: 320)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !310, file: !311, line: 59, baseType: !247, size: 64, offset: 384)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !310, file: !311, line: 60, baseType: !247, size: 64, offset: 448)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !310, file: !311, line: 61, baseType: !247, size: 64, offset: 512)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !310, file: !311, line: 64, baseType: !247, size: 64, offset: 576)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !310, file: !311, line: 65, baseType: !247, size: 64, offset: 640)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !310, file: !311, line: 66, baseType: !247, size: 64, offset: 704)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !310, file: !311, line: 68, baseType: !326, size: 64, offset: 768)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !311, line: 36, flags: DIFlagFwdDecl)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !310, file: !311, line: 70, baseType: !329, size: 64, offset: 832)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !310, file: !311, line: 72, baseType: !245, size: 32, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !310, file: !311, line: 73, baseType: !245, size: 32, offset: 928)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !310, file: !311, line: 74, baseType: !333, size: 64, offset: 960)
!333 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !334, line: 152, baseType: !261)
!334 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!335 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !310, file: !311, line: 77, baseType: !260, size: 16, offset: 1024)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !310, file: !311, line: 78, baseType: !337, size: 8, offset: 1040)
!337 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !310, file: !311, line: 79, baseType: !339, size: 8, offset: 1048)
!339 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 8, elements: !340)
!340 = !{!341}
!341 = !DISubrange(count: 1)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !310, file: !311, line: 81, baseType: !343, size: 64, offset: 1088)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !311, line: 43, baseType: null)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !310, file: !311, line: 89, baseType: !346, size: 64, offset: 1152)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !334, line: 153, baseType: !261)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !310, file: !311, line: 91, baseType: !348, size: 64, offset: 1216)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !311, line: 37, flags: DIFlagFwdDecl)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !310, file: !311, line: 92, baseType: !351, size: 64, offset: 1280)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !311, line: 38, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !310, file: !311, line: 93, baseType: !329, size: 64, offset: 1344)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !310, file: !311, line: 94, baseType: !249, size: 64, offset: 1408)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !310, file: !311, line: 95, baseType: !356, size: 64, offset: 1472)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !265, line: 46, baseType: !357)
!357 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !310, file: !311, line: 96, baseType: !245, size: 32, offset: 1536)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !310, file: !311, line: 98, baseType: !360, size: 160, offset: 1568)
!360 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 160, elements: !361)
!361 = !{!362}
!362 = !DISubrange(count: 20)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "line_length", scope: !268, file: !4, line: 94, baseType: !245, size: 32, offset: 1600)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "digit_buffer", scope: !268, file: !4, line: 98, baseType: !365, size: 1024, offset: 1632)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !248, size: 1024, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 128)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!249, !261}
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !372, size: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{null, !249}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !244)
!376 = !{i32 2, !"Dwarf Version", i32 4}
!377 = !{i32 2, !"Debug Info Version", i32 3}
!378 = !{i32 1, !"wchar_size", i32 4}
!379 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!380 = distinct !DISubprogram(name: "vprintf", scope: !381, file: !381, line: 39, type: !382, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !392)
!381 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!382 = !DISubroutineType(types: !383)
!383 = !{!245, !384, !385}
!384 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !250)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !387)
!387 = !{!388, !389, !390, !391}
!388 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !386, file: !1, baseType: !5, size: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !386, file: !1, baseType: !5, size: 32, offset: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !386, file: !1, baseType: !249, size: 64, offset: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !386, file: !1, baseType: !249, size: 64, offset: 128)
!392 = !{!393, !394}
!393 = !DILocalVariable(name: "__fmt", arg: 1, scope: !380, file: !381, line: 39, type: !384)
!394 = !DILocalVariable(name: "__arg", arg: 2, scope: !380, file: !381, line: 39, type: !385)
!395 = !DILocation(line: 0, scope: !380)
!396 = !DILocation(line: 41, column: 20, scope: !380)
!397 = !DILocation(line: 41, column: 10, scope: !380)
!398 = !DILocation(line: 41, column: 3, scope: !380)
!399 = distinct !DISubprogram(name: "getchar", scope: !381, file: !381, line: 47, type: !400, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !402)
!400 = !DISubroutineType(types: !401)
!401 = !{!245}
!402 = !{}
!403 = !DILocation(line: 49, column: 16, scope: !399)
!404 = !DILocation(line: 49, column: 10, scope: !399)
!405 = !DILocation(line: 49, column: 3, scope: !399)
!406 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !381, file: !381, line: 56, type: !407, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !409)
!407 = !DISubroutineType(types: !408)
!408 = !{!245, !307}
!409 = !{!410}
!410 = !DILocalVariable(name: "__fp", arg: 1, scope: !406, file: !381, line: 56, type: !307)
!411 = !DILocation(line: 0, scope: !406)
!412 = !DILocation(line: 58, column: 10, scope: !406)
!413 = !DILocation(line: 58, column: 3, scope: !406)
!414 = distinct !DISubprogram(name: "getc_unlocked", scope: !381, file: !381, line: 66, type: !407, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !415)
!415 = !{!416}
!416 = !DILocalVariable(name: "__fp", arg: 1, scope: !414, file: !381, line: 66, type: !307)
!417 = !DILocation(line: 0, scope: !414)
!418 = !DILocation(line: 68, column: 10, scope: !414)
!419 = !DILocation(line: 68, column: 3, scope: !414)
!420 = distinct !DISubprogram(name: "getchar_unlocked", scope: !381, file: !381, line: 73, type: !400, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !402)
!421 = !DILocation(line: 75, column: 10, scope: !420)
!422 = !DILocation(line: 75, column: 3, scope: !420)
!423 = distinct !DISubprogram(name: "putchar", scope: !381, file: !381, line: 82, type: !424, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !426)
!424 = !DISubroutineType(types: !425)
!425 = !{!245, !245}
!426 = !{!427}
!427 = !DILocalVariable(name: "__c", arg: 1, scope: !423, file: !381, line: 82, type: !245)
!428 = !DILocation(line: 0, scope: !423)
!429 = !DILocation(line: 84, column: 21, scope: !423)
!430 = !DILocation(line: 84, column: 10, scope: !423)
!431 = !DILocation(line: 84, column: 3, scope: !423)
!432 = distinct !DISubprogram(name: "fputc_unlocked", scope: !381, file: !381, line: 91, type: !433, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !435)
!433 = !DISubroutineType(types: !434)
!434 = !{!245, !245, !307}
!435 = !{!436, !437}
!436 = !DILocalVariable(name: "__c", arg: 1, scope: !432, file: !381, line: 91, type: !245)
!437 = !DILocalVariable(name: "__stream", arg: 2, scope: !432, file: !381, line: 91, type: !307)
!438 = !DILocation(line: 0, scope: !432)
!439 = !DILocation(line: 93, column: 10, scope: !432)
!440 = !DILocation(line: 93, column: 3, scope: !432)
!441 = distinct !DISubprogram(name: "putc_unlocked", scope: !381, file: !381, line: 101, type: !433, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !442)
!442 = !{!443, !444}
!443 = !DILocalVariable(name: "__c", arg: 1, scope: !441, file: !381, line: 101, type: !245)
!444 = !DILocalVariable(name: "__stream", arg: 2, scope: !441, file: !381, line: 101, type: !307)
!445 = !DILocation(line: 0, scope: !441)
!446 = !DILocation(line: 103, column: 10, scope: !441)
!447 = !DILocation(line: 103, column: 3, scope: !441)
!448 = distinct !DISubprogram(name: "putchar_unlocked", scope: !381, file: !381, line: 108, type: !424, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !449)
!449 = !{!450}
!450 = !DILocalVariable(name: "__c", arg: 1, scope: !448, file: !381, line: 108, type: !245)
!451 = !DILocation(line: 0, scope: !448)
!452 = !DILocation(line: 110, column: 10, scope: !448)
!453 = !DILocation(line: 110, column: 3, scope: !448)
!454 = distinct !DISubprogram(name: "getline", scope: !381, file: !381, line: 118, type: !455, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !459)
!455 = !DISubroutineType(types: !456)
!456 = !{!457, !246, !458, !307}
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !334, line: 193, baseType: !261)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!459 = !{!460, !461, !462}
!460 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !454, file: !381, line: 118, type: !246)
!461 = !DILocalVariable(name: "__n", arg: 2, scope: !454, file: !381, line: 118, type: !458)
!462 = !DILocalVariable(name: "__stream", arg: 3, scope: !454, file: !381, line: 118, type: !307)
!463 = !DILocation(line: 0, scope: !454)
!464 = !DILocation(line: 120, column: 10, scope: !454)
!465 = !DILocation(line: 120, column: 3, scope: !454)
!466 = distinct !DISubprogram(name: "feof_unlocked", scope: !381, file: !381, line: 128, type: !407, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !467)
!467 = !{!468}
!468 = !DILocalVariable(name: "__stream", arg: 1, scope: !466, file: !381, line: 128, type: !307)
!469 = !DILocation(line: 0, scope: !466)
!470 = !DILocation(line: 130, column: 10, scope: !466)
!471 = !DILocation(line: 130, column: 3, scope: !466)
!472 = distinct !DISubprogram(name: "ferror_unlocked", scope: !381, file: !381, line: 135, type: !407, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !473)
!473 = !{!474}
!474 = !DILocalVariable(name: "__stream", arg: 1, scope: !472, file: !381, line: 135, type: !307)
!475 = !DILocation(line: 0, scope: !472)
!476 = !DILocation(line: 137, column: 10, scope: !472)
!477 = !DILocation(line: 137, column: 3, scope: !472)
!478 = distinct !DISubprogram(name: "tolower", scope: !479, file: !479, line: 207, type: !424, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !480)
!479 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!480 = !{!481}
!481 = !DILocalVariable(name: "__c", arg: 1, scope: !478, file: !479, line: 207, type: !245)
!482 = !DILocation(line: 0, scope: !478)
!483 = !DILocation(line: 209, column: 22, scope: !478)
!484 = !DILocation(line: 209, column: 39, scope: !478)
!485 = !DILocation(line: 209, column: 38, scope: !478)
!486 = !DILocation(line: 209, column: 37, scope: !478)
!487 = !DILocation(line: 209, column: 10, scope: !478)
!488 = !DILocation(line: 209, column: 3, scope: !478)
!489 = distinct !DISubprogram(name: "toupper", scope: !479, file: !479, line: 213, type: !424, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !490)
!490 = !{!491}
!491 = !DILocalVariable(name: "__c", arg: 1, scope: !489, file: !479, line: 213, type: !245)
!492 = !DILocation(line: 0, scope: !489)
!493 = !DILocation(line: 215, column: 22, scope: !489)
!494 = !DILocation(line: 215, column: 39, scope: !489)
!495 = !DILocation(line: 215, column: 38, scope: !489)
!496 = !DILocation(line: 215, column: 37, scope: !489)
!497 = !DILocation(line: 215, column: 10, scope: !489)
!498 = !DILocation(line: 215, column: 3, scope: !489)
!499 = distinct !DISubprogram(name: "atoi", scope: !500, file: !500, line: 361, type: !501, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !503)
!500 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!501 = !DISubroutineType(types: !502)
!502 = !{!245, !250}
!503 = !{!504}
!504 = !DILocalVariable(name: "__nptr", arg: 1, scope: !499, file: !500, line: 361, type: !250)
!505 = !DILocation(line: 0, scope: !499)
!506 = !DILocation(line: 363, column: 16, scope: !499)
!507 = !DILocation(line: 363, column: 10, scope: !499)
!508 = !DILocation(line: 363, column: 3, scope: !499)
!509 = distinct !DISubprogram(name: "atol", scope: !500, file: !500, line: 366, type: !510, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!261, !250}
!512 = !{!513}
!513 = !DILocalVariable(name: "__nptr", arg: 1, scope: !509, file: !500, line: 366, type: !250)
!514 = !DILocation(line: 0, scope: !509)
!515 = !DILocation(line: 368, column: 10, scope: !509)
!516 = !DILocation(line: 368, column: 3, scope: !509)
!517 = distinct !DISubprogram(name: "atoll", scope: !500, file: !500, line: 373, type: !518, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !521)
!518 = !DISubroutineType(types: !519)
!519 = !{!520, !250}
!520 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!521 = !{!522}
!522 = !DILocalVariable(name: "__nptr", arg: 1, scope: !517, file: !500, line: 373, type: !250)
!523 = !DILocation(line: 0, scope: !517)
!524 = !DILocation(line: 375, column: 10, scope: !517)
!525 = !DILocation(line: 375, column: 3, scope: !517)
!526 = distinct !DISubprogram(name: "bsearch", scope: !527, file: !527, line: 20, type: !528, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !536)
!527 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!528 = !DISubroutineType(types: !529)
!529 = !{!249, !530, !530, !356, !356, !532}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !500, line: 808, baseType: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DISubroutineType(types: !535)
!535 = !{!245, !530, !530}
!536 = !{!537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!537 = !DILocalVariable(name: "__key", arg: 1, scope: !526, file: !527, line: 20, type: !530)
!538 = !DILocalVariable(name: "__base", arg: 2, scope: !526, file: !527, line: 20, type: !530)
!539 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !526, file: !527, line: 20, type: !356)
!540 = !DILocalVariable(name: "__size", arg: 4, scope: !526, file: !527, line: 20, type: !356)
!541 = !DILocalVariable(name: "__compar", arg: 5, scope: !526, file: !527, line: 21, type: !532)
!542 = !DILocalVariable(name: "__l", scope: !526, file: !527, line: 23, type: !356)
!543 = !DILocalVariable(name: "__u", scope: !526, file: !527, line: 23, type: !356)
!544 = !DILocalVariable(name: "__idx", scope: !526, file: !527, line: 23, type: !356)
!545 = !DILocalVariable(name: "__p", scope: !526, file: !527, line: 24, type: !530)
!546 = !DILocalVariable(name: "__comparison", scope: !526, file: !527, line: 25, type: !245)
!547 = !DILocation(line: 0, scope: !526)
!548 = !DILocation(line: 29, column: 3, scope: !526)
!549 = !DILocation(line: 27, column: 7, scope: !526)
!550 = !DILocation(line: 29, column: 14, scope: !526)
!551 = !DILocation(line: 31, column: 20, scope: !552)
!552 = distinct !DILexicalBlock(scope: !526, file: !527, line: 30, column: 5)
!553 = !DILocation(line: 31, column: 27, scope: !552)
!554 = !DILocation(line: 32, column: 56, scope: !552)
!555 = !DILocation(line: 32, column: 47, scope: !552)
!556 = !DILocation(line: 33, column: 22, scope: !552)
!557 = !DILocation(line: 34, column: 24, scope: !558)
!558 = distinct !DILexicalBlock(scope: !552, file: !527, line: 34, column: 11)
!559 = !DILocation(line: 34, column: 11, scope: !552)
!560 = !DILocation(line: 36, column: 29, scope: !561)
!561 = distinct !DILexicalBlock(scope: !558, file: !527, line: 36, column: 16)
!562 = !DILocation(line: 36, column: 16, scope: !558)
!563 = !DILocation(line: 37, column: 14, scope: !561)
!564 = distinct !{!564, !548, !565}
!565 = !DILocation(line: 40, column: 5, scope: !526)
!566 = !DILocation(line: 43, column: 1, scope: !526)
!567 = distinct !DISubprogram(name: "atof", scope: !568, file: !568, line: 25, type: !569, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !572)
!568 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!569 = !DISubroutineType(types: !570)
!570 = !{!571, !250}
!571 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!572 = !{!573}
!573 = !DILocalVariable(name: "__nptr", arg: 1, scope: !567, file: !568, line: 25, type: !250)
!574 = !DILocation(line: 0, scope: !567)
!575 = !DILocation(line: 27, column: 10, scope: !567)
!576 = !DILocation(line: 27, column: 3, scope: !567)
!577 = distinct !DISubprogram(name: "strtoimax", scope: !578, file: !578, line: 324, type: !579, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !585)
!578 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!579 = !DISubroutineType(types: !580)
!580 = !{!581, !384, !584, !245}
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !582, line: 101, baseType: !583)
!582 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !334, line: 72, baseType: !261)
!584 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !246)
!585 = !{!586, !587, !588}
!586 = !DILocalVariable(name: "nptr", arg: 1, scope: !577, file: !578, line: 324, type: !384)
!587 = !DILocalVariable(name: "endptr", arg: 2, scope: !577, file: !578, line: 324, type: !584)
!588 = !DILocalVariable(name: "base", arg: 3, scope: !577, file: !578, line: 324, type: !245)
!589 = !DILocation(line: 0, scope: !577)
!590 = !DILocation(line: 327, column: 10, scope: !577)
!591 = !DILocation(line: 327, column: 3, scope: !577)
!592 = distinct !DISubprogram(name: "strtoumax", scope: !578, file: !578, line: 336, type: !593, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !597)
!593 = !DISubroutineType(types: !594)
!594 = !{!595, !384, !584, !245}
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !582, line: 102, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !334, line: 73, baseType: !357)
!597 = !{!598, !599, !600}
!598 = !DILocalVariable(name: "nptr", arg: 1, scope: !592, file: !578, line: 336, type: !384)
!599 = !DILocalVariable(name: "endptr", arg: 2, scope: !592, file: !578, line: 336, type: !584)
!600 = !DILocalVariable(name: "base", arg: 3, scope: !592, file: !578, line: 336, type: !245)
!601 = !DILocation(line: 0, scope: !592)
!602 = !DILocation(line: 339, column: 10, scope: !592)
!603 = !DILocation(line: 339, column: 3, scope: !592)
!604 = distinct !DISubprogram(name: "wcstoimax", scope: !578, file: !578, line: 348, type: !605, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !614)
!605 = !DISubroutineType(types: !606)
!606 = !{!581, !607, !611, !245}
!607 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !578, line: 34, baseType: !245)
!611 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !612)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!614 = !{!615, !616, !617}
!615 = !DILocalVariable(name: "nptr", arg: 1, scope: !604, file: !578, line: 348, type: !607)
!616 = !DILocalVariable(name: "endptr", arg: 2, scope: !604, file: !578, line: 348, type: !611)
!617 = !DILocalVariable(name: "base", arg: 3, scope: !604, file: !578, line: 348, type: !245)
!618 = !DILocation(line: 0, scope: !604)
!619 = !DILocation(line: 351, column: 10, scope: !604)
!620 = !DILocation(line: 351, column: 3, scope: !604)
!621 = distinct !DISubprogram(name: "wcstoumax", scope: !578, file: !578, line: 362, type: !622, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !624)
!622 = !DISubroutineType(types: !623)
!623 = !{!595, !607, !611, !245}
!624 = !{!625, !626, !627}
!625 = !DILocalVariable(name: "nptr", arg: 1, scope: !621, file: !578, line: 362, type: !607)
!626 = !DILocalVariable(name: "endptr", arg: 2, scope: !621, file: !578, line: 362, type: !611)
!627 = !DILocalVariable(name: "base", arg: 3, scope: !621, file: !578, line: 362, type: !245)
!628 = !DILocation(line: 0, scope: !621)
!629 = !DILocation(line: 365, column: 10, scope: !621)
!630 = !DILocation(line: 365, column: 3, scope: !621)
!631 = distinct !DISubprogram(name: "stat", scope: !632, file: !632, line: 453, type: !633, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !672)
!632 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!633 = !DISubroutineType(types: !634)
!634 = !{!245, !250, !635}
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !637, line: 46, size: 1152, elements: !638)
!637 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!638 = !{!639, !641, !643, !645, !647, !649, !651, !652, !653, !654, !656, !658, !666, !667, !668}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !636, file: !637, line: 48, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !334, line: 145, baseType: !357)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !636, file: !637, line: 53, baseType: !642, size: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !334, line: 148, baseType: !357)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !636, file: !637, line: 61, baseType: !644, size: 64, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !334, line: 151, baseType: !357)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !636, file: !637, line: 62, baseType: !646, size: 32, offset: 192)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !334, line: 150, baseType: !5)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !636, file: !637, line: 64, baseType: !648, size: 32, offset: 224)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !334, line: 146, baseType: !5)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !636, file: !637, line: 65, baseType: !650, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !334, line: 147, baseType: !5)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !636, file: !637, line: 67, baseType: !245, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !636, file: !637, line: 69, baseType: !640, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !636, file: !637, line: 74, baseType: !333, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !636, file: !637, line: 78, baseType: !655, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !334, line: 174, baseType: !261)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !636, file: !637, line: 80, baseType: !657, size: 64, offset: 512)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !334, line: 179, baseType: !261)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !636, file: !637, line: 91, baseType: !659, size: 128, offset: 576)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !660, line: 10, size: 128, elements: !661)
!660 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!661 = !{!662, !664}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !659, file: !660, line: 12, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !334, line: 160, baseType: !261)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !659, file: !660, line: 16, baseType: !665, size: 64, offset: 64)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !334, line: 196, baseType: !261)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !636, file: !637, line: 92, baseType: !659, size: 128, offset: 704)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !636, file: !637, line: 93, baseType: !659, size: 128, offset: 832)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !636, file: !637, line: 106, baseType: !669, size: 192, offset: 960)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 192, elements: !670)
!670 = !{!671}
!671 = !DISubrange(count: 3)
!672 = !{!673, !674}
!673 = !DILocalVariable(name: "__path", arg: 1, scope: !631, file: !632, line: 453, type: !250)
!674 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !631, file: !632, line: 453, type: !635)
!675 = !DILocation(line: 0, scope: !631)
!676 = !DILocation(line: 455, column: 10, scope: !631)
!677 = !DILocation(line: 455, column: 3, scope: !631)
!678 = distinct !DISubprogram(name: "lstat", scope: !632, file: !632, line: 460, type: !633, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !679)
!679 = !{!680, !681}
!680 = !DILocalVariable(name: "__path", arg: 1, scope: !678, file: !632, line: 460, type: !250)
!681 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !678, file: !632, line: 460, type: !635)
!682 = !DILocation(line: 0, scope: !678)
!683 = !DILocation(line: 462, column: 10, scope: !678)
!684 = !DILocation(line: 462, column: 3, scope: !678)
!685 = distinct !DISubprogram(name: "fstat", scope: !632, file: !632, line: 467, type: !686, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !688)
!686 = !DISubroutineType(types: !687)
!687 = !{!245, !245, !635}
!688 = !{!689, !690}
!689 = !DILocalVariable(name: "__fd", arg: 1, scope: !685, file: !632, line: 467, type: !245)
!690 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !685, file: !632, line: 467, type: !635)
!691 = !DILocation(line: 0, scope: !685)
!692 = !DILocation(line: 469, column: 10, scope: !685)
!693 = !DILocation(line: 469, column: 3, scope: !685)
!694 = distinct !DISubprogram(name: "fstatat", scope: !632, file: !632, line: 474, type: !695, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !697)
!695 = !DISubroutineType(types: !696)
!696 = !{!245, !245, !250, !635, !245}
!697 = !{!698, !699, !700, !701}
!698 = !DILocalVariable(name: "__fd", arg: 1, scope: !694, file: !632, line: 474, type: !245)
!699 = !DILocalVariable(name: "__filename", arg: 2, scope: !694, file: !632, line: 474, type: !250)
!700 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !694, file: !632, line: 474, type: !635)
!701 = !DILocalVariable(name: "__flag", arg: 4, scope: !694, file: !632, line: 474, type: !245)
!702 = !DILocation(line: 0, scope: !694)
!703 = !DILocation(line: 477, column: 10, scope: !694)
!704 = !DILocation(line: 477, column: 3, scope: !694)
!705 = distinct !DISubprogram(name: "mknod", scope: !632, file: !632, line: 483, type: !706, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !708)
!706 = !DISubroutineType(types: !707)
!707 = !{!245, !250, !646, !640}
!708 = !{!709, !710, !711}
!709 = !DILocalVariable(name: "__path", arg: 1, scope: !705, file: !632, line: 483, type: !250)
!710 = !DILocalVariable(name: "__mode", arg: 2, scope: !705, file: !632, line: 483, type: !646)
!711 = !DILocalVariable(name: "__dev", arg: 3, scope: !705, file: !632, line: 483, type: !640)
!712 = !DILocation(line: 0, scope: !705)
!713 = !DILocation(line: 485, column: 10, scope: !705)
!714 = !DILocation(line: 485, column: 3, scope: !705)
!715 = distinct !DISubprogram(name: "mknodat", scope: !632, file: !632, line: 491, type: !716, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !718)
!716 = !DISubroutineType(types: !717)
!717 = !{!245, !245, !250, !646, !640}
!718 = !{!719, !720, !721, !722}
!719 = !DILocalVariable(name: "__fd", arg: 1, scope: !715, file: !632, line: 491, type: !245)
!720 = !DILocalVariable(name: "__path", arg: 2, scope: !715, file: !632, line: 491, type: !250)
!721 = !DILocalVariable(name: "__mode", arg: 3, scope: !715, file: !632, line: 491, type: !646)
!722 = !DILocalVariable(name: "__dev", arg: 4, scope: !715, file: !632, line: 491, type: !640)
!723 = !DILocation(line: 0, scope: !715)
!724 = !DILocation(line: 494, column: 10, scope: !715)
!725 = !DILocation(line: 494, column: 3, scope: !715)
!726 = distinct !DISubprogram(name: "stat64", scope: !632, file: !632, line: 502, type: !727, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !749)
!727 = !DISubroutineType(types: !728)
!728 = !{!245, !250, !729}
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !637, line: 119, size: 1152, elements: !731)
!731 = !{!732, !733, !735, !736, !737, !738, !739, !740, !741, !742, !743, !745, !746, !747, !748}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !730, file: !637, line: 121, baseType: !640, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !730, file: !637, line: 123, baseType: !734, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !334, line: 149, baseType: !357)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !730, file: !637, line: 124, baseType: !644, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !730, file: !637, line: 125, baseType: !646, size: 32, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !730, file: !637, line: 132, baseType: !648, size: 32, offset: 224)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !730, file: !637, line: 133, baseType: !650, size: 32, offset: 256)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !730, file: !637, line: 135, baseType: !245, size: 32, offset: 288)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !730, file: !637, line: 136, baseType: !640, size: 64, offset: 320)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !730, file: !637, line: 137, baseType: !333, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !730, file: !637, line: 143, baseType: !655, size: 64, offset: 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !730, file: !637, line: 144, baseType: !744, size: 64, offset: 512)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !334, line: 180, baseType: !261)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !730, file: !637, line: 152, baseType: !659, size: 128, offset: 576)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !730, file: !637, line: 153, baseType: !659, size: 128, offset: 704)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !730, file: !637, line: 154, baseType: !659, size: 128, offset: 832)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !730, file: !637, line: 164, baseType: !669, size: 192, offset: 960)
!749 = !{!750, !751}
!750 = !DILocalVariable(name: "__path", arg: 1, scope: !726, file: !632, line: 502, type: !250)
!751 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !726, file: !632, line: 502, type: !729)
!752 = !DILocation(line: 0, scope: !726)
!753 = !DILocation(line: 504, column: 10, scope: !726)
!754 = !DILocation(line: 504, column: 3, scope: !726)
!755 = distinct !DISubprogram(name: "lstat64", scope: !632, file: !632, line: 509, type: !727, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !756)
!756 = !{!757, !758}
!757 = !DILocalVariable(name: "__path", arg: 1, scope: !755, file: !632, line: 509, type: !250)
!758 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !755, file: !632, line: 509, type: !729)
!759 = !DILocation(line: 0, scope: !755)
!760 = !DILocation(line: 511, column: 10, scope: !755)
!761 = !DILocation(line: 511, column: 3, scope: !755)
!762 = distinct !DISubprogram(name: "fstat64", scope: !632, file: !632, line: 516, type: !763, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !765)
!763 = !DISubroutineType(types: !764)
!764 = !{!245, !245, !729}
!765 = !{!766, !767}
!766 = !DILocalVariable(name: "__fd", arg: 1, scope: !762, file: !632, line: 516, type: !245)
!767 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !762, file: !632, line: 516, type: !729)
!768 = !DILocation(line: 0, scope: !762)
!769 = !DILocation(line: 518, column: 10, scope: !762)
!770 = !DILocation(line: 518, column: 3, scope: !762)
!771 = distinct !DISubprogram(name: "fstatat64", scope: !632, file: !632, line: 523, type: !772, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{!245, !245, !250, !729, !245}
!774 = !{!775, !776, !777, !778}
!775 = !DILocalVariable(name: "__fd", arg: 1, scope: !771, file: !632, line: 523, type: !245)
!776 = !DILocalVariable(name: "__filename", arg: 2, scope: !771, file: !632, line: 523, type: !250)
!777 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !771, file: !632, line: 523, type: !729)
!778 = !DILocalVariable(name: "__flag", arg: 4, scope: !771, file: !632, line: 523, type: !245)
!779 = !DILocation(line: 0, scope: !771)
!780 = !DILocation(line: 526, column: 10, scope: !771)
!781 = !DILocation(line: 526, column: 3, scope: !771)
!782 = distinct !DISubprogram(name: "pp_write_text_to_stream", scope: !1, file: !1, line: 101, type: !783, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1457)
!783 = !DISubroutineType(types: !784)
!784 = !{null, !785}
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "pretty_printer", file: !4, line: 134, baseType: !787)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pretty_print_info", file: !4, line: 158, size: 448, elements: !788)
!788 = !{!789, !790, !791, !793, !794, !795, !802, !1454, !1455, !1456}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !787, file: !4, line: 161, baseType: !266, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "prefix", scope: !787, file: !4, line: 164, baseType: !250, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "padding", scope: !787, file: !4, line: 167, baseType: !792, size: 32, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_typedef, name: "pp_padding", file: !4, line: 107, baseType: !3)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "maximum_length", scope: !787, file: !4, line: 171, baseType: !245, size: 32, offset: 160)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "indent_skip", scope: !787, file: !4, line: 174, baseType: !245, size: 32, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "wrapping", scope: !787, file: !4, line: 177, baseType: !796, size: 64, offset: 224)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "pp_wrapping_mode_t", file: !4, line: 119, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 111, size: 64, elements: !798)
!798 = !{!799, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rule", scope: !797, file: !4, line: 114, baseType: !800, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "diagnostic_prefixing_rule_t", file: !4, line: 51, baseType: !10)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "line_cutoff", scope: !797, file: !4, line: 118, baseType: !245, size: 32, offset: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "format_decoder", scope: !787, file: !4, line: 187, baseType: !803, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "printer_fn", file: !4, line: 135, baseType: !804)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DISubroutineType(types: !806)
!806 = !{!244, !785, !807, !250, !245, !244, !244, !244}
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "text_info", file: !4, line: 39, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !4, line: 32, size: 320, elements: !810)
!810 = !{!811, !812, !820, !821, !825}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "format_spec", scope: !809, file: !4, line: 34, baseType: !250, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "args_ptr", scope: !809, file: !4, line: 35, baseType: !813, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !815, line: 52, baseType: !816)
!815 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !817, line: 32, baseType: !818)
!817 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stdarg.h", directory: "")
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, line: 527, baseType: !819)
!819 = !DICompositeType(tag: DW_TAG_array_type, baseType: !386, size: 192, elements: !340)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "err_no", scope: !809, file: !4, line: 36, baseType: !245, size: 32, offset: 128)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !809, file: !4, line: 37, baseType: !822, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !824, line: 58, baseType: !262)
!824 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!825 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !809, file: !4, line: 38, baseType: !826, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !828, line: 56, baseType: !829)
!828 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !16, line: 3371, size: 1792, elements: !831)
!831 = !{!832, !865, !871, !882, !889, !896, !901, !907, !913, !924, !932, !970, !978, !1006, !1014, !1015, !1020, !1029, !1035, !1040, !1044, !1048, !1077, !1126, !1132, !1139, !1146, !1171, !1196, !1213, !1225, !1247, !1265, !1436}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !830, file: !16, line: 3372, baseType: !833, size: 64)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !16, line: 360, size: 64, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !833, file: !16, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !833, file: !16, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !833, file: !16, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !833, file: !16, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !833, file: !16, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !833, file: !16, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !833, file: !16, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !833, file: !16, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !833, file: !16, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !833, file: !16, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !833, file: !16, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !833, file: !16, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !833, file: !16, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !833, file: !16, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !833, file: !16, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !833, file: !16, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !833, file: !16, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !833, file: !16, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !833, file: !16, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !833, file: !16, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !833, file: !16, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !833, file: !16, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !833, file: !16, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !833, file: !16, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !833, file: !16, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !833, file: !16, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !833, file: !16, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !833, file: !16, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !833, file: !16, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !833, file: !16, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !830, file: !16, line: 3373, baseType: !866, size: 192)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !16, line: 402, size: 192, elements: !867)
!867 = !{!868, !869, !870}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !866, file: !16, line: 403, baseType: !833, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !866, file: !16, line: 404, baseType: !827, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !866, file: !16, line: 405, baseType: !827, size: 64, offset: 128)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !830, file: !16, line: 3374, baseType: !872, size: 320)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !16, line: 1384, size: 320, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !872, file: !16, line: 1385, baseType: !866, size: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !872, file: !16, line: 1386, baseType: !876, size: 128, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !877, line: 58, baseType: !878)
!877 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !877, line: 54, size: 128, elements: !879)
!879 = !{!880, !881}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !878, file: !877, line: 56, baseType: !357, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !878, file: !877, line: 57, baseType: !261, size: 64, offset: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !830, file: !16, line: 3375, baseType: !883, size: 256)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !16, line: 1397, size: 256, elements: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !883, file: !16, line: 1398, baseType: !866, size: 192)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !883, file: !16, line: 1399, baseType: !887, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !16, line: 1392, flags: DIFlagFwdDecl)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !830, file: !16, line: 3376, baseType: !890, size: 256)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !16, line: 1408, size: 256, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !890, file: !16, line: 1409, baseType: !866, size: 192)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !890, file: !16, line: 1410, baseType: !894, size: 64, offset: 192)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !16, line: 1403, flags: DIFlagFwdDecl)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !830, file: !16, line: 3377, baseType: !897, size: 256)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !16, line: 1437, size: 256, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !16, line: 1438, baseType: !866, size: 192)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !897, file: !16, line: 1439, baseType: !827, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !830, file: !16, line: 3378, baseType: !902, size: 256)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !16, line: 1418, size: 256, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !16, line: 1419, baseType: !866, size: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !902, file: !16, line: 1420, baseType: !245, size: 32, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !902, file: !16, line: 1421, baseType: !339, size: 8, offset: 224)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !830, file: !16, line: 3379, baseType: !908, size: 320)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !16, line: 1428, size: 320, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !908, file: !16, line: 1429, baseType: !866, size: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !908, file: !16, line: 1430, baseType: !827, size: 64, offset: 192)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !908, file: !16, line: 1431, baseType: !827, size: 64, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !830, file: !16, line: 3380, baseType: !914, size: 320)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !16, line: 1460, size: 320, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !914, file: !16, line: 1461, baseType: !866, size: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !914, file: !16, line: 1462, baseType: !918, size: 128, offset: 192)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !919, line: 31, size: 128, elements: !920)
!919 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !918, file: !919, line: 32, baseType: !374, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !918, file: !919, line: 33, baseType: !5, size: 32, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !918, file: !919, line: 34, baseType: !5, size: 32, offset: 96)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !830, file: !16, line: 3381, baseType: !925, size: 384)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !16, line: 2507, size: 384, elements: !926)
!926 = !{!927, !928, !929, !930, !931}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !16, line: 2508, baseType: !866, size: 192)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !925, file: !16, line: 2509, baseType: !823, size: 32, offset: 192)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !925, file: !16, line: 2510, baseType: !5, size: 32, offset: 224)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !925, file: !16, line: 2511, baseType: !827, size: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !925, file: !16, line: 2512, baseType: !827, size: 64, offset: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !830, file: !16, line: 3382, baseType: !933, size: 896)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !16, line: 2652, size: 896, elements: !934)
!934 = !{!935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !16, line: 2653, baseType: !925, size: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !933, file: !16, line: 2654, baseType: !827, size: 64, offset: 384)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !933, file: !16, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !933, file: !16, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !933, file: !16, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !933, file: !16, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !933, file: !16, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !933, file: !16, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !933, file: !16, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !933, file: !16, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !933, file: !16, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !933, file: !16, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !933, file: !16, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !933, file: !16, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !933, file: !16, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !933, file: !16, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !933, file: !16, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !933, file: !16, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !933, file: !16, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !933, file: !16, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !933, file: !16, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !933, file: !16, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !933, file: !16, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !933, file: !16, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !933, file: !16, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !933, file: !16, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !933, file: !16, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !933, file: !16, line: 2703, baseType: !5, size: 32, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !933, file: !16, line: 2705, baseType: !827, size: 64, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !933, file: !16, line: 2706, baseType: !827, size: 64, offset: 640)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !933, file: !16, line: 2707, baseType: !827, size: 64, offset: 704)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !933, file: !16, line: 2708, baseType: !827, size: 64, offset: 768)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !933, file: !16, line: 2711, baseType: !968, size: 64, offset: 832)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !16, line: 2711, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !830, file: !16, line: 3383, baseType: !971, size: 960)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !16, line: 2756, size: 960, elements: !972)
!972 = !{!973, !974}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !971, file: !16, line: 2757, baseType: !933, size: 896)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !971, file: !16, line: 2758, baseType: !975, size: 64, offset: 896)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !828, line: 50, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !828, line: 49, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !830, file: !16, line: 3384, baseType: !979, size: 1472)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !16, line: 3114, size: 1472, elements: !980)
!980 = !{!981, !1002, !1003, !1004, !1005}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !979, file: !16, line: 3115, baseType: !982, size: 1216)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !16, line: 2984, size: 1216, elements: !983)
!983 = !{!984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !982, file: !16, line: 2985, baseType: !971, size: 960)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !982, file: !16, line: 2986, baseType: !827, size: 64, offset: 960)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !982, file: !16, line: 2987, baseType: !827, size: 64, offset: 1024)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !982, file: !16, line: 2988, baseType: !827, size: 64, offset: 1088)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !982, file: !16, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !982, file: !16, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !982, file: !16, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !982, file: !16, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !982, file: !16, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !982, file: !16, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !982, file: !16, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !982, file: !16, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !982, file: !16, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !982, file: !16, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !982, file: !16, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !982, file: !16, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !982, file: !16, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !982, file: !16, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !979, file: !16, line: 3117, baseType: !827, size: 64, offset: 1216)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !979, file: !16, line: 3119, baseType: !827, size: 64, offset: 1280)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !979, file: !16, line: 3121, baseType: !827, size: 64, offset: 1344)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !979, file: !16, line: 3123, baseType: !827, size: 64, offset: 1408)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !830, file: !16, line: 3385, baseType: !1007, size: 1088)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !16, line: 2874, size: 1088, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !16, line: 2875, baseType: !971, size: 960)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1007, file: !16, line: 2876, baseType: !975, size: 64, offset: 960)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1007, file: !16, line: 2877, baseType: !1012, size: 64, offset: 1024)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !16, line: 2856, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !830, file: !16, line: 3386, baseType: !982, size: 1216)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !830, file: !16, line: 3387, baseType: !1016, size: 1280)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !16, line: 3093, size: 1280, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1016, file: !16, line: 3094, baseType: !982, size: 1216)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1016, file: !16, line: 3095, baseType: !1012, size: 64, offset: 1216)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !830, file: !16, line: 3388, baseType: !1021, size: 1216)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !16, line: 2824, size: 1216, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1021, file: !16, line: 2825, baseType: !933, size: 896)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1021, file: !16, line: 2827, baseType: !827, size: 64, offset: 896)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1021, file: !16, line: 2828, baseType: !827, size: 64, offset: 960)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1021, file: !16, line: 2829, baseType: !827, size: 64, offset: 1024)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1021, file: !16, line: 2830, baseType: !827, size: 64, offset: 1088)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1021, file: !16, line: 2831, baseType: !827, size: 64, offset: 1152)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !830, file: !16, line: 3389, baseType: !1030, size: 1024)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !16, line: 2850, size: 1024, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1030, file: !16, line: 2851, baseType: !971, size: 960)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1030, file: !16, line: 2852, baseType: !245, size: 32, offset: 960)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1030, file: !16, line: 2853, baseType: !245, size: 32, offset: 992)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !830, file: !16, line: 3390, baseType: !1036, size: 1024)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !16, line: 2857, size: 1024, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1036, file: !16, line: 2858, baseType: !971, size: 960)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1036, file: !16, line: 2859, baseType: !1012, size: 64, offset: 960)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !830, file: !16, line: 3391, baseType: !1041, size: 960)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !16, line: 2862, size: 960, elements: !1042)
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1041, file: !16, line: 2863, baseType: !971, size: 960)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !830, file: !16, line: 3392, baseType: !1045, size: 1472)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !16, line: 3304, size: 1472, elements: !1046)
!1046 = !{!1047}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1045, file: !16, line: 3305, baseType: !979, size: 1472)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !830, file: !16, line: 3393, baseType: !1049, size: 1792)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !16, line: 3248, size: 1792, elements: !1050)
!1050 = !{!1051, !1052, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1049, file: !16, line: 3249, baseType: !979, size: 1472)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1049, file: !16, line: 3251, baseType: !1053, size: 64, offset: 1472)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1055, line: 41, flags: DIFlagFwdDecl)
!1055 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1049, file: !16, line: 3254, baseType: !827, size: 64, offset: 1536)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1049, file: !16, line: 3257, baseType: !827, size: 64, offset: 1600)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1049, file: !16, line: 3258, baseType: !827, size: 64, offset: 1664)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1049, file: !16, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1049, file: !16, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1049, file: !16, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1049, file: !16, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1049, file: !16, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1049, file: !16, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1049, file: !16, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1049, file: !16, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1049, file: !16, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1049, file: !16, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1049, file: !16, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1049, file: !16, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1049, file: !16, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1049, file: !16, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1049, file: !16, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1049, file: !16, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1049, file: !16, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1049, file: !16, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !830, file: !16, line: 3394, baseType: !1078, size: 1344)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !16, line: 2279, size: 1344, elements: !1079)
!1079 = !{!1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1105, !1106, !1107, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1078, file: !16, line: 2280, baseType: !866, size: 192)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1078, file: !16, line: 2281, baseType: !827, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1078, file: !16, line: 2282, baseType: !827, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1078, file: !16, line: 2283, baseType: !827, size: 64, offset: 320)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1078, file: !16, line: 2284, baseType: !827, size: 64, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1078, file: !16, line: 2285, baseType: !5, size: 32, offset: 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1078, file: !16, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1078, file: !16, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1078, file: !16, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1078, file: !16, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1078, file: !16, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1078, file: !16, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1078, file: !16, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1078, file: !16, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1078, file: !16, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1078, file: !16, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1078, file: !16, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1078, file: !16, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1078, file: !16, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1078, file: !16, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1078, file: !16, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1078, file: !16, line: 2305, baseType: !5, size: 32, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1078, file: !16, line: 2306, baseType: !1103, size: 32, offset: 544)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1104, line: 31, baseType: !245)
!1104 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1078, file: !16, line: 2307, baseType: !827, size: 64, offset: 576)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1078, file: !16, line: 2308, baseType: !827, size: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1078, file: !16, line: 2314, baseType: !1108, size: 64, offset: 704)
!1108 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !16, line: 2309, size: 64, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1108, file: !16, line: 2310, baseType: !245, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1108, file: !16, line: 2311, baseType: !250, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1108, file: !16, line: 2312, baseType: !1113, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !16, line: 2277, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1078, file: !16, line: 2315, baseType: !827, size: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1078, file: !16, line: 2316, baseType: !827, size: 64, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1078, file: !16, line: 2317, baseType: !827, size: 64, offset: 896)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1078, file: !16, line: 2318, baseType: !827, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1078, file: !16, line: 2319, baseType: !827, size: 64, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1078, file: !16, line: 2320, baseType: !827, size: 64, offset: 1088)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1078, file: !16, line: 2321, baseType: !827, size: 64, offset: 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1078, file: !16, line: 2322, baseType: !827, size: 64, offset: 1216)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1078, file: !16, line: 2324, baseType: !1124, size: 64, offset: 1280)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !16, line: 2324, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !830, file: !16, line: 3395, baseType: !1127, size: 320)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !16, line: 1469, size: 320, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !16, line: 1470, baseType: !866, size: 192)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1127, file: !16, line: 1471, baseType: !827, size: 64, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1127, file: !16, line: 1472, baseType: !827, size: 64, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !830, file: !16, line: 3396, baseType: !1133, size: 320)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !16, line: 1482, size: 320, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !16, line: 1483, baseType: !866, size: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1133, file: !16, line: 1484, baseType: !245, size: 32, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1133, file: !16, line: 1485, baseType: !1138, size: 64, offset: 256)
!1138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !827, size: 64, elements: !340)
