; ModuleID = 'print-tree.bc'
source_filename = "print-tree.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bucket = type { %union.tree_node*, %struct.bucket* }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }

!355 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!356 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!357 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!358 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!359 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!360 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!361 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!362 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !135, line: 1817, baseType: !7, size: 32, elements: !364)
!364 = !{!365, !366, !367, !368, !369}
!365 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!366 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!367 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!368 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!369 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !135, line: 1805, baseType: !7, size: 32, elements: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!376 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code_class", file: !135, line: 58, baseType: !7, size: 32, elements: !378)
!378 = !{!379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389}
!379 = !DIEnumerator(name: "tcc_exceptional", value: 0, isUnsigned: true)
!380 = !DIEnumerator(name: "tcc_constant", value: 1, isUnsigned: true)
!381 = !DIEnumerator(name: "tcc_type", value: 2, isUnsigned: true)
!382 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!383 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!384 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!385 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!386 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!387 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!388 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!389 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tls_model", file: !391, line: 97, baseType: !7, size: 32, elements: !392)
!391 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!392 = !{!393, !394, !395, !396, !397, !398, !399}
!393 = !DIEnumerator(name: "TLS_MODEL_NONE", value: 0, isUnsigned: true)
!394 = !DIEnumerator(name: "TLS_MODEL_EMULATED", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "TLS_MODEL_REAL", value: 2, isUnsigned: true)
!396 = !DIEnumerator(name: "TLS_MODEL_GLOBAL_DYNAMIC", value: 2, isUnsigned: true)
!397 = !DIEnumerator(name: "TLS_MODEL_LOCAL_DYNAMIC", value: 3, isUnsigned: true)
!398 = !DIEnumerator(name: "TLS_MODEL_INITIAL_EXEC", value: 4, isUnsigned: true)
!399 = !DIEnumerator(name: "TLS_MODEL_LOCAL_EXEC", value: 5, isUnsigned: true)
!400 = !{!401, !402, !403, !404, !407, !408, !410, !134, !468, !411, !470, !415, !541}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!403 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bucket", file: !3, line: 42, size: 128, elements: !413)
!413 = !{!414, !1605}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "node", scope: !412, file: !3, line: 44, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !391, line: 56, baseType: !416)
!416 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !417, size: 64)
!417 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !418)
!418 = !{!419, !452, !458, !471, !490, !501, !506, !515, !521, !534, !546, !584, !592, !620, !637, !638, !643, !652, !658, !663, !667, !671, !1254, !1303, !1309, !1315, !1322, !1335, !1349, !1366, !1378, !1400, !1415, !1587}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !417, file: !135, line: 3372, baseType: !420, size: 64)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !420, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !420, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !420, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !420, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !420, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !420, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !420, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !420, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !420, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !420, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !420, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !420, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !420, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !420, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !420, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !420, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !420, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !420, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !420, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !420, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !420, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !420, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !420, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !420, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !420, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !420, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !420, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !420, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !420, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !420, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !417, file: !135, line: 3373, baseType: !453, size: 192)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !454)
!454 = !{!455, !456, !457}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !453, file: !135, line: 403, baseType: !420, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !453, file: !135, line: 404, baseType: !415, size: 64, offset: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !453, file: !135, line: 405, baseType: !415, size: 64, offset: 128)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !417, file: !135, line: 3374, baseType: !459, size: 320)
!459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !460)
!460 = !{!461, !462}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !459, file: !135, line: 1385, baseType: !453, size: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !459, file: !135, line: 1386, baseType: !463, size: 128, offset: 192)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !464, line: 58, baseType: !465)
!464 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !464, line: 54, size: 128, elements: !466)
!466 = !{!467, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !465, file: !464, line: 56, baseType: !468, size: 64)
!468 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !465, file: !464, line: 57, baseType: !470, size: 64, offset: 64)
!470 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !417, file: !135, line: 3375, baseType: !472, size: 256)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !472, file: !135, line: 1398, baseType: !453, size: 192)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !472, file: !135, line: 1399, baseType: !476, size: 64, offset: 192)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !478, line: 52, size: 256, elements: !479)
!478 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!479 = !{!480, !481, !482, !483, !484, !485, !486}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !477, file: !478, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !477, file: !478, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !477, file: !478, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !477, file: !478, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !477, file: !478, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !477, file: !478, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !477, file: !478, line: 62, baseType: !487, size: 192, offset: 64)
!487 = !DICompositeType(tag: DW_TAG_array_type, baseType: !468, size: 192, elements: !488)
!488 = !{!489}
!489 = !DISubrange(count: 3)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !417, file: !135, line: 3376, baseType: !491, size: 256)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !492)
!492 = !{!493, !494}
!493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !491, file: !135, line: 1409, baseType: !453, size: 192)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !491, file: !135, line: 1410, baseType: !495, size: 64, offset: 192)
!495 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !496, size: 64)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !497, line: 27, size: 192, elements: !498)
!497 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !496, file: !497, line: 29, baseType: !463, size: 128)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !496, file: !497, line: 30, baseType: !5, size: 32, offset: 128)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !417, file: !135, line: 3377, baseType: !502, size: 256)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !502, file: !135, line: 1438, baseType: !453, size: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !502, file: !135, line: 1439, baseType: !415, size: 64, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !417, file: !135, line: 3378, baseType: !507, size: 256)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !508)
!508 = !{!509, !510, !511}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !507, file: !135, line: 1419, baseType: !453, size: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !507, file: !135, line: 1420, baseType: !403, size: 32, offset: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !507, file: !135, line: 1421, baseType: !512, size: 8, offset: 224)
!512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 8, elements: !513)
!513 = !{!514}
!514 = !DISubrange(count: 1)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !417, file: !135, line: 3379, baseType: !516, size: 320)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !517)
!517 = !{!518, !519, !520}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !516, file: !135, line: 1429, baseType: !453, size: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !516, file: !135, line: 1430, baseType: !415, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !516, file: !135, line: 1431, baseType: !415, size: 64, offset: 256)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !417, file: !135, line: 3380, baseType: !522, size: 320)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !523)
!523 = !{!524, !525}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !522, file: !135, line: 1461, baseType: !453, size: 192)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !522, file: !135, line: 1462, baseType: !526, size: 128, offset: 192)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !527, line: 31, size: 128, elements: !528)
!527 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!528 = !{!529, !532, !533}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !526, file: !527, line: 32, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !526, file: !527, line: 33, baseType: !7, size: 32, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !526, file: !527, line: 34, baseType: !7, size: 32, offset: 96)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !417, file: !135, line: 3381, baseType: !535, size: 384)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !536)
!536 = !{!537, !538, !543, !544, !545}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !535, file: !135, line: 2508, baseType: !453, size: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !535, file: !135, line: 2509, baseType: !539, size: 32, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !540, line: 58, baseType: !541)
!540 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!541 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !542, line: 44, baseType: !7)
!542 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!543 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !535, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !535, file: !135, line: 2511, baseType: !415, size: 64, offset: 256)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !535, file: !135, line: 2512, baseType: !415, size: 64, offset: 320)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !417, file: !135, line: 3382, baseType: !547, size: 896)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !548)
!548 = !{!549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !547, file: !135, line: 2653, baseType: !535, size: 384)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !547, file: !135, line: 2654, baseType: !415, size: 64, offset: 384)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !547, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !547, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !547, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !547, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !547, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !547, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !547, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !547, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !547, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !547, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !547, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !547, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !547, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !547, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !547, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !547, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !547, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !547, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !547, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !547, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !547, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !547, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !547, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !547, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !547, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !547, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !547, file: !135, line: 2705, baseType: !415, size: 64, offset: 576)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !547, file: !135, line: 2706, baseType: !415, size: 64, offset: 640)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !547, file: !135, line: 2707, baseType: !415, size: 64, offset: 704)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !547, file: !135, line: 2708, baseType: !415, size: 64, offset: 768)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !547, file: !135, line: 2711, baseType: !582, size: 64, offset: 832)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !417, file: !135, line: 3383, baseType: !585, size: 960)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !585, file: !135, line: 2757, baseType: !547, size: 896)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !585, file: !135, line: 2758, baseType: !589, size: 64, offset: 896)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !391, line: 50, baseType: !590)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !391, line: 49, flags: DIFlagFwdDecl)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !417, file: !135, line: 3384, baseType: !593, size: 1472)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !594)
!594 = !{!595, !616, !617, !618, !619}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !593, file: !135, line: 3115, baseType: !596, size: 1216)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !597)
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !596, file: !135, line: 2985, baseType: !585, size: 960)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !596, file: !135, line: 2986, baseType: !415, size: 64, offset: 960)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !596, file: !135, line: 2987, baseType: !415, size: 64, offset: 1024)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !596, file: !135, line: 2988, baseType: !415, size: 64, offset: 1088)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !596, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !596, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !596, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !596, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !596, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !596, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !596, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !596, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !596, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !596, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !596, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !596, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !596, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !596, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !593, file: !135, line: 3117, baseType: !415, size: 64, offset: 1216)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !593, file: !135, line: 3119, baseType: !415, size: 64, offset: 1280)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !593, file: !135, line: 3121, baseType: !415, size: 64, offset: 1344)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !593, file: !135, line: 3123, baseType: !415, size: 64, offset: 1408)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !417, file: !135, line: 3385, baseType: !621, size: 1088)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !622)
!622 = !{!623, !624, !625}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !621, file: !135, line: 2875, baseType: !585, size: 960)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !621, file: !135, line: 2876, baseType: !589, size: 64, offset: 960)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !621, file: !135, line: 2877, baseType: !626, size: 64, offset: 1024)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !628, line: 172, size: 128, elements: !629)
!628 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!629 = !{!630, !631, !632, !633, !634, !635, !636}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !627, file: !628, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !627, file: !628, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !627, file: !628, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !627, file: !628, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !627, file: !628, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !627, file: !628, line: 195, baseType: !7, size: 32, offset: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !627, file: !628, line: 199, baseType: !415, size: 64, offset: 64)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !417, file: !135, line: 3386, baseType: !596, size: 1216)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !417, file: !135, line: 3387, baseType: !639, size: 1280)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !640)
!640 = !{!641, !642}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !639, file: !135, line: 3094, baseType: !596, size: 1216)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !639, file: !135, line: 3095, baseType: !626, size: 64, offset: 1216)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !417, file: !135, line: 3388, baseType: !644, size: 1216)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !644, file: !135, line: 2825, baseType: !547, size: 896)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !644, file: !135, line: 2827, baseType: !415, size: 64, offset: 896)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !644, file: !135, line: 2828, baseType: !415, size: 64, offset: 960)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !644, file: !135, line: 2829, baseType: !415, size: 64, offset: 1024)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !644, file: !135, line: 2830, baseType: !415, size: 64, offset: 1088)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !644, file: !135, line: 2831, baseType: !415, size: 64, offset: 1152)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !417, file: !135, line: 3389, baseType: !653, size: 1024)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !653, file: !135, line: 2851, baseType: !585, size: 960)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !653, file: !135, line: 2852, baseType: !403, size: 32, offset: 960)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !653, file: !135, line: 2853, baseType: !403, size: 32, offset: 992)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !417, file: !135, line: 3390, baseType: !659, size: 1024)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !659, file: !135, line: 2858, baseType: !585, size: 960)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !659, file: !135, line: 2859, baseType: !626, size: 64, offset: 960)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !417, file: !135, line: 3391, baseType: !664, size: 960)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !664, file: !135, line: 2863, baseType: !585, size: 960)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !417, file: !135, line: 3392, baseType: !668, size: 1472)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !669)
!669 = !{!670}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !668, file: !135, line: 3305, baseType: !593, size: 1472)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !417, file: !135, line: 3393, baseType: !672, size: 1792)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !673)
!673 = !{!674, !675, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !672, file: !135, line: 3249, baseType: !593, size: 1472)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !672, file: !135, line: 3251, baseType: !676, size: 64, offset: 1472)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !678, line: 463, size: 1152, elements: !679)
!678 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!679 = !{!680, !683, !1001, !1002, !1174, !1177, !1178, !1179, !1180, !1181, !1182, !1206, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !677, file: !678, line: 464, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !678, line: 464, flags: DIFlagFwdDecl)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !677, file: !678, line: 467, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !686)
!686 = !{!687, !976, !977, !990, !991, !992, !993, !994, !995, !997, !999, !1000}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !685, file: !330, line: 377, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !391, line: 111, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !691)
!691 = !{!692, !939, !940, !941, !944, !950, !951, !952, !970, !971, !972, !973, !974, !975}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !690, file: !330, line: 219, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !696)
!696 = !{!697}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !695, file: !330, line: 151, baseType: !698, size: 128)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !700)
!700 = !{!701, !702, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !699, file: !330, line: 150, baseType: !7, size: 32)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !699, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !699, file: !330, line: 150, baseType: !704, size: 64, offset: 64)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !705, size: 64, elements: !513)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !391, line: 108, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !708)
!708 = !{!709, !710, !711, !931, !932, !933, !934, !935, !936, !937}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !707, file: !330, line: 124, baseType: !689, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !707, file: !330, line: 125, baseType: !689, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !707, file: !330, line: 131, baseType: !712, size: 64, offset: 128)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !713)
!713 = !{!714, !930}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !712, file: !330, line: 129, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !391, line: 66, baseType: !716)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !718, line: 143, size: 192, elements: !719)
!718 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!719 = !{!720, !928, !929}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !717, file: !718, line: 145, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !391, line: 69, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !718, line: 136, size: 192, elements: !724)
!724 = !{!725, !926, !927}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !723, file: !718, line: 137, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !391, line: 58, baseType: !727)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !718, line: 737, size: 768, elements: !729)
!729 = !{!730, !747, !781, !787, !792, !797, !804, !810, !816, !821, !835, !840, !846, !851, !861, !866, !884, !891, !898, !904, !909, !915, !921}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !728, file: !718, line: 738, baseType: !731, size: 256)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !718, line: 271, size: 256, elements: !732)
!732 = !{!733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !731, file: !718, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !731, file: !718, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !731, file: !718, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !731, file: !718, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !731, file: !718, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !731, file: !718, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !731, file: !718, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !731, file: !718, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !731, file: !718, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !731, file: !718, line: 312, baseType: !7, size: 32, offset: 32)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !731, file: !718, line: 316, baseType: !539, size: 32, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !731, file: !718, line: 319, baseType: !7, size: 32, offset: 96)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !731, file: !718, line: 323, baseType: !689, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !731, file: !718, line: 327, baseType: !415, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !728, file: !718, line: 739, baseType: !748, size: 448)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !718, line: 350, size: 448, elements: !749)
!749 = !{!750, !779}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !748, file: !718, line: 353, baseType: !751, size: 384)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !718, line: 333, size: 384, elements: !752)
!752 = !{!753, !754, !762}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !751, file: !718, line: 336, baseType: !731, size: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !751, file: !718, line: 343, baseType: !755, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !757, line: 37, size: 128, elements: !758)
!757 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !756, file: !757, line: 39, baseType: !755, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !756, file: !757, line: 40, baseType: !761, size: 64, offset: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !751, file: !718, line: 344, baseType: !763, size: 64, offset: 320)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !757, line: 45, size: 320, elements: !765)
!765 = !{!766, !767}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !764, file: !757, line: 47, baseType: !763, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !764, file: !757, line: 48, baseType: !768, size: 256, offset: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !769)
!769 = !{!770, !772, !773, !778}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !768, file: !135, line: 1884, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !768, file: !135, line: 1885, baseType: !771, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !768, file: !135, line: 1891, baseType: !774, size: 64, offset: 128)
!774 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !768, file: !135, line: 1891, size: 64, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !774, file: !135, line: 1891, baseType: !726, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !774, file: !135, line: 1891, baseType: !415, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !768, file: !135, line: 1892, baseType: !761, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !748, file: !718, line: 359, baseType: !780, size: 64, offset: 384)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !415, size: 64, elements: !513)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !728, file: !718, line: 740, baseType: !782, size: 512)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !718, line: 365, size: 512, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !782, file: !718, line: 368, baseType: !751, size: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !782, file: !718, line: 373, baseType: !415, size: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !782, file: !718, line: 374, baseType: !415, size: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !728, file: !718, line: 741, baseType: !788, size: 576)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !718, line: 380, size: 576, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !788, file: !718, line: 383, baseType: !782, size: 512)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !788, file: !718, line: 389, baseType: !780, size: 64, offset: 512)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !728, file: !718, line: 742, baseType: !793, size: 320)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !718, line: 395, size: 320, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !793, file: !718, line: 397, baseType: !731, size: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !793, file: !718, line: 400, baseType: !715, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !728, file: !718, line: 743, baseType: !798, size: 448)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !718, line: 406, size: 448, elements: !799)
!799 = !{!800, !801, !802, !803}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !798, file: !718, line: 408, baseType: !731, size: 256)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !798, file: !718, line: 412, baseType: !415, size: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !798, file: !718, line: 420, baseType: !415, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !798, file: !718, line: 423, baseType: !715, size: 64, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !728, file: !718, line: 744, baseType: !805, size: 384)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !718, line: 429, size: 384, elements: !806)
!806 = !{!807, !808, !809}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !805, file: !718, line: 431, baseType: !731, size: 256)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !805, file: !718, line: 434, baseType: !415, size: 64, offset: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !805, file: !718, line: 437, baseType: !715, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !728, file: !718, line: 745, baseType: !811, size: 384)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !718, line: 443, size: 384, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !811, file: !718, line: 445, baseType: !731, size: 256)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !811, file: !718, line: 449, baseType: !415, size: 64, offset: 256)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !811, file: !718, line: 453, baseType: !715, size: 64, offset: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !728, file: !718, line: 746, baseType: !817, size: 320)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !718, line: 459, size: 320, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !817, file: !718, line: 461, baseType: !731, size: 256)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !817, file: !718, line: 464, baseType: !415, size: 64, offset: 256)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !728, file: !718, line: 747, baseType: !822, size: 768)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !718, line: 469, size: 768, elements: !823)
!823 = !{!824, !825, !826, !827, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !822, file: !718, line: 471, baseType: !731, size: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !822, file: !718, line: 474, baseType: !7, size: 32, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !822, file: !718, line: 475, baseType: !7, size: 32, offset: 288)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !822, file: !718, line: 478, baseType: !415, size: 64, offset: 320)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !822, file: !718, line: 481, baseType: !829, size: 384, offset: 384)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 384, elements: !513)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !831)
!831 = !{!832, !833, !834}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !830, file: !135, line: 1920, baseType: !768, size: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !830, file: !135, line: 1921, baseType: !415, size: 64, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !830, file: !135, line: 1922, baseType: !539, size: 32, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !728, file: !718, line: 748, baseType: !836, size: 320)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !718, line: 487, size: 320, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !836, file: !718, line: 490, baseType: !731, size: 256)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !836, file: !718, line: 494, baseType: !403, size: 32, offset: 256)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !728, file: !718, line: 749, baseType: !841, size: 384)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !718, line: 500, size: 384, elements: !842)
!842 = !{!843, !844, !845}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !841, file: !718, line: 502, baseType: !731, size: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !841, file: !718, line: 506, baseType: !715, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !841, file: !718, line: 510, baseType: !715, size: 64, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !728, file: !718, line: 750, baseType: !847, size: 320)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !718, line: 529, size: 320, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !847, file: !718, line: 531, baseType: !731, size: 256)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !847, file: !718, line: 540, baseType: !715, size: 64, offset: 256)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !728, file: !718, line: 751, baseType: !852, size: 704)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !718, line: 546, size: 704, elements: !853)
!853 = !{!854, !855, !856, !857, !858, !859, !860}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !852, file: !718, line: 549, baseType: !782, size: 512)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !852, file: !718, line: 553, baseType: !408, size: 64, offset: 512)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !852, file: !718, line: 557, baseType: !402, size: 8, offset: 576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !852, file: !718, line: 558, baseType: !402, size: 8, offset: 584)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !852, file: !718, line: 559, baseType: !402, size: 8, offset: 592)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !852, file: !718, line: 560, baseType: !402, size: 8, offset: 600)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !852, file: !718, line: 566, baseType: !780, size: 64, offset: 640)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !728, file: !718, line: 752, baseType: !862, size: 384)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !718, line: 571, size: 384, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !862, file: !718, line: 573, baseType: !793, size: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !862, file: !718, line: 577, baseType: !415, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !728, file: !718, line: 753, baseType: !867, size: 576)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !718, line: 600, size: 576, elements: !868)
!868 = !{!869, !870, !871, !874, !883}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !867, file: !718, line: 602, baseType: !793, size: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !867, file: !718, line: 605, baseType: !415, size: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !867, file: !718, line: 609, baseType: !872, size: 64, offset: 384)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !873, line: 46, baseType: !468)
!873 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!874 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !867, file: !718, line: 612, baseType: !875, size: 64, offset: 448)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !718, line: 581, size: 320, elements: !877)
!877 = !{!878, !879, !880, !881, !882}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !876, file: !718, line: 583, baseType: !134, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !876, file: !718, line: 586, baseType: !415, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !876, file: !718, line: 589, baseType: !415, size: 64, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !876, file: !718, line: 592, baseType: !415, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !876, file: !718, line: 595, baseType: !415, size: 64, offset: 256)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !867, file: !718, line: 616, baseType: !715, size: 64, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !728, file: !718, line: 754, baseType: !885, size: 512)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !718, line: 622, size: 512, elements: !886)
!886 = !{!887, !888, !889, !890}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !885, file: !718, line: 624, baseType: !793, size: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !885, file: !718, line: 628, baseType: !415, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !885, file: !718, line: 632, baseType: !415, size: 64, offset: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !885, file: !718, line: 636, baseType: !415, size: 64, offset: 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !728, file: !718, line: 755, baseType: !892, size: 704)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !718, line: 642, size: 704, elements: !893)
!893 = !{!894, !895, !896, !897}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !892, file: !718, line: 644, baseType: !885, size: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !892, file: !718, line: 648, baseType: !415, size: 64, offset: 512)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !892, file: !718, line: 652, baseType: !415, size: 64, offset: 576)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !892, file: !718, line: 653, baseType: !415, size: 64, offset: 640)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !728, file: !718, line: 756, baseType: !899, size: 448)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !718, line: 663, size: 448, elements: !900)
!900 = !{!901, !902, !903}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !899, file: !718, line: 665, baseType: !793, size: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !899, file: !718, line: 668, baseType: !415, size: 64, offset: 320)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !899, file: !718, line: 673, baseType: !415, size: 64, offset: 384)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !728, file: !718, line: 757, baseType: !905, size: 384)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !718, line: 694, size: 384, elements: !906)
!906 = !{!907, !908}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !905, file: !718, line: 696, baseType: !793, size: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !905, file: !718, line: 699, baseType: !415, size: 64, offset: 320)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !728, file: !718, line: 758, baseType: !910, size: 384)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !718, line: 681, size: 384, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !910, file: !718, line: 683, baseType: !731, size: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !910, file: !718, line: 686, baseType: !415, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !910, file: !718, line: 689, baseType: !415, size: 64, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !728, file: !718, line: 759, baseType: !916, size: 384)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !718, line: 707, size: 384, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !916, file: !718, line: 709, baseType: !731, size: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !916, file: !718, line: 712, baseType: !415, size: 64, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !916, file: !718, line: 712, baseType: !415, size: 64, offset: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !728, file: !718, line: 760, baseType: !922, size: 320)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !718, line: 718, size: 320, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !922, file: !718, line: 720, baseType: !731, size: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !922, file: !718, line: 723, baseType: !415, size: 64, offset: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !723, file: !718, line: 138, baseType: !722, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !723, file: !718, line: 139, baseType: !722, size: 64, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !717, file: !718, line: 146, baseType: !721, size: 64, offset: 64)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !717, file: !718, line: 152, baseType: !715, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !712, file: !330, line: 130, baseType: !589, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !707, file: !330, line: 134, baseType: !407, size: 64, offset: 192)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !707, file: !330, line: 137, baseType: !415, size: 64, offset: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !707, file: !330, line: 138, baseType: !539, size: 32, offset: 320)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !707, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !707, file: !330, line: 144, baseType: !403, size: 32, offset: 384)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !707, file: !330, line: 145, baseType: !403, size: 32, offset: 416)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !707, file: !330, line: 146, baseType: !938, size: 64, offset: 448)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !470)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !690, file: !330, line: 220, baseType: !693, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !690, file: !330, line: 223, baseType: !407, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !690, file: !330, line: 226, baseType: !942, size: 64, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !690, file: !330, line: 229, baseType: !945, size: 128, offset: 256)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 128, elements: !948)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!948 = !{!949}
!949 = !DISubrange(count: 2)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !690, file: !330, line: 232, baseType: !689, size: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !690, file: !330, line: 233, baseType: !689, size: 64, offset: 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !690, file: !330, line: 238, baseType: !953, size: 64, offset: 512)
!953 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !954)
!954 = !{!955, !961}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !953, file: !330, line: 236, baseType: !956, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !957, file: !330, line: 275, baseType: !715, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !957, file: !330, line: 278, baseType: !715, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !953, file: !330, line: 237, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !964)
!964 = !{!965, !966, !967, !968, !969}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !963, file: !330, line: 261, baseType: !589, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !963, file: !330, line: 262, baseType: !589, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !963, file: !330, line: 266, baseType: !589, size: 64, offset: 128)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !963, file: !330, line: 267, baseType: !589, size: 64, offset: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !963, file: !330, line: 270, baseType: !403, size: 32, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !690, file: !330, line: 241, baseType: !938, size: 64, offset: 576)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !690, file: !330, line: 244, baseType: !403, size: 32, offset: 640)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !690, file: !330, line: 247, baseType: !403, size: 32, offset: 672)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !690, file: !330, line: 250, baseType: !403, size: 32, offset: 704)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !690, file: !330, line: 253, baseType: !403, size: 32, offset: 736)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !690, file: !330, line: 256, baseType: !403, size: 32, offset: 768)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !685, file: !330, line: 378, baseType: !688, size: 64, offset: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !685, file: !330, line: 381, baseType: !978, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !980)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !981)
!981 = !{!982}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !980, file: !330, line: 282, baseType: !983, size: 128)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !985)
!985 = !{!986, !987, !988}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !984, file: !330, line: 281, baseType: !7, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !984, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !984, file: !330, line: 281, baseType: !989, size: 64, offset: 64)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !688, size: 64, elements: !513)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !685, file: !330, line: 384, baseType: !403, size: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !685, file: !330, line: 387, baseType: !403, size: 32, offset: 224)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !685, file: !330, line: 390, baseType: !403, size: 32, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !685, file: !330, line: 394, baseType: !978, size: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !685, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !685, file: !330, line: 399, baseType: !996, size: 64, offset: 416)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !948)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !685, file: !330, line: 402, baseType: !998, size: 64, offset: 480)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !948)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !685, file: !330, line: 406, baseType: !403, size: 32, offset: 544)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !685, file: !330, line: 409, baseType: !403, size: 32, offset: 576)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !677, file: !678, line: 470, baseType: !716, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !677, file: !678, line: 473, baseType: !1003, size: 64, offset: 192)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !628, line: 39, size: 1152, elements: !1005)
!1005 = !{!1006, !1056, !1069, !1081, !1082, !1151, !1152, !1156, !1157, !1158, !1159, !1160}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1004, file: !628, line: 41, baseType: !1007, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1008, line: 144, baseType: !1009)
!1008 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1008, line: 100, size: 896, elements: !1011)
!1011 = !{!1012, !1020, !1025, !1030, !1032, !1033, !1034, !1035, !1036, !1037, !1042, !1044, !1045, !1050, !1055}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1010, file: !1008, line: 102, baseType: !1013, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1008, line: 52, baseType: !1014)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1008, line: 47, baseType: !7)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1010, file: !1008, line: 105, baseType: !1021, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1008, line: 59, baseType: !1022)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DISubroutineType(types: !1024)
!1024 = !{!403, !1018, !1018}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1010, file: !1008, line: 108, baseType: !1026, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1008, line: 63, baseType: !1027)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{null, !407}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1010, file: !1008, line: 111, baseType: !1031, size: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1010, file: !1008, line: 114, baseType: !872, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1010, file: !1008, line: 117, baseType: !872, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1010, file: !1008, line: 120, baseType: !872, size: 64, offset: 384)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1010, file: !1008, line: 124, baseType: !7, size: 32, offset: 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1010, file: !1008, line: 128, baseType: !7, size: 32, offset: 480)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1010, file: !1008, line: 131, baseType: !1038, size: 64, offset: 512)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1008, line: 75, baseType: !1039)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DISubroutineType(types: !1041)
!1041 = !{!407, !872, !872}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1010, file: !1008, line: 132, baseType: !1043, size: 64, offset: 576)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1008, line: 78, baseType: !1027)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1010, file: !1008, line: 135, baseType: !407, size: 64, offset: 640)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1010, file: !1008, line: 136, baseType: !1046, size: 64, offset: 704)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1008, line: 82, baseType: !1047)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DISubroutineType(types: !1049)
!1049 = !{!407, !407, !872, !872}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1010, file: !1008, line: 137, baseType: !1051, size: 64, offset: 768)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1008, line: 83, baseType: !1052)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{null, !407, !407}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1010, file: !1008, line: 141, baseType: !7, size: 32, offset: 832)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1004, file: !628, line: 48, baseType: !1057, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !718, line: 35, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !718, line: 35, size: 128, elements: !1060)
!1060 = !{!1061}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1059, file: !718, line: 35, baseType: !1062, size: 128)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !718, line: 33, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !718, line: 33, size: 128, elements: !1064)
!1064 = !{!1065, !1066, !1067}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1063, file: !718, line: 33, baseType: !7, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1063, file: !718, line: 33, baseType: !7, size: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1063, file: !718, line: 33, baseType: !1068, size: 64, offset: 64)
!1068 = !DICompositeType(tag: DW_TAG_array_type, baseType: !726, size: 64, elements: !513)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1004, file: !628, line: 51, baseType: !1070, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1072)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1073)
!1073 = !{!1074}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1072, file: !135, line: 183, baseType: !1075, size: 128)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1076)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1076, file: !135, line: 182, baseType: !7, size: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1076, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1076, file: !135, line: 182, baseType: !780, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1004, file: !628, line: 54, baseType: !415, size: 64, offset: 192)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1004, file: !628, line: 57, baseType: !1083, size: 128, offset: 256)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1084, line: 31, size: 128, elements: !1085)
!1084 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1083, file: !1084, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1083, file: !1084, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1083, file: !1084, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1083, file: !1084, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1083, file: !1084, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1083, file: !1084, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1083, file: !1084, line: 56, baseType: !1093, size: 64, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !391, line: 47, baseType: !1094)
!1094 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1095, size: 64)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1096, line: 75, size: 256, elements: !1097)
!1096 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1097 = !{!1098, !1110, !1111, !1112}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1095, file: !1096, line: 76, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1096, line: 68, baseType: !1101)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1096, line: 63, size: 320, elements: !1102)
!1102 = !{!1103, !1105, !1106, !1107}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1101, file: !1096, line: 64, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1101, file: !1096, line: 65, baseType: !1104, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1101, file: !1096, line: 66, baseType: !7, size: 32, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1101, file: !1096, line: 67, baseType: !1108, size: 128, offset: 192)
!1108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1109, size: 128, elements: !948)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1096, line: 29, baseType: !468)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1095, file: !1096, line: 77, baseType: !1099, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1095, file: !1096, line: 78, baseType: !7, size: 32, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1095, file: !1096, line: 79, baseType: !1113, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1096, line: 49, baseType: !1115)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1096, line: 45, size: 832, elements: !1116)
!1116 = !{!1117, !1118, !1119}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1115, file: !1096, line: 46, baseType: !1104, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1115, file: !1096, line: 47, baseType: !1094, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1115, file: !1096, line: 48, baseType: !1120, size: 704, offset: 128)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1121, line: 164, size: 704, elements: !1122)
!1121 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1122 = !{!1123, !1124, !1134, !1135, !1136, !1137, !1138, !1139, !1143, !1147, !1148, !1149, !1150}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1120, file: !1121, line: 166, baseType: !470, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1120, file: !1121, line: 167, baseType: !1125, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1121, line: 157, size: 192, elements: !1127)
!1127 = !{!1128, !1129, !1130}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1126, file: !1121, line: 159, baseType: !405, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1126, file: !1121, line: 160, baseType: !1125, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1126, file: !1121, line: 161, baseType: !1131, size: 32, offset: 128)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 32, elements: !1132)
!1132 = !{!1133}
!1133 = !DISubrange(count: 4)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1120, file: !1121, line: 168, baseType: !405, size: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1120, file: !1121, line: 169, baseType: !405, size: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1120, file: !1121, line: 170, baseType: !405, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1120, file: !1121, line: 171, baseType: !470, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1120, file: !1121, line: 172, baseType: !403, size: 32, offset: 384)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1120, file: !1121, line: 176, baseType: !1140, size: 64, offset: 448)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{!1125, !407, !470}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1120, file: !1121, line: 177, baseType: !1144, size: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DISubroutineType(types: !1146)
!1146 = !{null, !407, !1125}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1120, file: !1121, line: 178, baseType: !407, size: 64, offset: 576)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1120, file: !1121, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1120, file: !1121, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1120, file: !1121, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1004, file: !628, line: 60, baseType: !1083, size: 128, offset: 384)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1004, file: !628, line: 64, baseType: !1153, size: 64, offset: 512)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1155, line: 33, flags: DIFlagFwdDecl)
!1155 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1004, file: !628, line: 67, baseType: !415, size: 64, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1004, file: !628, line: 73, baseType: !1007, size: 64, offset: 640)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1004, file: !628, line: 77, baseType: !1093, size: 64, offset: 704)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1004, file: !628, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1004, file: !628, line: 82, baseType: !1161, size: 320, offset: 832)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !757, line: 62, size: 320, elements: !1162)
!1162 = !{!1163, !1169, !1170, !1171, !1172, !1173}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1161, file: !757, line: 63, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !757, line: 56, size: 128, elements: !1166)
!1166 = !{!1167, !1168}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1165, file: !757, line: 57, baseType: !1164, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1165, file: !757, line: 58, baseType: !512, size: 8, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1161, file: !757, line: 64, baseType: !7, size: 32, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1161, file: !757, line: 66, baseType: !7, size: 32, offset: 96)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1161, file: !757, line: 68, baseType: !402, size: 8, offset: 128)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1161, file: !757, line: 70, baseType: !755, size: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1161, file: !757, line: 71, baseType: !763, size: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !677, file: !678, line: 476, baseType: !1175, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !678, line: 476, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !677, file: !678, line: 479, baseType: !1007, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !677, file: !678, line: 484, baseType: !415, size: 64, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !677, file: !678, line: 488, baseType: !415, size: 64, offset: 448)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !677, file: !678, line: 493, baseType: !415, size: 64, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !677, file: !678, line: 496, baseType: !415, size: 64, offset: 576)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !677, file: !678, line: 501, baseType: !1183, size: 64, offset: 640)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !341, line: 2355, size: 576, elements: !1185)
!1185 = !{!1186, !1189, !1190, !1191, !1192, !1194, !1195, !1200, !1201, !1202, !1203, !1204, !1205}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1184, file: !341, line: 2356, baseType: !1187, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !341, line: 2356, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1184, file: !341, line: 2357, baseType: !408, size: 64, offset: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1184, file: !341, line: 2358, baseType: !403, size: 32, offset: 128)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1184, file: !341, line: 2359, baseType: !403, size: 32, offset: 160)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1184, file: !341, line: 2360, baseType: !1193, size: 128, offset: 192)
!1193 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 128, elements: !1132)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1184, file: !341, line: 2364, baseType: !403, size: 32, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1184, file: !341, line: 2367, baseType: !1196, size: 128, offset: 384)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !341, line: 2349, size: 128, elements: !1197)
!1197 = !{!1198, !1199}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1196, file: !341, line: 2351, baseType: !589, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1196, file: !341, line: 2352, baseType: !470, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1184, file: !341, line: 2371, baseType: !340, size: 32, offset: 512)
