; ModuleID = 'profile.bc'
source_filename = "profile.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!343 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!344 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!345 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!346 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!347 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!348 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!349 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!350 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!351 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!352 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!353 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!354 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!355 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!356 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!357 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!358 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!359 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!360 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!361 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!362 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!363 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!364 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!365 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!366 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!367 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!370 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!371 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!372 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!373 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!374 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!375 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!376 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!377 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!378 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!379 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!380 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!381 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!382 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!383 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!384 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!385 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!386 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!387 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!388 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!389 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!390 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "hist_type", file: !391, line: 24, baseType: !7, size: 32, elements: !392)
!391 = !DIFile(filename: "./value-prof.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!392 = !{!393, !394, !395, !396, !397, !398, !399}
!393 = !DIEnumerator(name: "HIST_TYPE_INTERVAL", value: 0, isUnsigned: true)
!394 = !DIEnumerator(name: "HIST_TYPE_POW2", value: 1, isUnsigned: true)
!395 = !DIEnumerator(name: "HIST_TYPE_SINGLE_VALUE", value: 2, isUnsigned: true)
!396 = !DIEnumerator(name: "HIST_TYPE_CONST_DELTA", value: 3, isUnsigned: true)
!397 = !DIEnumerator(name: "HIST_TYPE_INDIR_CALL", value: 4, isUnsigned: true)
!398 = !DIEnumerator(name: "HIST_TYPE_AVERAGE", value: 5, isUnsigned: true)
!399 = !DIEnumerator(name: "HIST_TYPE_IOR", value: 6, isUnsigned: true)
!400 = !{!401, !402, !403, !404, !407, !408, !410, !412, !419, !7, !421, !427, !429, !430}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!403 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!406 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !406)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !411, line: 44, baseType: !7)
!411 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_info", file: !414, line: 27, size: 32, elements: !415)
!414 = !DIFile(filename: "./profile.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!415 = !{!416, !417, !418}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "count_valid", scope: !413, file: !414, line: 29, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "on_tree", scope: !413, file: !414, line: 32, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "ignore", scope: !413, file: !414, line: 36, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_unsigned_t", file: !420, line: 205, baseType: !7)
!420 = !DIFile(filename: "./gcov-io.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bb_info", file: !3, line: 77, size: 192, elements: !423)
!423 = !{!424, !425, !428}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "count_valid", scope: !422, file: !3, line: 78, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "succ_count", scope: !422, file: !3, line: 81, baseType: !426, size: 64, offset: 64)
!426 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !427)
!427 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "pred_count", scope: !422, file: !3, line: 82, baseType: !426, size: 64, offset: 128)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !431, line: 111, baseType: !432)
!431 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !434)
!434 = !{!435, !1779, !1780, !1781, !1782, !1786, !1787, !1788, !1806, !1807, !1808, !1809, !1810, !1811}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !433, file: !135, line: 219, baseType: !436, size: 64)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !439)
!439 = !{!440}
!440 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !438, file: !135, line: 151, baseType: !441, size: 128)
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !442)
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !443)
!443 = !{!444, !445, !446}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !442, file: !135, line: 150, baseType: !7, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !442, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !442, file: !135, line: 150, baseType: !447, size: 64, offset: 64)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !448, size: 64, elements: !589)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !431, line: 108, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !451)
!451 = !{!452, !453, !454, !1772, !1773, !1774, !1775, !1776, !1777, !1778}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !450, file: !135, line: 124, baseType: !432, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !450, file: !135, line: 125, baseType: !432, size: 64, offset: 64)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !450, file: !135, line: 131, baseType: !455, size: 64, offset: 128)
!455 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !456)
!456 = !{!457, !1771}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !455, file: !135, line: 129, baseType: !458, size: 64)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !431, line: 66, baseType: !459)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !461, line: 143, size: 192, elements: !462)
!461 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!462 = !{!463, !1769, !1770}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !460, file: !461, line: 145, baseType: !464, size: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !431, line: 69, baseType: !465)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !461, line: 136, size: 192, elements: !467)
!467 = !{!468, !1767, !1768}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !466, file: !461, line: 137, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !431, line: 58, baseType: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !461, line: 737, size: 768, elements: !472)
!472 = !{!473, !1614, !1624, !1630, !1635, !1640, !1647, !1653, !1659, !1664, !1678, !1683, !1689, !1694, !1704, !1709, !1725, !1732, !1739, !1745, !1750, !1756, !1762}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !471, file: !461, line: 738, baseType: !474, size: 256)
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !461, line: 271, size: 256, elements: !475)
!475 = !{!476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !489, !490, !491}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !474, file: !461, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !474, file: !461, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !474, file: !461, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !474, file: !461, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !474, file: !461, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !474, file: !461, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !474, file: !461, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !474, file: !461, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !474, file: !461, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !474, file: !461, line: 312, baseType: !7, size: 32, offset: 32)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !474, file: !461, line: 316, baseType: !487, size: 32, offset: 64)
!487 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !488, line: 58, baseType: !410)
!488 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!489 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !474, file: !461, line: 319, baseType: !7, size: 32, offset: 96)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !474, file: !461, line: 323, baseType: !432, size: 64, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !474, file: !461, line: 327, baseType: !492, size: 64, offset: 192)
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !431, line: 56, baseType: !493)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !494, size: 64)
!494 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !495)
!495 = !{!496, !529, !535, !547, !566, !577, !582, !591, !597, !610, !618, !656, !864, !892, !909, !910, !915, !924, !930, !935, !939, !943, !1265, !1312, !1318, !1324, !1331, !1344, !1358, !1375, !1387, !1409, !1424, !1596}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !494, file: !164, line: 3372, baseType: !497, size: 64)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !498)
!498 = !{!499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !497, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !497, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !497, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !497, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !497, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !497, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !497, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !497, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !497, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !497, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !497, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !497, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !497, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !497, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !497, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !497, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !497, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !497, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !497, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !497, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !497, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !497, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !497, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !497, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !497, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !497, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !497, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !497, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !497, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !497, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !494, file: !164, line: 3373, baseType: !530, size: 192)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !531)
!531 = !{!532, !533, !534}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !530, file: !164, line: 403, baseType: !497, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !530, file: !164, line: 404, baseType: !492, size: 64, offset: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !530, file: !164, line: 405, baseType: !492, size: 64, offset: 128)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !494, file: !164, line: 3374, baseType: !536, size: 320)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !536, file: !164, line: 1385, baseType: !530, size: 192)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !536, file: !164, line: 1386, baseType: !540, size: 128, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !541, line: 58, baseType: !542)
!541 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !541, line: 54, size: 128, elements: !543)
!543 = !{!544, !546}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !542, file: !541, line: 56, baseType: !545, size: 64)
!545 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !542, file: !541, line: 57, baseType: !427, size: 64, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !494, file: !164, line: 3375, baseType: !548, size: 256)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !549)
!549 = !{!550, !551}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !548, file: !164, line: 1398, baseType: !530, size: 192)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !548, file: !164, line: 1399, baseType: !552, size: 64, offset: 192)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !554, line: 52, size: 256, elements: !555)
!554 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!555 = !{!556, !557, !558, !559, !560, !561, !562}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !553, file: !554, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !553, file: !554, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !553, file: !554, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !553, file: !554, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !553, file: !554, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !553, file: !554, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !553, file: !554, line: 62, baseType: !563, size: 192, offset: 64)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !545, size: 192, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 3)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !494, file: !164, line: 3376, baseType: !567, size: 256)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !568)
!568 = !{!569, !570}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !567, file: !164, line: 1409, baseType: !530, size: 192)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !567, file: !164, line: 1410, baseType: !571, size: 64, offset: 192)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !573, line: 27, size: 192, elements: !574)
!573 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !572, file: !573, line: 29, baseType: !540, size: 128)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !572, file: !573, line: 30, baseType: !5, size: 32, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !494, file: !164, line: 3377, baseType: !578, size: 256)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !579)
!579 = !{!580, !581}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !164, line: 1438, baseType: !530, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !578, file: !164, line: 1439, baseType: !492, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !494, file: !164, line: 3378, baseType: !583, size: 256)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !584)
!584 = !{!585, !586, !587}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !164, line: 1419, baseType: !530, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !583, file: !164, line: 1420, baseType: !403, size: 32, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !583, file: !164, line: 1421, baseType: !588, size: 8, offset: 224)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 8, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 1)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !494, file: !164, line: 3379, baseType: !592, size: 320)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !592, file: !164, line: 1429, baseType: !530, size: 192)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !592, file: !164, line: 1430, baseType: !492, size: 64, offset: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !592, file: !164, line: 1431, baseType: !492, size: 64, offset: 256)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !494, file: !164, line: 3380, baseType: !598, size: 320)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !598, file: !164, line: 1461, baseType: !530, size: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !598, file: !164, line: 1462, baseType: !602, size: 128, offset: 192)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !603, line: 31, size: 128, elements: !604)
!603 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !{!605, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !602, file: !603, line: 32, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !602, file: !603, line: 33, baseType: !7, size: 32, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !602, file: !603, line: 34, baseType: !7, size: 32, offset: 96)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !494, file: !164, line: 3381, baseType: !611, size: 384)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !612)
!612 = !{!613, !614, !615, !616, !617}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !164, line: 2508, baseType: !530, size: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !611, file: !164, line: 2509, baseType: !487, size: 32, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !611, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !611, file: !164, line: 2511, baseType: !492, size: 64, offset: 256)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !611, file: !164, line: 2512, baseType: !492, size: 64, offset: 320)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !494, file: !164, line: 3382, baseType: !619, size: 896)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !619, file: !164, line: 2653, baseType: !611, size: 384)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !619, file: !164, line: 2654, baseType: !492, size: 64, offset: 384)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !619, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !619, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !619, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !619, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !619, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !619, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !619, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !619, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !619, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !619, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !619, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !619, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !619, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !619, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !619, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !619, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !619, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !619, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !619, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !619, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !619, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !619, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !619, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !619, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !619, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !619, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !619, file: !164, line: 2705, baseType: !492, size: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !619, file: !164, line: 2706, baseType: !492, size: 64, offset: 640)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !619, file: !164, line: 2707, baseType: !492, size: 64, offset: 704)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !619, file: !164, line: 2708, baseType: !492, size: 64, offset: 768)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !619, file: !164, line: 2711, baseType: !654, size: 64, offset: 832)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !494, file: !164, line: 3383, baseType: !657, size: 960)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !658)
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !657, file: !164, line: 2757, baseType: !619, size: 896)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !657, file: !164, line: 2758, baseType: !661, size: 64, offset: 896)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !431, line: 50, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !664, line: 240, size: 384, elements: !665)
!664 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!665 = !{!666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !663, file: !664, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !663, file: !664, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !663, file: !664, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !663, file: !664, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !663, file: !664, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !663, file: !664, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !663, file: !664, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !663, file: !664, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !663, file: !664, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !663, file: !664, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !663, file: !664, line: 321, baseType: !677, size: 320, offset: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !664, line: 315, size: 320, elements: !678)
!678 = !{!679, !797, !799, !862, !863}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !677, file: !664, line: 316, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 64, elements: !589)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !664, line: 183, baseType: !682)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !664, line: 166, size: 64, elements: !683)
!683 = !{!684, !685, !686, !687, !688, !696, !697, !709, !712, !772, !773, !774, !787, !794}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !682, file: !664, line: 168, baseType: !403, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !682, file: !664, line: 169, baseType: !7, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !682, file: !664, line: 170, baseType: !408, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !682, file: !664, line: 171, baseType: !661, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !682, file: !664, line: 172, baseType: !689, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !431, line: 53, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !664, line: 359, size: 128, elements: !692)
!692 = !{!693, !694}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !691, file: !664, line: 360, baseType: !403, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !691, file: !664, line: 361, baseType: !695, size: 64, offset: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 64, elements: !589)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !682, file: !664, line: 173, baseType: !5, size: 32)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !682, file: !664, line: 174, baseType: !698, size: 32)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !664, line: 133, baseType: !699)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !664, line: 115, size: 32, elements: !700)
!700 = !{!701, !702, !703, !704, !705, !706, !707, !708}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !699, file: !664, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !699, file: !664, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !699, file: !664, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !699, file: !664, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !699, file: !664, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !699, file: !664, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !699, file: !664, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !699, file: !664, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !682, file: !664, line: 175, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !664, line: 175, flags: DIFlagFwdDecl)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !682, file: !664, line: 176, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !715, line: 75, size: 256, elements: !716)
!715 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!716 = !{!717, !731, !732, !733}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !714, file: !715, line: 76, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !715, line: 68, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !715, line: 63, size: 320, elements: !721)
!721 = !{!722, !724, !725, !726}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !720, file: !715, line: 64, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !720, file: !715, line: 65, baseType: !723, size: 64, offset: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !720, file: !715, line: 66, baseType: !7, size: 32, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !720, file: !715, line: 67, baseType: !727, size: 128, offset: 192)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !728, size: 128, elements: !729)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !715, line: 29, baseType: !545)
!729 = !{!730}
!730 = !DISubrange(count: 2)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !714, file: !715, line: 77, baseType: !718, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !714, file: !715, line: 78, baseType: !7, size: 32, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !714, file: !715, line: 79, baseType: !734, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !715, line: 49, baseType: !736)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !715, line: 45, size: 832, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !736, file: !715, line: 46, baseType: !723, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !736, file: !715, line: 47, baseType: !713, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !736, file: !715, line: 48, baseType: !741, size: 704, offset: 128)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !742, line: 164, size: 704, elements: !743)
!742 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!743 = !{!744, !745, !755, !756, !757, !758, !759, !760, !764, !768, !769, !770, !771}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !741, file: !742, line: 166, baseType: !427, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !741, file: !742, line: 167, baseType: !746, size: 64, offset: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !742, line: 157, size: 192, elements: !748)
!748 = !{!749, !750, !751}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !747, file: !742, line: 159, baseType: !405, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !747, file: !742, line: 160, baseType: !746, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !747, file: !742, line: 161, baseType: !752, size: 32, offset: 128)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 32, elements: !753)
!753 = !{!754}
!754 = !DISubrange(count: 4)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !741, file: !742, line: 168, baseType: !405, size: 64, offset: 128)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !741, file: !742, line: 169, baseType: !405, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !741, file: !742, line: 170, baseType: !405, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !741, file: !742, line: 171, baseType: !427, size: 64, offset: 320)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !741, file: !742, line: 172, baseType: !403, size: 32, offset: 384)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !741, file: !742, line: 176, baseType: !761, size: 64, offset: 448)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{!746, !407, !427}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !741, file: !742, line: 177, baseType: !765, size: 64, offset: 512)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DISubroutineType(types: !767)
!767 = !{null, !407, !746}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !741, file: !742, line: 178, baseType: !407, size: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !741, file: !742, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !741, file: !742, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !741, file: !742, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !682, file: !664, line: 177, baseType: !492, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !682, file: !664, line: 178, baseType: !432, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !682, file: !664, line: 179, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !664, line: 150, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !664, line: 142, size: 320, elements: !778)
!778 = !{!779, !780, !781, !782, !785, !786}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !777, file: !664, line: 144, baseType: !492, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !777, file: !664, line: 145, baseType: !661, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !777, file: !664, line: 146, baseType: !661, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !777, file: !664, line: 147, baseType: !783, size: 32, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !784, line: 31, baseType: !403)
!784 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!785 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !777, file: !664, line: 148, baseType: !7, size: 32, offset: 224)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !777, file: !664, line: 149, baseType: !402, size: 8, offset: 256)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !682, file: !664, line: 180, baseType: !788, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !664, line: 162, baseType: !790)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !664, line: 159, size: 128, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !790, file: !664, line: 160, baseType: !492, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !790, file: !664, line: 161, baseType: !427, size: 64, offset: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !682, file: !664, line: 181, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !664, line: 181, flags: DIFlagFwdDecl)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !677, file: !664, line: 317, baseType: !798, size: 64)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 64, elements: !589)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !677, file: !664, line: 318, baseType: !800, size: 320)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !664, line: 188, size: 320, elements: !801)
!801 = !{!802, !804, !861}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !800, file: !664, line: 190, baseType: !803, size: 192)
!803 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 192, elements: !564)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !800, file: !664, line: 193, baseType: !805, size: 64, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !664, line: 206, size: 320, elements: !807)
!807 = !{!808, !846, !847, !848, !860}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !806, file: !664, line: 208, baseType: !809, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !431, line: 62, baseType: !811)
!811 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !812, line: 538, size: 256, elements: !813)
!812 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!813 = !{!814, !818, !824, !837}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !812, line: 539, baseType: !815, size: 32)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !812, line: 482, size: 32, elements: !816)
!816 = !{!817}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !815, file: !812, line: 484, baseType: !7, size: 32)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !811, file: !812, line: 540, baseType: !819, size: 192)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !812, line: 488, size: 192, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !812, line: 489, baseType: !815, size: 32)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !812, line: 492, baseType: !408, size: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !819, file: !812, line: 496, baseType: !492, size: 64, offset: 128)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !811, file: !812, line: 541, baseType: !825, size: 256)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !812, line: 504, size: 256, elements: !826)
!826 = !{!827, !828, !835, !836}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !812, line: 505, baseType: !815, size: 32)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !825, file: !812, line: 509, baseType: !829, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !812, line: 501, baseType: !830)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = !DISubroutineType(types: !832)
!832 = !{null, !833}
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !825, file: !812, line: 510, baseType: !833, size: 64, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !825, file: !812, line: 513, baseType: !809, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !811, file: !812, line: 542, baseType: !838, size: 128)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !812, line: 530, size: 128, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !812, line: 531, baseType: !815, size: 32)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !838, file: !812, line: 534, baseType: !842, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !812, line: 525, baseType: !843)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = !DISubroutineType(types: !845)
!845 = !{!402, !492, !408, !545, !545}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !806, file: !664, line: 211, baseType: !7, size: 32, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !806, file: !664, line: 214, baseType: !427, size: 64, offset: 128)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !806, file: !664, line: 224, baseType: !849, size: 64, offset: 192)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !664, line: 202, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !664, line: 202, size: 128, elements: !852)
!852 = !{!853}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !851, file: !664, line: 202, baseType: !854, size: 128)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !664, line: 200, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !664, line: 200, size: 128, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !855, file: !664, line: 200, baseType: !7, size: 32)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !855, file: !664, line: 200, baseType: !7, size: 32, offset: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !855, file: !664, line: 200, baseType: !695, size: 64, offset: 64)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !806, file: !664, line: 234, baseType: !849, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !800, file: !664, line: 197, baseType: !427, size: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !677, file: !664, line: 319, baseType: !553, size: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !677, file: !664, line: 320, baseType: !572, size: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !494, file: !164, line: 3384, baseType: !865, size: 1472)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !866)
!866 = !{!867, !888, !889, !890, !891}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !865, file: !164, line: 3115, baseType: !868, size: 1216)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !868, file: !164, line: 2985, baseType: !657, size: 960)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !868, file: !164, line: 2986, baseType: !492, size: 64, offset: 960)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !868, file: !164, line: 2987, baseType: !492, size: 64, offset: 1024)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !868, file: !164, line: 2988, baseType: !492, size: 64, offset: 1088)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !868, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !868, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !868, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !868, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !868, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !868, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !868, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !868, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !868, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !868, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !868, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !868, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !868, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !868, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !865, file: !164, line: 3117, baseType: !492, size: 64, offset: 1216)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !865, file: !164, line: 3119, baseType: !492, size: 64, offset: 1280)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !865, file: !164, line: 3121, baseType: !492, size: 64, offset: 1344)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !865, file: !164, line: 3123, baseType: !492, size: 64, offset: 1408)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !494, file: !164, line: 3385, baseType: !893, size: 1088)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !894)
!894 = !{!895, !896, !897}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !893, file: !164, line: 2875, baseType: !657, size: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !893, file: !164, line: 2876, baseType: !661, size: 64, offset: 960)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !893, file: !164, line: 2877, baseType: !898, size: 64, offset: 1024)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !900, line: 172, size: 128, elements: !901)
!900 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!901 = !{!902, !903, !904, !905, !906, !907, !908}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !899, file: !900, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !899, file: !900, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !899, file: !900, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !899, file: !900, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !899, file: !900, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !899, file: !900, line: 195, baseType: !7, size: 32, offset: 32)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !899, file: !900, line: 199, baseType: !492, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !494, file: !164, line: 3386, baseType: !868, size: 1216)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !494, file: !164, line: 3387, baseType: !911, size: 1280)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !164, line: 3094, baseType: !868, size: 1216)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !911, file: !164, line: 3095, baseType: !898, size: 64, offset: 1216)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !494, file: !164, line: 3388, baseType: !916, size: 1216)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !916, file: !164, line: 2825, baseType: !619, size: 896)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !916, file: !164, line: 2827, baseType: !492, size: 64, offset: 896)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !916, file: !164, line: 2828, baseType: !492, size: 64, offset: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !916, file: !164, line: 2829, baseType: !492, size: 64, offset: 1024)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !916, file: !164, line: 2830, baseType: !492, size: 64, offset: 1088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !916, file: !164, line: 2831, baseType: !492, size: 64, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !494, file: !164, line: 3389, baseType: !925, size: 1024)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !926)
!926 = !{!927, !928, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !164, line: 2851, baseType: !657, size: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !925, file: !164, line: 2852, baseType: !403, size: 32, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !925, file: !164, line: 2853, baseType: !403, size: 32, offset: 992)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !494, file: !164, line: 3390, baseType: !931, size: 1024)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !931, file: !164, line: 2858, baseType: !657, size: 960)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !931, file: !164, line: 2859, baseType: !898, size: 64, offset: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !494, file: !164, line: 3391, baseType: !936, size: 960)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !164, line: 2863, baseType: !657, size: 960)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !494, file: !164, line: 3392, baseType: !940, size: 1472)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !941)
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !164, line: 3305, baseType: !865, size: 1472)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !494, file: !164, line: 3393, baseType: !944, size: 1792)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !945)
!945 = !{!946, !947, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !164, line: 3249, baseType: !865, size: 1472)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !944, file: !164, line: 3251, baseType: !948, size: 64, offset: 1472)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !950, line: 463, size: 1152, elements: !951)
!950 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!951 = !{!952, !955, !985, !986, !1125, !1188, !1189, !1190, !1191, !1192, !1193, !1217, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !949, file: !950, line: 464, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !950, line: 464, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !949, file: !950, line: 467, baseType: !956, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !958)
!958 = !{!959, !960, !961, !974, !975, !976, !977, !978, !979, !981, !983, !984}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !957, file: !135, line: 377, baseType: !430, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !957, file: !135, line: 378, baseType: !430, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !957, file: !135, line: 381, baseType: !962, size: 64, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !965)
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !964, file: !135, line: 282, baseType: !967, size: 128)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !968)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !969)
!969 = !{!970, !971, !972}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !968, file: !135, line: 281, baseType: !7, size: 32)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !968, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !968, file: !135, line: 281, baseType: !973, size: 64, offset: 64)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !430, size: 64, elements: !589)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !957, file: !135, line: 384, baseType: !403, size: 32, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !957, file: !135, line: 387, baseType: !403, size: 32, offset: 224)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !957, file: !135, line: 390, baseType: !403, size: 32, offset: 256)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !957, file: !135, line: 394, baseType: !962, size: 64, offset: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !957, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !957, file: !135, line: 399, baseType: !980, size: 64, offset: 416)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !729)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !957, file: !135, line: 402, baseType: !982, size: 64, offset: 480)
!982 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !729)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !957, file: !135, line: 406, baseType: !403, size: 32, offset: 544)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !957, file: !135, line: 409, baseType: !403, size: 32, offset: 576)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !949, file: !950, line: 470, baseType: !459, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !949, file: !950, line: 473, baseType: !987, size: 64, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !900, line: 39, size: 1152, elements: !989)
!989 = !{!990, !1040, !1053, !1066, !1067, !1079, !1080, !1084, !1085, !1086, !1087, !1088}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !988, file: !900, line: 41, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !992, line: 144, baseType: !993)
!992 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !992, line: 100, size: 896, elements: !995)
!995 = !{!996, !1002, !1007, !1012, !1014, !1017, !1018, !1019, !1020, !1021, !1026, !1028, !1029, !1034, !1039}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !994, file: !992, line: 102, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !992, line: 52, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{!1001, !833}
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !992, line: 47, baseType: !7)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !994, file: !992, line: 105, baseType: !1003, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !992, line: 59, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!403, !833, !833}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !994, file: !992, line: 108, baseType: !1008, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !992, line: 63, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = !DISubroutineType(types: !1011)
!1011 = !{null, !407}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !994, file: !992, line: 111, baseType: !1013, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !994, file: !992, line: 114, baseType: !1015, size: 64, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1016, line: 46, baseType: !545)
!1016 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !994, file: !992, line: 117, baseType: !1015, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !994, file: !992, line: 120, baseType: !1015, size: 64, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !994, file: !992, line: 124, baseType: !7, size: 32, offset: 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !994, file: !992, line: 128, baseType: !7, size: 32, offset: 480)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !994, file: !992, line: 131, baseType: !1022, size: 64, offset: 512)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !992, line: 75, baseType: !1023)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1024, size: 64)
!1024 = !DISubroutineType(types: !1025)
!1025 = !{!407, !1015, !1015}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !994, file: !992, line: 132, baseType: !1027, size: 64, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !992, line: 78, baseType: !1009)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !994, file: !992, line: 135, baseType: !407, size: 64, offset: 640)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !994, file: !992, line: 136, baseType: !1030, size: 64, offset: 704)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !992, line: 82, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DISubroutineType(types: !1033)
!1033 = !{!407, !407, !1015, !1015}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !994, file: !992, line: 137, baseType: !1035, size: 64, offset: 768)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !992, line: 83, baseType: !1036)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{null, !407, !407}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !994, file: !992, line: 141, baseType: !7, size: 32, offset: 832)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !988, file: !900, line: 48, baseType: !1041, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !461, line: 35, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !461, line: 35, size: 128, elements: !1044)
!1044 = !{!1045}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1043, file: !461, line: 35, baseType: !1046, size: 128)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !461, line: 33, baseType: !1047)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !461, line: 33, size: 128, elements: !1048)
!1048 = !{!1049, !1050, !1051}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1047, file: !461, line: 33, baseType: !7, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1047, file: !461, line: 33, baseType: !7, size: 32, offset: 32)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1047, file: !461, line: 33, baseType: !1052, size: 64, offset: 64)
!1052 = !DICompositeType(tag: DW_TAG_array_type, baseType: !469, size: 64, elements: !589)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !988, file: !900, line: 51, baseType: !1054, size: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !164, line: 183, baseType: !1056)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !164, line: 183, size: 128, elements: !1057)
!1057 = !{!1058}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1056, file: !164, line: 183, baseType: !1059, size: 128)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !164, line: 182, baseType: !1060)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !164, line: 182, size: 128, elements: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1060, file: !164, line: 182, baseType: !7, size: 32)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1060, file: !164, line: 182, baseType: !7, size: 32, offset: 32)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1060, file: !164, line: 182, baseType: !1065, size: 64, offset: 64)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !492, size: 64, elements: !589)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !988, file: !900, line: 54, baseType: !492, size: 64, offset: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !988, file: !900, line: 57, baseType: !1068, size: 128, offset: 256)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1069, line: 31, size: 128, elements: !1070)
!1069 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1077}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1068, file: !1069, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1068, file: !1069, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1068, file: !1069, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1068, file: !1069, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1068, file: !1069, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1068, file: !1069, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1068, file: !1069, line: 56, baseType: !1078, size: 64, offset: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !431, line: 47, baseType: !713)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !988, file: !900, line: 60, baseType: !1068, size: 128, offset: 384)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !988, file: !900, line: 64, baseType: !1081, size: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1083, line: 33, flags: DIFlagFwdDecl)
!1083 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !988, file: !900, line: 67, baseType: !492, size: 64, offset: 576)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !988, file: !900, line: 73, baseType: !991, size: 64, offset: 640)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !988, file: !900, line: 77, baseType: !1078, size: 64, offset: 704)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !988, file: !900, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !988, file: !900, line: 82, baseType: !1089, size: 320, offset: 832)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1090, line: 62, size: 320, elements: !1091)
!1090 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1091 = !{!1092, !1098, !1099, !1100, !1101, !1108}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1089, file: !1090, line: 63, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1090, line: 56, size: 128, elements: !1095)
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1094, file: !1090, line: 57, baseType: !1093, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1094, file: !1090, line: 58, baseType: !588, size: 8, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1089, file: !1090, line: 64, baseType: !7, size: 32, offset: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1089, file: !1090, line: 66, baseType: !7, size: 32, offset: 96)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1089, file: !1090, line: 68, baseType: !402, size: 8, offset: 128)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1089, file: !1090, line: 70, baseType: !1102, size: 64, offset: 192)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1090, line: 37, size: 128, elements: !1104)
!1104 = !{!1105, !1106}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1103, file: !1090, line: 39, baseType: !1102, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1103, file: !1090, line: 40, baseType: !1107, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1089, file: !1090, line: 71, baseType: !1109, size: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1090, line: 45, size: 320, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1110, file: !1090, line: 47, baseType: !1109, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1110, file: !1090, line: 48, baseType: !1114, size: 256, offset: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !1115)
!1115 = !{!1116, !1118, !1119, !1124}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1114, file: !164, line: 1884, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1114, file: !164, line: 1885, baseType: !1117, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1114, file: !164, line: 1891, baseType: !1120, size: 64, offset: 128)
!1120 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1114, file: !164, line: 1891, size: 64, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1120, file: !164, line: 1891, baseType: !469, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1120, file: !164, line: 1891, baseType: !492, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1114, file: !164, line: 1892, baseType: !1107, size: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !949, file: !950, line: 476, baseType: !1126, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !146, line: 187, size: 256, elements: !1128)
!1128 = !{!1129, !1130, !1186, !1187}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1127, file: !146, line: 189, baseType: !403, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1127, file: !146, line: 192, baseType: !1131, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1134)
!1134 = !{!1135}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1133, file: !146, line: 87, baseType: !1136, size: 128)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1138)
!1138 = !{!1139, !1140, !1141}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1137, file: !146, line: 85, baseType: !7, size: 32)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1137, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1137, file: !146, line: 85, baseType: !1142, size: 64, offset: 64)
!1142 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1143, size: 64, elements: !589)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1176, !1184, !1185}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1145, file: !146, line: 102, baseType: !403, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1145, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1145, file: !146, line: 108, baseType: !432, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1145, file: !146, line: 111, baseType: !432, size: 64, offset: 128)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1145, file: !146, line: 114, baseType: !1152, size: 64, offset: 192)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1152, file: !146, line: 42, baseType: !145, size: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1152, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1145, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1145, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1145, file: !146, line: 123, baseType: !1131, size: 64, offset: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1145, file: !146, line: 126, baseType: !1144, size: 64, offset: 384)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1145, file: !146, line: 129, baseType: !1144, size: 64, offset: 448)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1145, file: !146, line: 132, baseType: !407, size: 64, offset: 512)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1145, file: !146, line: 139, baseType: !492, size: 64, offset: 576)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1145, file: !146, line: 143, baseType: !540, size: 128, offset: 640)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1145, file: !146, line: 146, baseType: !540, size: 128, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1145, file: !146, line: 148, baseType: !402, size: 8, offset: 896)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1145, file: !146, line: 149, baseType: !402, size: 8, offset: 904)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1145, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1145, file: !146, line: 156, baseType: !1169, size: 64, offset: 960)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1171)
!1171 = !{!1172, !1173, !1174, !1175}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1170, file: !146, line: 50, baseType: !469, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1170, file: !146, line: 59, baseType: !540, size: 128, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1170, file: !146, line: 64, baseType: !402, size: 8, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1170, file: !146, line: 67, baseType: !1169, size: 64, offset: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1145, file: !146, line: 159, baseType: !1177, size: 64, offset: 1024)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1179)
!1179 = !{!1180, !1181, !1182, !1183}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1178, file: !146, line: 74, baseType: !449, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1178, file: !146, line: 77, baseType: !1177, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1178, file: !146, line: 78, baseType: !1177, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1178, file: !146, line: 81, baseType: !1177, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1145, file: !146, line: 162, baseType: !402, size: 8, offset: 1088)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1145, file: !146, line: 166, baseType: !492, size: 64, offset: 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1127, file: !146, line: 197, baseType: !991, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1127, file: !146, line: 200, baseType: !1144, size: 64, offset: 192)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !949, file: !950, line: 479, baseType: !991, size: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !949, file: !950, line: 484, baseType: !492, size: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !949, file: !950, line: 488, baseType: !492, size: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !949, file: !950, line: 493, baseType: !492, size: 64, offset: 512)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !949, file: !950, line: 496, baseType: !492, size: 64, offset: 576)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !949, file: !950, line: 501, baseType: !1194, size: 64, offset: 640)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1196)
!1196 = !{!1197, !1200, !1201, !1202, !1203, !1205, !1206, !1211, !1212, !1213, !1214, !1215, !1216}
