; ModuleID = 'recog.bc'
source_filename = "recog.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.change_t = type { %struct.rtx_def*, i32, %struct.rtx_def**, %struct.rtx_def*, i8 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }

!735 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!736 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!737 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!738 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!739 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!740 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!741 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!742 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!743 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!744 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!745 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!746 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!747 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!748 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!749 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!750 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!751 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!752 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!753 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!754 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!755 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!756 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!757 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!758 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!759 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!760 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!761 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!762 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!763 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!764 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!765 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!766 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!767 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!768 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!769 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!770 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!771 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!772 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!773 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!774 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!775 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!776 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!777 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!778 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!779 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!780 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!781 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!782 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!783 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!784 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!785 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!786 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!787 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!788 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!789 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "op_type", file: !790, line: 25, baseType: !7, size: 32, elements: !791)
!790 = !DIFile(filename: "./recog.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !{!792, !793, !794}
!792 = !DIEnumerator(name: "OP_IN", value: 0, isUnsigned: true)
!793 = !DIEnumerator(name: "OP_OUT", value: 1, isUnsigned: true)
!794 = !DIEnumerator(name: "OP_INOUT", value: 2, isUnsigned: true)
!795 = !{!796, !797, !798, !799, !802, !803, !805, !1876, !377, !806, !5, !922, !183, !520, !554, !1877, !808, !1878, !1880, !1882, !1891, !7, !876, !1897, !1898}
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!798 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !801)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !807, line: 50, baseType: !808)
!807 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !810)
!810 = !{!811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !809, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !809, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !809, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !809, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !809, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !809, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !809, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !809, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !809, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !809, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !809, file: !378, line: 321, baseType: !822, size: 320, offset: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !823)
!823 = !{!824, !1811, !1813, !1874, !1875}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !822, file: !378, line: 316, baseType: !825, size: 64)
!825 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 64, elements: !841)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !827)
!827 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !828)
!828 = !{!829, !830, !831, !832, !833, !843, !844, !856, !859, !921, !1789, !1790, !1801, !1808}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !827, file: !378, line: 168, baseType: !798, size: 32)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !827, file: !378, line: 169, baseType: !7, size: 32)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !827, file: !378, line: 170, baseType: !803, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !827, file: !378, line: 171, baseType: !806, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !827, file: !378, line: 172, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !807, line: 53, baseType: !835)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !836, file: !378, line: 360, baseType: !798, size: 32)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !836, file: !378, line: 361, baseType: !840, size: 64, offset: 64)
!840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !806, size: 64, elements: !841)
!841 = !{!842}
!842 = !DISubrange(count: 1)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !827, file: !378, line: 173, baseType: !5, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !827, file: !378, line: 174, baseType: !845, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !846)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !846, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !846, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !846, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !846, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !846, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !846, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !846, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !846, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !827, file: !378, line: 175, baseType: !857, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !378, line: 175, flags: DIFlagFwdDecl)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !827, file: !378, line: 176, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !862, line: 75, size: 256, elements: !863)
!862 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!863 = !{!864, !879, !880, !881}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !861, file: !862, line: 76, baseType: !865, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !862, line: 68, baseType: !867)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !862, line: 63, size: 320, elements: !868)
!868 = !{!869, !871, !872, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !862, line: 64, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !867, file: !862, line: 65, baseType: !870, size: 64, offset: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !867, file: !862, line: 66, baseType: !7, size: 32, offset: 128)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !867, file: !862, line: 67, baseType: !874, size: 128, offset: 192)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !875, size: 128, elements: !877)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !862, line: 29, baseType: !876)
!876 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!877 = !{!878}
!878 = !DISubrange(count: 2)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !861, file: !862, line: 77, baseType: !865, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !861, file: !862, line: 78, baseType: !7, size: 32, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !861, file: !862, line: 79, baseType: !882, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !862, line: 49, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !862, line: 45, size: 832, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !884, file: !862, line: 46, baseType: !870, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !884, file: !862, line: 47, baseType: !860, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !884, file: !862, line: 48, baseType: !889, size: 704, offset: 128)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !890, line: 164, size: 704, elements: !891)
!890 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!891 = !{!892, !894, !904, !905, !906, !907, !908, !909, !913, !917, !918, !919, !920}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !889, file: !890, line: 166, baseType: !893, size: 64)
!893 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !889, file: !890, line: 167, baseType: !895, size: 64, offset: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !890, line: 157, size: 192, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !896, file: !890, line: 159, baseType: !800, size: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !896, file: !890, line: 160, baseType: !895, size: 64, offset: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !896, file: !890, line: 161, baseType: !901, size: 32, offset: 128)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 32, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 4)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !889, file: !890, line: 168, baseType: !800, size: 64, offset: 128)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !889, file: !890, line: 169, baseType: !800, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !889, file: !890, line: 170, baseType: !800, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !889, file: !890, line: 171, baseType: !893, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !889, file: !890, line: 172, baseType: !798, size: 32, offset: 384)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !889, file: !890, line: 176, baseType: !910, size: 64, offset: 448)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DISubroutineType(types: !912)
!912 = !{!895, !802, !893}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !889, file: !890, line: 177, baseType: !914, size: 64, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{null, !802, !895}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !889, file: !890, line: 178, baseType: !802, size: 64, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !889, file: !890, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !889, file: !890, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !889, file: !890, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !827, file: !378, line: 177, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !807, line: 56, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !925)
!925 = !{!926, !959, !965, !976, !995, !1006, !1011, !1018, !1024, !1037, !1049, !1087, !1092, !1120, !1128, !1129, !1134, !1143, !1149, !1154, !1158, !1162, !1413, !1462, !1468, !1475, !1482, !1508, !1533, !1550, !1562, !1584, !1599, !1771}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !924, file: !151, line: 3372, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !928)
!928 = !{!929, !930, !931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !927, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !927, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !927, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !927, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !927, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !927, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !927, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !927, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !927, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !927, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !927, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !927, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !927, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !927, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !927, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !927, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !927, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !927, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !927, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !927, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !927, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !927, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !927, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !927, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !927, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !927, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !927, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !927, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !927, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !927, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !151, line: 3373, baseType: !960, size: 192)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !961)
!961 = !{!962, !963, !964}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !960, file: !151, line: 403, baseType: !927, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !960, file: !151, line: 404, baseType: !922, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !960, file: !151, line: 405, baseType: !922, size: 64, offset: 128)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !924, file: !151, line: 3374, baseType: !966, size: 320)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !967)
!967 = !{!968, !969}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !151, line: 1385, baseType: !960, size: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !966, file: !151, line: 1386, baseType: !970, size: 128, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !971, line: 58, baseType: !972)
!971 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !971, line: 54, size: 128, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !972, file: !971, line: 56, baseType: !876, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !972, file: !971, line: 57, baseType: !893, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !924, file: !151, line: 3375, baseType: !977, size: 256)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !151, line: 1398, baseType: !960, size: 192)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !977, file: !151, line: 1399, baseType: !981, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !983, line: 52, size: 256, elements: !984)
!983 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!984 = !{!985, !986, !987, !988, !989, !990, !991}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !982, file: !983, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !982, file: !983, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !982, file: !983, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !982, file: !983, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !982, file: !983, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !982, file: !983, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !982, file: !983, line: 62, baseType: !992, size: 192, offset: 64)
!992 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 192, elements: !993)
!993 = !{!994}
!994 = !DISubrange(count: 3)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !924, file: !151, line: 3376, baseType: !996, size: 256)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !996, file: !151, line: 1409, baseType: !960, size: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !996, file: !151, line: 1410, baseType: !1000, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1002, line: 27, size: 192, elements: !1003)
!1002 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1001, file: !1002, line: 29, baseType: !970, size: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1001, file: !1002, line: 30, baseType: !5, size: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !924, file: !151, line: 3377, baseType: !1007, size: 256)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1007, file: !151, line: 1438, baseType: !960, size: 192)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1007, file: !151, line: 1439, baseType: !922, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !924, file: !151, line: 3378, baseType: !1012, size: 256)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !1013)
!1013 = !{!1014, !1015, !1016}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1012, file: !151, line: 1419, baseType: !960, size: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1012, file: !151, line: 1420, baseType: !798, size: 32, offset: 192)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1012, file: !151, line: 1421, baseType: !1017, size: 8, offset: 224)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !801, size: 8, elements: !841)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !924, file: !151, line: 3379, baseType: !1019, size: 320)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !1020)
!1020 = !{!1021, !1022, !1023}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1019, file: !151, line: 1429, baseType: !960, size: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1019, file: !151, line: 1430, baseType: !922, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1019, file: !151, line: 1431, baseType: !922, size: 64, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !924, file: !151, line: 3380, baseType: !1025, size: 320)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1025, file: !151, line: 1461, baseType: !960, size: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1025, file: !151, line: 1462, baseType: !1029, size: 128, offset: 192)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1030, line: 31, size: 128, elements: !1031)
!1030 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1031 = !{!1032, !1035, !1036}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1029, file: !1030, line: 32, baseType: !1033, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !797)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1029, file: !1030, line: 33, baseType: !7, size: 32, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1029, file: !1030, line: 34, baseType: !7, size: 32, offset: 96)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !924, file: !151, line: 3381, baseType: !1038, size: 384)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1039)
!1039 = !{!1040, !1041, !1046, !1047, !1048}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1038, file: !151, line: 2508, baseType: !960, size: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1038, file: !151, line: 2509, baseType: !1042, size: 32, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1043, line: 58, baseType: !1044)
!1043 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1045, line: 44, baseType: !7)
!1045 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1038, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1038, file: !151, line: 2511, baseType: !922, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1038, file: !151, line: 2512, baseType: !922, size: 64, offset: 320)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !924, file: !151, line: 3382, baseType: !1050, size: 896)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1050, file: !151, line: 2653, baseType: !1038, size: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1050, file: !151, line: 2654, baseType: !922, size: 64, offset: 384)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1050, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1050, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1050, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1050, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1050, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1050, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1050, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1050, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1050, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1050, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1050, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1050, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1050, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1050, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1050, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1050, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1050, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1050, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1050, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1050, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1050, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1050, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1050, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1050, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1050, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1050, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1050, file: !151, line: 2705, baseType: !922, size: 64, offset: 576)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1050, file: !151, line: 2706, baseType: !922, size: 64, offset: 640)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1050, file: !151, line: 2707, baseType: !922, size: 64, offset: 704)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1050, file: !151, line: 2708, baseType: !922, size: 64, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1050, file: !151, line: 2711, baseType: !1085, size: 64, offset: 832)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !924, file: !151, line: 3383, baseType: !1088, size: 960)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1088, file: !151, line: 2757, baseType: !1050, size: 896)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1088, file: !151, line: 2758, baseType: !806, size: 64, offset: 896)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !924, file: !151, line: 3384, baseType: !1093, size: 1472)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1094)
!1094 = !{!1095, !1116, !1117, !1118, !1119}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1093, file: !151, line: 3115, baseType: !1096, size: 1216)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1097)
!1097 = !{!1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1096, file: !151, line: 2985, baseType: !1088, size: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1096, file: !151, line: 2986, baseType: !922, size: 64, offset: 960)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1096, file: !151, line: 2987, baseType: !922, size: 64, offset: 1024)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1096, file: !151, line: 2988, baseType: !922, size: 64, offset: 1088)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1096, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1096, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1096, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1096, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1096, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1096, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1096, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1096, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1096, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1096, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1096, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1096, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1096, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1096, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1093, file: !151, line: 3117, baseType: !922, size: 64, offset: 1216)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1093, file: !151, line: 3119, baseType: !922, size: 64, offset: 1280)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1093, file: !151, line: 3121, baseType: !922, size: 64, offset: 1344)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1093, file: !151, line: 3123, baseType: !922, size: 64, offset: 1408)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !924, file: !151, line: 3385, baseType: !1121, size: 1088)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1122)
!1122 = !{!1123, !1124, !1125}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1121, file: !151, line: 2875, baseType: !1088, size: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1121, file: !151, line: 2876, baseType: !806, size: 64, offset: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1121, file: !151, line: 2877, baseType: !1126, size: 64, offset: 1024)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !924, file: !151, line: 3386, baseType: !1096, size: 1216)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !924, file: !151, line: 3387, baseType: !1130, size: 1280)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1131)
!1131 = !{!1132, !1133}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1130, file: !151, line: 3094, baseType: !1096, size: 1216)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1130, file: !151, line: 3095, baseType: !1126, size: 64, offset: 1216)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !924, file: !151, line: 3388, baseType: !1135, size: 1216)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !151, line: 2825, baseType: !1050, size: 896)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1135, file: !151, line: 2827, baseType: !922, size: 64, offset: 896)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1135, file: !151, line: 2828, baseType: !922, size: 64, offset: 960)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1135, file: !151, line: 2829, baseType: !922, size: 64, offset: 1024)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1135, file: !151, line: 2830, baseType: !922, size: 64, offset: 1088)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1135, file: !151, line: 2831, baseType: !922, size: 64, offset: 1152)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !924, file: !151, line: 3389, baseType: !1144, size: 1024)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1145)
!1145 = !{!1146, !1147, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1144, file: !151, line: 2851, baseType: !1088, size: 960)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1144, file: !151, line: 2852, baseType: !798, size: 32, offset: 960)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1144, file: !151, line: 2853, baseType: !798, size: 32, offset: 992)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !924, file: !151, line: 3390, baseType: !1150, size: 1024)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1151)
!1151 = !{!1152, !1153}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1150, file: !151, line: 2858, baseType: !1088, size: 960)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1150, file: !151, line: 2859, baseType: !1126, size: 64, offset: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !924, file: !151, line: 3391, baseType: !1155, size: 960)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1156)
!1156 = !{!1157}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1155, file: !151, line: 2863, baseType: !1088, size: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !924, file: !151, line: 3392, baseType: !1159, size: 1472)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1160)
!1160 = !{!1161}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1159, file: !151, line: 3305, baseType: !1093, size: 1472)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !924, file: !151, line: 3393, baseType: !1163, size: 1792)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1164)
!1164 = !{!1165, !1166, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1163, file: !151, line: 3249, baseType: !1093, size: 1472)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1163, file: !151, line: 3251, baseType: !1167, size: 64, offset: 1472)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1169, line: 463, size: 1152, elements: !1170)
!1169 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1170 = !{!1171, !1174, !1278, !1279, !1282, !1285, !1337, !1338, !1339, !1340, !1341, !1365, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1168, file: !1169, line: 464, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1169, line: 464, flags: DIFlagFwdDecl)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1168, file: !1169, line: 467, baseType: !1175, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1177)
!1177 = !{!1178, !1253, !1254, !1267, !1268, !1269, !1270, !1271, !1272, !1274, !1276, !1277}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1176, file: !135, line: 377, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !807, line: 111, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1182)
!1182 = !{!1183, !1218, !1219, !1220, !1223, !1227, !1228, !1229, !1247, !1248, !1249, !1250, !1251, !1252}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1181, file: !135, line: 219, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1187)
!1187 = !{!1188}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1186, file: !135, line: 151, baseType: !1189, size: 128)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1190, file: !135, line: 150, baseType: !7, size: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1190, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1190, file: !135, line: 150, baseType: !1195, size: 64, offset: 64)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 64, elements: !841)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !807, line: 108, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1210, !1211, !1212, !1213, !1214, !1215, !1216}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1198, file: !135, line: 124, baseType: !1180, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1198, file: !135, line: 125, baseType: !1180, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1198, file: !135, line: 131, baseType: !1203, size: 64, offset: 128)
!1203 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1204)
!1204 = !{!1205, !1209}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1203, file: !135, line: 129, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !807, line: 66, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !807, line: 65, flags: DIFlagFwdDecl)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1203, file: !135, line: 130, baseType: !806, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1198, file: !135, line: 134, baseType: !802, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1198, file: !135, line: 137, baseType: !922, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1198, file: !135, line: 138, baseType: !1042, size: 32, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1198, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1198, file: !135, line: 144, baseType: !798, size: 32, offset: 384)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1198, file: !135, line: 145, baseType: !798, size: 32, offset: 416)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1198, file: !135, line: 146, baseType: !1217, size: 64, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !893)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1181, file: !135, line: 220, baseType: !1184, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1181, file: !135, line: 223, baseType: !802, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1181, file: !135, line: 226, baseType: !1221, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1181, file: !135, line: 229, baseType: !1224, size: 128, offset: 256)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1225, size: 128, elements: !877)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1181, file: !135, line: 232, baseType: !1180, size: 64, offset: 384)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1181, file: !135, line: 233, baseType: !1180, size: 64, offset: 448)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1181, file: !135, line: 238, baseType: !1230, size: 64, offset: 512)
!1230 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1231)
!1231 = !{!1232, !1238}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1230, file: !135, line: 236, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1235)
!1235 = !{!1236, !1237}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1234, file: !135, line: 275, baseType: !1206, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1234, file: !135, line: 278, baseType: !1206, size: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1230, file: !135, line: 237, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1241)
!1241 = !{!1242, !1243, !1244, !1245, !1246}
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1240, file: !135, line: 261, baseType: !806, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1240, file: !135, line: 262, baseType: !806, size: 64, offset: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1240, file: !135, line: 266, baseType: !806, size: 64, offset: 128)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1240, file: !135, line: 267, baseType: !806, size: 64, offset: 192)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1240, file: !135, line: 270, baseType: !798, size: 32, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1181, file: !135, line: 241, baseType: !1217, size: 64, offset: 576)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1181, file: !135, line: 244, baseType: !798, size: 32, offset: 640)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1181, file: !135, line: 247, baseType: !798, size: 32, offset: 672)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1181, file: !135, line: 250, baseType: !798, size: 32, offset: 704)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1181, file: !135, line: 253, baseType: !798, size: 32, offset: 736)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1181, file: !135, line: 256, baseType: !798, size: 32, offset: 768)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1176, file: !135, line: 378, baseType: !1179, size: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1176, file: !135, line: 381, baseType: !1255, size: 64, offset: 128)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1257)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1258)
!1258 = !{!1259}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1257, file: !135, line: 282, baseType: !1260, size: 128)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1262)
!1262 = !{!1263, !1264, !1265}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1261, file: !135, line: 281, baseType: !7, size: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1261, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1261, file: !135, line: 281, baseType: !1266, size: 64, offset: 64)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 64, elements: !841)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1176, file: !135, line: 384, baseType: !798, size: 32, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1176, file: !135, line: 387, baseType: !798, size: 32, offset: 224)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1176, file: !135, line: 390, baseType: !798, size: 32, offset: 256)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1176, file: !135, line: 394, baseType: !1255, size: 64, offset: 320)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1176, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1176, file: !135, line: 399, baseType: !1273, size: 64, offset: 416)
!1273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !877)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1176, file: !135, line: 402, baseType: !1275, size: 64, offset: 480)
!1275 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !877)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1176, file: !135, line: 406, baseType: !798, size: 32, offset: 544)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1176, file: !135, line: 409, baseType: !798, size: 32, offset: 576)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1168, file: !1169, line: 470, baseType: !1207, size: 64, offset: 128)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1168, file: !1169, line: 473, baseType: !1280, size: 64, offset: 192)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1169, line: 166, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1168, file: !1169, line: 476, baseType: !1283, size: 64, offset: 256)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1169, line: 476, flags: DIFlagFwdDecl)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1168, file: !1169, line: 479, baseType: !1286, size: 64, offset: 320)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1287, line: 144, baseType: !1288)
!1287 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1287, line: 100, size: 896, elements: !1290)
!1290 = !{!1291, !1299, !1304, !1309, !1311, !1314, !1315, !1316, !1317, !1318, !1323, !1325, !1326, !1331, !1336}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1289, file: !1287, line: 102, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1287, line: 52, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!1296, !1297}
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1287, line: 47, baseType: !7)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1289, file: !1287, line: 105, baseType: !1300, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1287, line: 59, baseType: !1301)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DISubroutineType(types: !1303)
!1303 = !{!798, !1297, !1297}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1289, file: !1287, line: 108, baseType: !1305, size: 64, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1287, line: 63, baseType: !1306)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DISubroutineType(types: !1308)
!1308 = !{null, !802}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1289, file: !1287, line: 111, baseType: !1310, size: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1289, file: !1287, line: 114, baseType: !1312, size: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1313, line: 46, baseType: !876)
!1313 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1289, file: !1287, line: 117, baseType: !1312, size: 64, offset: 320)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1289, file: !1287, line: 120, baseType: !1312, size: 64, offset: 384)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1289, file: !1287, line: 124, baseType: !7, size: 32, offset: 448)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1289, file: !1287, line: 128, baseType: !7, size: 32, offset: 480)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1289, file: !1287, line: 131, baseType: !1319, size: 64, offset: 512)
!1319 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1287, line: 75, baseType: !1320)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DISubroutineType(types: !1322)
!1322 = !{!802, !1312, !1312}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1289, file: !1287, line: 132, baseType: !1324, size: 64, offset: 576)
!1324 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1287, line: 78, baseType: !1306)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1289, file: !1287, line: 135, baseType: !802, size: 64, offset: 640)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1289, file: !1287, line: 136, baseType: !1327, size: 64, offset: 704)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1287, line: 82, baseType: !1328)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1329, size: 64)
!1329 = !DISubroutineType(types: !1330)
!1330 = !{!802, !802, !1312, !1312}
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1289, file: !1287, line: 137, baseType: !1332, size: 64, offset: 768)
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1287, line: 83, baseType: !1333)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DISubroutineType(types: !1335)
!1335 = !{null, !802, !802}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1289, file: !1287, line: 141, baseType: !7, size: 32, offset: 832)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1168, file: !1169, line: 484, baseType: !922, size: 64, offset: 384)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1168, file: !1169, line: 488, baseType: !922, size: 64, offset: 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1168, file: !1169, line: 493, baseType: !922, size: 64, offset: 512)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1168, file: !1169, line: 496, baseType: !922, size: 64, offset: 576)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1168, file: !1169, line: 501, baseType: !1342, size: 64, offset: 640)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1344)
!1344 = !{!1345, !1348, !1349, !1350, !1351, !1353, !1354, !1359, !1360, !1361, !1362, !1363, !1364}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1343, file: !146, line: 2356, baseType: !1346, size: 64)
!1346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1347, size: 64)
!1347 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1343, file: !146, line: 2357, baseType: !803, size: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1343, file: !146, line: 2358, baseType: !798, size: 32, offset: 128)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1343, file: !146, line: 2359, baseType: !798, size: 32, offset: 160)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1343, file: !146, line: 2360, baseType: !1352, size: 128, offset: 192)
!1352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !798, size: 128, elements: !902)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1343, file: !146, line: 2364, baseType: !798, size: 32, offset: 320)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1343, file: !146, line: 2367, baseType: !1355, size: 128, offset: 384)
!1355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1356)
!1356 = !{!1357, !1358}
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1355, file: !146, line: 2351, baseType: !806, size: 64)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1355, file: !146, line: 2352, baseType: !893, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1343, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1343, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1343, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1343, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1343, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1343, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1168, file: !1169, line: 504, baseType: !1366, size: 64, offset: 704)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1169, line: 504, flags: DIFlagFwdDecl)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1168, file: !1169, line: 507, baseType: !1286, size: 64, offset: 768)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1168, file: !1169, line: 510, baseType: !798, size: 32, offset: 832)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1168, file: !1169, line: 513, baseType: !798, size: 32, offset: 864)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1168, file: !1169, line: 516, baseType: !1042, size: 32, offset: 896)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1168, file: !1169, line: 519, baseType: !1042, size: 32, offset: 928)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1168, file: !1169, line: 522, baseType: !7, size: 32, offset: 960)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1168, file: !1169, line: 523, baseType: !7, size: 32, offset: 992)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1168, file: !1169, line: 528, baseType: !803, size: 64, offset: 1024)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1168, file: !1169, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1168, file: !1169, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1168, file: !1169, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1168, file: !1169, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1168, file: !1169, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1168, file: !1169, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1168, file: !1169, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1168, file: !1169, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1168, file: !1169, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1168, file: !1169, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1168, file: !1169, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1168, file: !1169, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1168, file: !1169, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1168, file: !1169, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1168, file: !1169, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1168, file: !1169, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1163, file: !151, line: 3254, baseType: !922, size: 64, offset: 1536)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1163, file: !151, line: 3257, baseType: !922, size: 64, offset: 1600)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1163, file: !151, line: 3258, baseType: !922, size: 64, offset: 1664)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1163, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1163, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1163, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1163, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1163, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1163, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1163, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1163, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1163, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1163, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1163, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1163, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1163, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1163, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1163, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1163, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1163, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1163, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !924, file: !151, line: 3394, baseType: !1414, size: 1344)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1415)
!1415 = !{!1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1441, !1442, !1443, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1414, file: !151, line: 2280, baseType: !960, size: 192)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1414, file: !151, line: 2281, baseType: !922, size: 64, offset: 192)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1414, file: !151, line: 2282, baseType: !922, size: 64, offset: 256)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1414, file: !151, line: 2283, baseType: !922, size: 64, offset: 320)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1414, file: !151, line: 2284, baseType: !922, size: 64, offset: 384)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1414, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1414, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1414, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1414, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1414, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1414, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1414, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1414, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1414, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1414, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1414, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1414, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1414, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1414, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1414, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1414, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1414, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1414, file: !151, line: 2306, baseType: !1439, size: 32, offset: 544)
!1439 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1440, line: 31, baseType: !798)
!1440 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1414, file: !151, line: 2307, baseType: !922, size: 64, offset: 576)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1414, file: !151, line: 2308, baseType: !922, size: 64, offset: 640)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1414, file: !151, line: 2314, baseType: !1444, size: 64, offset: 704)
!1444 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1445)
!1445 = !{!1446, !1447, !1448}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1444, file: !151, line: 2310, baseType: !798, size: 32)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1444, file: !151, line: 2311, baseType: !803, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1444, file: !151, line: 2312, baseType: !1449, size: 64)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64)
!1450 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1414, file: !151, line: 2315, baseType: !922, size: 64, offset: 768)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1414, file: !151, line: 2316, baseType: !922, size: 64, offset: 832)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1414, file: !151, line: 2317, baseType: !922, size: 64, offset: 896)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1414, file: !151, line: 2318, baseType: !922, size: 64, offset: 960)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1414, file: !151, line: 2319, baseType: !922, size: 64, offset: 1024)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1414, file: !151, line: 2320, baseType: !922, size: 64, offset: 1088)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1414, file: !151, line: 2321, baseType: !922, size: 64, offset: 1152)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1414, file: !151, line: 2322, baseType: !922, size: 64, offset: 1216)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1414, file: !151, line: 2324, baseType: !1460, size: 64, offset: 1280)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1461 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !924, file: !151, line: 3395, baseType: !1463, size: 320)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1464)
!1464 = !{!1465, !1466, !1467}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1463, file: !151, line: 1470, baseType: !960, size: 192)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1463, file: !151, line: 1471, baseType: !922, size: 64, offset: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1463, file: !151, line: 1472, baseType: !922, size: 64, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !924, file: !151, line: 3396, baseType: !1469, size: 320)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1470)
!1470 = !{!1471, !1472, !1473}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1469, file: !151, line: 1483, baseType: !960, size: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1469, file: !151, line: 1484, baseType: !798, size: 32, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1469, file: !151, line: 1485, baseType: !1474, size: 64, offset: 256)
!1474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 64, elements: !841)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !924, file: !151, line: 3397, baseType: !1476, size: 384)
!1476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1477)
!1477 = !{!1478, !1479, !1480, !1481}
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1476, file: !151, line: 1830, baseType: !960, size: 192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1476, file: !151, line: 1831, baseType: !1042, size: 32, offset: 192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1476, file: !151, line: 1832, baseType: !922, size: 64, offset: 256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1476, file: !151, line: 1835, baseType: !1474, size: 64, offset: 320)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !924, file: !151, line: 3398, baseType: !1483, size: 704)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1484)
!1484 = !{!1485, !1486, !1487, !1491, !1492, !1495}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1483, file: !151, line: 1899, baseType: !960, size: 192)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1483, file: !151, line: 1902, baseType: !922, size: 64, offset: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1483, file: !151, line: 1905, baseType: !1488, size: 64, offset: 256)
!1488 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !807, line: 58, baseType: !1489)
!1489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1490, size: 64)
!1490 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !807, line: 57, flags: DIFlagFwdDecl)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1483, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1483, file: !151, line: 1911, baseType: !1493, size: 64, offset: 384)
!1493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1494, size: 64)
!1494 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1483, file: !151, line: 1914, baseType: !1496, size: 256, offset: 448)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1497)
!1497 = !{!1498, !1500, !1501, !1506}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1496, file: !151, line: 1884, baseType: !1499, size: 64)
!1499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1496, size: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1496, file: !151, line: 1885, baseType: !1499, size: 64, offset: 64)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1496, file: !151, line: 1891, baseType: !1502, size: 64, offset: 128)
!1502 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1496, file: !151, line: 1891, size: 64, elements: !1503)
!1503 = !{!1504, !1505}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1502, file: !151, line: 1891, baseType: !1488, size: 64)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1502, file: !151, line: 1891, baseType: !922, size: 64)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1496, file: !151, line: 1892, baseType: !1507, size: 64, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !924, file: !151, line: 3399, baseType: !1509, size: 704)
!1509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1510)
!1510 = !{!1511, !1512, !1513, !1514, !1515, !1516, !1528, !1529, !1530, !1531, !1532}
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1509, file: !151, line: 2009, baseType: !960, size: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1509, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1509, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1509, file: !151, line: 2014, baseType: !1042, size: 32, offset: 224)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1509, file: !151, line: 2016, baseType: !922, size: 64, offset: 256)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1509, file: !151, line: 2017, baseType: !1517, size: 64, offset: 320)
!1517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1518, size: 64)
!1518 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1519)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1520)
!1520 = !{!1521}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1519, file: !151, line: 183, baseType: !1522, size: 128)
!1522 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1523)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1524)
!1524 = !{!1525, !1526, !1527}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1523, file: !151, line: 182, baseType: !7, size: 32)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1523, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1523, file: !151, line: 182, baseType: !1474, size: 64, offset: 64)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1509, file: !151, line: 2019, baseType: !922, size: 64, offset: 384)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1509, file: !151, line: 2020, baseType: !922, size: 64, offset: 448)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1509, file: !151, line: 2021, baseType: !922, size: 64, offset: 512)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1509, file: !151, line: 2022, baseType: !922, size: 64, offset: 576)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1509, file: !151, line: 2023, baseType: !922, size: 64, offset: 640)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !924, file: !151, line: 3400, baseType: !1534, size: 832)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1535)
!1535 = !{!1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1534, file: !151, line: 2431, baseType: !960, size: 192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1534, file: !151, line: 2433, baseType: !922, size: 64, offset: 192)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1534, file: !151, line: 2434, baseType: !922, size: 64, offset: 256)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1534, file: !151, line: 2435, baseType: !922, size: 64, offset: 320)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1534, file: !151, line: 2436, baseType: !922, size: 64, offset: 384)
