; ModuleID = 'reg-stack.bc'
source_filename = "reg-stack.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.VEC_char_heap = type { %struct.VEC_char_base }
%struct.VEC_char_base = type { i32, i32, [1 x i8] }
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!708 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!709 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!710 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!711 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!712 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!713 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!714 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!715 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!716 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!717 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!718 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!719 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!720 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!721 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!722 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!723 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!724 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!725 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !378, line: 836, baseType: !7, size: 32, elements: !726)
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758}
!727 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!728 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!729 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!730 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!731 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!732 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!733 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!734 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!735 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!736 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!737 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!738 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!739 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!740 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!741 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!750 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!751 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!752 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!756 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!757 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!758 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!759 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "emit_where", file: !3, line: 226, baseType: !7, size: 32, elements: !760)
!760 = !{!761, !762}
!761 = !DIEnumerator(name: "EMIT_AFTER", value: 0, isUnsigned: true)
!762 = !DIEnumerator(name: "EMIT_BEFORE", value: 1, isUnsigned: true)
!763 = !{!764, !765, !766, !767, !770, !771, !377, !7, !773, !788, !789, !798, !5, !808, !183, !878, !1884, !703, !725, !910, !1886, !1887, !1888}
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!766 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !769)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_char_heap", file: !775, line: 24, baseType: !776)
!775 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_char_heap", file: !775, line: 24, size: 96, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !776, file: !775, line: 24, baseType: !779, size: 96)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_char_base", file: !775, line: 23, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_char_base", file: !775, line: 23, size: 96, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !780, file: !775, line: 23, baseType: !7, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !780, file: !775, line: 23, baseType: !7, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !780, file: !775, line: 23, baseType: !785, size: 8, offset: 64)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 8, elements: !786)
!786 = !{!787}
!787 = !DISubrange(count: 1)
!788 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "block_info", file: !3, line: 221, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_info_def", file: !3, line: 213, size: 512, elements: !792)
!792 = !{!793, !804, !805, !806, !807}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "stack_in", scope: !791, file: !3, line: 215, baseType: !794, size: 192)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stack_def", file: !3, line: 203, size: 192, elements: !795)
!795 = !{!796, !797, !800}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "top", scope: !794, file: !3, line: 205, baseType: !766, size: 32)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "reg_set", scope: !794, file: !3, line: 206, baseType: !798, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !799, line: 42, baseType: !788)
!799 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!800 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !794, file: !3, line: 207, baseType: !801, size: 64, offset: 128)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 64, elements: !802)
!802 = !{!803}
!803 = !DISubrange(count: 8)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "stack_out", scope: !791, file: !3, line: 216, baseType: !794, size: 192, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "out_reg_set", scope: !791, file: !3, line: 217, baseType: !798, size: 64, offset: 384)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "done", scope: !791, file: !3, line: 218, baseType: !766, size: 32, offset: 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "predecessors", scope: !791, file: !3, line: 219, baseType: !766, size: 32, offset: 480)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_lr_bb_info", file: !810, line: 826, size: 256, elements: !811)
!810 = !DIFile(filename: "./df.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!811 = !{!812, !875, !876, !877}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !809, file: !810, line: 829, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !814, line: 47, baseType: !815)
!814 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !817, line: 75, size: 256, elements: !818)
!817 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!818 = !{!819, !833, !834, !835}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !816, file: !817, line: 76, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !817, line: 68, baseType: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !817, line: 63, size: 320, elements: !823)
!823 = !{!824, !826, !827, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !822, file: !817, line: 64, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !822, file: !817, line: 65, baseType: !825, size: 64, offset: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !822, file: !817, line: 66, baseType: !7, size: 32, offset: 128)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !822, file: !817, line: 67, baseType: !829, size: 128, offset: 192)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 128, elements: !831)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !817, line: 29, baseType: !788)
!831 = !{!832}
!832 = !DISubrange(count: 2)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !816, file: !817, line: 77, baseType: !820, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !816, file: !817, line: 78, baseType: !7, size: 32, offset: 128)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !816, file: !817, line: 79, baseType: !836, size: 64, offset: 192)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !817, line: 49, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !817, line: 45, size: 832, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !838, file: !817, line: 46, baseType: !825, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !838, file: !817, line: 47, baseType: !815, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !838, file: !817, line: 48, baseType: !843, size: 704, offset: 128)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !844, line: 164, size: 704, elements: !845)
!844 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!845 = !{!846, !848, !858, !859, !860, !861, !862, !863, !867, !871, !872, !873, !874}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !843, file: !844, line: 166, baseType: !847, size: 64)
!847 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !843, file: !844, line: 167, baseType: !849, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !844, line: 157, size: 192, elements: !851)
!851 = !{!852, !853, !854}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !850, file: !844, line: 159, baseType: !768, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !850, file: !844, line: 160, baseType: !849, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !850, file: !844, line: 161, baseType: !855, size: 32, offset: 128)
!855 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 32, elements: !856)
!856 = !{!857}
!857 = !DISubrange(count: 4)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !843, file: !844, line: 168, baseType: !768, size: 64, offset: 128)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !843, file: !844, line: 169, baseType: !768, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !843, file: !844, line: 170, baseType: !768, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !843, file: !844, line: 171, baseType: !847, size: 64, offset: 320)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !843, file: !844, line: 172, baseType: !766, size: 32, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !843, file: !844, line: 176, baseType: !864, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{!849, !770, !847}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !843, file: !844, line: 177, baseType: !868, size: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DISubroutineType(types: !870)
!870 = !{null, !770, !849}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !843, file: !844, line: 178, baseType: !770, size: 64, offset: 576)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !843, file: !844, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !843, file: !844, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !843, file: !844, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !809, file: !810, line: 831, baseType: !813, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !809, file: !810, line: 834, baseType: !813, size: 64, offset: 128)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !809, file: !810, line: 835, baseType: !813, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !814, line: 111, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !882)
!882 = !{!883, !1849, !1850, !1851, !1854, !1858, !1859, !1860, !1878, !1879, !1880, !1881, !1882, !1883}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !881, file: !135, line: 219, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !886)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !887)
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !886, file: !135, line: 151, baseType: !889, size: 128)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !890, file: !135, line: 150, baseType: !7, size: 32)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !890, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !890, file: !135, line: 150, baseType: !895, size: 64, offset: 64)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !896, size: 64, elements: !786)
!896 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !814, line: 108, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !899)
!899 = !{!900, !901, !902, !1841, !1842, !1843, !1844, !1845, !1846, !1847}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !898, file: !135, line: 124, baseType: !880, size: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !898, file: !135, line: 125, baseType: !880, size: 64, offset: 64)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !898, file: !135, line: 131, baseType: !903, size: 64, offset: 128)
!903 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !904)
!904 = !{!905, !909}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !903, file: !135, line: 129, baseType: !906, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !814, line: 66, baseType: !907)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !814, line: 65, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !903, file: !135, line: 130, baseType: !910, size: 64)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !814, line: 50, baseType: !911)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !913)
!913 = !{!914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !912, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !912, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !912, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !912, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !912, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !912, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !912, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !912, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !912, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !912, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !912, file: !378, line: 321, baseType: !925, size: 320, offset: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !926)
!926 = !{!927, !1776, !1778, !1839, !1840}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !925, file: !378, line: 316, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 64, elements: !786)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !944, !945, !957, !960, !961, !1754, !1755, !1766, !1773}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !930, file: !378, line: 168, baseType: !766, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !930, file: !378, line: 169, baseType: !7, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !930, file: !378, line: 170, baseType: !771, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !930, file: !378, line: 171, baseType: !910, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !930, file: !378, line: 172, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !814, line: 53, baseType: !938)
!938 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !939, size: 64)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !939, file: !378, line: 360, baseType: !766, size: 32)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !939, file: !378, line: 361, baseType: !943, size: 64, offset: 64)
!943 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 64, elements: !786)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !930, file: !378, line: 173, baseType: !5, size: 32)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !930, file: !378, line: 174, baseType: !946, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !948)
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !947, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !947, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !947, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !947, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !947, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !947, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !947, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !947, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !930, file: !378, line: 175, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !378, line: 175, flags: DIFlagFwdDecl)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !930, file: !378, line: 176, baseType: !815, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !930, file: !378, line: 177, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !814, line: 56, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !965)
!965 = !{!966, !999, !1005, !1016, !1035, !1046, !1051, !1057, !1063, !1076, !1088, !1126, !1131, !1159, !1167, !1168, !1173, !1182, !1188, !1193, !1197, !1201, !1378, !1427, !1433, !1440, !1447, !1473, !1498, !1515, !1527, !1549, !1564, !1736}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !964, file: !151, line: 3372, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !967, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !967, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !967, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !967, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !967, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !967, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !967, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !967, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !967, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !967, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !967, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !967, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !967, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !967, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !967, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !967, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !967, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !967, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !967, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !967, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !967, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !967, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !967, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !967, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !967, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !967, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !967, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !967, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !967, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !967, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !151, line: 3373, baseType: !1000, size: 192)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !1001)
!1001 = !{!1002, !1003, !1004}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1000, file: !151, line: 403, baseType: !967, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1000, file: !151, line: 404, baseType: !962, size: 64, offset: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1000, file: !151, line: 405, baseType: !962, size: 64, offset: 128)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !964, file: !151, line: 3374, baseType: !1006, size: 320)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1006, file: !151, line: 1385, baseType: !1000, size: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1006, file: !151, line: 1386, baseType: !1010, size: 128, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1011, line: 58, baseType: !1012)
!1011 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1011, line: 54, size: 128, elements: !1013)
!1013 = !{!1014, !1015}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1012, file: !1011, line: 56, baseType: !788, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1012, file: !1011, line: 57, baseType: !847, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !964, file: !151, line: 3375, baseType: !1017, size: 256)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1017, file: !151, line: 1398, baseType: !1000, size: 192)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1017, file: !151, line: 1399, baseType: !1021, size: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1023, line: 52, size: 256, elements: !1024)
!1023 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1022, file: !1023, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1022, file: !1023, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1022, file: !1023, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1022, file: !1023, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1022, file: !1023, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1022, file: !1023, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1022, file: !1023, line: 62, baseType: !1032, size: 192, offset: 64)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !788, size: 192, elements: !1033)
!1033 = !{!1034}
!1034 = !DISubrange(count: 3)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !964, file: !151, line: 3376, baseType: !1036, size: 256)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !1037)
!1037 = !{!1038, !1039}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1036, file: !151, line: 1409, baseType: !1000, size: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1036, file: !151, line: 1410, baseType: !1040, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1042, line: 27, size: 192, elements: !1043)
!1042 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1041, file: !1042, line: 29, baseType: !1010, size: 128)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1041, file: !1042, line: 30, baseType: !5, size: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !964, file: !151, line: 3377, baseType: !1047, size: 256)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1047, file: !151, line: 1438, baseType: !1000, size: 192)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1047, file: !151, line: 1439, baseType: !962, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !964, file: !151, line: 3378, baseType: !1052, size: 256)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !1053)
!1053 = !{!1054, !1055, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1052, file: !151, line: 1419, baseType: !1000, size: 192)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1052, file: !151, line: 1420, baseType: !766, size: 32, offset: 192)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1052, file: !151, line: 1421, baseType: !785, size: 8, offset: 224)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !964, file: !151, line: 3379, baseType: !1058, size: 320)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1058, file: !151, line: 1429, baseType: !1000, size: 192)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1058, file: !151, line: 1430, baseType: !962, size: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1058, file: !151, line: 1431, baseType: !962, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !964, file: !151, line: 3380, baseType: !1064, size: 320)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1064, file: !151, line: 1461, baseType: !1000, size: 192)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1064, file: !151, line: 1462, baseType: !1068, size: 128, offset: 192)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1069, line: 31, size: 128, elements: !1070)
!1069 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1070 = !{!1071, !1074, !1075}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1068, file: !1069, line: 32, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !765)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1068, file: !1069, line: 33, baseType: !7, size: 32, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1068, file: !1069, line: 34, baseType: !7, size: 32, offset: 96)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !964, file: !151, line: 3381, baseType: !1077, size: 384)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !1078)
!1078 = !{!1079, !1080, !1085, !1086, !1087}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1077, file: !151, line: 2508, baseType: !1000, size: 192)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1077, file: !151, line: 2509, baseType: !1081, size: 32, offset: 192)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1082, line: 58, baseType: !1083)
!1082 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1084, line: 44, baseType: !7)
!1084 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1077, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1077, file: !151, line: 2511, baseType: !962, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1077, file: !151, line: 2512, baseType: !962, size: 64, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !964, file: !151, line: 3382, baseType: !1089, size: 896)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1089, file: !151, line: 2653, baseType: !1077, size: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !151, line: 2654, baseType: !962, size: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1089, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1089, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1089, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1089, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1089, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1089, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1089, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1089, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1089, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1089, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1089, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1089, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1089, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1089, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1089, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1089, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1089, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1089, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1089, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1089, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1089, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1089, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1089, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1089, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1089, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1089, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1089, file: !151, line: 2705, baseType: !962, size: 64, offset: 576)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1089, file: !151, line: 2706, baseType: !962, size: 64, offset: 640)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1089, file: !151, line: 2707, baseType: !962, size: 64, offset: 704)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1089, file: !151, line: 2708, baseType: !962, size: 64, offset: 768)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1089, file: !151, line: 2711, baseType: !1124, size: 64, offset: 832)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !964, file: !151, line: 3383, baseType: !1127, size: 960)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !151, line: 2757, baseType: !1089, size: 896)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1127, file: !151, line: 2758, baseType: !910, size: 64, offset: 896)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !964, file: !151, line: 3384, baseType: !1132, size: 1472)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1133)
!1133 = !{!1134, !1155, !1156, !1157, !1158}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1132, file: !151, line: 3115, baseType: !1135, size: 1216)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1136)
!1136 = !{!1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !151, line: 2985, baseType: !1127, size: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1135, file: !151, line: 2986, baseType: !962, size: 64, offset: 960)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1135, file: !151, line: 2987, baseType: !962, size: 64, offset: 1024)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1135, file: !151, line: 2988, baseType: !962, size: 64, offset: 1088)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1135, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1135, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1135, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1135, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1135, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1135, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1135, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1135, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1135, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1135, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1135, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1135, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1135, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1135, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1132, file: !151, line: 3117, baseType: !962, size: 64, offset: 1216)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1132, file: !151, line: 3119, baseType: !962, size: 64, offset: 1280)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1132, file: !151, line: 3121, baseType: !962, size: 64, offset: 1344)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1132, file: !151, line: 3123, baseType: !962, size: 64, offset: 1408)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !964, file: !151, line: 3385, baseType: !1160, size: 1088)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1161)
!1161 = !{!1162, !1163, !1164}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1160, file: !151, line: 2875, baseType: !1127, size: 960)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1160, file: !151, line: 2876, baseType: !910, size: 64, offset: 960)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1160, file: !151, line: 2877, baseType: !1165, size: 64, offset: 1024)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !964, file: !151, line: 3386, baseType: !1135, size: 1216)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !964, file: !151, line: 3387, baseType: !1169, size: 1280)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1170)
!1170 = !{!1171, !1172}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1169, file: !151, line: 3094, baseType: !1135, size: 1216)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1169, file: !151, line: 3095, baseType: !1165, size: 64, offset: 1216)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !964, file: !151, line: 3388, baseType: !1174, size: 1216)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1175)
!1175 = !{!1176, !1177, !1178, !1179, !1180, !1181}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1174, file: !151, line: 2825, baseType: !1089, size: 896)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1174, file: !151, line: 2827, baseType: !962, size: 64, offset: 896)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1174, file: !151, line: 2828, baseType: !962, size: 64, offset: 960)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1174, file: !151, line: 2829, baseType: !962, size: 64, offset: 1024)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1174, file: !151, line: 2830, baseType: !962, size: 64, offset: 1088)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1174, file: !151, line: 2831, baseType: !962, size: 64, offset: 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !964, file: !151, line: 3389, baseType: !1183, size: 1024)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1184)
!1184 = !{!1185, !1186, !1187}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1183, file: !151, line: 2851, baseType: !1127, size: 960)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1183, file: !151, line: 2852, baseType: !766, size: 32, offset: 960)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1183, file: !151, line: 2853, baseType: !766, size: 32, offset: 992)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !964, file: !151, line: 3390, baseType: !1189, size: 1024)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1190)
!1190 = !{!1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1189, file: !151, line: 2858, baseType: !1127, size: 960)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1189, file: !151, line: 2859, baseType: !1165, size: 64, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !964, file: !151, line: 3391, baseType: !1194, size: 960)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1195)
!1195 = !{!1196}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1194, file: !151, line: 2863, baseType: !1127, size: 960)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !964, file: !151, line: 3392, baseType: !1198, size: 1472)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1199)
!1199 = !{!1200}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1198, file: !151, line: 3305, baseType: !1132, size: 1472)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !964, file: !151, line: 3393, baseType: !1202, size: 1792)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1203)
!1203 = !{!1204, !1205, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1202, file: !151, line: 3249, baseType: !1132, size: 1472)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1202, file: !151, line: 3251, baseType: !1206, size: 64, offset: 1472)
!1206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1207, size: 64)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1208, line: 463, size: 1152, elements: !1209)
!1208 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1209 = !{!1210, !1213, !1243, !1244, !1247, !1250, !1302, !1303, !1304, !1305, !1306, !1330, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1207, file: !1208, line: 464, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1208, line: 464, flags: DIFlagFwdDecl)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1207, file: !1208, line: 467, baseType: !1214, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1232, !1233, !1234, !1235, !1236, !1237, !1239, !1241, !1242}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1215, file: !135, line: 377, baseType: !879, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1215, file: !135, line: 378, baseType: !879, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1215, file: !135, line: 381, baseType: !1220, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1223)
!1223 = !{!1224}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1222, file: !135, line: 282, baseType: !1225, size: 128)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1226)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1227)
!1227 = !{!1228, !1229, !1230}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1226, file: !135, line: 281, baseType: !7, size: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1226, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1226, file: !135, line: 281, baseType: !1231, size: 64, offset: 64)
!1231 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 64, elements: !786)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1215, file: !135, line: 384, baseType: !766, size: 32, offset: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1215, file: !135, line: 387, baseType: !766, size: 32, offset: 224)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1215, file: !135, line: 390, baseType: !766, size: 32, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1215, file: !135, line: 394, baseType: !1220, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1215, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1215, file: !135, line: 399, baseType: !1238, size: 64, offset: 416)
!1238 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !831)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1215, file: !135, line: 402, baseType: !1240, size: 64, offset: 480)
!1240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !831)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1215, file: !135, line: 406, baseType: !766, size: 32, offset: 544)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1215, file: !135, line: 409, baseType: !766, size: 32, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1207, file: !1208, line: 470, baseType: !907, size: 64, offset: 128)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1207, file: !1208, line: 473, baseType: !1245, size: 64, offset: 192)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1208, line: 166, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1207, file: !1208, line: 476, baseType: !1248, size: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1208, line: 476, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1207, file: !1208, line: 479, baseType: !1251, size: 64, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1252, line: 144, baseType: !1253)
!1252 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1252, line: 100, size: 896, elements: !1255)
!1255 = !{!1256, !1264, !1269, !1274, !1276, !1279, !1280, !1281, !1282, !1283, !1288, !1290, !1291, !1296, !1301}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1254, file: !1252, line: 102, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1252, line: 52, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!1261, !1262}
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1252, line: 47, baseType: !7)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1254, file: !1252, line: 105, baseType: !1265, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1252, line: 59, baseType: !1266)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DISubroutineType(types: !1268)
!1268 = !{!766, !1262, !1262}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1254, file: !1252, line: 108, baseType: !1270, size: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1252, line: 63, baseType: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{null, !770}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1254, file: !1252, line: 111, baseType: !1275, size: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1254, file: !1252, line: 114, baseType: !1277, size: 64, offset: 256)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1278, line: 46, baseType: !788)
!1278 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1254, file: !1252, line: 117, baseType: !1277, size: 64, offset: 320)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1254, file: !1252, line: 120, baseType: !1277, size: 64, offset: 384)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1254, file: !1252, line: 124, baseType: !7, size: 32, offset: 448)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1254, file: !1252, line: 128, baseType: !7, size: 32, offset: 480)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1254, file: !1252, line: 131, baseType: !1284, size: 64, offset: 512)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1252, line: 75, baseType: !1285)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DISubroutineType(types: !1287)
!1287 = !{!770, !1277, !1277}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1254, file: !1252, line: 132, baseType: !1289, size: 64, offset: 576)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1252, line: 78, baseType: !1271)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1254, file: !1252, line: 135, baseType: !770, size: 64, offset: 640)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1254, file: !1252, line: 136, baseType: !1292, size: 64, offset: 704)
!1292 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1252, line: 82, baseType: !1293)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DISubroutineType(types: !1295)
!1295 = !{!770, !770, !1277, !1277}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1254, file: !1252, line: 137, baseType: !1297, size: 64, offset: 768)
!1297 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1252, line: 83, baseType: !1298)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DISubroutineType(types: !1300)
!1300 = !{null, !770, !770}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1254, file: !1252, line: 141, baseType: !7, size: 32, offset: 832)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1207, file: !1208, line: 484, baseType: !962, size: 64, offset: 384)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1207, file: !1208, line: 488, baseType: !962, size: 64, offset: 448)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1207, file: !1208, line: 493, baseType: !962, size: 64, offset: 512)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1207, file: !1208, line: 496, baseType: !962, size: 64, offset: 576)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1207, file: !1208, line: 501, baseType: !1307, size: 64, offset: 640)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1309)
!1309 = !{!1310, !1313, !1314, !1315, !1316, !1318, !1319, !1324, !1325, !1326, !1327, !1328, !1329}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1308, file: !146, line: 2356, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1308, file: !146, line: 2357, baseType: !771, size: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1308, file: !146, line: 2358, baseType: !766, size: 32, offset: 128)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1308, file: !146, line: 2359, baseType: !766, size: 32, offset: 160)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1308, file: !146, line: 2360, baseType: !1317, size: 128, offset: 192)
!1317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !766, size: 128, elements: !856)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1308, file: !146, line: 2364, baseType: !766, size: 32, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1308, file: !146, line: 2367, baseType: !1320, size: 128, offset: 384)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1321)
!1321 = !{!1322, !1323}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1320, file: !146, line: 2351, baseType: !910, size: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1320, file: !146, line: 2352, baseType: !847, size: 64, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1308, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1308, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1308, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1308, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1308, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1308, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1207, file: !1208, line: 504, baseType: !1331, size: 64, offset: 704)
!1331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1332, size: 64)
!1332 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1208, line: 504, flags: DIFlagFwdDecl)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1207, file: !1208, line: 507, baseType: !1251, size: 64, offset: 768)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1207, file: !1208, line: 510, baseType: !766, size: 32, offset: 832)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1207, file: !1208, line: 513, baseType: !766, size: 32, offset: 864)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1207, file: !1208, line: 516, baseType: !1081, size: 32, offset: 896)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1207, file: !1208, line: 519, baseType: !1081, size: 32, offset: 928)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1207, file: !1208, line: 522, baseType: !7, size: 32, offset: 960)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1207, file: !1208, line: 523, baseType: !7, size: 32, offset: 992)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1207, file: !1208, line: 528, baseType: !771, size: 64, offset: 1024)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1207, file: !1208, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1207, file: !1208, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1207, file: !1208, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1207, file: !1208, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1207, file: !1208, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1207, file: !1208, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1207, file: !1208, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1207, file: !1208, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1207, file: !1208, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1207, file: !1208, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1207, file: !1208, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1207, file: !1208, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1207, file: !1208, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1207, file: !1208, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1207, file: !1208, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1207, file: !1208, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1202, file: !151, line: 3254, baseType: !962, size: 64, offset: 1536)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1202, file: !151, line: 3257, baseType: !962, size: 64, offset: 1600)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1202, file: !151, line: 3258, baseType: !962, size: 64, offset: 1664)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1202, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1202, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1202, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1202, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1202, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1202, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1202, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1202, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1202, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1202, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1202, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1202, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1202, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1202, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1202, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1202, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1202, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1202, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !964, file: !151, line: 3394, baseType: !1379, size: 1344)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1380)
!1380 = !{!1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1406, !1407, !1408, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1379, file: !151, line: 2280, baseType: !1000, size: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1379, file: !151, line: 2281, baseType: !962, size: 64, offset: 192)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1379, file: !151, line: 2282, baseType: !962, size: 64, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1379, file: !151, line: 2283, baseType: !962, size: 64, offset: 320)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1379, file: !151, line: 2284, baseType: !962, size: 64, offset: 384)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1379, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1379, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1379, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1379, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1379, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1379, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1379, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1379, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1379, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1379, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1379, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1379, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1379, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1379, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1379, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1379, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1379, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1379, file: !151, line: 2306, baseType: !1404, size: 32, offset: 544)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1405, line: 31, baseType: !766)
!1405 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1379, file: !151, line: 2307, baseType: !962, size: 64, offset: 576)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1379, file: !151, line: 2308, baseType: !962, size: 64, offset: 640)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1379, file: !151, line: 2314, baseType: !1409, size: 64, offset: 704)
!1409 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1410)
!1410 = !{!1411, !1412, !1413}
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1409, file: !151, line: 2310, baseType: !766, size: 32)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1409, file: !151, line: 2311, baseType: !771, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1409, file: !151, line: 2312, baseType: !1414, size: 64)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1379, file: !151, line: 2315, baseType: !962, size: 64, offset: 768)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1379, file: !151, line: 2316, baseType: !962, size: 64, offset: 832)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1379, file: !151, line: 2317, baseType: !962, size: 64, offset: 896)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1379, file: !151, line: 2318, baseType: !962, size: 64, offset: 960)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1379, file: !151, line: 2319, baseType: !962, size: 64, offset: 1024)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1379, file: !151, line: 2320, baseType: !962, size: 64, offset: 1088)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1379, file: !151, line: 2321, baseType: !962, size: 64, offset: 1152)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1379, file: !151, line: 2322, baseType: !962, size: 64, offset: 1216)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1379, file: !151, line: 2324, baseType: !1425, size: 64, offset: 1280)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !964, file: !151, line: 3395, baseType: !1428, size: 320)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1429)
!1429 = !{!1430, !1431, !1432}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1428, file: !151, line: 1470, baseType: !1000, size: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1428, file: !151, line: 1471, baseType: !962, size: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1428, file: !151, line: 1472, baseType: !962, size: 64, offset: 256)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !964, file: !151, line: 3396, baseType: !1434, size: 320)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1435)
!1435 = !{!1436, !1437, !1438}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1434, file: !151, line: 1483, baseType: !1000, size: 192)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1434, file: !151, line: 1484, baseType: !766, size: 32, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1434, file: !151, line: 1485, baseType: !1439, size: 64, offset: 256)
!1439 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 64, elements: !786)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !964, file: !151, line: 3397, baseType: !1441, size: 384)
!1441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1442)
!1442 = !{!1443, !1444, !1445, !1446}
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1441, file: !151, line: 1830, baseType: !1000, size: 192)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1441, file: !151, line: 1831, baseType: !1081, size: 32, offset: 192)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1441, file: !151, line: 1832, baseType: !962, size: 64, offset: 256)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1441, file: !151, line: 1835, baseType: !1439, size: 64, offset: 320)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !964, file: !151, line: 3398, baseType: !1448, size: 704)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1456, !1457, !1460}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1448, file: !151, line: 1899, baseType: !1000, size: 192)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1448, file: !151, line: 1902, baseType: !962, size: 64, offset: 192)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1448, file: !151, line: 1905, baseType: !1453, size: 64, offset: 256)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !814, line: 58, baseType: !1454)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1455, size: 64)
!1455 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !814, line: 57, flags: DIFlagFwdDecl)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1448, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1448, file: !151, line: 1911, baseType: !1458, size: 64, offset: 384)
!1458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1459, size: 64)
!1459 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1448, file: !151, line: 1914, baseType: !1461, size: 256, offset: 448)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1462)
!1462 = !{!1463, !1465, !1466, !1471}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1461, file: !151, line: 1884, baseType: !1464, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1461, file: !151, line: 1885, baseType: !1464, size: 64, offset: 64)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1461, file: !151, line: 1891, baseType: !1467, size: 64, offset: 128)
!1467 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1461, file: !151, line: 1891, size: 64, elements: !1468)
!1468 = !{!1469, !1470}
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1467, file: !151, line: 1891, baseType: !1453, size: 64)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1467, file: !151, line: 1891, baseType: !962, size: 64)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1461, file: !151, line: 1892, baseType: !1472, size: 64, offset: 192)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !964, file: !151, line: 3399, baseType: !1474, size: 704)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1475)
!1475 = !{!1476, !1477, !1478, !1479, !1480, !1481, !1493, !1494, !1495, !1496, !1497}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1474, file: !151, line: 2009, baseType: !1000, size: 192)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1474, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1474, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1474, file: !151, line: 2014, baseType: !1081, size: 32, offset: 224)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1474, file: !151, line: 2016, baseType: !962, size: 64, offset: 256)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1474, file: !151, line: 2017, baseType: !1482, size: 64, offset: 320)
!1482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1483, size: 64)
!1483 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1484)
!1484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1485)
!1485 = !{!1486}
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1484, file: !151, line: 183, baseType: !1487, size: 128)
!1487 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1488)
!1488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1489)
!1489 = !{!1490, !1491, !1492}
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1488, file: !151, line: 182, baseType: !7, size: 32)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1488, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1488, file: !151, line: 182, baseType: !1439, size: 64, offset: 64)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1474, file: !151, line: 2019, baseType: !962, size: 64, offset: 384)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1474, file: !151, line: 2020, baseType: !962, size: 64, offset: 448)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1474, file: !151, line: 2021, baseType: !962, size: 64, offset: 512)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1474, file: !151, line: 2022, baseType: !962, size: 64, offset: 576)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1474, file: !151, line: 2023, baseType: !962, size: 64, offset: 640)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !964, file: !151, line: 3400, baseType: !1499, size: 832)
!1499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1500)
!1500 = !{!1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510}
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1499, file: !151, line: 2431, baseType: !1000, size: 192)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1499, file: !151, line: 2433, baseType: !962, size: 64, offset: 192)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1499, file: !151, line: 2434, baseType: !962, size: 64, offset: 256)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1499, file: !151, line: 2435, baseType: !962, size: 64, offset: 320)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1499, file: !151, line: 2436, baseType: !962, size: 64, offset: 384)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1499, file: !151, line: 2437, baseType: !1482, size: 64, offset: 448)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1499, file: !151, line: 2438, baseType: !962, size: 64, offset: 512)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1499, file: !151, line: 2440, baseType: !962, size: 64, offset: 576)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1499, file: !151, line: 2441, baseType: !962, size: 64, offset: 640)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1499, file: !151, line: 2443, baseType: !1511, size: 128, offset: 704)
!1511 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !151, line: 182, baseType: !1512)
!1512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !151, line: 182, size: 128, elements: !1513)
!1513 = !{!1514}
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1512, file: !151, line: 182, baseType: !1487, size: 128)
