; ModuleID = 'regcprop.bc'
source_filename = "regcprop.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!675 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!676 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!677 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!678 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!679 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!680 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!681 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!682 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!683 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!684 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!685 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!686 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!687 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!688 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!689 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!690 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!691 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!692 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!693 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!694 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!695 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!696 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!697 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!698 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!700 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!701 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!702 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!703 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !146, line: 1188, baseType: !7, size: 32, elements: !704)
!704 = !{!705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!705 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!706 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!707 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!708 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!709 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!710 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!711 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!712 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!713 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!714 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!715 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!716 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!717 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!718 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!719 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!720 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!721 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!722 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!723 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!724 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!725 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!726 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!727 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!728 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!729 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!730 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!731 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!732 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!733 = !{!734, !735, !736, !737, !740, !741, !743, !7, !746, !745, !560, !5, !762, !1838, !757}
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!736 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !739)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !744, line: 42, baseType: !745)
!744 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!745 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "value_data", file: !3, line: 75, size: 10240, elements: !748)
!748 = !{!749, !1836, !1837}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !747, file: !3, line: 77, baseType: !750, size: 10176)
!750 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 10176, elements: !1834)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "value_data_entry", file: !3, line: 67, size: 192, elements: !752)
!752 = !{!753, !754, !755, !756}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !751, file: !3, line: 69, baseType: !5, size: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "oldest_regno", scope: !751, file: !3, line: 70, baseType: !7, size: 32, offset: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "next_regno", scope: !751, file: !3, line: 71, baseType: !7, size: 32, offset: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "debug_insn_changes", scope: !751, file: !3, line: 72, baseType: !757, size: 64, offset: 128)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "queued_debug_insn_change", file: !3, line: 53, size: 256, elements: !759)
!759 = !{!760, !761, !1831, !1833}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !758, file: !3, line: 55, baseType: !757, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !758, file: !3, line: 56, baseType: !762, size: 64, offset: 64)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !763, line: 50, baseType: !764)
!763 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !766)
!766 = !{!767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !765, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !765, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !765, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !765, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !765, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !765, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !765, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !765, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !765, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !765, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !765, file: !561, line: 321, baseType: !778, size: 320, offset: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !779)
!779 = !{!780, !1766, !1768, !1829, !1830}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !778, file: !561, line: 316, baseType: !781, size: 64)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 64, elements: !797)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !783)
!783 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !784)
!784 = !{!785, !786, !787, !788, !789, !799, !800, !812, !815, !876, !1744, !1745, !1756, !1763}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !783, file: !561, line: 168, baseType: !736, size: 32)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !783, file: !561, line: 169, baseType: !7, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !783, file: !561, line: 170, baseType: !741, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !783, file: !561, line: 171, baseType: !762, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !783, file: !561, line: 172, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !763, line: 53, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !792, file: !561, line: 360, baseType: !736, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !792, file: !561, line: 361, baseType: !796, size: 64, offset: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 64, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 1)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !783, file: !561, line: 173, baseType: !5, size: 32)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !783, file: !561, line: 174, baseType: !801, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !802)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !803)
!803 = !{!804, !805, !806, !807, !808, !809, !810, !811}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !802, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !802, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !802, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !802, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !802, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !802, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !802, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !802, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !783, file: !561, line: 175, baseType: !813, size: 64)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !783, file: !561, line: 176, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !818, line: 75, size: 256, elements: !819)
!818 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!819 = !{!820, !834, !835, !836}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !817, file: !818, line: 76, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !818, line: 68, baseType: !823)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !818, line: 63, size: 320, elements: !824)
!824 = !{!825, !827, !828, !829}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !823, file: !818, line: 64, baseType: !826, size: 64)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !823, file: !818, line: 65, baseType: !826, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !823, file: !818, line: 66, baseType: !7, size: 32, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !823, file: !818, line: 67, baseType: !830, size: 128, offset: 192)
!830 = !DICompositeType(tag: DW_TAG_array_type, baseType: !831, size: 128, elements: !832)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !818, line: 29, baseType: !745)
!832 = !{!833}
!833 = !DISubrange(count: 2)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !817, file: !818, line: 77, baseType: !821, size: 64, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !817, file: !818, line: 78, baseType: !7, size: 32, offset: 128)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !817, file: !818, line: 79, baseType: !837, size: 64, offset: 192)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !818, line: 49, baseType: !839)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !818, line: 45, size: 832, elements: !840)
!840 = !{!841, !842, !843}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !839, file: !818, line: 46, baseType: !826, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !839, file: !818, line: 47, baseType: !816, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !839, file: !818, line: 48, baseType: !844, size: 704, offset: 128)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !845, line: 164, size: 704, elements: !846)
!845 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!846 = !{!847, !849, !859, !860, !861, !862, !863, !864, !868, !872, !873, !874, !875}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !844, file: !845, line: 166, baseType: !848, size: 64)
!848 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !844, file: !845, line: 167, baseType: !850, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !845, line: 157, size: 192, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !851, file: !845, line: 159, baseType: !738, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !851, file: !845, line: 160, baseType: !850, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !851, file: !845, line: 161, baseType: !856, size: 32, offset: 128)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 32, elements: !857)
!857 = !{!858}
!858 = !DISubrange(count: 4)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !844, file: !845, line: 168, baseType: !738, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !844, file: !845, line: 169, baseType: !738, size: 64, offset: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !844, file: !845, line: 170, baseType: !738, size: 64, offset: 256)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !844, file: !845, line: 171, baseType: !848, size: 64, offset: 320)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !844, file: !845, line: 172, baseType: !736, size: 32, offset: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !844, file: !845, line: 176, baseType: !865, size: 64, offset: 448)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!850, !740, !848}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !844, file: !845, line: 177, baseType: !869, size: 64, offset: 512)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !740, !850}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !844, file: !845, line: 178, baseType: !740, size: 64, offset: 576)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !844, file: !845, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !844, file: !845, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !844, file: !845, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !783, file: !561, line: 177, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !763, line: 56, baseType: !878)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !880)
!880 = !{!881, !914, !920, !931, !950, !961, !966, !973, !979, !992, !1004, !1042, !1047, !1075, !1083, !1084, !1089, !1098, !1104, !1109, !1113, !1117, !1368, !1417, !1423, !1430, !1437, !1463, !1488, !1505, !1517, !1539, !1554, !1726}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !879, file: !151, line: 3372, baseType: !882, size: 64)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !882, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !882, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !882, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !882, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !882, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !882, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !882, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !882, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !882, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !882, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !882, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !882, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !882, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !882, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !882, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !882, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !882, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !882, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !882, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !882, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !882, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !882, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !882, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !882, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !882, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !882, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !882, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !882, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !882, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !882, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !879, file: !151, line: 3373, baseType: !915, size: 192)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !916)
!916 = !{!917, !918, !919}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !915, file: !151, line: 403, baseType: !882, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !915, file: !151, line: 404, baseType: !877, size: 64, offset: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !915, file: !151, line: 405, baseType: !877, size: 64, offset: 128)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !879, file: !151, line: 3374, baseType: !921, size: 320)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !921, file: !151, line: 1385, baseType: !915, size: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !921, file: !151, line: 1386, baseType: !925, size: 128, offset: 192)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !926, line: 58, baseType: !927)
!926 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !926, line: 54, size: 128, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !927, file: !926, line: 56, baseType: !745, size: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !927, file: !926, line: 57, baseType: !848, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !879, file: !151, line: 3375, baseType: !932, size: 256)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !933)
!933 = !{!934, !935}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !932, file: !151, line: 1398, baseType: !915, size: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !932, file: !151, line: 1399, baseType: !936, size: 64, offset: 192)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !938, line: 52, size: 256, elements: !939)
!938 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!939 = !{!940, !941, !942, !943, !944, !945, !946}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !937, file: !938, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !937, file: !938, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !937, file: !938, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !937, file: !938, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !937, file: !938, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !937, file: !938, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !937, file: !938, line: 62, baseType: !947, size: 192, offset: 64)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 192, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 3)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !879, file: !151, line: 3376, baseType: !951, size: 256)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !151, line: 1409, baseType: !915, size: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !951, file: !151, line: 1410, baseType: !955, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !957, line: 27, size: 192, elements: !958)
!957 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !956, file: !957, line: 29, baseType: !925, size: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !956, file: !957, line: 30, baseType: !5, size: 32, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !879, file: !151, line: 3377, baseType: !962, size: 256)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !963)
!963 = !{!964, !965}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !151, line: 1438, baseType: !915, size: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !962, file: !151, line: 1439, baseType: !877, size: 64, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !879, file: !151, line: 3378, baseType: !967, size: 256)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !968)
!968 = !{!969, !970, !971}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !151, line: 1419, baseType: !915, size: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !967, file: !151, line: 1420, baseType: !736, size: 32, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !967, file: !151, line: 1421, baseType: !972, size: 8, offset: 224)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !739, size: 8, elements: !797)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !879, file: !151, line: 3379, baseType: !974, size: 320)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !975)
!975 = !{!976, !977, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !974, file: !151, line: 1429, baseType: !915, size: 192)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !974, file: !151, line: 1430, baseType: !877, size: 64, offset: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !974, file: !151, line: 1431, baseType: !877, size: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !879, file: !151, line: 3380, baseType: !980, size: 320)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !981)
!981 = !{!982, !983}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !980, file: !151, line: 1461, baseType: !915, size: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !980, file: !151, line: 1462, baseType: !984, size: 128, offset: 192)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !985, line: 31, size: 128, elements: !986)
!985 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!986 = !{!987, !990, !991}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !984, file: !985, line: 32, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !735)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !984, file: !985, line: 33, baseType: !7, size: 32, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !984, file: !985, line: 34, baseType: !7, size: 32, offset: 96)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !879, file: !151, line: 3381, baseType: !993, size: 384)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !994)
!994 = !{!995, !996, !1001, !1002, !1003}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !993, file: !151, line: 2508, baseType: !915, size: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !993, file: !151, line: 2509, baseType: !997, size: 32, offset: 192)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !998, line: 58, baseType: !999)
!998 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1000, line: 44, baseType: !7)
!1000 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !993, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !993, file: !151, line: 2511, baseType: !877, size: 64, offset: 256)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !993, file: !151, line: 2512, baseType: !877, size: 64, offset: 320)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !879, file: !151, line: 3382, baseType: !1005, size: 896)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1005, file: !151, line: 2653, baseType: !993, size: 384)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1005, file: !151, line: 2654, baseType: !877, size: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1005, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1005, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1005, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1005, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1005, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1005, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1005, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1005, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1005, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1005, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1005, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1005, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1005, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1005, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1005, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1005, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1005, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1005, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1005, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1005, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1005, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1005, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1005, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1005, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1005, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1005, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1005, file: !151, line: 2705, baseType: !877, size: 64, offset: 576)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1005, file: !151, line: 2706, baseType: !877, size: 64, offset: 640)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1005, file: !151, line: 2707, baseType: !877, size: 64, offset: 704)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1005, file: !151, line: 2708, baseType: !877, size: 64, offset: 768)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1005, file: !151, line: 2711, baseType: !1040, size: 64, offset: 832)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !879, file: !151, line: 3383, baseType: !1043, size: 960)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1043, file: !151, line: 2757, baseType: !1005, size: 896)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1043, file: !151, line: 2758, baseType: !762, size: 64, offset: 896)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !879, file: !151, line: 3384, baseType: !1048, size: 1472)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1049)
!1049 = !{!1050, !1071, !1072, !1073, !1074}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1048, file: !151, line: 3115, baseType: !1051, size: 1216)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065, !1066, !1067, !1068, !1069, !1070}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1051, file: !151, line: 2985, baseType: !1043, size: 960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1051, file: !151, line: 2986, baseType: !877, size: 64, offset: 960)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1051, file: !151, line: 2987, baseType: !877, size: 64, offset: 1024)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1051, file: !151, line: 2988, baseType: !877, size: 64, offset: 1088)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1051, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1051, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1051, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1051, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1051, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1051, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1051, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1051, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1051, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1051, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1051, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1051, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1051, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1051, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1048, file: !151, line: 3117, baseType: !877, size: 64, offset: 1216)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1048, file: !151, line: 3119, baseType: !877, size: 64, offset: 1280)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1048, file: !151, line: 3121, baseType: !877, size: 64, offset: 1344)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1048, file: !151, line: 3123, baseType: !877, size: 64, offset: 1408)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !879, file: !151, line: 3385, baseType: !1076, size: 1088)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1077)
!1077 = !{!1078, !1079, !1080}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1076, file: !151, line: 2875, baseType: !1043, size: 960)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1076, file: !151, line: 2876, baseType: !762, size: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1076, file: !151, line: 2877, baseType: !1081, size: 64, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !879, file: !151, line: 3386, baseType: !1051, size: 1216)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !879, file: !151, line: 3387, baseType: !1085, size: 1280)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !151, line: 3094, baseType: !1051, size: 1216)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1085, file: !151, line: 3095, baseType: !1081, size: 64, offset: 1216)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !879, file: !151, line: 3388, baseType: !1090, size: 1216)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !151, line: 2825, baseType: !1005, size: 896)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1090, file: !151, line: 2827, baseType: !877, size: 64, offset: 896)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1090, file: !151, line: 2828, baseType: !877, size: 64, offset: 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1090, file: !151, line: 2829, baseType: !877, size: 64, offset: 1024)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1090, file: !151, line: 2830, baseType: !877, size: 64, offset: 1088)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1090, file: !151, line: 2831, baseType: !877, size: 64, offset: 1152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !879, file: !151, line: 3389, baseType: !1099, size: 1024)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1100)
!1100 = !{!1101, !1102, !1103}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1099, file: !151, line: 2851, baseType: !1043, size: 960)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1099, file: !151, line: 2852, baseType: !736, size: 32, offset: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1099, file: !151, line: 2853, baseType: !736, size: 32, offset: 992)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !879, file: !151, line: 3390, baseType: !1105, size: 1024)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !151, line: 2858, baseType: !1043, size: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1105, file: !151, line: 2859, baseType: !1081, size: 64, offset: 960)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !879, file: !151, line: 3391, baseType: !1110, size: 960)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1111)
!1111 = !{!1112}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !151, line: 2863, baseType: !1043, size: 960)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !879, file: !151, line: 3392, baseType: !1114, size: 1472)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1115)
!1115 = !{!1116}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !151, line: 3305, baseType: !1048, size: 1472)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !879, file: !151, line: 3393, baseType: !1118, size: 1792)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1119)
!1119 = !{!1120, !1121, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !151, line: 3249, baseType: !1048, size: 1472)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1118, file: !151, line: 3251, baseType: !1122, size: 64, offset: 1472)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1124, line: 463, size: 1152, elements: !1125)
!1124 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1125 = !{!1126, !1129, !1233, !1234, !1237, !1240, !1292, !1293, !1294, !1295, !1296, !1320, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1123, file: !1124, line: 464, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1124, line: 464, flags: DIFlagFwdDecl)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1123, file: !1124, line: 467, baseType: !1130, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1132)
!1132 = !{!1133, !1208, !1209, !1222, !1223, !1224, !1225, !1226, !1227, !1229, !1231, !1232}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1131, file: !135, line: 377, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !763, line: 111, baseType: !1135)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !1137)
!1137 = !{!1138, !1173, !1174, !1175, !1178, !1182, !1183, !1184, !1202, !1203, !1204, !1205, !1206, !1207}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1136, file: !135, line: 219, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !1141)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !1142)
!1142 = !{!1143}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1141, file: !135, line: 151, baseType: !1144, size: 128)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !1146)
!1146 = !{!1147, !1148, !1149}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1145, file: !135, line: 150, baseType: !7, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1145, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1145, file: !135, line: 150, baseType: !1150, size: 64, offset: 64)
!1150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1151, size: 64, elements: !797)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !763, line: 108, baseType: !1152)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1165, !1166, !1167, !1168, !1169, !1170, !1171}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1153, file: !135, line: 124, baseType: !1135, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1153, file: !135, line: 125, baseType: !1135, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1153, file: !135, line: 131, baseType: !1158, size: 64, offset: 128)
!1158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !1159)
!1159 = !{!1160, !1164}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1158, file: !135, line: 129, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !763, line: 66, baseType: !1162)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !763, line: 65, flags: DIFlagFwdDecl)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1158, file: !135, line: 130, baseType: !762, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1153, file: !135, line: 134, baseType: !740, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1153, file: !135, line: 137, baseType: !877, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1153, file: !135, line: 138, baseType: !997, size: 32, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1153, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1153, file: !135, line: 144, baseType: !736, size: 32, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1153, file: !135, line: 145, baseType: !736, size: 32, offset: 416)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1153, file: !135, line: 146, baseType: !1172, size: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !848)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1136, file: !135, line: 220, baseType: !1139, size: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1136, file: !135, line: 223, baseType: !740, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1136, file: !135, line: 226, baseType: !1176, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1136, file: !135, line: 229, baseType: !1179, size: 128, offset: 256)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1180, size: 128, elements: !832)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1136, file: !135, line: 232, baseType: !1135, size: 64, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1136, file: !135, line: 233, baseType: !1135, size: 64, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1136, file: !135, line: 238, baseType: !1185, size: 64, offset: 512)
!1185 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1186)
!1186 = !{!1187, !1193}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1185, file: !135, line: 236, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1190)
!1190 = !{!1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1189, file: !135, line: 275, baseType: !1161, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1189, file: !135, line: 278, baseType: !1161, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1185, file: !135, line: 237, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1195, file: !135, line: 261, baseType: !762, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1195, file: !135, line: 262, baseType: !762, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1195, file: !135, line: 266, baseType: !762, size: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1195, file: !135, line: 267, baseType: !762, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1195, file: !135, line: 270, baseType: !736, size: 32, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1136, file: !135, line: 241, baseType: !1172, size: 64, offset: 576)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1136, file: !135, line: 244, baseType: !736, size: 32, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1136, file: !135, line: 247, baseType: !736, size: 32, offset: 672)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1136, file: !135, line: 250, baseType: !736, size: 32, offset: 704)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1136, file: !135, line: 253, baseType: !736, size: 32, offset: 736)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1136, file: !135, line: 256, baseType: !736, size: 32, offset: 768)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1131, file: !135, line: 378, baseType: !1134, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1131, file: !135, line: 381, baseType: !1210, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1212, file: !135, line: 282, baseType: !1215, size: 128)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1216, file: !135, line: 281, baseType: !7, size: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1216, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1216, file: !135, line: 281, baseType: !1221, size: 64, offset: 64)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1134, size: 64, elements: !797)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1131, file: !135, line: 384, baseType: !736, size: 32, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1131, file: !135, line: 387, baseType: !736, size: 32, offset: 224)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1131, file: !135, line: 390, baseType: !736, size: 32, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1131, file: !135, line: 394, baseType: !1210, size: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1131, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1131, file: !135, line: 399, baseType: !1228, size: 64, offset: 416)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !832)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1131, file: !135, line: 402, baseType: !1230, size: 64, offset: 480)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !832)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1131, file: !135, line: 406, baseType: !736, size: 32, offset: 544)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1131, file: !135, line: 409, baseType: !736, size: 32, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1123, file: !1124, line: 470, baseType: !1162, size: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1123, file: !1124, line: 473, baseType: !1235, size: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1124, line: 166, flags: DIFlagFwdDecl)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1123, file: !1124, line: 476, baseType: !1238, size: 64, offset: 256)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1124, line: 476, flags: DIFlagFwdDecl)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1123, file: !1124, line: 479, baseType: !1241, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1242, line: 144, baseType: !1243)
!1242 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1242, line: 100, size: 896, elements: !1245)
!1245 = !{!1246, !1254, !1259, !1264, !1266, !1269, !1270, !1271, !1272, !1273, !1278, !1280, !1281, !1286, !1291}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1244, file: !1242, line: 102, baseType: !1247, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1242, line: 52, baseType: !1248)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DISubroutineType(types: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1242, line: 47, baseType: !7)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1244, file: !1242, line: 105, baseType: !1255, size: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1242, line: 59, baseType: !1256)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = !DISubroutineType(types: !1258)
!1258 = !{!736, !1252, !1252}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1244, file: !1242, line: 108, baseType: !1260, size: 64, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1242, line: 63, baseType: !1261)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = !DISubroutineType(types: !1263)
!1263 = !{null, !740}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1244, file: !1242, line: 111, baseType: !1265, size: 64, offset: 192)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1244, file: !1242, line: 114, baseType: !1267, size: 64, offset: 256)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1268, line: 46, baseType: !745)
!1268 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1244, file: !1242, line: 117, baseType: !1267, size: 64, offset: 320)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1244, file: !1242, line: 120, baseType: !1267, size: 64, offset: 384)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1244, file: !1242, line: 124, baseType: !7, size: 32, offset: 448)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1244, file: !1242, line: 128, baseType: !7, size: 32, offset: 480)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1244, file: !1242, line: 131, baseType: !1274, size: 64, offset: 512)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1242, line: 75, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!740, !1267, !1267}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1244, file: !1242, line: 132, baseType: !1279, size: 64, offset: 576)
!1279 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1242, line: 78, baseType: !1261)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1244, file: !1242, line: 135, baseType: !740, size: 64, offset: 640)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1244, file: !1242, line: 136, baseType: !1282, size: 64, offset: 704)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1242, line: 82, baseType: !1283)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DISubroutineType(types: !1285)
!1285 = !{!740, !740, !1267, !1267}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1244, file: !1242, line: 137, baseType: !1287, size: 64, offset: 768)
!1287 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1242, line: 83, baseType: !1288)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DISubroutineType(types: !1290)
!1290 = !{null, !740, !740}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1244, file: !1242, line: 141, baseType: !7, size: 32, offset: 832)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1123, file: !1124, line: 484, baseType: !877, size: 64, offset: 384)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1123, file: !1124, line: 488, baseType: !877, size: 64, offset: 448)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1123, file: !1124, line: 493, baseType: !877, size: 64, offset: 512)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1123, file: !1124, line: 496, baseType: !877, size: 64, offset: 576)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1123, file: !1124, line: 501, baseType: !1297, size: 64, offset: 640)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1299)
!1299 = !{!1300, !1303, !1304, !1305, !1306, !1308, !1309, !1314, !1315, !1316, !1317, !1318, !1319}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1298, file: !146, line: 2356, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1298, file: !146, line: 2357, baseType: !741, size: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1298, file: !146, line: 2358, baseType: !736, size: 32, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1298, file: !146, line: 2359, baseType: !736, size: 32, offset: 160)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1298, file: !146, line: 2360, baseType: !1307, size: 128, offset: 192)
!1307 = !DICompositeType(tag: DW_TAG_array_type, baseType: !736, size: 128, elements: !857)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1298, file: !146, line: 2364, baseType: !736, size: 32, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1298, file: !146, line: 2367, baseType: !1310, size: 128, offset: 384)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1311)
!1311 = !{!1312, !1313}
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1310, file: !146, line: 2351, baseType: !762, size: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1310, file: !146, line: 2352, baseType: !848, size: 64, offset: 64)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1298, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1298, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1298, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1298, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1298, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1298, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1123, file: !1124, line: 504, baseType: !1321, size: 64, offset: 704)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1124, line: 504, flags: DIFlagFwdDecl)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1123, file: !1124, line: 507, baseType: !1241, size: 64, offset: 768)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1123, file: !1124, line: 510, baseType: !736, size: 32, offset: 832)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1123, file: !1124, line: 513, baseType: !736, size: 32, offset: 864)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1123, file: !1124, line: 516, baseType: !997, size: 32, offset: 896)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1123, file: !1124, line: 519, baseType: !997, size: 32, offset: 928)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1123, file: !1124, line: 522, baseType: !7, size: 32, offset: 960)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1123, file: !1124, line: 523, baseType: !7, size: 32, offset: 992)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1123, file: !1124, line: 528, baseType: !741, size: 64, offset: 1024)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1123, file: !1124, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1123, file: !1124, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1123, file: !1124, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1123, file: !1124, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1123, file: !1124, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1123, file: !1124, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1123, file: !1124, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1123, file: !1124, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1123, file: !1124, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1123, file: !1124, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1123, file: !1124, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1123, file: !1124, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1123, file: !1124, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1123, file: !1124, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1123, file: !1124, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1123, file: !1124, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1118, file: !151, line: 3254, baseType: !877, size: 64, offset: 1536)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1118, file: !151, line: 3257, baseType: !877, size: 64, offset: 1600)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1118, file: !151, line: 3258, baseType: !877, size: 64, offset: 1664)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1118, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1118, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1118, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1118, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1118, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1118, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1118, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1118, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1118, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1118, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1118, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1118, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1118, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1118, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1118, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1118, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1118, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1118, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !879, file: !151, line: 3394, baseType: !1369, size: 1344)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1370)
!1370 = !{!1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1396, !1397, !1398, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1369, file: !151, line: 2280, baseType: !915, size: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1369, file: !151, line: 2281, baseType: !877, size: 64, offset: 192)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1369, file: !151, line: 2282, baseType: !877, size: 64, offset: 256)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1369, file: !151, line: 2283, baseType: !877, size: 64, offset: 320)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1369, file: !151, line: 2284, baseType: !877, size: 64, offset: 384)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1369, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1369, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1369, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1369, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1369, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1369, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1369, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1369, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1369, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1369, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1369, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1369, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1369, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1369, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1369, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1369, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1369, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1369, file: !151, line: 2306, baseType: !1394, size: 32, offset: 544)
!1394 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1395, line: 31, baseType: !736)
!1395 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1369, file: !151, line: 2307, baseType: !877, size: 64, offset: 576)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1369, file: !151, line: 2308, baseType: !877, size: 64, offset: 640)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1369, file: !151, line: 2314, baseType: !1399, size: 64, offset: 704)
!1399 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1400)
!1400 = !{!1401, !1402, !1403}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1399, file: !151, line: 2310, baseType: !736, size: 32)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1399, file: !151, line: 2311, baseType: !741, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1399, file: !151, line: 2312, baseType: !1404, size: 64)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1369, file: !151, line: 2315, baseType: !877, size: 64, offset: 768)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1369, file: !151, line: 2316, baseType: !877, size: 64, offset: 832)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1369, file: !151, line: 2317, baseType: !877, size: 64, offset: 896)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1369, file: !151, line: 2318, baseType: !877, size: 64, offset: 960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1369, file: !151, line: 2319, baseType: !877, size: 64, offset: 1024)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1369, file: !151, line: 2320, baseType: !877, size: 64, offset: 1088)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1369, file: !151, line: 2321, baseType: !877, size: 64, offset: 1152)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1369, file: !151, line: 2322, baseType: !877, size: 64, offset: 1216)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1369, file: !151, line: 2324, baseType: !1415, size: 64, offset: 1280)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !879, file: !151, line: 3395, baseType: !1418, size: 320)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1419)
!1419 = !{!1420, !1421, !1422}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1418, file: !151, line: 1470, baseType: !915, size: 192)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1418, file: !151, line: 1471, baseType: !877, size: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1418, file: !151, line: 1472, baseType: !877, size: 64, offset: 256)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !879, file: !151, line: 3396, baseType: !1424, size: 320)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1425)
!1425 = !{!1426, !1427, !1428}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1424, file: !151, line: 1483, baseType: !915, size: 192)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1424, file: !151, line: 1484, baseType: !736, size: 32, offset: 192)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1424, file: !151, line: 1485, baseType: !1429, size: 64, offset: 256)
!1429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 64, elements: !797)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !879, file: !151, line: 3397, baseType: !1431, size: 384)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1432)
!1432 = !{!1433, !1434, !1435, !1436}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1431, file: !151, line: 1830, baseType: !915, size: 192)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1431, file: !151, line: 1831, baseType: !997, size: 32, offset: 192)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1431, file: !151, line: 1832, baseType: !877, size: 64, offset: 256)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1431, file: !151, line: 1835, baseType: !1429, size: 64, offset: 320)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !879, file: !151, line: 3398, baseType: !1438, size: 704)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1439)
!1439 = !{!1440, !1441, !1442, !1446, !1447, !1450}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1438, file: !151, line: 1899, baseType: !915, size: 192)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1438, file: !151, line: 1902, baseType: !877, size: 64, offset: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1438, file: !151, line: 1905, baseType: !1443, size: 64, offset: 256)
!1443 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !763, line: 58, baseType: !1444)
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !763, line: 57, flags: DIFlagFwdDecl)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1438, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1438, file: !151, line: 1911, baseType: !1448, size: 64, offset: 384)
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1449 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1438, file: !151, line: 1914, baseType: !1451, size: 256, offset: 448)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1452)
!1452 = !{!1453, !1455, !1456, !1461}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1451, file: !151, line: 1884, baseType: !1454, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1451, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1451, file: !151, line: 1885, baseType: !1454, size: 64, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1451, file: !151, line: 1891, baseType: !1457, size: 64, offset: 128)
!1457 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1451, file: !151, line: 1891, size: 64, elements: !1458)
!1458 = !{!1459, !1460}
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1457, file: !151, line: 1891, baseType: !1443, size: 64)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1457, file: !151, line: 1891, baseType: !877, size: 64)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1451, file: !151, line: 1892, baseType: !1462, size: 64, offset: 192)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !879, file: !151, line: 3399, baseType: !1464, size: 704)
!1464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1465)
!1465 = !{!1466, !1467, !1468, !1469, !1470, !1471, !1483, !1484, !1485, !1486, !1487}
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1464, file: !151, line: 2009, baseType: !915, size: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1464, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1464, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1464, file: !151, line: 2014, baseType: !997, size: 32, offset: 224)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1464, file: !151, line: 2016, baseType: !877, size: 64, offset: 256)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1464, file: !151, line: 2017, baseType: !1472, size: 64, offset: 320)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1475)
!1475 = !{!1476}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1474, file: !151, line: 183, baseType: !1477, size: 128)
!1477 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1478)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1479)
!1479 = !{!1480, !1481, !1482}
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1478, file: !151, line: 182, baseType: !7, size: 32)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1478, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1478, file: !151, line: 182, baseType: !1429, size: 64, offset: 64)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1464, file: !151, line: 2019, baseType: !877, size: 64, offset: 384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1464, file: !151, line: 2020, baseType: !877, size: 64, offset: 448)
