; ModuleID = 'reginfo.bc'
source_filename = "reginfo.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }

!698 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!699 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!700 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!701 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!702 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!703 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!704 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!705 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!706 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!707 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!708 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!709 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!710 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!711 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!712 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!713 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!714 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!715 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!716 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!717 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!718 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!719 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!720 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!721 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!722 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!723 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!724 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!725 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!726 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!727 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!728 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!729 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!730 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!731 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!732 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!733 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!734 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!735 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!736 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!737 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!738 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!739 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!740 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!741 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!742 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!743 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!744 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!745 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!746 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!747 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!748 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!749 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!750 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!751 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!752 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!753 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!754 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!755 = !{!756, !757, !758, !759, !762, !763, !765, !7, !134, !768, !767, !165, !5, !772, !775, !777, !612, !783, !791}
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!758 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !761)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !766, line: 42, baseType: !767)
!766 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!767 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "move_table", file: !770, line: 269, baseType: !771)
!770 = !DIFile(filename: "./regs.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!771 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 432, elements: !773)
!772 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!773 = !{!774}
!774 = !DISubrange(count: 27)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_pref", file: !3, line: 883, size: 24, elements: !779)
!779 = !{!780, !781, !782}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "prefclass", scope: !778, file: !3, line: 887, baseType: !761, size: 8)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "altclass", scope: !778, file: !3, line: 896, baseType: !761, size: 8, offset: 8)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "coverclass", scope: !778, file: !3, line: 900, baseType: !761, size: 8, offset: 16)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "subregs_of_mode_node", file: !3, line: 1243, size: 736, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !784, file: !3, line: 1245, baseType: !7, size: 32)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "modes", scope: !784, file: !3, line: 1246, baseType: !788, size: 696, offset: 32)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 696, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 87)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !784)
!793 = !{!0, !794, !799, !802, !831, !845, !873, !893, !895, !898, !900, !902, !904, !906, !908, !910, !973, !976, !979, !982, !985, !987, !989, !992, !994, !998, !1001, !1003, !1005, !1007, !2013, !2017, !2019, !2021, !2023, !2025, !2027, !2029, !2034, !2037, !2039, !2041}
!794 = !DIGlobalVariableExpression(var: !795, expr: !DIExpression())
!795 = distinct !DIGlobalVariable(name: "reg_names", scope: !2, file: !3, line: 169, type: !796, isLocal: false, isDefinition: true)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 3392, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 53)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "reg_class_names", scope: !2, file: !3, line: 172, type: !801, isLocal: false, isDefinition: true)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !763, size: 1728, elements: !773)
!802 = !DIGlobalVariableExpression(var: !803, expr: !DIExpression())
!803 = distinct !DIGlobalVariable(name: "last_move_cost", scope: !804, file: !3, line: 264, type: !829, isLocal: true, isDefinition: true)
!804 = distinct !DISubprogram(name: "init_move_cost", scope: !3, file: !3, line: 262, type: !805, scopeLine: 263, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!805 = !DISubroutineType(types: !806)
!806 = !{null, !5}
!807 = !{!808, !809, !810, !811, !812, !819, !826, !828}
!808 = !DILocalVariable(name: "m", arg: 1, scope: !804, file: !3, line: 262, type: !5)
!809 = !DILocalVariable(name: "all_match", scope: !804, file: !3, line: 265, type: !757)
!810 = !DILocalVariable(name: "i", scope: !804, file: !3, line: 266, type: !7)
!811 = !DILocalVariable(name: "j", scope: !804, file: !3, line: 266, type: !7)
!812 = !DILocalVariable(name: "cost", scope: !813, file: !3, line: 273, type: !758)
!813 = distinct !DILexicalBlock(scope: !814, file: !3, line: 272, column: 2)
!814 = distinct !DILexicalBlock(scope: !815, file: !3, line: 271, column: 7)
!815 = distinct !DILexicalBlock(scope: !816, file: !3, line: 271, column: 7)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 270, column: 9)
!817 = distinct !DILexicalBlock(scope: !818, file: !3, line: 269, column: 3)
!818 = distinct !DILexicalBlock(scope: !804, file: !3, line: 269, column: 3)
!819 = !DILocalVariable(name: "cost", scope: !820, file: !3, line: 303, type: !758)
!820 = distinct !DILexicalBlock(scope: !821, file: !3, line: 302, column: 2)
!821 = distinct !DILexicalBlock(scope: !822, file: !3, line: 301, column: 7)
!822 = distinct !DILexicalBlock(scope: !823, file: !3, line: 301, column: 7)
!823 = distinct !DILexicalBlock(scope: !824, file: !3, line: 300, column: 9)
!824 = distinct !DILexicalBlock(scope: !825, file: !3, line: 299, column: 3)
!825 = distinct !DILexicalBlock(scope: !804, file: !3, line: 299, column: 3)
!826 = !DILocalVariable(name: "p1", scope: !820, file: !3, line: 304, type: !827)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!828 = !DILocalVariable(name: "p2", scope: !820, file: !3, line: 304, type: !827)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !772, size: 11664, elements: !830)
!830 = !{!774, !774}
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "what_option", scope: !833, file: !3, line: 815, type: !841, isLocal: true, isDefinition: true)
!833 = distinct !DISubprogram(name: "fix_register", scope: !3, file: !3, line: 797, type: !834, scopeLine: 798, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !836)
!834 = !DISubroutineType(types: !835)
!835 = !{null, !763, !758, !758}
!836 = !{!837, !838, !839, !840}
!837 = !DILocalVariable(name: "name", arg: 1, scope: !833, file: !3, line: 797, type: !763)
!838 = !DILocalVariable(name: "fixed", arg: 2, scope: !833, file: !3, line: 797, type: !758)
!839 = !DILocalVariable(name: "call_used", arg: 3, scope: !833, file: !3, line: 797, type: !758)
!840 = !DILocalVariable(name: "i", scope: !833, file: !3, line: 799, type: !758)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !842, size: 256, elements: !843)
!842 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !763)
!843 = !{!844, !844}
!844 = !DISubrange(count: 2)
!845 = !DIGlobalVariableExpression(var: !846, expr: !DIExpression())
!846 = distinct !DIGlobalVariable(name: "pass_reginfo_init", scope: !2, file: !3, line: 1013, type: !847, isLocal: false, isDefinition: true)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_opt_pass", file: !430, line: 162, size: 640, elements: !848)
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !847, file: !430, line: 164, baseType: !850, size: 640)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opt_pass", file: !430, line: 114, size: 640, elements: !851)
!851 = !{!852, !853, !854, !858, !862, !864, !865, !866, !868, !869, !870, !871, !872}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !850, file: !430, line: 117, baseType: !429, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !850, file: !430, line: 121, baseType: !763, size: 64, offset: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gate", scope: !850, file: !430, line: 125, baseType: !855, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!757}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !850, file: !430, line: 130, baseType: !859, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!7}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !850, file: !430, line: 133, baseType: !863, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !850, file: !430, line: 136, baseType: !863, size: 64, offset: 320)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "static_pass_number", scope: !850, file: !430, line: 139, baseType: !758, size: 32, offset: 384)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "tv_id", scope: !850, file: !430, line: 143, baseType: !867, size: 32, offset: 416)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "timevar_id_t", file: !437, line: 80, baseType: !436)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "properties_required", scope: !850, file: !430, line: 146, baseType: !7, size: 32, offset: 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "properties_provided", scope: !850, file: !430, line: 147, baseType: !7, size: 32, offset: 480)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "properties_destroyed", scope: !850, file: !430, line: 148, baseType: !7, size: 32, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_start", scope: !850, file: !430, line: 151, baseType: !7, size: 32, offset: 544)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_finish", scope: !850, file: !430, line: 152, baseType: !7, size: 32, offset: 576)
!873 = !DIGlobalVariableExpression(var: !874, expr: !DIExpression())
!874 = distinct !DIGlobalVariable(name: "gt_ggc_r_gt_reginfo_h", scope: !2, file: !875, line: 24, type: !876, isLocal: false, isDefinition: true)
!875 = !DIFile(filename: "./gt-reginfo.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!876 = !DICompositeType(tag: DW_TAG_array_type, baseType: !877, size: 640, elements: !892)
!877 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !878)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_root_tab", file: !879, line: 69, size: 320, elements: !880)
!879 = !DIFile(filename: "./ggc.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!880 = !{!881, !882, !885, !886, !891}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !878, file: !879, line: 70, baseType: !762, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nelt", scope: !878, file: !879, line: 71, baseType: !883, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !884, line: 46, baseType: !767)
!884 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!885 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !878, file: !879, line: 72, baseType: !883, size: 64, offset: 128)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !878, file: !879, line: 73, baseType: !887, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "gt_pointer_walker", file: !879, line: 65, baseType: !888)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{null, !762}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pchw", scope: !878, file: !879, line: 74, baseType: !887, size: 64, offset: 256)
!892 = !{!844}
!893 = !DIGlobalVariableExpression(var: !894, expr: !DIExpression())
!894 = distinct !DIGlobalVariable(name: "max_regno", scope: !2, file: !3, line: 59, type: !758, isLocal: false, isDefinition: true)
!895 = !DIGlobalVariableExpression(var: !896, expr: !DIExpression())
!896 = distinct !DIGlobalVariable(name: "fixed_regs", scope: !2, file: !3, line: 68, type: !897, isLocal: false, isDefinition: true)
!897 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 424, elements: !797)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "fixed_reg_set", scope: !2, file: !3, line: 71, type: !765, isLocal: false, isDefinition: true)
!900 = !DIGlobalVariableExpression(var: !901, expr: !DIExpression())
!901 = distinct !DIGlobalVariable(name: "call_used_regs", scope: !2, file: !3, line: 81, type: !897, isLocal: false, isDefinition: true)
!902 = !DIGlobalVariableExpression(var: !903, expr: !DIExpression())
!903 = distinct !DIGlobalVariable(name: "call_used_reg_set", scope: !2, file: !3, line: 84, type: !765, isLocal: false, isDefinition: true)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(name: "call_fixed_reg_set", scope: !2, file: !3, line: 109, type: !765, isLocal: false, isDefinition: true)
!906 = !DIGlobalVariableExpression(var: !907, expr: !DIExpression())
!907 = distinct !DIGlobalVariable(name: "global_regs", scope: !2, file: !3, line: 115, type: !897, isLocal: false, isDefinition: true)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(name: "regs_invalidated_by_call", scope: !2, file: !3, line: 123, type: !765, isLocal: false, isDefinition: true)
!910 = !DIGlobalVariableExpression(var: !911, expr: !DIExpression())
!911 = distinct !DIGlobalVariable(name: "regs_invalidated_by_call_regset", scope: !2, file: !3, line: 127, type: !912, isLocal: false, isDefinition: true)
!912 = !DIDerivedType(tag: DW_TAG_typedef, name: "regset", file: !188, line: 37, baseType: !913)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !914, line: 47, baseType: !915)
!914 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !917, line: 75, size: 256, elements: !918)
!917 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!918 = !{!919, !931, !932, !933}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !916, file: !917, line: 76, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !917, line: 68, baseType: !922)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !917, line: 63, size: 320, elements: !923)
!923 = !{!924, !926, !927, !928}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !922, file: !917, line: 64, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !922, file: !917, line: 65, baseType: !925, size: 64, offset: 64)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !922, file: !917, line: 66, baseType: !7, size: 32, offset: 128)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !922, file: !917, line: 67, baseType: !929, size: 128, offset: 192)
!929 = !DICompositeType(tag: DW_TAG_array_type, baseType: !930, size: 128, elements: !892)
!930 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !917, line: 29, baseType: !767)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !916, file: !917, line: 77, baseType: !920, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !916, file: !917, line: 78, baseType: !7, size: 32, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !916, file: !917, line: 79, baseType: !934, size: 64, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !917, line: 49, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !917, line: 45, size: 832, elements: !937)
!937 = !{!938, !939, !940}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !936, file: !917, line: 46, baseType: !925, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !936, file: !917, line: 47, baseType: !915, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !936, file: !917, line: 48, baseType: !941, size: 704, offset: 128)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !942, line: 164, size: 704, elements: !943)
!942 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!943 = !{!944, !946, !956, !957, !958, !959, !960, !961, !965, !969, !970, !971, !972}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !941, file: !942, line: 166, baseType: !945, size: 64)
!945 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !941, file: !942, line: 167, baseType: !947, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !942, line: 157, size: 192, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !948, file: !942, line: 159, baseType: !760, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !948, file: !942, line: 160, baseType: !947, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !948, file: !942, line: 161, baseType: !953, size: 32, offset: 128)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 32, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 4)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !941, file: !942, line: 168, baseType: !760, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !941, file: !942, line: 169, baseType: !760, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !941, file: !942, line: 170, baseType: !760, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !941, file: !942, line: 171, baseType: !945, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !941, file: !942, line: 172, baseType: !758, size: 32, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !941, file: !942, line: 176, baseType: !962, size: 64, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!947, !762, !945}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !941, file: !942, line: 177, baseType: !966, size: 64, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !762, !947}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !941, file: !942, line: 178, baseType: !762, size: 64, offset: 576)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !941, file: !942, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !941, file: !942, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !941, file: !942, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!973 = !DIGlobalVariableExpression(var: !974, expr: !DIExpression())
!974 = distinct !DIGlobalVariable(name: "inv_reg_alloc_order", scope: !2, file: !3, line: 138, type: !975, isLocal: false, isDefinition: true)
!975 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 1696, elements: !797)
!976 = !DIGlobalVariableExpression(var: !977, expr: !DIExpression())
!977 = distinct !DIGlobalVariable(name: "reg_class_contents", scope: !2, file: !3, line: 142, type: !978, isLocal: false, isDefinition: true)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 1728, elements: !773)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(name: "reg_class_size", scope: !2, file: !3, line: 155, type: !981, isLocal: false, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 864, elements: !773)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "reg_class_subclasses", scope: !2, file: !3, line: 158, type: !984, isLocal: false, isDefinition: true)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !134, size: 23328, elements: !830)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(name: "reg_class_subunion", scope: !2, file: !3, line: 162, type: !984, isLocal: false, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "reg_class_superunion", scope: !2, file: !3, line: 166, type: !984, isLocal: false, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(name: "reg_raw_mode", scope: !2, file: !3, line: 178, type: !991, isLocal: false, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 1696, elements: !797)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "have_regs_of_mode", scope: !2, file: !3, line: 181, type: !788, isLocal: false, isDefinition: true)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(name: "contains_reg_of_mode", scope: !2, file: !3, line: 184, type: !996, isLocal: false, isDefinition: true)
!996 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 18792, elements: !997)
!997 = !{!774, !790}
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "move_cost", scope: !2, file: !3, line: 188, type: !1000, isLocal: false, isDefinition: true)
!1000 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 5568, elements: !789)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "may_move_in_cost", scope: !2, file: !3, line: 192, type: !1000, isLocal: false, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(name: "may_move_out_cost", scope: !2, file: !3, line: 196, type: !1000, isLocal: false, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(name: "last_mode_for_init_move_cost", scope: !2, file: !3, line: 199, type: !758, isLocal: true, isDefinition: true)
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "top_of_stack", scope: !2, file: !3, line: 202, type: !1009, isLocal: true, isDefinition: true)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 5568, elements: !789)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !914, line: 50, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !613, line: 240, size: 384, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1012, file: !613, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1012, file: !613, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1012, file: !613, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1012, file: !613, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1012, file: !613, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1012, file: !613, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1012, file: !613, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1012, file: !613, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1012, file: !613, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1012, file: !613, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1012, file: !613, line: 321, baseType: !1025, size: 320, offset: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !613, line: 315, size: 320, elements: !1026)
!1026 = !{!1027, !1948, !1950, !2011, !2012}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1025, file: !613, line: 316, baseType: !1028, size: 64)
!1028 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 64, elements: !1044)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !613, line: 183, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !613, line: 166, size: 64, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1046, !1047, !1059, !1062, !1063, !1926, !1927, !1938, !1945}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1030, file: !613, line: 168, baseType: !758, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1030, file: !613, line: 169, baseType: !7, size: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1030, file: !613, line: 170, baseType: !763, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1030, file: !613, line: 171, baseType: !1010, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1030, file: !613, line: 172, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !914, line: 53, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !613, line: 359, size: 128, elements: !1040)
!1040 = !{!1041, !1042}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1039, file: !613, line: 360, baseType: !758, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1039, file: !613, line: 361, baseType: !1043, size: 64, offset: 64)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 64, elements: !1044)
!1044 = !{!1045}
!1045 = !DISubrange(count: 1)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1030, file: !613, line: 173, baseType: !5, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1030, file: !613, line: 174, baseType: !1048, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !613, line: 133, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !613, line: 115, size: 32, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1049, file: !613, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1049, file: !613, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1049, file: !613, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1049, file: !613, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1049, file: !613, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1049, file: !613, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1049, file: !613, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1049, file: !613, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1030, file: !613, line: 175, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !613, line: 175, flags: DIFlagFwdDecl)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1030, file: !613, line: 176, baseType: !915, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1030, file: !613, line: 177, baseType: !1064, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !914, line: 56, baseType: !1065)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !203, line: 3371, size: 1792, elements: !1067)
!1067 = !{!1068, !1101, !1107, !1118, !1137, !1148, !1153, !1160, !1166, !1179, !1191, !1229, !1234, !1262, !1270, !1271, !1276, !1285, !1291, !1296, !1300, !1304, !1550, !1599, !1605, !1612, !1619, !1645, !1670, !1687, !1699, !1721, !1736, !1908}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1066, file: !203, line: 3372, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !203, line: 360, size: 64, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1069, file: !203, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1069, file: !203, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1069, file: !203, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1069, file: !203, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1069, file: !203, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1069, file: !203, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1069, file: !203, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1069, file: !203, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1069, file: !203, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1069, file: !203, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1069, file: !203, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1069, file: !203, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1069, file: !203, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1069, file: !203, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1069, file: !203, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1069, file: !203, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1069, file: !203, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1069, file: !203, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1069, file: !203, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1069, file: !203, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1069, file: !203, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1069, file: !203, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1069, file: !203, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1069, file: !203, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1069, file: !203, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1069, file: !203, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1069, file: !203, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1069, file: !203, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1069, file: !203, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1069, file: !203, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1066, file: !203, line: 3373, baseType: !1102, size: 192)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !203, line: 402, size: 192, elements: !1103)
!1103 = !{!1104, !1105, !1106}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1102, file: !203, line: 403, baseType: !1069, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1102, file: !203, line: 404, baseType: !1064, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1102, file: !203, line: 405, baseType: !1064, size: 64, offset: 128)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1066, file: !203, line: 3374, baseType: !1108, size: 320)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !203, line: 1384, size: 320, elements: !1109)
!1109 = !{!1110, !1111}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1108, file: !203, line: 1385, baseType: !1102, size: 192)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1108, file: !203, line: 1386, baseType: !1112, size: 128, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1113, line: 58, baseType: !1114)
!1113 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1113, line: 54, size: 128, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1114, file: !1113, line: 56, baseType: !767, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1114, file: !1113, line: 57, baseType: !945, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1066, file: !203, line: 3375, baseType: !1119, size: 256)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !203, line: 1397, size: 256, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !203, line: 1398, baseType: !1102, size: 192)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1119, file: !203, line: 1399, baseType: !1123, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1125, line: 52, size: 256, elements: !1126)
!1125 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1126 = !{!1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1124, file: !1125, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1124, file: !1125, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1124, file: !1125, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1124, file: !1125, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1124, file: !1125, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1124, file: !1125, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1124, file: !1125, line: 62, baseType: !1134, size: 192, offset: 64)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !767, size: 192, elements: !1135)
!1135 = !{!1136}
!1136 = !DISubrange(count: 3)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1066, file: !203, line: 3376, baseType: !1138, size: 256)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !203, line: 1408, size: 256, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !203, line: 1409, baseType: !1102, size: 192)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1138, file: !203, line: 1410, baseType: !1142, size: 64, offset: 192)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1144, line: 27, size: 192, elements: !1145)
!1144 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1145 = !{!1146, !1147}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1143, file: !1144, line: 29, baseType: !1112, size: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1143, file: !1144, line: 30, baseType: !5, size: 32, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1066, file: !203, line: 3377, baseType: !1149, size: 256)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !203, line: 1437, size: 256, elements: !1150)
!1150 = !{!1151, !1152}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1149, file: !203, line: 1438, baseType: !1102, size: 192)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1149, file: !203, line: 1439, baseType: !1064, size: 64, offset: 192)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1066, file: !203, line: 3378, baseType: !1154, size: 256)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !203, line: 1418, size: 256, elements: !1155)
!1155 = !{!1156, !1157, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !203, line: 1419, baseType: !1102, size: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1154, file: !203, line: 1420, baseType: !758, size: 32, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1154, file: !203, line: 1421, baseType: !1159, size: 8, offset: 224)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 8, elements: !1044)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1066, file: !203, line: 3379, baseType: !1161, size: 320)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !203, line: 1428, size: 320, elements: !1162)
!1162 = !{!1163, !1164, !1165}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1161, file: !203, line: 1429, baseType: !1102, size: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1161, file: !203, line: 1430, baseType: !1064, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1161, file: !203, line: 1431, baseType: !1064, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1066, file: !203, line: 3380, baseType: !1167, size: 320)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !203, line: 1460, size: 320, elements: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !203, line: 1461, baseType: !1102, size: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1167, file: !203, line: 1462, baseType: !1171, size: 128, offset: 192)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1172, line: 31, size: 128, elements: !1173)
!1172 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1173 = !{!1174, !1177, !1178}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1171, file: !1172, line: 32, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !757)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1171, file: !1172, line: 33, baseType: !7, size: 32, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1171, file: !1172, line: 34, baseType: !7, size: 32, offset: 96)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1066, file: !203, line: 3381, baseType: !1180, size: 384)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !203, line: 2507, size: 384, elements: !1181)
!1181 = !{!1182, !1183, !1188, !1189, !1190}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1180, file: !203, line: 2508, baseType: !1102, size: 192)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1180, file: !203, line: 2509, baseType: !1184, size: 32, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1185, line: 58, baseType: !1186)
!1185 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1187, line: 44, baseType: !7)
!1187 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1180, file: !203, line: 2510, baseType: !7, size: 32, offset: 224)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1180, file: !203, line: 2511, baseType: !1064, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1180, file: !203, line: 2512, baseType: !1064, size: 64, offset: 320)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1066, file: !203, line: 3382, baseType: !1192, size: 896)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !203, line: 2652, size: 896, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1192, file: !203, line: 2653, baseType: !1180, size: 384)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1192, file: !203, line: 2654, baseType: !1064, size: 64, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1192, file: !203, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1192, file: !203, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1192, file: !203, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1192, file: !203, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1192, file: !203, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1192, file: !203, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1192, file: !203, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1192, file: !203, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1192, file: !203, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1192, file: !203, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1192, file: !203, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1192, file: !203, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1192, file: !203, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1192, file: !203, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1192, file: !203, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1192, file: !203, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1192, file: !203, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1192, file: !203, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1192, file: !203, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1192, file: !203, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1192, file: !203, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1192, file: !203, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1192, file: !203, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1192, file: !203, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1192, file: !203, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1192, file: !203, line: 2703, baseType: !7, size: 32, offset: 512)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1192, file: !203, line: 2705, baseType: !1064, size: 64, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1192, file: !203, line: 2706, baseType: !1064, size: 64, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1192, file: !203, line: 2707, baseType: !1064, size: 64, offset: 704)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1192, file: !203, line: 2708, baseType: !1064, size: 64, offset: 768)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1192, file: !203, line: 2711, baseType: !1227, size: 64, offset: 832)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !203, line: 2711, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1066, file: !203, line: 3383, baseType: !1230, size: 960)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !203, line: 2756, size: 960, elements: !1231)
!1231 = !{!1232, !1233}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1230, file: !203, line: 2757, baseType: !1192, size: 896)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1230, file: !203, line: 2758, baseType: !1010, size: 64, offset: 896)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1066, file: !203, line: 3384, baseType: !1235, size: 1472)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !203, line: 3114, size: 1472, elements: !1236)
!1236 = !{!1237, !1258, !1259, !1260, !1261}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1235, file: !203, line: 3115, baseType: !1238, size: 1216)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !203, line: 2984, size: 1216, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1238, file: !203, line: 2985, baseType: !1230, size: 960)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1238, file: !203, line: 2986, baseType: !1064, size: 64, offset: 960)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1238, file: !203, line: 2987, baseType: !1064, size: 64, offset: 1024)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1238, file: !203, line: 2988, baseType: !1064, size: 64, offset: 1088)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1238, file: !203, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1238, file: !203, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1238, file: !203, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1238, file: !203, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1238, file: !203, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1238, file: !203, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1238, file: !203, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1238, file: !203, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1238, file: !203, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1238, file: !203, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1238, file: !203, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1238, file: !203, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1238, file: !203, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1238, file: !203, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1235, file: !203, line: 3117, baseType: !1064, size: 64, offset: 1216)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1235, file: !203, line: 3119, baseType: !1064, size: 64, offset: 1280)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1235, file: !203, line: 3121, baseType: !1064, size: 64, offset: 1344)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1235, file: !203, line: 3123, baseType: !1064, size: 64, offset: 1408)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1066, file: !203, line: 3385, baseType: !1263, size: 1088)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !203, line: 2874, size: 1088, elements: !1264)
!1264 = !{!1265, !1266, !1267}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1263, file: !203, line: 2875, baseType: !1230, size: 960)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1263, file: !203, line: 2876, baseType: !1010, size: 64, offset: 960)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1263, file: !203, line: 2877, baseType: !1268, size: 64, offset: 1024)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !203, line: 2856, flags: DIFlagFwdDecl)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1066, file: !203, line: 3386, baseType: !1238, size: 1216)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1066, file: !203, line: 3387, baseType: !1272, size: 1280)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !203, line: 3093, size: 1280, elements: !1273)
!1273 = !{!1274, !1275}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1272, file: !203, line: 3094, baseType: !1238, size: 1216)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1272, file: !203, line: 3095, baseType: !1268, size: 64, offset: 1216)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1066, file: !203, line: 3388, baseType: !1277, size: 1216)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !203, line: 2824, size: 1216, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1283, !1284}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1277, file: !203, line: 2825, baseType: !1192, size: 896)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1277, file: !203, line: 2827, baseType: !1064, size: 64, offset: 896)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1277, file: !203, line: 2828, baseType: !1064, size: 64, offset: 960)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1277, file: !203, line: 2829, baseType: !1064, size: 64, offset: 1024)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1277, file: !203, line: 2830, baseType: !1064, size: 64, offset: 1088)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1277, file: !203, line: 2831, baseType: !1064, size: 64, offset: 1152)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1066, file: !203, line: 3389, baseType: !1286, size: 1024)
!1286 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !203, line: 2850, size: 1024, elements: !1287)
!1287 = !{!1288, !1289, !1290}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1286, file: !203, line: 2851, baseType: !1230, size: 960)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1286, file: !203, line: 2852, baseType: !758, size: 32, offset: 960)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1286, file: !203, line: 2853, baseType: !758, size: 32, offset: 992)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1066, file: !203, line: 3390, baseType: !1292, size: 1024)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !203, line: 2857, size: 1024, elements: !1293)
!1293 = !{!1294, !1295}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1292, file: !203, line: 2858, baseType: !1230, size: 960)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1292, file: !203, line: 2859, baseType: !1268, size: 64, offset: 960)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1066, file: !203, line: 3391, baseType: !1297, size: 960)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !203, line: 2862, size: 960, elements: !1298)
!1298 = !{!1299}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1297, file: !203, line: 2863, baseType: !1230, size: 960)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1066, file: !203, line: 3392, baseType: !1301, size: 1472)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !203, line: 3304, size: 1472, elements: !1302)
!1302 = !{!1303}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1301, file: !203, line: 3305, baseType: !1235, size: 1472)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1066, file: !203, line: 3393, baseType: !1305, size: 1792)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !203, line: 3248, size: 1792, elements: !1306)
!1306 = !{!1307, !1308, !1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1305, file: !203, line: 3249, baseType: !1235, size: 1472)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1305, file: !203, line: 3251, baseType: !1309, size: 64, offset: 1472)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1311, line: 463, size: 1152, elements: !1312)
!1311 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1312 = !{!1313, !1316, !1420, !1421, !1424, !1427, !1474, !1475, !1476, !1477, !1478, !1502, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1520, !1521, !1522, !1523, !1524, !1525, !1526, !1527, !1528}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1310, file: !1311, line: 464, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1311, line: 464, flags: DIFlagFwdDecl)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1310, file: !1311, line: 467, baseType: !1317, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !188, line: 374, size: 640, elements: !1319)
!1319 = !{!1320, !1395, !1396, !1409, !1410, !1411, !1412, !1413, !1414, !1416, !1418, !1419}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1318, file: !188, line: 377, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !914, line: 111, baseType: !1322)
!1322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1323, size: 64)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !188, line: 217, size: 832, elements: !1324)
!1324 = !{!1325, !1360, !1361, !1362, !1365, !1369, !1370, !1371, !1389, !1390, !1391, !1392, !1393, !1394}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1323, file: !188, line: 219, baseType: !1326, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1327, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !188, line: 151, baseType: !1328)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !188, line: 151, size: 128, elements: !1329)
!1329 = !{!1330}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1328, file: !188, line: 151, baseType: !1331, size: 128)
!1331 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !188, line: 150, baseType: !1332)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !188, line: 150, size: 128, elements: !1333)
!1333 = !{!1334, !1335, !1336}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1332, file: !188, line: 150, baseType: !7, size: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1332, file: !188, line: 150, baseType: !7, size: 32, offset: 32)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1332, file: !188, line: 150, baseType: !1337, size: 64, offset: 64)
!1337 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1338, size: 64, elements: !1044)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !914, line: 108, baseType: !1339)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !188, line: 122, size: 512, elements: !1341)
!1341 = !{!1342, !1343, !1344, !1352, !1353, !1354, !1355, !1356, !1357, !1358}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1340, file: !188, line: 124, baseType: !1322, size: 64)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1340, file: !188, line: 125, baseType: !1322, size: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1340, file: !188, line: 131, baseType: !1345, size: 64, offset: 128)
!1345 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !188, line: 128, size: 64, elements: !1346)
!1346 = !{!1347, !1351}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1345, file: !188, line: 129, baseType: !1348, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !914, line: 66, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !914, line: 65, flags: DIFlagFwdDecl)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1345, file: !188, line: 130, baseType: !1010, size: 64)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1340, file: !188, line: 134, baseType: !762, size: 64, offset: 192)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1340, file: !188, line: 137, baseType: !1064, size: 64, offset: 256)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1340, file: !188, line: 138, baseType: !1184, size: 32, offset: 320)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1340, file: !188, line: 142, baseType: !7, size: 32, offset: 352)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1340, file: !188, line: 144, baseType: !758, size: 32, offset: 384)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1340, file: !188, line: 145, baseType: !758, size: 32, offset: 416)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1340, file: !188, line: 146, baseType: !1359, size: 64, offset: 448)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !188, line: 119, baseType: !945)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1323, file: !188, line: 220, baseType: !1326, size: 64, offset: 64)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1323, file: !188, line: 223, baseType: !762, size: 64, offset: 128)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1323, file: !188, line: 226, baseType: !1363, size: 64, offset: 192)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !188, line: 185, flags: DIFlagFwdDecl)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1323, file: !188, line: 229, baseType: !1366, size: 128, offset: 256)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1367, size: 128, elements: !892)
!1367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1368, size: 64)
!1368 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !188, line: 229, flags: DIFlagFwdDecl)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1323, file: !188, line: 232, baseType: !1322, size: 64, offset: 384)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1323, file: !188, line: 233, baseType: !1322, size: 64, offset: 448)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1323, file: !188, line: 238, baseType: !1372, size: 64, offset: 512)
!1372 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !188, line: 235, size: 64, elements: !1373)
!1373 = !{!1374, !1380}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1372, file: !188, line: 236, baseType: !1375, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !188, line: 273, size: 128, elements: !1377)
!1377 = !{!1378, !1379}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1376, file: !188, line: 275, baseType: !1348, size: 64)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1376, file: !188, line: 278, baseType: !1348, size: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1372, file: !188, line: 237, baseType: !1381, size: 64)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !188, line: 259, size: 320, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1382, file: !188, line: 261, baseType: !1010, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1382, file: !188, line: 262, baseType: !1010, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1382, file: !188, line: 266, baseType: !1010, size: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1382, file: !188, line: 267, baseType: !1010, size: 64, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1382, file: !188, line: 270, baseType: !758, size: 32, offset: 256)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1323, file: !188, line: 241, baseType: !1359, size: 64, offset: 576)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1323, file: !188, line: 244, baseType: !758, size: 32, offset: 640)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1323, file: !188, line: 247, baseType: !758, size: 32, offset: 672)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1323, file: !188, line: 250, baseType: !758, size: 32, offset: 704)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1323, file: !188, line: 253, baseType: !758, size: 32, offset: 736)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1323, file: !188, line: 256, baseType: !758, size: 32, offset: 768)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1318, file: !188, line: 378, baseType: !1321, size: 64, offset: 64)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1318, file: !188, line: 381, baseType: !1397, size: 64, offset: 128)
!1397 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1398, size: 64)
!1398 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !188, line: 282, baseType: !1399)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !188, line: 282, size: 128, elements: !1400)
!1400 = !{!1401}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1399, file: !188, line: 282, baseType: !1402, size: 128)
!1402 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !188, line: 281, baseType: !1403)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !188, line: 281, size: 128, elements: !1404)
!1404 = !{!1405, !1406, !1407}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1403, file: !188, line: 281, baseType: !7, size: 32)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1403, file: !188, line: 281, baseType: !7, size: 32, offset: 32)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1403, file: !188, line: 281, baseType: !1408, size: 64, offset: 64)
!1408 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1321, size: 64, elements: !1044)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1318, file: !188, line: 384, baseType: !758, size: 32, offset: 192)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1318, file: !188, line: 387, baseType: !758, size: 32, offset: 224)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1318, file: !188, line: 390, baseType: !758, size: 32, offset: 256)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1318, file: !188, line: 394, baseType: !1397, size: 64, offset: 320)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1318, file: !188, line: 396, baseType: !187, size: 32, offset: 384)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1318, file: !188, line: 399, baseType: !1415, size: 64, offset: 416)
!1415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !193, size: 64, elements: !892)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1318, file: !188, line: 402, baseType: !1417, size: 64, offset: 480)
!1417 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !892)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1318, file: !188, line: 406, baseType: !758, size: 32, offset: 544)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1318, file: !188, line: 409, baseType: !758, size: 32, offset: 576)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1310, file: !1311, line: 470, baseType: !1349, size: 64, offset: 128)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1310, file: !1311, line: 473, baseType: !1422, size: 64, offset: 192)
!1422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1423, size: 64)
!1423 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1311, line: 166, flags: DIFlagFwdDecl)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1310, file: !1311, line: 476, baseType: !1425, size: 64, offset: 256)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1311, line: 476, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1310, file: !1311, line: 479, baseType: !1428, size: 64, offset: 320)
!1428 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1429, line: 144, baseType: !1430)
!1429 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1430 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1431, size: 64)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1429, line: 100, size: 896, elements: !1432)
!1432 = !{!1433, !1441, !1446, !1448, !1450, !1451, !1452, !1453, !1454, !1455, !1460, !1462, !1463, !1468, !1473}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1431, file: !1429, line: 102, baseType: !1434, size: 64)
!1434 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1429, line: 52, baseType: !1435)
!1435 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1436, size: 64)
!1436 = !DISubroutineType(types: !1437)
!1437 = !{!1438, !1439}
!1438 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1429, line: 47, baseType: !7)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1431, file: !1429, line: 105, baseType: !1442, size: 64, offset: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1429, line: 59, baseType: !1443)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64)
!1444 = !DISubroutineType(types: !1445)
!1445 = !{!758, !1439, !1439}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1431, file: !1429, line: 108, baseType: !1447, size: 64, offset: 128)
!1447 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1429, line: 63, baseType: !888)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1431, file: !1429, line: 111, baseType: !1449, size: 64, offset: 192)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1431, file: !1429, line: 114, baseType: !883, size: 64, offset: 256)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1431, file: !1429, line: 117, baseType: !883, size: 64, offset: 320)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1431, file: !1429, line: 120, baseType: !883, size: 64, offset: 384)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1431, file: !1429, line: 124, baseType: !7, size: 32, offset: 448)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1431, file: !1429, line: 128, baseType: !7, size: 32, offset: 480)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1431, file: !1429, line: 131, baseType: !1456, size: 64, offset: 512)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1429, line: 75, baseType: !1457)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!762, !883, !883}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1431, file: !1429, line: 132, baseType: !1461, size: 64, offset: 576)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1429, line: 78, baseType: !888)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1431, file: !1429, line: 135, baseType: !762, size: 64, offset: 640)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1431, file: !1429, line: 136, baseType: !1464, size: 64, offset: 704)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1429, line: 82, baseType: !1465)
!1465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1466, size: 64)
!1466 = !DISubroutineType(types: !1467)
!1467 = !{!762, !762, !883, !883}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1431, file: !1429, line: 137, baseType: !1469, size: 64, offset: 768)
!1469 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1429, line: 83, baseType: !1470)
!1470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1471, size: 64)
!1471 = !DISubroutineType(types: !1472)
!1472 = !{null, !762, !762}
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1431, file: !1429, line: 141, baseType: !7, size: 32, offset: 832)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1310, file: !1311, line: 484, baseType: !1064, size: 64, offset: 384)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1310, file: !1311, line: 488, baseType: !1064, size: 64, offset: 448)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1310, file: !1311, line: 493, baseType: !1064, size: 64, offset: 512)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1310, file: !1311, line: 496, baseType: !1064, size: 64, offset: 576)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1310, file: !1311, line: 501, baseType: !1479, size: 64, offset: 640)
!1479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1480, size: 64)
!1480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !135, line: 2355, size: 576, elements: !1481)
!1481 = !{!1482, !1485, !1486, !1487, !1488, !1490, !1491, !1496, !1497, !1498, !1499, !1500, !1501}
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1480, file: !135, line: 2356, baseType: !1483, size: 64)
!1483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1484, size: 64)
!1484 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !135, line: 2356, flags: DIFlagFwdDecl)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1480, file: !135, line: 2357, baseType: !763, size: 64, offset: 64)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1480, file: !135, line: 2358, baseType: !758, size: 32, offset: 128)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1480, file: !135, line: 2359, baseType: !758, size: 32, offset: 160)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1480, file: !135, line: 2360, baseType: !1489, size: 128, offset: 192)
!1489 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 128, elements: !954)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1480, file: !135, line: 2364, baseType: !758, size: 32, offset: 320)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1480, file: !135, line: 2367, baseType: !1492, size: 128, offset: 384)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !135, line: 2349, size: 128, elements: !1493)
!1493 = !{!1494, !1495}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1492, file: !135, line: 2351, baseType: !1010, size: 64)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1492, file: !135, line: 2352, baseType: !945, size: 64, offset: 64)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1480, file: !135, line: 2371, baseType: !198, size: 32, offset: 512)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1480, file: !135, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1480, file: !135, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1480, file: !135, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1480, file: !135, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1480, file: !135, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1310, file: !1311, line: 504, baseType: !1503, size: 64, offset: 704)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1311, line: 504, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1310, file: !1311, line: 507, baseType: !1428, size: 64, offset: 768)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1310, file: !1311, line: 510, baseType: !758, size: 32, offset: 832)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1310, file: !1311, line: 513, baseType: !758, size: 32, offset: 864)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1310, file: !1311, line: 516, baseType: !1184, size: 32, offset: 896)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1310, file: !1311, line: 519, baseType: !1184, size: 32, offset: 928)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1310, file: !1311, line: 522, baseType: !7, size: 32, offset: 960)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1310, file: !1311, line: 523, baseType: !7, size: 32, offset: 992)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1310, file: !1311, line: 528, baseType: !763, size: 64, offset: 1024)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1310, file: !1311, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1310, file: !1311, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1310, file: !1311, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1310, file: !1311, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1310, file: !1311, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1310, file: !1311, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1310, file: !1311, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1310, file: !1311, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1310, file: !1311, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1310, file: !1311, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1310, file: !1311, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1310, file: !1311, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1310, file: !1311, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1310, file: !1311, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1310, file: !1311, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1310, file: !1311, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1305, file: !203, line: 3254, baseType: !1064, size: 64, offset: 1536)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1305, file: !203, line: 3257, baseType: !1064, size: 64, offset: 1600)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1305, file: !203, line: 3258, baseType: !1064, size: 64, offset: 1664)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1305, file: !203, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1305, file: !203, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1305, file: !203, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1305, file: !203, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1305, file: !203, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1305, file: !203, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1305, file: !203, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1305, file: !203, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1305, file: !203, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1305, file: !203, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1305, file: !203, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1305, file: !203, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1305, file: !203, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1305, file: !203, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1305, file: !203, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
