; ModuleID = 'regmove.bc'
source_filename = "regmove.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }
%struct.edge_def = type { %struct.basic_block_def*, %struct.basic_block_def*, %union.edge_def_insns, i8*, %union.tree_node*, i32, i32, i32, i32, i64 }
%union.edge_def_insns = type { %struct.gimple_seq_d* }
%struct.gimple_seq_d = type opaque
%union.tree_node = type { %struct.tree_function_decl }

!682 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!683 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!684 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!685 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!686 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!687 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!688 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!689 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!690 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!691 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!692 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!693 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!694 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!695 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!696 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!697 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!698 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!700 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!701 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!702 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!703 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!704 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!705 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!706 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!707 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!708 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!709 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!710 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "match_use", file: !3, line: 54, baseType: !7, size: 32, elements: !711)
!711 = !{!712, !713, !714}
!712 = !DIEnumerator(name: "READ", value: 0, isUnsigned: true)
!713 = !DIEnumerator(name: "WRITE", value: 1, isUnsigned: true)
!714 = !DIEnumerator(name: "READWRITE", value: 2, isUnsigned: true)
!715 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !336, line: 1188, baseType: !7, size: 32, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744}
!717 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!718 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!719 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!720 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!721 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!722 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!723 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!724 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!725 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!726 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!727 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!728 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!729 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!730 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!731 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!732 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!733 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!734 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!735 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!736 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!737 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!738 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!739 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!740 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!741 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!742 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!743 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!744 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!745 = !{!746, !747, !748, !749, !752, !753, !755, !567, !756, !1924, !189, !1925}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!748 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !751)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !757, line: 50, baseType: !758)
!757 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !568, line: 240, size: 384, elements: !760)
!760 = !{!761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !759, file: !568, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !759, file: !568, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !759, file: !568, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !759, file: !568, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !759, file: !568, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !759, file: !568, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !759, file: !568, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !759, file: !568, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !759, file: !568, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !759, file: !568, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !759, file: !568, line: 321, baseType: !772, size: 320, offset: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !568, line: 315, size: 320, elements: !773)
!773 = !{!774, !1859, !1861, !1922, !1923}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !772, file: !568, line: 316, baseType: !775, size: 64)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 64, elements: !791)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !568, line: 183, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !568, line: 166, size: 64, elements: !778)
!778 = !{!779, !780, !781, !782, !783, !793, !794, !806, !809, !871, !1837, !1838, !1849, !1856}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !777, file: !568, line: 168, baseType: !748, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !777, file: !568, line: 169, baseType: !7, size: 32)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !777, file: !568, line: 170, baseType: !753, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !777, file: !568, line: 171, baseType: !756, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !777, file: !568, line: 172, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !757, line: 53, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !568, line: 359, size: 128, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !786, file: !568, line: 360, baseType: !748, size: 32)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !786, file: !568, line: 361, baseType: !790, size: 64, offset: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 64, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 1)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !777, file: !568, line: 173, baseType: !189, size: 32)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !777, file: !568, line: 174, baseType: !795, size: 32)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !568, line: 133, baseType: !796)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !568, line: 115, size: 32, elements: !797)
!797 = !{!798, !799, !800, !801, !802, !803, !804, !805}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !796, file: !568, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !796, file: !568, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !796, file: !568, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !796, file: !568, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !796, file: !568, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !796, file: !568, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !796, file: !568, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !796, file: !568, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !777, file: !568, line: 175, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !568, line: 175, flags: DIFlagFwdDecl)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !777, file: !568, line: 176, baseType: !810, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !811, size: 64)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !812, line: 75, size: 256, elements: !813)
!812 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!813 = !{!814, !829, !830, !831}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !811, file: !812, line: 76, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !812, line: 68, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !812, line: 63, size: 320, elements: !818)
!818 = !{!819, !821, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !817, file: !812, line: 64, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !817, file: !812, line: 65, baseType: !820, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !817, file: !812, line: 66, baseType: !7, size: 32, offset: 128)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !817, file: !812, line: 67, baseType: !824, size: 128, offset: 192)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !825, size: 128, elements: !827)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !812, line: 29, baseType: !826)
!826 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!827 = !{!828}
!828 = !DISubrange(count: 2)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !811, file: !812, line: 77, baseType: !815, size: 64, offset: 64)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !811, file: !812, line: 78, baseType: !7, size: 32, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !811, file: !812, line: 79, baseType: !832, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !812, line: 49, baseType: !834)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !812, line: 45, size: 832, elements: !835)
!835 = !{!836, !837, !838}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !834, file: !812, line: 46, baseType: !820, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !834, file: !812, line: 47, baseType: !810, size: 64, offset: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !834, file: !812, line: 48, baseType: !839, size: 704, offset: 128)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !840, line: 164, size: 704, elements: !841)
!840 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!841 = !{!842, !844, !854, !855, !856, !857, !858, !859, !863, !867, !868, !869, !870}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !839, file: !840, line: 166, baseType: !843, size: 64)
!843 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !839, file: !840, line: 167, baseType: !845, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !840, line: 157, size: 192, elements: !847)
!847 = !{!848, !849, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !846, file: !840, line: 159, baseType: !750, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !846, file: !840, line: 160, baseType: !845, size: 64, offset: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !846, file: !840, line: 161, baseType: !851, size: 32, offset: 128)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 32, elements: !852)
!852 = !{!853}
!853 = !DISubrange(count: 4)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !839, file: !840, line: 168, baseType: !750, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !839, file: !840, line: 169, baseType: !750, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !839, file: !840, line: 170, baseType: !750, size: 64, offset: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !839, file: !840, line: 171, baseType: !843, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !839, file: !840, line: 172, baseType: !748, size: 32, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !839, file: !840, line: 176, baseType: !860, size: 64, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DISubroutineType(types: !862)
!862 = !{!845, !752, !843}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !839, file: !840, line: 177, baseType: !864, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DISubroutineType(types: !866)
!866 = !{null, !752, !845}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !839, file: !840, line: 178, baseType: !752, size: 64, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !839, file: !840, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !839, file: !840, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !839, file: !840, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !777, file: !568, line: 177, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !757, line: 56, baseType: !873)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !341, line: 3371, size: 1792, elements: !875)
!875 = !{!876, !909, !915, !926, !945, !956, !961, !968, !974, !987, !999, !1037, !1042, !1070, !1078, !1079, !1084, !1093, !1099, !1104, !1108, !1112, !1473, !1522, !1528, !1534, !1541, !1567, !1581, !1598, !1610, !1632, !1647, !1819}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !874, file: !341, line: 3372, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !341, line: 360, size: 64, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !877, file: !341, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !877, file: !341, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !877, file: !341, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !877, file: !341, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !877, file: !341, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !877, file: !341, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !877, file: !341, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !877, file: !341, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !877, file: !341, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !877, file: !341, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !877, file: !341, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !877, file: !341, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !877, file: !341, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !877, file: !341, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !877, file: !341, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !877, file: !341, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !877, file: !341, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !877, file: !341, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !877, file: !341, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !877, file: !341, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !877, file: !341, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !877, file: !341, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !877, file: !341, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !877, file: !341, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !877, file: !341, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !877, file: !341, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !877, file: !341, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !877, file: !341, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !877, file: !341, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !877, file: !341, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !874, file: !341, line: 3373, baseType: !910, size: 192)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !341, line: 402, size: 192, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !910, file: !341, line: 403, baseType: !877, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !910, file: !341, line: 404, baseType: !872, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !910, file: !341, line: 405, baseType: !872, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !874, file: !341, line: 3374, baseType: !916, size: 320)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !341, line: 1384, size: 320, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !916, file: !341, line: 1385, baseType: !910, size: 192)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !916, file: !341, line: 1386, baseType: !920, size: 128, offset: 192)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !921, line: 58, baseType: !922)
!921 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !921, line: 54, size: 128, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !922, file: !921, line: 56, baseType: !826, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !922, file: !921, line: 57, baseType: !843, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !874, file: !341, line: 3375, baseType: !927, size: 256)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !341, line: 1397, size: 256, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !341, line: 1398, baseType: !910, size: 192)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !927, file: !341, line: 1399, baseType: !931, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !933, line: 52, size: 256, elements: !934)
!933 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!934 = !{!935, !936, !937, !938, !939, !940, !941}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !932, file: !933, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !932, file: !933, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !932, file: !933, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !932, file: !933, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !932, file: !933, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !932, file: !933, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !932, file: !933, line: 62, baseType: !942, size: 192, offset: 64)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 192, elements: !943)
!943 = !{!944}
!944 = !DISubrange(count: 3)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !874, file: !341, line: 3376, baseType: !946, size: 256)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !341, line: 1408, size: 256, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !946, file: !341, line: 1409, baseType: !910, size: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !946, file: !341, line: 1410, baseType: !950, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !952, line: 27, size: 192, elements: !953)
!952 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!953 = !{!954, !955}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !951, file: !952, line: 29, baseType: !920, size: 128)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !951, file: !952, line: 30, baseType: !189, size: 32, offset: 128)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !874, file: !341, line: 3377, baseType: !957, size: 256)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !341, line: 1437, size: 256, elements: !958)
!958 = !{!959, !960}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !957, file: !341, line: 1438, baseType: !910, size: 192)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !957, file: !341, line: 1439, baseType: !872, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !874, file: !341, line: 3378, baseType: !962, size: 256)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !341, line: 1418, size: 256, elements: !963)
!963 = !{!964, !965, !966}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !341, line: 1419, baseType: !910, size: 192)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !962, file: !341, line: 1420, baseType: !748, size: 32, offset: 192)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !962, file: !341, line: 1421, baseType: !967, size: 8, offset: 224)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 8, elements: !791)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !874, file: !341, line: 3379, baseType: !969, size: 320)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !341, line: 1428, size: 320, elements: !970)
!970 = !{!971, !972, !973}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !341, line: 1429, baseType: !910, size: 192)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !969, file: !341, line: 1430, baseType: !872, size: 64, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !969, file: !341, line: 1431, baseType: !872, size: 64, offset: 256)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !874, file: !341, line: 3380, baseType: !975, size: 320)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !341, line: 1460, size: 320, elements: !976)
!976 = !{!977, !978}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !975, file: !341, line: 1461, baseType: !910, size: 192)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !975, file: !341, line: 1462, baseType: !979, size: 128, offset: 192)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !980, line: 31, size: 128, elements: !981)
!980 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!981 = !{!982, !985, !986}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !979, file: !980, line: 32, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !747)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !979, file: !980, line: 33, baseType: !7, size: 32, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !979, file: !980, line: 34, baseType: !7, size: 32, offset: 96)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !874, file: !341, line: 3381, baseType: !988, size: 384)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !341, line: 2507, size: 384, elements: !989)
!989 = !{!990, !991, !996, !997, !998}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !988, file: !341, line: 2508, baseType: !910, size: 192)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !988, file: !341, line: 2509, baseType: !992, size: 32, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !993, line: 58, baseType: !994)
!993 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !995, line: 44, baseType: !7)
!995 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!996 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !988, file: !341, line: 2510, baseType: !7, size: 32, offset: 224)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !988, file: !341, line: 2511, baseType: !872, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !988, file: !341, line: 2512, baseType: !872, size: 64, offset: 320)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !874, file: !341, line: 3382, baseType: !1000, size: 896)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !341, line: 2652, size: 896, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1000, file: !341, line: 2653, baseType: !988, size: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1000, file: !341, line: 2654, baseType: !872, size: 64, offset: 384)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1000, file: !341, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1000, file: !341, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1000, file: !341, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1000, file: !341, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1000, file: !341, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1000, file: !341, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1000, file: !341, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1000, file: !341, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1000, file: !341, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1000, file: !341, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1000, file: !341, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1000, file: !341, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1000, file: !341, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1000, file: !341, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1000, file: !341, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1000, file: !341, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1000, file: !341, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1000, file: !341, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1000, file: !341, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1000, file: !341, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1000, file: !341, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1000, file: !341, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1000, file: !341, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1000, file: !341, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1000, file: !341, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1000, file: !341, line: 2703, baseType: !7, size: 32, offset: 512)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1000, file: !341, line: 2705, baseType: !872, size: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1000, file: !341, line: 2706, baseType: !872, size: 64, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1000, file: !341, line: 2707, baseType: !872, size: 64, offset: 704)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1000, file: !341, line: 2708, baseType: !872, size: 64, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1000, file: !341, line: 2711, baseType: !1035, size: 64, offset: 832)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !341, line: 2711, flags: DIFlagFwdDecl)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !874, file: !341, line: 3383, baseType: !1038, size: 960)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !341, line: 2756, size: 960, elements: !1039)
!1039 = !{!1040, !1041}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1038, file: !341, line: 2757, baseType: !1000, size: 896)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1038, file: !341, line: 2758, baseType: !756, size: 64, offset: 896)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !874, file: !341, line: 3384, baseType: !1043, size: 1472)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !341, line: 3114, size: 1472, elements: !1044)
!1044 = !{!1045, !1066, !1067, !1068, !1069}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1043, file: !341, line: 3115, baseType: !1046, size: 1216)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !341, line: 2984, size: 1216, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1063, !1064, !1065}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1046, file: !341, line: 2985, baseType: !1038, size: 960)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1046, file: !341, line: 2986, baseType: !872, size: 64, offset: 960)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1046, file: !341, line: 2987, baseType: !872, size: 64, offset: 1024)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1046, file: !341, line: 2988, baseType: !872, size: 64, offset: 1088)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1046, file: !341, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1046, file: !341, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1046, file: !341, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1046, file: !341, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1046, file: !341, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1046, file: !341, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1046, file: !341, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1046, file: !341, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1046, file: !341, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1046, file: !341, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1046, file: !341, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1046, file: !341, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1046, file: !341, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1046, file: !341, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1043, file: !341, line: 3117, baseType: !872, size: 64, offset: 1216)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1043, file: !341, line: 3119, baseType: !872, size: 64, offset: 1280)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1043, file: !341, line: 3121, baseType: !872, size: 64, offset: 1344)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1043, file: !341, line: 3123, baseType: !872, size: 64, offset: 1408)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !874, file: !341, line: 3385, baseType: !1071, size: 1088)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !341, line: 2874, size: 1088, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1071, file: !341, line: 2875, baseType: !1038, size: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1071, file: !341, line: 2876, baseType: !756, size: 64, offset: 960)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1071, file: !341, line: 2877, baseType: !1076, size: 64, offset: 1024)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !341, line: 2856, flags: DIFlagFwdDecl)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !874, file: !341, line: 3386, baseType: !1046, size: 1216)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !874, file: !341, line: 3387, baseType: !1080, size: 1280)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !341, line: 3093, size: 1280, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1080, file: !341, line: 3094, baseType: !1046, size: 1216)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1080, file: !341, line: 3095, baseType: !1076, size: 64, offset: 1216)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !874, file: !341, line: 3388, baseType: !1085, size: 1216)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !341, line: 2824, size: 1216, elements: !1086)
!1086 = !{!1087, !1088, !1089, !1090, !1091, !1092}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1085, file: !341, line: 2825, baseType: !1000, size: 896)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1085, file: !341, line: 2827, baseType: !872, size: 64, offset: 896)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1085, file: !341, line: 2828, baseType: !872, size: 64, offset: 960)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1085, file: !341, line: 2829, baseType: !872, size: 64, offset: 1024)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1085, file: !341, line: 2830, baseType: !872, size: 64, offset: 1088)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1085, file: !341, line: 2831, baseType: !872, size: 64, offset: 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !874, file: !341, line: 3389, baseType: !1094, size: 1024)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !341, line: 2850, size: 1024, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1094, file: !341, line: 2851, baseType: !1038, size: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1094, file: !341, line: 2852, baseType: !748, size: 32, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1094, file: !341, line: 2853, baseType: !748, size: 32, offset: 992)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !874, file: !341, line: 3390, baseType: !1100, size: 1024)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !341, line: 2857, size: 1024, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !341, line: 2858, baseType: !1038, size: 960)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1100, file: !341, line: 2859, baseType: !1076, size: 64, offset: 960)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !874, file: !341, line: 3391, baseType: !1105, size: 960)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !341, line: 2862, size: 960, elements: !1106)
!1106 = !{!1107}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1105, file: !341, line: 2863, baseType: !1038, size: 960)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !874, file: !341, line: 3392, baseType: !1109, size: 1472)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !341, line: 3304, size: 1472, elements: !1110)
!1110 = !{!1111}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1109, file: !341, line: 3305, baseType: !1043, size: 1472)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !874, file: !341, line: 3393, baseType: !1113, size: 1792)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !341, line: 3248, size: 1792, elements: !1114)
!1114 = !{!1115, !1116, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1113, file: !341, line: 3249, baseType: !1043, size: 1472)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1113, file: !341, line: 3251, baseType: !1117, size: 64, offset: 1472)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1119, line: 463, size: 1152, elements: !1120)
!1119 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1120 = !{!1121, !1285, !1389, !1390, !1393, !1396, !1397, !1398, !1399, !1400, !1401, !1425, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1118, file: !1119, line: 464, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !318, line: 194, size: 384, elements: !1124)
!1124 = !{!1125, !1174, !1187, !1201, !1253, !1266}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1123, file: !318, line: 197, baseType: !1126, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !318, line: 182, baseType: !1127)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !318, line: 116, size: 704, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134, !1135, !1162, !1171, !1172, !1173}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1128, file: !318, line: 119, baseType: !1127, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1128, file: !318, line: 122, baseType: !1127, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1128, file: !318, line: 123, baseType: !1127, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1128, file: !318, line: 126, baseType: !748, size: 32, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1128, file: !318, line: 129, baseType: !317, size: 32, offset: 224)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1128, file: !318, line: 165, baseType: !1136, size: 192, offset: 256)
!1136 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !318, line: 132, size: 192, elements: !1137)
!1137 = !{!1138, !1151, !1157}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1136, file: !318, line: 137, baseType: !1139, size: 128)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !318, line: 133, size: 128, elements: !1140)
!1140 = !{!1141, !1150}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1139, file: !318, line: 135, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !318, line: 93, size: 320, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1143, file: !318, line: 96, baseType: !1142, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1143, file: !318, line: 97, baseType: !1142, size: 64, offset: 64)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1143, file: !318, line: 101, baseType: !872, size: 64, offset: 128)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1143, file: !318, line: 106, baseType: !872, size: 64, offset: 192)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1143, file: !318, line: 111, baseType: !872, size: 64, offset: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1139, file: !318, line: 136, baseType: !1142, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1136, file: !318, line: 151, baseType: !1152, size: 192)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !318, line: 139, size: 192, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1152, file: !318, line: 141, baseType: !872, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1152, file: !318, line: 145, baseType: !872, size: 64, offset: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1152, file: !318, line: 150, baseType: !748, size: 32, offset: 128)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1136, file: !318, line: 164, baseType: !1158, size: 128)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !318, line: 153, size: 128, elements: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1158, file: !318, line: 161, baseType: !872, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1158, file: !318, line: 163, baseType: !992, size: 32, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1128, file: !318, line: 168, baseType: !1163, size: 64, offset: 448)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !318, line: 67, size: 320, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1170}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1164, file: !318, line: 70, baseType: !1163, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1164, file: !318, line: 73, baseType: !1127, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1164, file: !318, line: 78, baseType: !872, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1164, file: !318, line: 85, baseType: !756, size: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1164, file: !318, line: 88, baseType: !748, size: 32, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1128, file: !318, line: 173, baseType: !756, size: 64, offset: 512)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1128, file: !318, line: 173, baseType: !756, size: 64, offset: 576)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1128, file: !318, line: 177, baseType: !747, size: 8, offset: 640)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1123, file: !318, line: 200, baseType: !1175, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !318, line: 185, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !318, line: 185, size: 128, elements: !1178)
!1178 = !{!1179}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1177, file: !318, line: 185, baseType: !1180, size: 128)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !318, line: 184, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !318, line: 184, size: 128, elements: !1182)
!1182 = !{!1183, !1184, !1185}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1181, file: !318, line: 184, baseType: !7, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1181, file: !318, line: 184, baseType: !7, size: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1181, file: !318, line: 184, baseType: !1186, size: 64, offset: 64)
!1186 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1126, size: 64, elements: !791)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1123, file: !318, line: 203, baseType: !1188, size: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !318, line: 189, size: 128, elements: !1191)
!1191 = !{!1192}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1190, file: !318, line: 189, baseType: !1193, size: 128)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !318, line: 188, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !318, line: 188, size: 128, elements: !1195)
!1195 = !{!1196, !1197, !1198}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1194, file: !318, line: 188, baseType: !7, size: 32)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1194, file: !318, line: 188, baseType: !7, size: 32, offset: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1194, file: !318, line: 188, baseType: !1199, size: 64, offset: 64)
!1199 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1200, size: 64, elements: !791)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !318, line: 180, baseType: !1163)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1123, file: !318, line: 207, baseType: !1202, size: 64, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1203, line: 144, baseType: !1204)
!1203 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1203, line: 100, size: 896, elements: !1206)
!1206 = !{!1207, !1215, !1220, !1225, !1227, !1230, !1231, !1232, !1233, !1234, !1239, !1241, !1242, !1247, !1252}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1205, file: !1203, line: 102, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1203, line: 52, baseType: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DISubroutineType(types: !1211)
!1211 = !{!1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1203, line: 47, baseType: !7)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1205, file: !1203, line: 105, baseType: !1216, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1203, line: 59, baseType: !1217)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = !DISubroutineType(types: !1219)
!1219 = !{!748, !1213, !1213}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1205, file: !1203, line: 108, baseType: !1221, size: 64, offset: 128)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1203, line: 63, baseType: !1222)
!1222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1223, size: 64)
!1223 = !DISubroutineType(types: !1224)
!1224 = !{null, !752}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1205, file: !1203, line: 111, baseType: !1226, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1205, file: !1203, line: 114, baseType: !1228, size: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1229, line: 46, baseType: !826)
!1229 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1205, file: !1203, line: 117, baseType: !1228, size: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1205, file: !1203, line: 120, baseType: !1228, size: 64, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1205, file: !1203, line: 124, baseType: !7, size: 32, offset: 448)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1205, file: !1203, line: 128, baseType: !7, size: 32, offset: 480)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1205, file: !1203, line: 131, baseType: !1235, size: 64, offset: 512)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1203, line: 75, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{!752, !1228, !1228}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1205, file: !1203, line: 132, baseType: !1240, size: 64, offset: 576)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1203, line: 78, baseType: !1222)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1205, file: !1203, line: 135, baseType: !752, size: 64, offset: 640)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1205, file: !1203, line: 136, baseType: !1243, size: 64, offset: 704)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1203, line: 82, baseType: !1244)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = !DISubroutineType(types: !1246)
!1246 = !{!752, !752, !1228, !1228}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1205, file: !1203, line: 137, baseType: !1248, size: 64, offset: 768)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1203, line: 83, baseType: !1249)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DISubroutineType(types: !1251)
!1251 = !{null, !752, !752}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1205, file: !1203, line: 141, baseType: !7, size: 32, offset: 832)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1123, file: !318, line: 211, baseType: !1254, size: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !341, line: 183, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !341, line: 183, size: 128, elements: !1257)
!1257 = !{!1258}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1256, file: !341, line: 183, baseType: !1259, size: 128)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !341, line: 182, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !341, line: 182, size: 128, elements: !1261)
!1261 = !{!1262, !1263, !1264}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1260, file: !341, line: 182, baseType: !7, size: 32)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1260, file: !341, line: 182, baseType: !7, size: 32, offset: 32)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1260, file: !341, line: 182, baseType: !1265, size: 64, offset: 64)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !872, size: 64, elements: !791)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1123, file: !318, line: 220, baseType: !1267, size: 64, offset: 320)
!1267 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !318, line: 217, size: 64, elements: !1268)
!1268 = !{!1269, !1270}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1267, file: !318, line: 218, baseType: !1254, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1267, file: !318, line: 219, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1273, line: 29, baseType: !1274)
!1273 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1273, line: 29, size: 96, elements: !1275)
!1275 = !{!1276}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1274, file: !1273, line: 29, baseType: !1277, size: 96)
!1277 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1273, line: 27, baseType: !1278)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1273, line: 27, size: 96, elements: !1279)
!1279 = !{!1280, !1281, !1282}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1278, file: !1273, line: 27, baseType: !7, size: 32)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1278, file: !1273, line: 27, baseType: !7, size: 32, offset: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1278, file: !1273, line: 27, baseType: !1283, size: 8, offset: 64)
!1283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1284, size: 8, elements: !791)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1273, line: 26, baseType: !747)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1118, file: !1119, line: 467, baseType: !1286, size: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !325, line: 374, size: 640, elements: !1288)
!1288 = !{!1289, !1364, !1365, !1378, !1379, !1380, !1381, !1382, !1383, !1385, !1387, !1388}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1287, file: !325, line: 377, baseType: !1290, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !757, line: 111, baseType: !1291)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !1293)
!1293 = !{!1294, !1329, !1330, !1331, !1334, !1338, !1339, !1340, !1358, !1359, !1360, !1361, !1362, !1363}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1292, file: !325, line: 219, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !1298)
!1298 = !{!1299}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1297, file: !325, line: 151, baseType: !1300, size: 128)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !1302)
!1302 = !{!1303, !1304, !1305}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1301, file: !325, line: 150, baseType: !7, size: 32)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1301, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1301, file: !325, line: 150, baseType: !1306, size: 64, offset: 64)
!1306 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1307, size: 64, elements: !791)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !757, line: 108, baseType: !1308)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !1310)
!1310 = !{!1311, !1312, !1313, !1321, !1322, !1323, !1324, !1325, !1326, !1327}
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1309, file: !325, line: 124, baseType: !1291, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1309, file: !325, line: 125, baseType: !1291, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1309, file: !325, line: 131, baseType: !1314, size: 64, offset: 128)
!1314 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !1315)
!1315 = !{!1316, !1320}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1314, file: !325, line: 129, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !757, line: 66, baseType: !1318)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !757, line: 65, flags: DIFlagFwdDecl)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1314, file: !325, line: 130, baseType: !756, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1309, file: !325, line: 134, baseType: !752, size: 64, offset: 192)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1309, file: !325, line: 137, baseType: !872, size: 64, offset: 256)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1309, file: !325, line: 138, baseType: !992, size: 32, offset: 320)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1309, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1309, file: !325, line: 144, baseType: !748, size: 32, offset: 384)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1309, file: !325, line: 145, baseType: !748, size: 32, offset: 416)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1309, file: !325, line: 146, baseType: !1328, size: 64, offset: 448)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !843)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1292, file: !325, line: 220, baseType: !1295, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1292, file: !325, line: 223, baseType: !752, size: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1292, file: !325, line: 226, baseType: !1332, size: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1333, size: 64)
!1333 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !325, line: 185, flags: DIFlagFwdDecl)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1292, file: !325, line: 229, baseType: !1335, size: 128, offset: 256)
!1335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1336, size: 128, elements: !827)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1292, file: !325, line: 232, baseType: !1291, size: 64, offset: 384)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1292, file: !325, line: 233, baseType: !1291, size: 64, offset: 448)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1292, file: !325, line: 238, baseType: !1341, size: 64, offset: 512)
!1341 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1342)
!1342 = !{!1343, !1349}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1341, file: !325, line: 236, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1346)
!1346 = !{!1347, !1348}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1345, file: !325, line: 275, baseType: !1317, size: 64)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1345, file: !325, line: 278, baseType: !1317, size: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1341, file: !325, line: 237, baseType: !1350, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1352)
!1352 = !{!1353, !1354, !1355, !1356, !1357}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1351, file: !325, line: 261, baseType: !756, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1351, file: !325, line: 262, baseType: !756, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1351, file: !325, line: 266, baseType: !756, size: 64, offset: 128)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1351, file: !325, line: 267, baseType: !756, size: 64, offset: 192)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1351, file: !325, line: 270, baseType: !748, size: 32, offset: 256)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1292, file: !325, line: 241, baseType: !1328, size: 64, offset: 576)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1292, file: !325, line: 244, baseType: !748, size: 32, offset: 640)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1292, file: !325, line: 247, baseType: !748, size: 32, offset: 672)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1292, file: !325, line: 250, baseType: !748, size: 32, offset: 704)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1292, file: !325, line: 253, baseType: !748, size: 32, offset: 736)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1292, file: !325, line: 256, baseType: !748, size: 32, offset: 768)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1287, file: !325, line: 378, baseType: !1290, size: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1287, file: !325, line: 381, baseType: !1366, size: 64, offset: 128)
!1366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1367, size: 64)
!1367 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !325, line: 282, baseType: !1368)
!1368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !325, line: 282, size: 128, elements: !1369)
!1369 = !{!1370}
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1368, file: !325, line: 282, baseType: !1371, size: 128)
!1371 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !325, line: 281, baseType: !1372)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !325, line: 281, size: 128, elements: !1373)
!1373 = !{!1374, !1375, !1376}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1372, file: !325, line: 281, baseType: !7, size: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1372, file: !325, line: 281, baseType: !7, size: 32, offset: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1372, file: !325, line: 281, baseType: !1377, size: 64, offset: 64)
!1377 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1290, size: 64, elements: !791)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1287, file: !325, line: 384, baseType: !748, size: 32, offset: 192)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1287, file: !325, line: 387, baseType: !748, size: 32, offset: 224)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1287, file: !325, line: 390, baseType: !748, size: 32, offset: 256)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1287, file: !325, line: 394, baseType: !1366, size: 64, offset: 320)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1287, file: !325, line: 396, baseType: !324, size: 32, offset: 384)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1287, file: !325, line: 399, baseType: !1384, size: 64, offset: 416)
!1384 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !827)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1287, file: !325, line: 402, baseType: !1386, size: 64, offset: 480)
!1386 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !827)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1287, file: !325, line: 406, baseType: !748, size: 32, offset: 544)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1287, file: !325, line: 409, baseType: !748, size: 32, offset: 576)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1118, file: !1119, line: 470, baseType: !1318, size: 64, offset: 128)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1118, file: !1119, line: 473, baseType: !1391, size: 64, offset: 192)
!1391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1392, size: 64)
!1392 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1119, line: 166, flags: DIFlagFwdDecl)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1118, file: !1119, line: 476, baseType: !1394, size: 64, offset: 256)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1119, line: 476, flags: DIFlagFwdDecl)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1118, file: !1119, line: 479, baseType: !1202, size: 64, offset: 320)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1118, file: !1119, line: 484, baseType: !872, size: 64, offset: 384)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1118, file: !1119, line: 488, baseType: !872, size: 64, offset: 448)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1118, file: !1119, line: 493, baseType: !872, size: 64, offset: 512)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1118, file: !1119, line: 496, baseType: !872, size: 64, offset: 576)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1118, file: !1119, line: 501, baseType: !1402, size: 64, offset: 640)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !336, line: 2355, size: 576, elements: !1404)
!1404 = !{!1405, !1408, !1409, !1410, !1411, !1413, !1414, !1419, !1420, !1421, !1422, !1423, !1424}
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1403, file: !336, line: 2356, baseType: !1406, size: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !336, line: 2356, flags: DIFlagFwdDecl)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1403, file: !336, line: 2357, baseType: !753, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1403, file: !336, line: 2358, baseType: !748, size: 32, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1403, file: !336, line: 2359, baseType: !748, size: 32, offset: 160)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1403, file: !336, line: 2360, baseType: !1412, size: 128, offset: 192)
!1412 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 128, elements: !852)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1403, file: !336, line: 2364, baseType: !748, size: 32, offset: 320)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1403, file: !336, line: 2367, baseType: !1415, size: 128, offset: 384)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !336, line: 2349, size: 128, elements: !1416)
!1416 = !{!1417, !1418}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1415, file: !336, line: 2351, baseType: !756, size: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1415, file: !336, line: 2352, baseType: !843, size: 64, offset: 64)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1403, file: !336, line: 2371, baseType: !335, size: 32, offset: 512)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1403, file: !336, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1403, file: !336, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1403, file: !336, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1403, file: !336, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1403, file: !336, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1118, file: !1119, line: 504, baseType: !1426, size: 64, offset: 704)
!1426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1427, size: 64)
!1427 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1119, line: 504, flags: DIFlagFwdDecl)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1118, file: !1119, line: 507, baseType: !1202, size: 64, offset: 768)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1118, file: !1119, line: 510, baseType: !748, size: 32, offset: 832)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1118, file: !1119, line: 513, baseType: !748, size: 32, offset: 864)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1118, file: !1119, line: 516, baseType: !992, size: 32, offset: 896)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1118, file: !1119, line: 519, baseType: !992, size: 32, offset: 928)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1118, file: !1119, line: 522, baseType: !7, size: 32, offset: 960)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1118, file: !1119, line: 523, baseType: !7, size: 32, offset: 992)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1118, file: !1119, line: 528, baseType: !753, size: 64, offset: 1024)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1118, file: !1119, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1118, file: !1119, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1118, file: !1119, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1118, file: !1119, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1118, file: !1119, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1118, file: !1119, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1118, file: !1119, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1118, file: !1119, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1118, file: !1119, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1118, file: !1119, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1118, file: !1119, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1118, file: !1119, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1118, file: !1119, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1118, file: !1119, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1118, file: !1119, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1118, file: !1119, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1113, file: !341, line: 3254, baseType: !872, size: 64, offset: 1536)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1113, file: !341, line: 3257, baseType: !872, size: 64, offset: 1600)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1113, file: !341, line: 3258, baseType: !872, size: 64, offset: 1664)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1113, file: !341, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1113, file: !341, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1113, file: !341, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1113, file: !341, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1113, file: !341, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1113, file: !341, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1113, file: !341, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1113, file: !341, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1113, file: !341, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1113, file: !341, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1113, file: !341, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1113, file: !341, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1113, file: !341, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1113, file: !341, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1113, file: !341, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1113, file: !341, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1113, file: !341, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1113, file: !341, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !874, file: !341, line: 3394, baseType: !1474, size: 1344)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !341, line: 2279, size: 1344, elements: !1475)
!1475 = !{!1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1501, !1502, !1503, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519}
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1474, file: !341, line: 2280, baseType: !910, size: 192)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1474, file: !341, line: 2281, baseType: !872, size: 64, offset: 192)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1474, file: !341, line: 2282, baseType: !872, size: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1474, file: !341, line: 2283, baseType: !872, size: 64, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1474, file: !341, line: 2284, baseType: !872, size: 64, offset: 384)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1474, file: !341, line: 2285, baseType: !7, size: 32, offset: 448)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1474, file: !341, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1474, file: !341, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1474, file: !341, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1474, file: !341, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1474, file: !341, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1474, file: !341, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1474, file: !341, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1474, file: !341, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1474, file: !341, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1474, file: !341, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1474, file: !341, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1474, file: !341, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1474, file: !341, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1474, file: !341, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1474, file: !341, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1474, file: !341, line: 2305, baseType: !7, size: 32, offset: 512)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1474, file: !341, line: 2306, baseType: !1499, size: 32, offset: 544)
