; ModuleID = 'regrename.bc'
source_filename = "regrename.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque

!736 = !DIEnumerator(name: "OP_IN", value: 0, isUnsigned: true)
!737 = !DIEnumerator(name: "OP_OUT", value: 1, isUnsigned: true)
!738 = !DIEnumerator(name: "OP_INOUT", value: 2, isUnsigned: true)
!739 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !561, line: 836, baseType: !7, size: 32, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!741 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!742 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!743 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!744 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!745 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!746 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!747 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!748 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!749 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!750 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!751 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!752 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!753 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!754 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!755 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!756 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!757 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!758 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!759 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!760 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!761 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!762 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!763 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!764 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!765 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!766 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!767 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!768 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!769 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!770 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!771 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!772 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!773 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "scan_actions", file: !3, line: 89, baseType: !7, size: 32, elements: !774)
!774 = !{!775, !776, !777, !778, !779, !780}
!775 = !DIEnumerator(name: "terminate_write", value: 0, isUnsigned: true)
!776 = !DIEnumerator(name: "terminate_dead", value: 1, isUnsigned: true)
!777 = !DIEnumerator(name: "mark_all_read", value: 2, isUnsigned: true)
!778 = !DIEnumerator(name: "mark_read", value: 3, isUnsigned: true)
!779 = !DIEnumerator(name: "mark_write", value: 4, isUnsigned: true)
!780 = !DIEnumerator(name: "mark_access", value: 5, isUnsigned: true)
!781 = !{!782, !783, !784, !785, !788, !789, !791, !795, !786, !798, !560, !189, !800, !801, !803, !1903, !826, !739, !1904, !816, !821, !7, !1970, !815}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!784 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !787)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!788, !794}
!794 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DISubroutineType(types: !797)
!797 = !{null, !788}
!798 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !799, line: 42, baseType: !800)
!799 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!800 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "ptrdiff_t", file: !802, line: 35, baseType: !794)
!802 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_du_head_p_heap", file: !3, line: 126, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_du_head_p_heap", file: !3, line: 126, size: 128, elements: !806)
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !805, file: !3, line: 126, baseType: !808, size: 128)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_du_head_p_base", file: !3, line: 125, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_du_head_p_base", file: !3, line: 125, size: 128, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !809, file: !3, line: 125, baseType: !7, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !809, file: !3, line: 125, baseType: !7, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !809, file: !3, line: 125, baseType: !814, size: 64, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 64, elements: !861)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "du_head_p", file: !3, line: 124, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "du_head", file: !3, line: 49, size: 704, elements: !818)
!818 = !{!819, !820, !1893, !1894, !1895, !1896, !1897, !1899, !1900, !1901, !1902}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "next_chain", scope: !817, file: !3, line: 52, baseType: !816, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !817, file: !3, line: 54, baseType: !821, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "du_chain", file: !3, line: 76, size: 256, elements: !823)
!823 = !{!824, !825, !1890, !1892}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "next_use", scope: !822, file: !3, line: 79, baseType: !821, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !822, file: !3, line: 82, baseType: !826, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !827, line: 50, baseType: !828)
!827 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !830)
!830 = !{!831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !829, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !829, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !829, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !829, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !829, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !829, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !829, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !829, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !829, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !829, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !829, file: !561, line: 321, baseType: !842, size: 320, offset: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !843)
!843 = !{!844, !1825, !1827, !1888, !1889}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !842, file: !561, line: 316, baseType: !845, size: 64)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 64, elements: !861)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !863, !864, !876, !879, !939, !1803, !1804, !1815, !1822}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !847, file: !561, line: 168, baseType: !784, size: 32)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !847, file: !561, line: 169, baseType: !7, size: 32)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !847, file: !561, line: 170, baseType: !789, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !847, file: !561, line: 171, baseType: !826, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !847, file: !561, line: 172, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !827, line: 53, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !857)
!857 = !{!858, !859}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !856, file: !561, line: 360, baseType: !784, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !856, file: !561, line: 361, baseType: !860, size: 64, offset: 64)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 64, elements: !861)
!861 = !{!862}
!862 = !DISubrange(count: 1)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !847, file: !561, line: 173, baseType: !189, size: 32)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !847, file: !561, line: 174, baseType: !865, size: 32)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !866)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !867)
!867 = !{!868, !869, !870, !871, !872, !873, !874, !875}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !866, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !866, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !866, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !866, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !866, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !866, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !866, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !866, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !847, file: !561, line: 175, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !847, file: !561, line: 176, baseType: !880, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !882, line: 75, size: 256, elements: !883)
!882 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!883 = !{!884, !898, !899, !900}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !881, file: !882, line: 76, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !882, line: 68, baseType: !887)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !882, line: 63, size: 320, elements: !888)
!888 = !{!889, !891, !892, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !887, file: !882, line: 64, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !887, file: !882, line: 65, baseType: !890, size: 64, offset: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !887, file: !882, line: 66, baseType: !7, size: 32, offset: 128)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !887, file: !882, line: 67, baseType: !894, size: 128, offset: 192)
!894 = !DICompositeType(tag: DW_TAG_array_type, baseType: !895, size: 128, elements: !896)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !882, line: 29, baseType: !800)
!896 = !{!897}
!897 = !DISubrange(count: 2)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !881, file: !882, line: 77, baseType: !885, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !881, file: !882, line: 78, baseType: !7, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !881, file: !882, line: 79, baseType: !901, size: 64, offset: 192)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !882, line: 49, baseType: !903)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !882, line: 45, size: 832, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !903, file: !882, line: 46, baseType: !890, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !903, file: !882, line: 47, baseType: !880, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !903, file: !882, line: 48, baseType: !908, size: 704, offset: 128)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !909, line: 164, size: 704, elements: !910)
!909 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!910 = !{!911, !912, !922, !923, !924, !925, !926, !927, !931, !935, !936, !937, !938}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !908, file: !909, line: 166, baseType: !794, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !908, file: !909, line: 167, baseType: !913, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !909, line: 157, size: 192, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !914, file: !909, line: 159, baseType: !786, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !914, file: !909, line: 160, baseType: !913, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !914, file: !909, line: 161, baseType: !919, size: 32, offset: 128)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 32, elements: !920)
!920 = !{!921}
!921 = !DISubrange(count: 4)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !908, file: !909, line: 168, baseType: !786, size: 64, offset: 128)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !908, file: !909, line: 169, baseType: !786, size: 64, offset: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !908, file: !909, line: 170, baseType: !786, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !908, file: !909, line: 171, baseType: !794, size: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !908, file: !909, line: 172, baseType: !784, size: 32, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !908, file: !909, line: 176, baseType: !928, size: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DISubroutineType(types: !930)
!930 = !{!913, !788, !794}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !908, file: !909, line: 177, baseType: !932, size: 64, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !933, size: 64)
!933 = !DISubroutineType(types: !934)
!934 = !{null, !788, !913}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !908, file: !909, line: 178, baseType: !788, size: 64, offset: 576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !908, file: !909, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !908, file: !909, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !908, file: !909, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !847, file: !561, line: 177, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !827, line: 56, baseType: !941)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !943)
!943 = !{!944, !977, !983, !994, !1013, !1024, !1029, !1036, !1042, !1055, !1067, !1105, !1110, !1138, !1146, !1147, !1152, !1161, !1167, !1172, !1176, !1180, !1427, !1476, !1482, !1489, !1496, !1522, !1547, !1564, !1576, !1598, !1613, !1785}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !942, file: !334, line: 3372, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !946)
!946 = !{!947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !945, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !945, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !945, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !945, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !945, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !945, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !945, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !945, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !945, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !945, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !945, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !945, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !945, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !945, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !945, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !945, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !945, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !945, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !945, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !945, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !945, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !945, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !945, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !945, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !945, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !945, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !945, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !945, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !945, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !945, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !942, file: !334, line: 3373, baseType: !978, size: 192)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !978, file: !334, line: 403, baseType: !945, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !978, file: !334, line: 404, baseType: !940, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !978, file: !334, line: 405, baseType: !940, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !942, file: !334, line: 3374, baseType: !984, size: 320)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !334, line: 1385, baseType: !978, size: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !984, file: !334, line: 1386, baseType: !988, size: 128, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !989, line: 58, baseType: !990)
!989 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !989, line: 54, size: 128, elements: !991)
!991 = !{!992, !993}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !990, file: !989, line: 56, baseType: !800, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !990, file: !989, line: 57, baseType: !794, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !942, file: !334, line: 3375, baseType: !995, size: 256)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !995, file: !334, line: 1398, baseType: !978, size: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !995, file: !334, line: 1399, baseType: !999, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1001, line: 52, size: 256, elements: !1002)
!1001 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1008, !1009}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1000, file: !1001, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1000, file: !1001, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1000, file: !1001, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1000, file: !1001, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1000, file: !1001, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1000, file: !1001, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1000, file: !1001, line: 62, baseType: !1010, size: 192, offset: 64)
!1010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !800, size: 192, elements: !1011)
!1011 = !{!1012}
!1012 = !DISubrange(count: 3)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !942, file: !334, line: 3376, baseType: !1014, size: 256)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1014, file: !334, line: 1409, baseType: !978, size: 192)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1014, file: !334, line: 1410, baseType: !1018, size: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1020, line: 27, size: 192, elements: !1021)
!1020 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1019, file: !1020, line: 29, baseType: !988, size: 128)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1019, file: !1020, line: 30, baseType: !189, size: 32, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !942, file: !334, line: 3377, baseType: !1025, size: 256)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1025, file: !334, line: 1438, baseType: !978, size: 192)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1025, file: !334, line: 1439, baseType: !940, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !942, file: !334, line: 3378, baseType: !1030, size: 256)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1030, file: !334, line: 1419, baseType: !978, size: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1030, file: !334, line: 1420, baseType: !784, size: 32, offset: 192)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1030, file: !334, line: 1421, baseType: !1035, size: 8, offset: 224)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 8, elements: !861)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !942, file: !334, line: 3379, baseType: !1037, size: 320)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !1038)
!1038 = !{!1039, !1040, !1041}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1037, file: !334, line: 1429, baseType: !978, size: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1037, file: !334, line: 1430, baseType: !940, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1037, file: !334, line: 1431, baseType: !940, size: 64, offset: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !942, file: !334, line: 3380, baseType: !1043, size: 320)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !1044)
!1044 = !{!1045, !1046}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1043, file: !334, line: 1461, baseType: !978, size: 192)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1043, file: !334, line: 1462, baseType: !1047, size: 128, offset: 192)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1048, line: 31, size: 128, elements: !1049)
!1048 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1049 = !{!1050, !1053, !1054}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1047, file: !1048, line: 32, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !783)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1047, file: !1048, line: 33, baseType: !7, size: 32, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1047, file: !1048, line: 34, baseType: !7, size: 32, offset: 96)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !942, file: !334, line: 3381, baseType: !1056, size: 384)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !1057)
!1057 = !{!1058, !1059, !1064, !1065, !1066}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1056, file: !334, line: 2508, baseType: !978, size: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1056, file: !334, line: 2509, baseType: !1060, size: 32, offset: 192)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1061, line: 58, baseType: !1062)
!1061 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1063, line: 44, baseType: !7)
!1063 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1056, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1056, file: !334, line: 2511, baseType: !940, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1056, file: !334, line: 2512, baseType: !940, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !942, file: !334, line: 3382, baseType: !1068, size: 896)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1068, file: !334, line: 2653, baseType: !1056, size: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1068, file: !334, line: 2654, baseType: !940, size: 64, offset: 384)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1068, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1068, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1068, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1068, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1068, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1068, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1068, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1068, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1068, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1068, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1068, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1068, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1068, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1068, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1068, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1068, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1068, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1068, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1068, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1068, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1068, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1068, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1068, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1068, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1068, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1068, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1068, file: !334, line: 2705, baseType: !940, size: 64, offset: 576)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1068, file: !334, line: 2706, baseType: !940, size: 64, offset: 640)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1068, file: !334, line: 2707, baseType: !940, size: 64, offset: 704)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1068, file: !334, line: 2708, baseType: !940, size: 64, offset: 768)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1068, file: !334, line: 2711, baseType: !1103, size: 64, offset: 832)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !942, file: !334, line: 3383, baseType: !1106, size: 960)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1106, file: !334, line: 2757, baseType: !1068, size: 896)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1106, file: !334, line: 2758, baseType: !826, size: 64, offset: 896)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !942, file: !334, line: 3384, baseType: !1111, size: 1472)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1112)
!1112 = !{!1113, !1134, !1135, !1136, !1137}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1111, file: !334, line: 3115, baseType: !1114, size: 1216)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1114, file: !334, line: 2985, baseType: !1106, size: 960)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1114, file: !334, line: 2986, baseType: !940, size: 64, offset: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1114, file: !334, line: 2987, baseType: !940, size: 64, offset: 1024)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1114, file: !334, line: 2988, baseType: !940, size: 64, offset: 1088)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1114, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1114, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1114, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1114, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1114, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1114, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1114, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1114, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1114, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1114, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1114, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1114, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1114, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1114, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1111, file: !334, line: 3117, baseType: !940, size: 64, offset: 1216)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1111, file: !334, line: 3119, baseType: !940, size: 64, offset: 1280)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1111, file: !334, line: 3121, baseType: !940, size: 64, offset: 1344)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1111, file: !334, line: 3123, baseType: !940, size: 64, offset: 1408)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !942, file: !334, line: 3385, baseType: !1139, size: 1088)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1140)
!1140 = !{!1141, !1142, !1143}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !334, line: 2875, baseType: !1106, size: 960)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1139, file: !334, line: 2876, baseType: !826, size: 64, offset: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1139, file: !334, line: 2877, baseType: !1144, size: 64, offset: 1024)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !334, line: 2856, flags: DIFlagFwdDecl)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !942, file: !334, line: 3386, baseType: !1114, size: 1216)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !942, file: !334, line: 3387, baseType: !1148, size: 1280)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1149)
!1149 = !{!1150, !1151}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1148, file: !334, line: 3094, baseType: !1114, size: 1216)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1148, file: !334, line: 3095, baseType: !1144, size: 64, offset: 1216)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !942, file: !334, line: 3388, baseType: !1153, size: 1216)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1154)
!1154 = !{!1155, !1156, !1157, !1158, !1159, !1160}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1153, file: !334, line: 2825, baseType: !1068, size: 896)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1153, file: !334, line: 2827, baseType: !940, size: 64, offset: 896)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1153, file: !334, line: 2828, baseType: !940, size: 64, offset: 960)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1153, file: !334, line: 2829, baseType: !940, size: 64, offset: 1024)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1153, file: !334, line: 2830, baseType: !940, size: 64, offset: 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1153, file: !334, line: 2831, baseType: !940, size: 64, offset: 1152)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !942, file: !334, line: 3389, baseType: !1162, size: 1024)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1162, file: !334, line: 2851, baseType: !1106, size: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1162, file: !334, line: 2852, baseType: !784, size: 32, offset: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1162, file: !334, line: 2853, baseType: !784, size: 32, offset: 992)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !942, file: !334, line: 3390, baseType: !1168, size: 1024)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1169)
!1169 = !{!1170, !1171}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1168, file: !334, line: 2858, baseType: !1106, size: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1168, file: !334, line: 2859, baseType: !1144, size: 64, offset: 960)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !942, file: !334, line: 3391, baseType: !1173, size: 960)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1174)
!1174 = !{!1175}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1173, file: !334, line: 2863, baseType: !1106, size: 960)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !942, file: !334, line: 3392, baseType: !1177, size: 1472)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1178)
!1178 = !{!1179}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1177, file: !334, line: 3305, baseType: !1111, size: 1472)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !942, file: !334, line: 3393, baseType: !1181, size: 1792)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1182)
!1182 = !{!1183, !1184, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1181, file: !334, line: 3249, baseType: !1111, size: 1472)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1181, file: !334, line: 3251, baseType: !1185, size: 64, offset: 1472)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1187, line: 463, size: 1152, elements: !1188)
!1187 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1188 = !{!1189, !1192, !1296, !1297, !1300, !1303, !1351, !1352, !1353, !1354, !1355, !1379, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1186, file: !1187, line: 464, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1187, line: 464, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1186, file: !1187, line: 467, baseType: !1193, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1195)
!1195 = !{!1196, !1271, !1272, !1285, !1286, !1287, !1288, !1289, !1290, !1292, !1294, !1295}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1194, file: !318, line: 377, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !827, line: 111, baseType: !1198)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1200)
!1200 = !{!1201, !1236, !1237, !1238, !1241, !1245, !1246, !1247, !1265, !1266, !1267, !1268, !1269, !1270}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1199, file: !318, line: 219, baseType: !1202, size: 64)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1205)
!1205 = !{!1206}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1204, file: !318, line: 151, baseType: !1207, size: 128)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1208)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1208, file: !318, line: 150, baseType: !7, size: 32)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1208, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1208, file: !318, line: 150, baseType: !1213, size: 64, offset: 64)
!1213 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1214, size: 64, elements: !861)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !827, line: 108, baseType: !1215)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1217)
!1217 = !{!1218, !1219, !1220, !1228, !1229, !1230, !1231, !1232, !1233, !1234}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1216, file: !318, line: 124, baseType: !1198, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1216, file: !318, line: 125, baseType: !1198, size: 64, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1216, file: !318, line: 131, baseType: !1221, size: 64, offset: 128)
!1221 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1222)
!1222 = !{!1223, !1227}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1221, file: !318, line: 129, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !827, line: 66, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !827, line: 65, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1221, file: !318, line: 130, baseType: !826, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1216, file: !318, line: 134, baseType: !788, size: 64, offset: 192)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1216, file: !318, line: 137, baseType: !940, size: 64, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1216, file: !318, line: 138, baseType: !1060, size: 32, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1216, file: !318, line: 142, baseType: !7, size: 32, offset: 352)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1216, file: !318, line: 144, baseType: !784, size: 32, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1216, file: !318, line: 145, baseType: !784, size: 32, offset: 416)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1216, file: !318, line: 146, baseType: !1235, size: 64, offset: 448)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !318, line: 119, baseType: !794)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1199, file: !318, line: 220, baseType: !1202, size: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1199, file: !318, line: 223, baseType: !788, size: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1199, file: !318, line: 226, baseType: !1239, size: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1240, size: 64)
!1240 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !318, line: 185, flags: DIFlagFwdDecl)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1199, file: !318, line: 229, baseType: !1242, size: 128, offset: 256)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1243, size: 128, elements: !896)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !318, line: 229, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1199, file: !318, line: 232, baseType: !1198, size: 64, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1199, file: !318, line: 233, baseType: !1198, size: 64, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1199, file: !318, line: 238, baseType: !1248, size: 64, offset: 512)
!1248 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !318, line: 235, size: 64, elements: !1249)
!1249 = !{!1250, !1256}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1248, file: !318, line: 236, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !318, line: 273, size: 128, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1252, file: !318, line: 275, baseType: !1224, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1252, file: !318, line: 278, baseType: !1224, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1248, file: !318, line: 237, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !318, line: 259, size: 320, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1264}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1258, file: !318, line: 261, baseType: !826, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1258, file: !318, line: 262, baseType: !826, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1258, file: !318, line: 266, baseType: !826, size: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1258, file: !318, line: 267, baseType: !826, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1258, file: !318, line: 270, baseType: !784, size: 32, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1199, file: !318, line: 241, baseType: !1235, size: 64, offset: 576)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1199, file: !318, line: 244, baseType: !784, size: 32, offset: 640)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1199, file: !318, line: 247, baseType: !784, size: 32, offset: 672)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1199, file: !318, line: 250, baseType: !784, size: 32, offset: 704)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1199, file: !318, line: 253, baseType: !784, size: 32, offset: 736)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1199, file: !318, line: 256, baseType: !784, size: 32, offset: 768)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1194, file: !318, line: 378, baseType: !1197, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1194, file: !318, line: 381, baseType: !1273, size: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1276)
!1276 = !{!1277}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1275, file: !318, line: 282, baseType: !1278, size: 128)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1280)
!1280 = !{!1281, !1282, !1283}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1279, file: !318, line: 281, baseType: !7, size: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1279, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1279, file: !318, line: 281, baseType: !1284, size: 64, offset: 64)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1197, size: 64, elements: !861)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1194, file: !318, line: 384, baseType: !784, size: 32, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1194, file: !318, line: 387, baseType: !784, size: 32, offset: 224)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1194, file: !318, line: 390, baseType: !784, size: 32, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1194, file: !318, line: 394, baseType: !1273, size: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1194, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1194, file: !318, line: 399, baseType: !1291, size: 64, offset: 416)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !896)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1194, file: !318, line: 402, baseType: !1293, size: 64, offset: 480)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !896)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1194, file: !318, line: 406, baseType: !784, size: 32, offset: 544)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1194, file: !318, line: 409, baseType: !784, size: 32, offset: 576)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1186, file: !1187, line: 470, baseType: !1225, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1186, file: !1187, line: 473, baseType: !1298, size: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1187, line: 166, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1186, file: !1187, line: 476, baseType: !1301, size: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1187, line: 476, flags: DIFlagFwdDecl)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1186, file: !1187, line: 479, baseType: !1304, size: 64, offset: 320)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1305, line: 144, baseType: !1306)
!1305 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1305, line: 100, size: 896, elements: !1308)
!1308 = !{!1309, !1317, !1322, !1324, !1326, !1328, !1329, !1330, !1331, !1332, !1337, !1339, !1340, !1345, !1350}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1307, file: !1305, line: 102, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1305, line: 52, baseType: !1311)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DISubroutineType(types: !1313)
!1313 = !{!1314, !1315}
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1305, line: 47, baseType: !7)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1307, file: !1305, line: 105, baseType: !1318, size: 64, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1305, line: 59, baseType: !1319)
!1319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1320, size: 64)
!1320 = !DISubroutineType(types: !1321)
!1321 = !{!784, !1315, !1315}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1307, file: !1305, line: 108, baseType: !1323, size: 64, offset: 128)
!1323 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1305, line: 63, baseType: !795)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1307, file: !1305, line: 111, baseType: !1325, size: 64, offset: 192)
!1325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1307, file: !1305, line: 114, baseType: !1327, size: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !802, line: 46, baseType: !800)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1307, file: !1305, line: 117, baseType: !1327, size: 64, offset: 320)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1307, file: !1305, line: 120, baseType: !1327, size: 64, offset: 384)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1307, file: !1305, line: 124, baseType: !7, size: 32, offset: 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1307, file: !1305, line: 128, baseType: !7, size: 32, offset: 480)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1307, file: !1305, line: 131, baseType: !1333, size: 64, offset: 512)
!1333 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1305, line: 75, baseType: !1334)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1335, size: 64)
!1335 = !DISubroutineType(types: !1336)
!1336 = !{!788, !1327, !1327}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1307, file: !1305, line: 132, baseType: !1338, size: 64, offset: 576)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1305, line: 78, baseType: !795)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1307, file: !1305, line: 135, baseType: !788, size: 64, offset: 640)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1307, file: !1305, line: 136, baseType: !1341, size: 64, offset: 704)
!1341 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1305, line: 82, baseType: !1342)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DISubroutineType(types: !1344)
!1344 = !{!788, !788, !1327, !1327}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1307, file: !1305, line: 137, baseType: !1346, size: 64, offset: 768)
!1346 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1305, line: 83, baseType: !1347)
!1347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1348, size: 64)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{null, !788, !788}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1307, file: !1305, line: 141, baseType: !7, size: 32, offset: 832)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1186, file: !1187, line: 484, baseType: !940, size: 64, offset: 384)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1186, file: !1187, line: 488, baseType: !940, size: 64, offset: 448)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1186, file: !1187, line: 493, baseType: !940, size: 64, offset: 512)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1186, file: !1187, line: 496, baseType: !940, size: 64, offset: 576)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1186, file: !1187, line: 501, baseType: !1356, size: 64, offset: 640)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1358)
!1358 = !{!1359, !1362, !1363, !1364, !1365, !1367, !1368, !1373, !1374, !1375, !1376, !1377, !1378}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1357, file: !329, line: 2356, baseType: !1360, size: 64)
!1360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1361, size: 64)
!1361 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1357, file: !329, line: 2357, baseType: !789, size: 64, offset: 64)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1357, file: !329, line: 2358, baseType: !784, size: 32, offset: 128)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1357, file: !329, line: 2359, baseType: !784, size: 32, offset: 160)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1357, file: !329, line: 2360, baseType: !1366, size: 128, offset: 192)
!1366 = !DICompositeType(tag: DW_TAG_array_type, baseType: !784, size: 128, elements: !920)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1357, file: !329, line: 2364, baseType: !784, size: 32, offset: 320)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1357, file: !329, line: 2367, baseType: !1369, size: 128, offset: 384)
!1369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1370)
!1370 = !{!1371, !1372}
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1369, file: !329, line: 2351, baseType: !826, size: 64)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1369, file: !329, line: 2352, baseType: !794, size: 64, offset: 64)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1357, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1357, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1357, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1357, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1357, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1357, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1186, file: !1187, line: 504, baseType: !1380, size: 64, offset: 704)
!1380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1381, size: 64)
!1381 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1187, line: 504, flags: DIFlagFwdDecl)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1186, file: !1187, line: 507, baseType: !1304, size: 64, offset: 768)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1186, file: !1187, line: 510, baseType: !784, size: 32, offset: 832)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1186, file: !1187, line: 513, baseType: !784, size: 32, offset: 864)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1186, file: !1187, line: 516, baseType: !1060, size: 32, offset: 896)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1186, file: !1187, line: 519, baseType: !1060, size: 32, offset: 928)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1186, file: !1187, line: 522, baseType: !7, size: 32, offset: 960)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1186, file: !1187, line: 523, baseType: !7, size: 32, offset: 992)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1186, file: !1187, line: 528, baseType: !789, size: 64, offset: 1024)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1186, file: !1187, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1186, file: !1187, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1186, file: !1187, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1186, file: !1187, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1186, file: !1187, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1186, file: !1187, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1186, file: !1187, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1186, file: !1187, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1186, file: !1187, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1186, file: !1187, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1186, file: !1187, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1186, file: !1187, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1186, file: !1187, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1186, file: !1187, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1186, file: !1187, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1186, file: !1187, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1181, file: !334, line: 3254, baseType: !940, size: 64, offset: 1536)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1181, file: !334, line: 3257, baseType: !940, size: 64, offset: 1600)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1181, file: !334, line: 3258, baseType: !940, size: 64, offset: 1664)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1181, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1181, file: !334, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1181, file: !334, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1181, file: !334, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1181, file: !334, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1181, file: !334, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1181, file: !334, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1181, file: !334, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1181, file: !334, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1181, file: !334, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1181, file: !334, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1181, file: !334, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1181, file: !334, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1181, file: !334, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1181, file: !334, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1181, file: !334, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1181, file: !334, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1181, file: !334, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !942, file: !334, line: 3394, baseType: !1428, size: 1344)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !334, line: 2279, size: 1344, elements: !1429)
!1429 = !{!1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1455, !1456, !1457, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1428, file: !334, line: 2280, baseType: !978, size: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1428, file: !334, line: 2281, baseType: !940, size: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1428, file: !334, line: 2282, baseType: !940, size: 64, offset: 256)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1428, file: !334, line: 2283, baseType: !940, size: 64, offset: 320)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1428, file: !334, line: 2284, baseType: !940, size: 64, offset: 384)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1428, file: !334, line: 2285, baseType: !7, size: 32, offset: 448)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1428, file: !334, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1428, file: !334, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1428, file: !334, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1428, file: !334, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1428, file: !334, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1428, file: !334, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1428, file: !334, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1428, file: !334, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1428, file: !334, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1428, file: !334, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1428, file: !334, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1428, file: !334, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1428, file: !334, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1428, file: !334, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1428, file: !334, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1428, file: !334, line: 2305, baseType: !7, size: 32, offset: 512)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1428, file: !334, line: 2306, baseType: !1453, size: 32, offset: 544)
!1453 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1454, line: 31, baseType: !784)
!1454 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1428, file: !334, line: 2307, baseType: !940, size: 64, offset: 576)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1428, file: !334, line: 2308, baseType: !940, size: 64, offset: 640)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1428, file: !334, line: 2314, baseType: !1458, size: 64, offset: 704)
!1458 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !334, line: 2309, size: 64, elements: !1459)
!1459 = !{!1460, !1461, !1462}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1458, file: !334, line: 2310, baseType: !784, size: 32)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1458, file: !334, line: 2311, baseType: !789, size: 64)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1458, file: !334, line: 2312, baseType: !1463, size: 64)
!1463 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1464, size: 64)
!1464 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !334, line: 2277, flags: DIFlagFwdDecl)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1428, file: !334, line: 2315, baseType: !940, size: 64, offset: 768)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1428, file: !334, line: 2316, baseType: !940, size: 64, offset: 832)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1428, file: !334, line: 2317, baseType: !940, size: 64, offset: 896)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1428, file: !334, line: 2318, baseType: !940, size: 64, offset: 960)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1428, file: !334, line: 2319, baseType: !940, size: 64, offset: 1024)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1428, file: !334, line: 2320, baseType: !940, size: 64, offset: 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1428, file: !334, line: 2321, baseType: !940, size: 64, offset: 1152)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1428, file: !334, line: 2322, baseType: !940, size: 64, offset: 1216)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1428, file: !334, line: 2324, baseType: !1474, size: 64, offset: 1280)
!1474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1475, size: 64)
!1475 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !334, line: 2324, flags: DIFlagFwdDecl)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !942, file: !334, line: 3395, baseType: !1477, size: 320)
!1477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !334, line: 1469, size: 320, elements: !1478)
!1478 = !{!1479, !1480, !1481}
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1477, file: !334, line: 1470, baseType: !978, size: 192)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1477, file: !334, line: 1471, baseType: !940, size: 64, offset: 192)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1477, file: !334, line: 1472, baseType: !940, size: 64, offset: 256)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !942, file: !334, line: 3396, baseType: !1483, size: 320)
!1483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !334, line: 1482, size: 320, elements: !1484)
!1484 = !{!1485, !1486, !1487}
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1483, file: !334, line: 1483, baseType: !978, size: 192)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1483, file: !334, line: 1484, baseType: !784, size: 32, offset: 192)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1483, file: !334, line: 1485, baseType: !1488, size: 64, offset: 256)
!1488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !940, size: 64, elements: !861)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !942, file: !334, line: 3397, baseType: !1490, size: 384)
!1490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !334, line: 1829, size: 384, elements: !1491)
!1491 = !{!1492, !1493, !1494, !1495}
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1490, file: !334, line: 1830, baseType: !978, size: 192)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1490, file: !334, line: 1831, baseType: !1060, size: 32, offset: 192)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1490, file: !334, line: 1832, baseType: !940, size: 64, offset: 256)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1490, file: !334, line: 1835, baseType: !1488, size: 64, offset: 320)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !942, file: !334, line: 3398, baseType: !1497, size: 704)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !334, line: 1898, size: 704, elements: !1498)
!1498 = !{!1499, !1500, !1501, !1505, !1506, !1509}
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1497, file: !334, line: 1899, baseType: !978, size: 192)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1497, file: !334, line: 1902, baseType: !940, size: 64, offset: 192)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1497, file: !334, line: 1905, baseType: !1502, size: 64, offset: 256)
!1502 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !827, line: 58, baseType: !1503)
!1503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1504, size: 64)
!1504 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !827, line: 57, flags: DIFlagFwdDecl)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1497, file: !334, line: 1908, baseType: !7, size: 32, offset: 320)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1497, file: !334, line: 1911, baseType: !1507, size: 64, offset: 384)
!1507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1508, size: 64)
!1508 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !334, line: 1876, flags: DIFlagFwdDecl)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1497, file: !334, line: 1914, baseType: !1510, size: 256, offset: 448)
!1510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1511)
!1511 = !{!1512, !1514, !1515, !1520}
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1510, file: !334, line: 1884, baseType: !1513, size: 64)
!1513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1510, size: 64)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1510, file: !334, line: 1885, baseType: !1513, size: 64, offset: 64)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1510, file: !334, line: 1891, baseType: !1516, size: 64, offset: 128)
!1516 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1510, file: !334, line: 1891, size: 64, elements: !1517)
!1517 = !{!1518, !1519}
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1516, file: !334, line: 1891, baseType: !1502, size: 64)
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1516, file: !334, line: 1891, baseType: !940, size: 64)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1510, file: !334, line: 1892, baseType: !1521, size: 64, offset: 192)
!1521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !942, file: !334, line: 3399, baseType: !1523, size: 704)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !334, line: 2008, size: 704, elements: !1524)
!1524 = !{!1525, !1526, !1527, !1528, !1529, !1530, !1542, !1543, !1544, !1545, !1546}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1523, file: !334, line: 2009, baseType: !978, size: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1523, file: !334, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1523, file: !334, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1523, file: !334, line: 2014, baseType: !1060, size: 32, offset: 224)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1523, file: !334, line: 2016, baseType: !940, size: 64, offset: 256)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1523, file: !334, line: 2017, baseType: !1531, size: 64, offset: 320)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64)
!1532 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1533)
!1533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1534)
!1534 = !{!1535}
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1533, file: !334, line: 183, baseType: !1536, size: 128)
!1536 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1537)
!1537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1538)
!1538 = !{!1539, !1540, !1541}
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1537, file: !334, line: 182, baseType: !7, size: 32)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1537, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
