; ModuleID = 'regstat.bc'
source_filename = "regstat.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.regstat_n_sets_and_refs_t = type { i32, i32 }
%struct.df = type { [8 x %struct.dataflow*], [8 x %struct.dataflow*], %struct.bitmap_head_def*, %struct.df_ref_info, %struct.df_ref_info, %struct.df_reg_info**, %struct.df_reg_info**, %struct.df_reg_info**, i32, i32, %struct.df_insn_info**, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, i32*, i32*, i32, i32, i32*, i32, i8, i8, i8 }
%struct.dataflow = type { %struct.df_problem*, i8**, i32, %struct.alloc_pool_def*, %struct.bitmap_head_def*, i8*, i32, i8, i8, i8 }

!497 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!498 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!499 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!500 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!501 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!502 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!503 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!504 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!505 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!506 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!507 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!508 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!509 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!510 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!511 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!512 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!513 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!514 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!515 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!516 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!517 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!518 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!519 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!520 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!521 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!522 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!523 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!524 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!525 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!526 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !385, line: 836, baseType: !7, size: 32, elements: !528)
!528 = !{!529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560}
!529 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!530 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!531 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!532 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!533 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!534 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!535 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!536 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!537 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!538 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!539 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!540 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!541 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!542 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!543 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!544 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!545 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!546 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!547 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!548 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!549 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!550 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!551 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!552 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!553 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!554 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!555 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!556 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!557 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!558 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!559 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!560 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!561 = !{!562, !563, !564, !565, !568, !569, !571, !384, !577, !587, !527, !5, !650}
!562 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !563, size: 64)
!563 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!564 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !567)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "regstat_n_sets_and_refs_t", file: !573, line: 69, size: 64, elements: !574)
!573 = !DIFile(filename: "./regs.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "sets", scope: !572, file: !573, line: 71, baseType: !564, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "refs", scope: !572, file: !573, line: 72, baseType: !564, size: 32, offset: 32)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_info_t", file: !573, line: 113, size: 224, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "freq", scope: !578, file: !573, line: 115, baseType: !564, size: 32)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "deaths", scope: !578, file: !573, line: 116, baseType: !564, size: 32, offset: 32)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "live_length", scope: !578, file: !573, line: 117, baseType: !564, size: 32, offset: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "calls_crossed", scope: !578, file: !573, line: 118, baseType: !564, size: 32, offset: 96)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "freq_calls_crossed", scope: !578, file: !573, line: 119, baseType: !564, size: 32, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "throw_calls_crossed", scope: !578, file: !573, line: 120, baseType: !564, size: 32, offset: 160)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "basic_block", scope: !578, file: !573, line: 121, baseType: !564, size: 32, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !588, line: 47, baseType: !589)
!588 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !591, line: 75, size: 256, elements: !592)
!591 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!592 = !{!593, !608, !609, !610}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !590, file: !591, line: 76, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !591, line: 68, baseType: !596)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !591, line: 63, size: 320, elements: !597)
!597 = !{!598, !600, !601, !602}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !596, file: !591, line: 64, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !596, file: !591, line: 65, baseType: !599, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !596, file: !591, line: 66, baseType: !7, size: 32, offset: 128)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !596, file: !591, line: 67, baseType: !603, size: 128, offset: 192)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 128, elements: !606)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !591, line: 29, baseType: !605)
!605 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!606 = !{!607}
!607 = !DISubrange(count: 2)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !590, file: !591, line: 77, baseType: !594, size: 64, offset: 64)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !590, file: !591, line: 78, baseType: !7, size: 32, offset: 128)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !590, file: !591, line: 79, baseType: !611, size: 64, offset: 192)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !591, line: 49, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !591, line: 45, size: 832, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !613, file: !591, line: 46, baseType: !599, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !613, file: !591, line: 47, baseType: !589, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !613, file: !591, line: 48, baseType: !618, size: 704, offset: 128)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !619, line: 164, size: 704, elements: !620)
!619 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!620 = !{!621, !623, !633, !634, !635, !636, !637, !638, !642, !646, !647, !648, !649}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !618, file: !619, line: 166, baseType: !622, size: 64)
!622 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !618, file: !619, line: 167, baseType: !624, size: 64, offset: 64)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !619, line: 157, size: 192, elements: !626)
!626 = !{!627, !628, !629}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !625, file: !619, line: 159, baseType: !566, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !625, file: !619, line: 160, baseType: !624, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !625, file: !619, line: 161, baseType: !630, size: 32, offset: 128)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 32, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 4)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !618, file: !619, line: 168, baseType: !566, size: 64, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !618, file: !619, line: 169, baseType: !566, size: 64, offset: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !618, file: !619, line: 170, baseType: !566, size: 64, offset: 256)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !618, file: !619, line: 171, baseType: !622, size: 64, offset: 320)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !618, file: !619, line: 172, baseType: !564, size: 32, offset: 384)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !618, file: !619, line: 176, baseType: !639, size: 64, offset: 448)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DISubroutineType(types: !641)
!641 = !{!624, !568, !622}
!642 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !618, file: !619, line: 177, baseType: !643, size: 64, offset: 512)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !568, !624}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !618, file: !619, line: 178, baseType: !568, size: 64, offset: 576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !618, file: !619, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !618, file: !619, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !618, file: !619, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_scan_bb_info", file: !652, line: 771, size: 128, elements: !653)
!652 = !DIFile(filename: "./df.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!653 = !{!654, !1822}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_defs", scope: !651, file: !652, line: 782, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "df_ref", file: !652, line: 429, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "df_ref_d", file: !652, line: 422, size: 704, elements: !659)
!659 = !{!660, !1804, !1810, !1815}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !652, line: 424, baseType: !661, size: 512)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_base_ref", file: !652, line: 356, size: 512, elements: !662)
!662 = !{!663, !664, !665, !666, !1773, !1779, !1799, !1800, !1801, !1802, !1803}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !661, file: !652, line: 360, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !661, file: !652, line: 362, baseType: !7, size: 8, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !661, file: !652, line: 364, baseType: !564, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !661, file: !652, line: 365, baseType: !667, size: 64, offset: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !588, line: 50, baseType: !668)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !670)
!670 = !{!671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !669, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !669, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !669, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !669, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !669, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !669, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !669, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !669, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !669, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !669, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !669, file: !385, line: 321, baseType: !682, size: 320, offset: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !683)
!683 = !{!684, !1708, !1710, !1771, !1772}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !682, file: !385, line: 316, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 64, elements: !701)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !687)
!687 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !703, !704, !716, !719, !720, !1686, !1687, !1698, !1705}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !687, file: !385, line: 168, baseType: !564, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !687, file: !385, line: 169, baseType: !7, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !687, file: !385, line: 170, baseType: !569, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !687, file: !385, line: 171, baseType: !667, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !687, file: !385, line: 172, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !588, line: 53, baseType: !695)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !697)
!697 = !{!698, !699}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !696, file: !385, line: 360, baseType: !564, size: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !696, file: !385, line: 361, baseType: !700, size: 64, offset: 64)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !667, size: 64, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 1)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !687, file: !385, line: 173, baseType: !5, size: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !687, file: !385, line: 174, baseType: !705, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !707)
!707 = !{!708, !709, !710, !711, !712, !713, !714, !715}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !706, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !706, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !706, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !706, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !706, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !706, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !706, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !706, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !687, file: !385, line: 175, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !687, file: !385, line: 176, baseType: !589, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !687, file: !385, line: 177, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !588, line: 56, baseType: !722)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !724)
!724 = !{!725, !758, !764, !775, !794, !805, !810, !817, !823, !836, !848, !886, !891, !919, !927, !928, !933, !942, !948, !953, !957, !961, !1322, !1371, !1377, !1383, !1390, !1416, !1430, !1447, !1459, !1481, !1496, !1668}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !723, file: !158, line: 3372, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !727)
!727 = !{!728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !726, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !726, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !726, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !726, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !726, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !726, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !726, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !726, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !726, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !726, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !726, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !726, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !726, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !726, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !726, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !726, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !726, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !726, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !726, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !726, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !726, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !726, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !726, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !726, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !726, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !726, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !726, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !726, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !726, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !726, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !723, file: !158, line: 3373, baseType: !759, size: 192)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !759, file: !158, line: 403, baseType: !726, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !759, file: !158, line: 404, baseType: !721, size: 64, offset: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !759, file: !158, line: 405, baseType: !721, size: 64, offset: 128)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !723, file: !158, line: 3374, baseType: !765, size: 320)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !158, line: 1385, baseType: !759, size: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !765, file: !158, line: 1386, baseType: !769, size: 128, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !770, line: 58, baseType: !771)
!770 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !770, line: 54, size: 128, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !771, file: !770, line: 56, baseType: !605, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !771, file: !770, line: 57, baseType: !622, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !723, file: !158, line: 3375, baseType: !776, size: 256)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !158, line: 1398, baseType: !759, size: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !776, file: !158, line: 1399, baseType: !780, size: 64, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !782, line: 52, size: 256, elements: !783)
!782 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!783 = !{!784, !785, !786, !787, !788, !789, !790}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !781, file: !782, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !781, file: !782, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !781, file: !782, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !781, file: !782, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !781, file: !782, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !781, file: !782, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !781, file: !782, line: 62, baseType: !791, size: 192, offset: 64)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 192, elements: !792)
!792 = !{!793}
!793 = !DISubrange(count: 3)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !723, file: !158, line: 3376, baseType: !795, size: 256)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !796)
!796 = !{!797, !798}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !795, file: !158, line: 1409, baseType: !759, size: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !795, file: !158, line: 1410, baseType: !799, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !801, line: 27, size: 192, elements: !802)
!801 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !800, file: !801, line: 29, baseType: !769, size: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !800, file: !801, line: 30, baseType: !5, size: 32, offset: 128)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !723, file: !158, line: 3377, baseType: !806, size: 256)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !158, line: 1438, baseType: !759, size: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !806, file: !158, line: 1439, baseType: !721, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !723, file: !158, line: 3378, baseType: !811, size: 256)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !158, line: 1419, baseType: !759, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !811, file: !158, line: 1420, baseType: !564, size: 32, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !811, file: !158, line: 1421, baseType: !816, size: 8, offset: 224)
!816 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 8, elements: !701)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !723, file: !158, line: 3379, baseType: !818, size: 320)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !819)
!819 = !{!820, !821, !822}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !818, file: !158, line: 1429, baseType: !759, size: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !818, file: !158, line: 1430, baseType: !721, size: 64, offset: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !818, file: !158, line: 1431, baseType: !721, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !723, file: !158, line: 3380, baseType: !824, size: 320)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !158, line: 1461, baseType: !759, size: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !824, file: !158, line: 1462, baseType: !828, size: 128, offset: 192)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !829, line: 31, size: 128, elements: !830)
!829 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!830 = !{!831, !834, !835}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !828, file: !829, line: 32, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !563)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !828, file: !829, line: 33, baseType: !7, size: 32, offset: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !828, file: !829, line: 34, baseType: !7, size: 32, offset: 96)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !723, file: !158, line: 3381, baseType: !837, size: 384)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !838)
!838 = !{!839, !840, !845, !846, !847}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !837, file: !158, line: 2508, baseType: !759, size: 192)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !837, file: !158, line: 2509, baseType: !841, size: 32, offset: 192)
!841 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !842, line: 58, baseType: !843)
!842 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !844, line: 44, baseType: !7)
!844 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!845 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !837, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !837, file: !158, line: 2511, baseType: !721, size: 64, offset: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !837, file: !158, line: 2512, baseType: !721, size: 64, offset: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !723, file: !158, line: 3382, baseType: !849, size: 896)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !850)
!850 = !{!851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !849, file: !158, line: 2653, baseType: !837, size: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !849, file: !158, line: 2654, baseType: !721, size: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !849, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !849, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !849, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !849, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !849, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !849, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !849, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !849, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !849, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !849, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !849, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !849, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !849, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !849, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !849, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !849, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !849, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !849, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !849, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !849, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !849, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !849, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !849, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !849, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !849, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !849, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !849, file: !158, line: 2705, baseType: !721, size: 64, offset: 576)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !849, file: !158, line: 2706, baseType: !721, size: 64, offset: 640)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !849, file: !158, line: 2707, baseType: !721, size: 64, offset: 704)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !849, file: !158, line: 2708, baseType: !721, size: 64, offset: 768)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !849, file: !158, line: 2711, baseType: !884, size: 64, offset: 832)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !723, file: !158, line: 3383, baseType: !887, size: 960)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !888)
!888 = !{!889, !890}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !158, line: 2757, baseType: !849, size: 896)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !887, file: !158, line: 2758, baseType: !667, size: 64, offset: 896)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !723, file: !158, line: 3384, baseType: !892, size: 1472)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !893)
!893 = !{!894, !915, !916, !917, !918}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !892, file: !158, line: 3115, baseType: !895, size: 1216)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !896)
!896 = !{!897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !895, file: !158, line: 2985, baseType: !887, size: 960)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !895, file: !158, line: 2986, baseType: !721, size: 64, offset: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !895, file: !158, line: 2987, baseType: !721, size: 64, offset: 1024)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !895, file: !158, line: 2988, baseType: !721, size: 64, offset: 1088)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !895, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !895, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !895, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !895, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !895, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !895, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !895, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !895, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !895, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !895, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !895, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !895, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !895, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !895, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !892, file: !158, line: 3117, baseType: !721, size: 64, offset: 1216)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !892, file: !158, line: 3119, baseType: !721, size: 64, offset: 1280)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !892, file: !158, line: 3121, baseType: !721, size: 64, offset: 1344)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !892, file: !158, line: 3123, baseType: !721, size: 64, offset: 1408)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !723, file: !158, line: 3385, baseType: !920, size: 1088)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !921)
!921 = !{!922, !923, !924}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !158, line: 2875, baseType: !887, size: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !920, file: !158, line: 2876, baseType: !667, size: 64, offset: 960)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !920, file: !158, line: 2877, baseType: !925, size: 64, offset: 1024)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !723, file: !158, line: 3386, baseType: !895, size: 1216)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !723, file: !158, line: 3387, baseType: !929, size: 1280)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !158, line: 3094, baseType: !895, size: 1216)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !929, file: !158, line: 3095, baseType: !925, size: 64, offset: 1216)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !723, file: !158, line: 3388, baseType: !934, size: 1216)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !935)
!935 = !{!936, !937, !938, !939, !940, !941}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !934, file: !158, line: 2825, baseType: !849, size: 896)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !934, file: !158, line: 2827, baseType: !721, size: 64, offset: 896)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !934, file: !158, line: 2828, baseType: !721, size: 64, offset: 960)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !934, file: !158, line: 2829, baseType: !721, size: 64, offset: 1024)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !934, file: !158, line: 2830, baseType: !721, size: 64, offset: 1088)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !934, file: !158, line: 2831, baseType: !721, size: 64, offset: 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !723, file: !158, line: 3389, baseType: !943, size: 1024)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !944)
!944 = !{!945, !946, !947}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !943, file: !158, line: 2851, baseType: !887, size: 960)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !943, file: !158, line: 2852, baseType: !564, size: 32, offset: 960)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !943, file: !158, line: 2853, baseType: !564, size: 32, offset: 992)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !723, file: !158, line: 3390, baseType: !949, size: 1024)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !949, file: !158, line: 2858, baseType: !887, size: 960)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !949, file: !158, line: 2859, baseType: !925, size: 64, offset: 960)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !723, file: !158, line: 3391, baseType: !954, size: 960)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !955)
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !954, file: !158, line: 2863, baseType: !887, size: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !723, file: !158, line: 3392, baseType: !958, size: 1472)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !959)
!959 = !{!960}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !958, file: !158, line: 3305, baseType: !892, size: 1472)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !723, file: !158, line: 3393, baseType: !962, size: 1792)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !963)
!963 = !{!964, !965, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !962, file: !158, line: 3249, baseType: !892, size: 1472)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !962, file: !158, line: 3251, baseType: !966, size: 64, offset: 1472)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !968, line: 463, size: 1152, elements: !969)
!968 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!969 = !{!970, !1134, !1238, !1239, !1242, !1245, !1246, !1247, !1248, !1249, !1250, !1274, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !967, file: !968, line: 464, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !973)
!973 = !{!974, !1023, !1036, !1050, !1102, !1115}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !972, file: !135, line: 197, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984, !1011, !1020, !1021, !1022}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !977, file: !135, line: 119, baseType: !976, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !977, file: !135, line: 122, baseType: !976, size: 64, offset: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !977, file: !135, line: 123, baseType: !976, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !977, file: !135, line: 126, baseType: !564, size: 32, offset: 192)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !977, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !977, file: !135, line: 165, baseType: !985, size: 192, offset: 256)
!985 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !986)
!986 = !{!987, !1000, !1006}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !985, file: !135, line: 137, baseType: !988, size: 128)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !989)
!989 = !{!990, !999}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !988, file: !135, line: 135, baseType: !991, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !993)
!993 = !{!994, !995, !996, !997, !998}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !992, file: !135, line: 96, baseType: !991, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !992, file: !135, line: 97, baseType: !991, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !992, file: !135, line: 101, baseType: !721, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !992, file: !135, line: 106, baseType: !721, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !992, file: !135, line: 111, baseType: !721, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !988, file: !135, line: 136, baseType: !991, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !985, file: !135, line: 151, baseType: !1001, size: 192)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1002)
!1002 = !{!1003, !1004, !1005}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1001, file: !135, line: 141, baseType: !721, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1001, file: !135, line: 145, baseType: !721, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1001, file: !135, line: 150, baseType: !564, size: 32, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !985, file: !135, line: 164, baseType: !1007, size: 128)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1008)
!1008 = !{!1009, !1010}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1007, file: !135, line: 161, baseType: !721, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1007, file: !135, line: 163, baseType: !841, size: 32, offset: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !977, file: !135, line: 168, baseType: !1012, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1019}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1013, file: !135, line: 70, baseType: !1012, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1013, file: !135, line: 73, baseType: !976, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1013, file: !135, line: 78, baseType: !721, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1013, file: !135, line: 85, baseType: !667, size: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1013, file: !135, line: 88, baseType: !564, size: 32, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !977, file: !135, line: 173, baseType: !667, size: 64, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !977, file: !135, line: 173, baseType: !667, size: 64, offset: 576)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !977, file: !135, line: 177, baseType: !563, size: 8, offset: 640)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !972, file: !135, line: 200, baseType: !1024, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1027)
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1026, file: !135, line: 185, baseType: !1029, size: 128)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1030, file: !135, line: 184, baseType: !7, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1030, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1030, file: !135, line: 184, baseType: !1035, size: 64, offset: 64)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !975, size: 64, elements: !701)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !972, file: !135, line: 203, baseType: !1037, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1040)
!1040 = !{!1041}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1039, file: !135, line: 189, baseType: !1042, size: 128)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1044)
!1044 = !{!1045, !1046, !1047}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1043, file: !135, line: 188, baseType: !7, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1043, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1043, file: !135, line: 188, baseType: !1048, size: 64, offset: 64)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 64, elements: !701)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1012)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !972, file: !135, line: 207, baseType: !1051, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1052, line: 144, baseType: !1053)
!1052 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1052, line: 100, size: 896, elements: !1055)
!1055 = !{!1056, !1064, !1069, !1074, !1076, !1079, !1080, !1081, !1082, !1083, !1088, !1090, !1091, !1096, !1101}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1054, file: !1052, line: 102, baseType: !1057, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1052, line: 52, baseType: !1058)
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = !DISubroutineType(types: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1052, line: 47, baseType: !7)
!1062 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1054, file: !1052, line: 105, baseType: !1065, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1052, line: 59, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!564, !1062, !1062}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1054, file: !1052, line: 108, baseType: !1070, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1052, line: 63, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !568}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1054, file: !1052, line: 111, baseType: !1075, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1054, file: !1052, line: 114, baseType: !1077, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1078, line: 46, baseType: !605)
!1078 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1054, file: !1052, line: 117, baseType: !1077, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1054, file: !1052, line: 120, baseType: !1077, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1054, file: !1052, line: 124, baseType: !7, size: 32, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1054, file: !1052, line: 128, baseType: !7, size: 32, offset: 480)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1054, file: !1052, line: 131, baseType: !1084, size: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1052, line: 75, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!568, !1077, !1077}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1054, file: !1052, line: 132, baseType: !1089, size: 64, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1052, line: 78, baseType: !1071)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1054, file: !1052, line: 135, baseType: !568, size: 64, offset: 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1054, file: !1052, line: 136, baseType: !1092, size: 64, offset: 704)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1052, line: 82, baseType: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!568, !568, !1077, !1077}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1054, file: !1052, line: 137, baseType: !1097, size: 64, offset: 768)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1052, line: 83, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{null, !568, !568}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1054, file: !1052, line: 141, baseType: !7, size: 32, offset: 832)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !972, file: !135, line: 211, baseType: !1103, size: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1106)
!1106 = !{!1107}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1105, file: !158, line: 183, baseType: !1108, size: 128)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1110)
!1110 = !{!1111, !1112, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1109, file: !158, line: 182, baseType: !7, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1109, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1109, file: !158, line: 182, baseType: !1114, size: 64, offset: 64)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 64, elements: !701)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !972, file: !135, line: 220, baseType: !1116, size: 64, offset: 320)
!1116 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1116, file: !135, line: 218, baseType: !1103, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1116, file: !135, line: 219, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1122, line: 29, baseType: !1123)
!1122 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1122, line: 29, size: 96, elements: !1124)
!1124 = !{!1125}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1123, file: !1122, line: 29, baseType: !1126, size: 96)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1122, line: 27, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1122, line: 27, size: 96, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1127, file: !1122, line: 27, baseType: !7, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1127, file: !1122, line: 27, baseType: !7, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1127, file: !1122, line: 27, baseType: !1132, size: 8, offset: 64)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1133, size: 8, elements: !701)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1122, line: 26, baseType: !563)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !967, file: !968, line: 467, baseType: !1135, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1137)
!1137 = !{!1138, !1213, !1214, !1227, !1228, !1229, !1230, !1231, !1232, !1234, !1236, !1237}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1136, file: !142, line: 377, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !588, line: 111, baseType: !1140)
!1140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1141, size: 64)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1142)
!1142 = !{!1143, !1178, !1179, !1180, !1183, !1187, !1188, !1189, !1207, !1208, !1209, !1210, !1211, !1212}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1141, file: !142, line: 219, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1147)
!1147 = !{!1148}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1146, file: !142, line: 151, baseType: !1149, size: 128)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1151)
!1151 = !{!1152, !1153, !1154}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1150, file: !142, line: 150, baseType: !7, size: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1150, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1150, file: !142, line: 150, baseType: !1155, size: 64, offset: 64)
!1155 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1156, size: 64, elements: !701)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !588, line: 108, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1159)
!1159 = !{!1160, !1161, !1162, !1170, !1171, !1172, !1173, !1174, !1175, !1176}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1158, file: !142, line: 124, baseType: !1140, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1158, file: !142, line: 125, baseType: !1140, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1158, file: !142, line: 131, baseType: !1163, size: 64, offset: 128)
!1163 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1164)
!1164 = !{!1165, !1169}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1163, file: !142, line: 129, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !588, line: 66, baseType: !1167)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !588, line: 65, flags: DIFlagFwdDecl)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1163, file: !142, line: 130, baseType: !667, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1158, file: !142, line: 134, baseType: !568, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1158, file: !142, line: 137, baseType: !721, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1158, file: !142, line: 138, baseType: !841, size: 32, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1158, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1158, file: !142, line: 144, baseType: !564, size: 32, offset: 384)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1158, file: !142, line: 145, baseType: !564, size: 32, offset: 416)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1158, file: !142, line: 146, baseType: !1177, size: 64, offset: 448)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !622)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1141, file: !142, line: 220, baseType: !1144, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1141, file: !142, line: 223, baseType: !568, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1141, file: !142, line: 226, baseType: !1181, size: 64, offset: 192)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1141, file: !142, line: 229, baseType: !1184, size: 128, offset: 256)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1185, size: 128, elements: !606)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1141, file: !142, line: 232, baseType: !1140, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1141, file: !142, line: 233, baseType: !1140, size: 64, offset: 448)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1141, file: !142, line: 238, baseType: !1190, size: 64, offset: 512)
!1190 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1191)
!1191 = !{!1192, !1198}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1190, file: !142, line: 236, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1194, size: 64)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1195)
!1195 = !{!1196, !1197}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1194, file: !142, line: 275, baseType: !1166, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1194, file: !142, line: 278, baseType: !1166, size: 64, offset: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1190, file: !142, line: 237, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1200, file: !142, line: 261, baseType: !667, size: 64)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1200, file: !142, line: 262, baseType: !667, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1200, file: !142, line: 266, baseType: !667, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1200, file: !142, line: 267, baseType: !667, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1200, file: !142, line: 270, baseType: !564, size: 32, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1141, file: !142, line: 241, baseType: !1177, size: 64, offset: 576)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1141, file: !142, line: 244, baseType: !564, size: 32, offset: 640)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1141, file: !142, line: 247, baseType: !564, size: 32, offset: 672)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1141, file: !142, line: 250, baseType: !564, size: 32, offset: 704)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1141, file: !142, line: 253, baseType: !564, size: 32, offset: 736)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !142, line: 256, baseType: !564, size: 32, offset: 768)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1136, file: !142, line: 378, baseType: !1139, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1136, file: !142, line: 381, baseType: !1215, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1218)
!1218 = !{!1219}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1217, file: !142, line: 282, baseType: !1220, size: 128)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1222)
!1222 = !{!1223, !1224, !1225}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1221, file: !142, line: 281, baseType: !7, size: 32)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1221, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1221, file: !142, line: 281, baseType: !1226, size: 64, offset: 64)
!1226 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1139, size: 64, elements: !701)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1136, file: !142, line: 384, baseType: !564, size: 32, offset: 192)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1136, file: !142, line: 387, baseType: !564, size: 32, offset: 224)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1136, file: !142, line: 390, baseType: !564, size: 32, offset: 256)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1136, file: !142, line: 394, baseType: !1215, size: 64, offset: 320)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1136, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1136, file: !142, line: 399, baseType: !1233, size: 64, offset: 416)
!1233 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !606)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1136, file: !142, line: 402, baseType: !1235, size: 64, offset: 480)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !606)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1136, file: !142, line: 406, baseType: !564, size: 32, offset: 544)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1136, file: !142, line: 409, baseType: !564, size: 32, offset: 576)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !967, file: !968, line: 470, baseType: !1167, size: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !967, file: !968, line: 473, baseType: !1240, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !968, line: 166, flags: DIFlagFwdDecl)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !967, file: !968, line: 476, baseType: !1243, size: 64, offset: 256)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !968, line: 476, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !967, file: !968, line: 479, baseType: !1051, size: 64, offset: 320)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !967, file: !968, line: 484, baseType: !721, size: 64, offset: 384)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !967, file: !968, line: 488, baseType: !721, size: 64, offset: 448)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !967, file: !968, line: 493, baseType: !721, size: 64, offset: 512)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !967, file: !968, line: 496, baseType: !721, size: 64, offset: 576)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !967, file: !968, line: 501, baseType: !1251, size: 64, offset: 640)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1253)
!1253 = !{!1254, !1257, !1258, !1259, !1260, !1262, !1263, !1268, !1269, !1270, !1271, !1272, !1273}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1252, file: !153, line: 2356, baseType: !1255, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1252, file: !153, line: 2357, baseType: !569, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1252, file: !153, line: 2358, baseType: !564, size: 32, offset: 128)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1252, file: !153, line: 2359, baseType: !564, size: 32, offset: 160)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1252, file: !153, line: 2360, baseType: !1261, size: 128, offset: 192)
!1261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !564, size: 128, elements: !631)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1252, file: !153, line: 2364, baseType: !564, size: 32, offset: 320)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1252, file: !153, line: 2367, baseType: !1264, size: 128, offset: 384)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1265)
!1265 = !{!1266, !1267}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1264, file: !153, line: 2351, baseType: !667, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1264, file: !153, line: 2352, baseType: !622, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1252, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1252, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1252, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1252, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1252, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1252, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !967, file: !968, line: 504, baseType: !1275, size: 64, offset: 704)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !968, line: 504, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !967, file: !968, line: 507, baseType: !1051, size: 64, offset: 768)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !967, file: !968, line: 510, baseType: !564, size: 32, offset: 832)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !967, file: !968, line: 513, baseType: !564, size: 32, offset: 864)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !967, file: !968, line: 516, baseType: !841, size: 32, offset: 896)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !967, file: !968, line: 519, baseType: !841, size: 32, offset: 928)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !967, file: !968, line: 522, baseType: !7, size: 32, offset: 960)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !967, file: !968, line: 523, baseType: !7, size: 32, offset: 992)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !967, file: !968, line: 528, baseType: !569, size: 64, offset: 1024)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !967, file: !968, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !967, file: !968, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !967, file: !968, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !967, file: !968, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !967, file: !968, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !967, file: !968, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !967, file: !968, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !967, file: !968, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !967, file: !968, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !967, file: !968, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !967, file: !968, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !967, file: !968, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !967, file: !968, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !967, file: !968, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !967, file: !968, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !967, file: !968, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !962, file: !158, line: 3254, baseType: !721, size: 64, offset: 1536)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !962, file: !158, line: 3257, baseType: !721, size: 64, offset: 1600)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !962, file: !158, line: 3258, baseType: !721, size: 64, offset: 1664)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !962, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !962, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !962, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !962, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !962, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !962, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !962, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !962, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !962, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !962, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !962, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !962, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !962, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !962, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !962, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !962, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !962, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !962, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !158, line: 3394, baseType: !1323, size: 1344)
!1323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !1324)
!1324 = !{!1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1350, !1351, !1352, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368}
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1323, file: !158, line: 2280, baseType: !759, size: 192)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1323, file: !158, line: 2281, baseType: !721, size: 64, offset: 192)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1323, file: !158, line: 2282, baseType: !721, size: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1323, file: !158, line: 2283, baseType: !721, size: 64, offset: 320)
