; ModuleID = 'reload.bc'
source_filename = "reload.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!2049 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!2050 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!2051 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!2052 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!2053 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!2054 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!2055 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!2056 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!2057 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!2058 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!2059 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!2060 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!2061 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!2062 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!2063 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!2064 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!2065 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!2066 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!2067 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!2068 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!2069 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!2070 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!2071 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!2072 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!2073 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!2074 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!2075 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!2076 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!2077 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!2078 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !1936, line: 836, baseType: !7, size: 32, elements: !2079)
!2079 = !{!2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111}
!2080 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!2081 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!2082 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!2083 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!2084 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!2085 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!2086 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!2087 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!2088 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!2089 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!2090 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!2091 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!2092 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!2093 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!2094 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!2095 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!2096 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!2097 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!2098 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!2099 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!2100 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!2101 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!2102 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!2103 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!2104 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!2105 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!2106 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!2107 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!2108 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!2109 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!2110 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!2111 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!2112 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reload_usage", scope: !2113, file: !3, line: 2579, baseType: !7, size: 32, elements: !3433)
!2113 = distinct !DISubprogram(name: "find_reloads", scope: !3, file: !3, line: 2555, type: !2114, scopeLine: 2557, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !3195)
!2114 = !DISubroutineType(types: !2115)
!2115 = !{!2116, !2117, !2116, !2116, !2116, !3193}
!2116 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2117 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2118, line: 50, baseType: !2119)
!2118 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2120, size: 64)
!2120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1936, line: 240, size: 384, elements: !2121)
!2121 = !{!2122, !2123, !2124, !2125, !2126, !2127, !2128, !2129, !2130, !2131, !2132}
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2120, file: !1936, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2120, file: !1936, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2120, file: !1936, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2120, file: !1936, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2120, file: !1936, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2120, file: !1936, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2120, file: !1936, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2120, file: !1936, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2120, file: !1936, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2120, file: !1936, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2120, file: !1936, line: 321, baseType: !2133, size: 320, offset: 64)
!2133 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1936, line: 315, size: 320, elements: !2134)
!2134 = !{!2135, !3128, !3130, !3191, !3192}
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2133, file: !1936, line: 316, baseType: !2136, size: 64)
!2136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2137, size: 64, elements: !2155)
!2137 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1936, line: 183, baseType: !2138)
!2138 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1936, line: 166, size: 64, elements: !2139)
!2139 = !{!2140, !2141, !2142, !2146, !2147, !2157, !2158, !2170, !2173, !2237, !3106, !3107, !3118, !3125}
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2138, file: !1936, line: 168, baseType: !2116, size: 32)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2138, file: !1936, line: 169, baseType: !7, size: 32)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2138, file: !1936, line: 170, baseType: !2143, size: 64)
!2143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2144, size: 64)
!2144 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2145)
!2145 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2138, file: !1936, line: 171, baseType: !2117, size: 64)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2138, file: !1936, line: 172, baseType: !2148, size: 64)
!2148 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2118, line: 53, baseType: !2149)
!2149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2150, size: 64)
!2150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1936, line: 359, size: 128, elements: !2151)
!2151 = !{!2152, !2153}
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2150, file: !1936, line: 360, baseType: !2116, size: 32)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2150, file: !1936, line: 361, baseType: !2154, size: 64, offset: 64)
!2154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2117, size: 64, elements: !2155)
!2155 = !{!2156}
!2156 = !DISubrange(count: 1)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2138, file: !1936, line: 173, baseType: !37, size: 32)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2138, file: !1936, line: 174, baseType: !2159, size: 32)
!2159 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1936, line: 133, baseType: !2160)
!2160 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1936, line: 115, size: 32, elements: !2161)
!2161 = !{!2162, !2163, !2164, !2165, !2166, !2167, !2168, !2169}
!2162 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2160, file: !1936, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2163 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2160, file: !1936, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2160, file: !1936, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2160, file: !1936, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2160, file: !1936, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2160, file: !1936, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2160, file: !1936, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2160, file: !1936, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2138, file: !1936, line: 175, baseType: !2171, size: 64)
!2171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2172, size: 64)
!2172 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1936, line: 175, flags: DIFlagFwdDecl)
!2173 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2138, file: !1936, line: 176, baseType: !2174, size: 64)
!2174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2175, size: 64)
!2175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2176, line: 75, size: 256, elements: !2177)
!2176 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2177 = !{!2178, !2193, !2194, !2195}
!2178 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2175, file: !2176, line: 76, baseType: !2179, size: 64)
!2179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2180, size: 64)
!2180 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2176, line: 68, baseType: !2181)
!2181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2176, line: 63, size: 320, elements: !2182)
!2182 = !{!2183, !2185, !2186, !2187}
!2183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2181, file: !2176, line: 64, baseType: !2184, size: 64)
!2184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2181, size: 64)
!2185 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2181, file: !2176, line: 65, baseType: !2184, size: 64, offset: 64)
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2181, file: !2176, line: 66, baseType: !7, size: 32, offset: 128)
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2181, file: !2176, line: 67, baseType: !2188, size: 128, offset: 192)
!2188 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2189, size: 128, elements: !2191)
!2189 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2176, line: 29, baseType: !2190)
!2190 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2191 = !{!2192}
!2192 = !DISubrange(count: 2)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2175, file: !2176, line: 77, baseType: !2179, size: 64, offset: 64)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2175, file: !2176, line: 78, baseType: !7, size: 32, offset: 128)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2175, file: !2176, line: 79, baseType: !2196, size: 64, offset: 192)
!2196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2197, size: 64)
!2197 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2176, line: 49, baseType: !2198)
!2198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2176, line: 45, size: 832, elements: !2199)
!2199 = !{!2200, !2201, !2202}
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2198, file: !2176, line: 46, baseType: !2184, size: 64)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2198, file: !2176, line: 47, baseType: !2174, size: 64, offset: 64)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2198, file: !2176, line: 48, baseType: !2203, size: 704, offset: 128)
!2203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2204, line: 164, size: 704, elements: !2205)
!2204 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2205 = !{!2206, !2208, !2219, !2220, !2221, !2222, !2223, !2224, !2229, !2233, !2234, !2235, !2236}
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2203, file: !2204, line: 166, baseType: !2207, size: 64)
!2207 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2203, file: !2204, line: 167, baseType: !2209, size: 64, offset: 64)
!2209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2210, size: 64)
!2210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2204, line: 157, size: 192, elements: !2211)
!2211 = !{!2212, !2214, !2215}
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2210, file: !2204, line: 159, baseType: !2213, size: 64)
!2213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2145, size: 64)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2210, file: !2204, line: 160, baseType: !2209, size: 64, offset: 64)
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2210, file: !2204, line: 161, baseType: !2216, size: 32, offset: 128)
!2216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2145, size: 32, elements: !2217)
!2217 = !{!2218}
!2218 = !DISubrange(count: 4)
!2219 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2203, file: !2204, line: 168, baseType: !2213, size: 64, offset: 128)
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2203, file: !2204, line: 169, baseType: !2213, size: 64, offset: 192)
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2203, file: !2204, line: 170, baseType: !2213, size: 64, offset: 256)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2203, file: !2204, line: 171, baseType: !2207, size: 64, offset: 320)
!2223 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2203, file: !2204, line: 172, baseType: !2116, size: 32, offset: 384)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2203, file: !2204, line: 176, baseType: !2225, size: 64, offset: 448)
!2225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2226, size: 64)
!2226 = !DISubroutineType(types: !2227)
!2227 = !{!2209, !2228, !2207}
!2228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2203, file: !2204, line: 177, baseType: !2230, size: 64, offset: 512)
!2230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2231, size: 64)
!2231 = !DISubroutineType(types: !2232)
!2232 = !{null, !2228, !2209}
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2203, file: !2204, line: 178, baseType: !2228, size: 64, offset: 576)
!2234 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2203, file: !2204, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2203, file: !2204, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2203, file: !2204, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2138, file: !1936, line: 177, baseType: !2238, size: 64)
!2238 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2118, line: 56, baseType: !2239)
!2239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2240, size: 64)
!2240 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !181, line: 3371, size: 1792, elements: !2241)
!2241 = !{!2242, !2275, !2281, !2292, !2311, !2322, !2327, !2334, !2340, !2354, !2366, !2404, !2409, !2437, !2445, !2446, !2451, !2460, !2466, !2471, !2475, !2479, !2730, !2779, !2785, !2792, !2799, !2825, !2850, !2867, !2879, !2901, !2916, !3088}
!2242 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2240, file: !181, line: 3372, baseType: !2243, size: 64)
!2243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !181, line: 360, size: 64, elements: !2244)
!2244 = !{!2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252, !2253, !2254, !2255, !2256, !2257, !2258, !2259, !2260, !2261, !2262, !2263, !2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274}
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2243, file: !181, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2243, file: !181, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2247 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2243, file: !181, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2248 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2243, file: !181, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2243, file: !181, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2243, file: !181, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2251 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2243, file: !181, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2252 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2243, file: !181, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2253 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2243, file: !181, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2254 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2243, file: !181, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2243, file: !181, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2256 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2243, file: !181, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2243, file: !181, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2258 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2243, file: !181, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2259 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2243, file: !181, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2260 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2243, file: !181, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2261 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2243, file: !181, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2243, file: !181, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2243, file: !181, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2264 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2243, file: !181, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2265 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2243, file: !181, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2266 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2243, file: !181, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2267 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2243, file: !181, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2243, file: !181, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2243, file: !181, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2243, file: !181, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2243, file: !181, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2272 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2243, file: !181, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2243, file: !181, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2243, file: !181, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2275 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2240, file: !181, line: 3373, baseType: !2276, size: 192)
!2276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !181, line: 402, size: 192, elements: !2277)
!2277 = !{!2278, !2279, !2280}
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2276, file: !181, line: 403, baseType: !2243, size: 64)
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2276, file: !181, line: 404, baseType: !2238, size: 64, offset: 64)
!2280 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2276, file: !181, line: 405, baseType: !2238, size: 64, offset: 128)
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2240, file: !181, line: 3374, baseType: !2282, size: 320)
!2282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !181, line: 1384, size: 320, elements: !2283)
!2283 = !{!2284, !2285}
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2282, file: !181, line: 1385, baseType: !2276, size: 192)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2282, file: !181, line: 1386, baseType: !2286, size: 128, offset: 192)
!2286 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2287, line: 58, baseType: !2288)
!2287 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2288 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2287, line: 54, size: 128, elements: !2289)
!2289 = !{!2290, !2291}
!2290 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2288, file: !2287, line: 56, baseType: !2190, size: 64)
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2288, file: !2287, line: 57, baseType: !2207, size: 64, offset: 64)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2240, file: !181, line: 3375, baseType: !2293, size: 256)
!2293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !181, line: 1397, size: 256, elements: !2294)
!2294 = !{!2295, !2296}
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2293, file: !181, line: 1398, baseType: !2276, size: 192)
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2293, file: !181, line: 1399, baseType: !2297, size: 64, offset: 192)
!2297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2298, size: 64)
!2298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2299, line: 52, size: 256, elements: !2300)
!2299 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2300 = !{!2301, !2302, !2303, !2304, !2305, !2306, !2307}
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2298, file: !2299, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2302 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2298, file: !2299, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2303 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2298, file: !2299, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2304 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2298, file: !2299, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2298, file: !2299, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2298, file: !2299, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2298, file: !2299, line: 62, baseType: !2308, size: 192, offset: 64)
!2308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2190, size: 192, elements: !2309)
!2309 = !{!2310}
!2310 = !DISubrange(count: 3)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2240, file: !181, line: 3376, baseType: !2312, size: 256)
!2312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !181, line: 1408, size: 256, elements: !2313)
!2313 = !{!2314, !2315}
!2314 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2312, file: !181, line: 1409, baseType: !2276, size: 192)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2312, file: !181, line: 1410, baseType: !2316, size: 64, offset: 192)
!2316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2317, size: 64)
!2317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2318, line: 27, size: 192, elements: !2319)
!2318 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2319 = !{!2320, !2321}
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2317, file: !2318, line: 29, baseType: !2286, size: 128)
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2317, file: !2318, line: 30, baseType: !37, size: 32, offset: 128)
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2240, file: !181, line: 3377, baseType: !2323, size: 256)
!2323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !181, line: 1437, size: 256, elements: !2324)
!2324 = !{!2325, !2326}
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2323, file: !181, line: 1438, baseType: !2276, size: 192)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2323, file: !181, line: 1439, baseType: !2238, size: 64, offset: 192)
!2327 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2240, file: !181, line: 3378, baseType: !2328, size: 256)
!2328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !181, line: 1418, size: 256, elements: !2329)
!2329 = !{!2330, !2331, !2332}
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2328, file: !181, line: 1419, baseType: !2276, size: 192)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2328, file: !181, line: 1420, baseType: !2116, size: 32, offset: 192)
!2332 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2328, file: !181, line: 1421, baseType: !2333, size: 8, offset: 224)
!2333 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2145, size: 8, elements: !2155)
!2334 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2240, file: !181, line: 3379, baseType: !2335, size: 320)
!2335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !181, line: 1428, size: 320, elements: !2336)
!2336 = !{!2337, !2338, !2339}
!2337 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2335, file: !181, line: 1429, baseType: !2276, size: 192)
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2335, file: !181, line: 1430, baseType: !2238, size: 64, offset: 192)
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2335, file: !181, line: 1431, baseType: !2238, size: 64, offset: 256)
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2240, file: !181, line: 3380, baseType: !2341, size: 320)
!2341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !181, line: 1460, size: 320, elements: !2342)
!2342 = !{!2343, !2344}
!2343 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2341, file: !181, line: 1461, baseType: !2276, size: 192)
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2341, file: !181, line: 1462, baseType: !2345, size: 128, offset: 192)
!2345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2346, line: 31, size: 128, elements: !2347)
!2346 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2347 = !{!2348, !2352, !2353}
!2348 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2345, file: !2346, line: 32, baseType: !2349, size: 64)
!2349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2350, size: 64)
!2350 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2351)
!2351 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2345, file: !2346, line: 33, baseType: !7, size: 32, offset: 64)
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2345, file: !2346, line: 34, baseType: !7, size: 32, offset: 96)
!2354 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2240, file: !181, line: 3381, baseType: !2355, size: 384)
!2355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !181, line: 2507, size: 384, elements: !2356)
!2356 = !{!2357, !2358, !2363, !2364, !2365}
!2357 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2355, file: !181, line: 2508, baseType: !2276, size: 192)
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2355, file: !181, line: 2509, baseType: !2359, size: 32, offset: 192)
!2359 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2360, line: 58, baseType: !2361)
!2360 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2361 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2362, line: 44, baseType: !7)
!2362 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2363 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2355, file: !181, line: 2510, baseType: !7, size: 32, offset: 224)
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2355, file: !181, line: 2511, baseType: !2238, size: 64, offset: 256)
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2355, file: !181, line: 2512, baseType: !2238, size: 64, offset: 320)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2240, file: !181, line: 3382, baseType: !2367, size: 896)
!2367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !181, line: 2652, size: 896, elements: !2368)
!2368 = !{!2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401}
!2369 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2367, file: !181, line: 2653, baseType: !2355, size: 384)
!2370 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2367, file: !181, line: 2654, baseType: !2238, size: 64, offset: 384)
!2371 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2367, file: !181, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2372 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2367, file: !181, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2373 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2367, file: !181, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2367, file: !181, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2375 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2367, file: !181, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2376 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2367, file: !181, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2377 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2367, file: !181, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2367, file: !181, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2367, file: !181, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2367, file: !181, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2367, file: !181, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2382 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2367, file: !181, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2367, file: !181, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2367, file: !181, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2367, file: !181, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2386 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2367, file: !181, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2387 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2367, file: !181, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2367, file: !181, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2367, file: !181, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2367, file: !181, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2367, file: !181, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2367, file: !181, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2367, file: !181, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2367, file: !181, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2367, file: !181, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2367, file: !181, line: 2703, baseType: !7, size: 32, offset: 512)
!2397 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2367, file: !181, line: 2705, baseType: !2238, size: 64, offset: 576)
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2367, file: !181, line: 2706, baseType: !2238, size: 64, offset: 640)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2367, file: !181, line: 2707, baseType: !2238, size: 64, offset: 704)
!2400 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2367, file: !181, line: 2708, baseType: !2238, size: 64, offset: 768)
!2401 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2367, file: !181, line: 2711, baseType: !2402, size: 64, offset: 832)
!2402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2403, size: 64)
!2403 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !181, line: 2711, flags: DIFlagFwdDecl)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2240, file: !181, line: 3383, baseType: !2405, size: 960)
!2405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !181, line: 2756, size: 960, elements: !2406)
!2406 = !{!2407, !2408}
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2405, file: !181, line: 2757, baseType: !2367, size: 896)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2405, file: !181, line: 2758, baseType: !2117, size: 64, offset: 896)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2240, file: !181, line: 3384, baseType: !2410, size: 1472)
!2410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !181, line: 3114, size: 1472, elements: !2411)
!2411 = !{!2412, !2433, !2434, !2435, !2436}
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2410, file: !181, line: 3115, baseType: !2413, size: 1216)
!2413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !181, line: 2984, size: 1216, elements: !2414)
!2414 = !{!2415, !2416, !2417, !2418, !2419, !2420, !2421, !2422, !2423, !2424, !2425, !2426, !2427, !2428, !2429, !2430, !2431, !2432}
!2415 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2413, file: !181, line: 2985, baseType: !2405, size: 960)
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2413, file: !181, line: 2986, baseType: !2238, size: 64, offset: 960)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2413, file: !181, line: 2987, baseType: !2238, size: 64, offset: 1024)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2413, file: !181, line: 2988, baseType: !2238, size: 64, offset: 1088)
!2419 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2413, file: !181, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2420 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2413, file: !181, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2421 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2413, file: !181, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2413, file: !181, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2413, file: !181, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2424 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2413, file: !181, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2425 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2413, file: !181, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2426 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2413, file: !181, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2413, file: !181, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2413, file: !181, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2429 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2413, file: !181, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2413, file: !181, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2413, file: !181, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2432 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2413, file: !181, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2433 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2410, file: !181, line: 3117, baseType: !2238, size: 64, offset: 1216)
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2410, file: !181, line: 3119, baseType: !2238, size: 64, offset: 1280)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2410, file: !181, line: 3121, baseType: !2238, size: 64, offset: 1344)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2410, file: !181, line: 3123, baseType: !2238, size: 64, offset: 1408)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2240, file: !181, line: 3385, baseType: !2438, size: 1088)
!2438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !181, line: 2874, size: 1088, elements: !2439)
!2439 = !{!2440, !2441, !2442}
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2438, file: !181, line: 2875, baseType: !2405, size: 960)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2438, file: !181, line: 2876, baseType: !2117, size: 64, offset: 960)
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2438, file: !181, line: 2877, baseType: !2443, size: 64, offset: 1024)
!2443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2444, size: 64)
!2444 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !181, line: 2856, flags: DIFlagFwdDecl)
!2445 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2240, file: !181, line: 3386, baseType: !2413, size: 1216)
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2240, file: !181, line: 3387, baseType: !2447, size: 1280)
!2447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !181, line: 3093, size: 1280, elements: !2448)
!2448 = !{!2449, !2450}
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2447, file: !181, line: 3094, baseType: !2413, size: 1216)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2447, file: !181, line: 3095, baseType: !2443, size: 64, offset: 1216)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2240, file: !181, line: 3388, baseType: !2452, size: 1216)
!2452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !181, line: 2824, size: 1216, elements: !2453)
!2453 = !{!2454, !2455, !2456, !2457, !2458, !2459}
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2452, file: !181, line: 2825, baseType: !2367, size: 896)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2452, file: !181, line: 2827, baseType: !2238, size: 64, offset: 896)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2452, file: !181, line: 2828, baseType: !2238, size: 64, offset: 960)
!2457 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2452, file: !181, line: 2829, baseType: !2238, size: 64, offset: 1024)
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2452, file: !181, line: 2830, baseType: !2238, size: 64, offset: 1088)
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2452, file: !181, line: 2831, baseType: !2238, size: 64, offset: 1152)
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2240, file: !181, line: 3389, baseType: !2461, size: 1024)
!2461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !181, line: 2850, size: 1024, elements: !2462)
!2462 = !{!2463, !2464, !2465}
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2461, file: !181, line: 2851, baseType: !2405, size: 960)
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2461, file: !181, line: 2852, baseType: !2116, size: 32, offset: 960)
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2461, file: !181, line: 2853, baseType: !2116, size: 32, offset: 992)
!2466 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2240, file: !181, line: 3390, baseType: !2467, size: 1024)
!2467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !181, line: 2857, size: 1024, elements: !2468)
!2468 = !{!2469, !2470}
!2469 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2467, file: !181, line: 2858, baseType: !2405, size: 960)
!2470 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2467, file: !181, line: 2859, baseType: !2443, size: 64, offset: 960)
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2240, file: !181, line: 3391, baseType: !2472, size: 960)
!2472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !181, line: 2862, size: 960, elements: !2473)
!2473 = !{!2474}
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2472, file: !181, line: 2863, baseType: !2405, size: 960)
!2475 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2240, file: !181, line: 3392, baseType: !2476, size: 1472)
!2476 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !181, line: 3304, size: 1472, elements: !2477)
!2477 = !{!2478}
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2476, file: !181, line: 3305, baseType: !2410, size: 1472)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2240, file: !181, line: 3393, baseType: !2480, size: 1792)
!2480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !181, line: 3248, size: 1792, elements: !2481)
!2481 = !{!2482, !2483, !2709, !2710, !2711, !2712, !2713, !2714, !2715, !2716, !2717, !2718, !2719, !2720, !2721, !2722, !2723, !2724, !2725, !2726, !2727, !2728, !2729}
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2480, file: !181, line: 3249, baseType: !2410, size: 1472)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2480, file: !181, line: 3251, baseType: !2484, size: 64, offset: 1472)
!2484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2485, size: 64)
!2485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2486, line: 463, size: 1152, elements: !2487)
!2486 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2487 = !{!2488, !2491, !2595, !2596, !2599, !2602, !2654, !2655, !2656, !2657, !2658, !2682, !2685, !2686, !2687, !2688, !2689, !2690, !2691, !2692, !2693, !2694, !2695, !2696, !2697, !2698, !2699, !2700, !2701, !2702, !2703, !2704, !2705, !2706, !2707, !2708}
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2485, file: !2486, line: 464, baseType: !2489, size: 64)
!2489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2490, size: 64)
!2490 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2486, line: 464, flags: DIFlagFwdDecl)
!2491 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2485, file: !2486, line: 467, baseType: !2492, size: 64, offset: 64)
!2492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2493, size: 64)
!2493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !166, line: 374, size: 640, elements: !2494)
!2494 = !{!2495, !2570, !2571, !2584, !2585, !2586, !2587, !2588, !2589, !2591, !2593, !2594}
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2493, file: !166, line: 377, baseType: !2496, size: 64)
!2496 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2118, line: 111, baseType: !2497)
!2497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2498, size: 64)
!2498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !166, line: 217, size: 832, elements: !2499)
!2499 = !{!2500, !2535, !2536, !2537, !2540, !2544, !2545, !2546, !2564, !2565, !2566, !2567, !2568, !2569}
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2498, file: !166, line: 219, baseType: !2501, size: 64)
!2501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2502, size: 64)
!2502 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !166, line: 151, baseType: !2503)
!2503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !166, line: 151, size: 128, elements: !2504)
!2504 = !{!2505}
!2505 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2503, file: !166, line: 151, baseType: !2506, size: 128)
!2506 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !166, line: 150, baseType: !2507)
!2507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !166, line: 150, size: 128, elements: !2508)
!2508 = !{!2509, !2510, !2511}
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2507, file: !166, line: 150, baseType: !7, size: 32)
!2510 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2507, file: !166, line: 150, baseType: !7, size: 32, offset: 32)
!2511 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2507, file: !166, line: 150, baseType: !2512, size: 64, offset: 64)
!2512 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2513, size: 64, elements: !2155)
!2513 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2118, line: 108, baseType: !2514)
!2514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2515, size: 64)
!2515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !166, line: 122, size: 512, elements: !2516)
!2516 = !{!2517, !2518, !2519, !2527, !2528, !2529, !2530, !2531, !2532, !2533}
!2517 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2515, file: !166, line: 124, baseType: !2497, size: 64)
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2515, file: !166, line: 125, baseType: !2497, size: 64, offset: 64)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2515, file: !166, line: 131, baseType: !2520, size: 64, offset: 128)
!2520 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !166, line: 128, size: 64, elements: !2521)
!2521 = !{!2522, !2526}
!2522 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2520, file: !166, line: 129, baseType: !2523, size: 64)
!2523 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2118, line: 66, baseType: !2524)
!2524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2525, size: 64)
!2525 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2118, line: 65, flags: DIFlagFwdDecl)
!2526 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2520, file: !166, line: 130, baseType: !2117, size: 64)
!2527 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2515, file: !166, line: 134, baseType: !2228, size: 64, offset: 192)
!2528 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !2515, file: !166, line: 137, baseType: !2238, size: 64, offset: 256)
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !2515, file: !166, line: 138, baseType: !2359, size: 32, offset: 320)
!2530 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !2515, file: !166, line: 142, baseType: !7, size: 32, offset: 352)
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2515, file: !166, line: 144, baseType: !2116, size: 32, offset: 384)
!2532 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !2515, file: !166, line: 145, baseType: !2116, size: 32, offset: 416)
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2515, file: !166, line: 146, baseType: !2534, size: 64, offset: 448)
!2534 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !166, line: 119, baseType: !2207)
!2535 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !2498, file: !166, line: 220, baseType: !2501, size: 64, offset: 64)
!2536 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2498, file: !166, line: 223, baseType: !2228, size: 64, offset: 128)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !2498, file: !166, line: 226, baseType: !2538, size: 64, offset: 192)
!2538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2539, size: 64)
!2539 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !166, line: 185, flags: DIFlagFwdDecl)
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !2498, file: !166, line: 229, baseType: !2541, size: 128, offset: 256)
!2541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2542, size: 128, elements: !2191)
!2542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2543, size: 64)
!2543 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !166, line: 229, flags: DIFlagFwdDecl)
!2544 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !2498, file: !166, line: 232, baseType: !2497, size: 64, offset: 384)
!2545 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !2498, file: !166, line: 233, baseType: !2497, size: 64, offset: 448)
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !2498, file: !166, line: 238, baseType: !2547, size: 64, offset: 512)
!2547 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !166, line: 235, size: 64, elements: !2548)
!2548 = !{!2549, !2555}
!2549 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2547, file: !166, line: 236, baseType: !2550, size: 64)
!2550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2551, size: 64)
!2551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !166, line: 273, size: 128, elements: !2552)
!2552 = !{!2553, !2554}
!2553 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2551, file: !166, line: 275, baseType: !2523, size: 64)
!2554 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2551, file: !166, line: 278, baseType: !2523, size: 64, offset: 64)
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2547, file: !166, line: 237, baseType: !2556, size: 64)
!2556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2557, size: 64)
!2557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !166, line: 259, size: 320, elements: !2558)
!2558 = !{!2559, !2560, !2561, !2562, !2563}
!2559 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2557, file: !166, line: 261, baseType: !2117, size: 64)
!2560 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2557, file: !166, line: 262, baseType: !2117, size: 64, offset: 64)
!2561 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2557, file: !166, line: 266, baseType: !2117, size: 64, offset: 128)
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2557, file: !166, line: 267, baseType: !2117, size: 64, offset: 192)
!2563 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2557, file: !166, line: 270, baseType: !2116, size: 32, offset: 256)
!2564 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2498, file: !166, line: 241, baseType: !2534, size: 64, offset: 576)
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2498, file: !166, line: 244, baseType: !2116, size: 32, offset: 640)
!2566 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !2498, file: !166, line: 247, baseType: !2116, size: 32, offset: 672)
!2567 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !2498, file: !166, line: 250, baseType: !2116, size: 32, offset: 704)
!2568 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !2498, file: !166, line: 253, baseType: !2116, size: 32, offset: 736)
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2498, file: !166, line: 256, baseType: !2116, size: 32, offset: 768)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2493, file: !166, line: 378, baseType: !2496, size: 64, offset: 64)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2493, file: !166, line: 381, baseType: !2572, size: 64, offset: 128)
!2572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2573, size: 64)
!2573 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !166, line: 282, baseType: !2574)
!2574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !166, line: 282, size: 128, elements: !2575)
!2575 = !{!2576}
!2576 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2574, file: !166, line: 282, baseType: !2577, size: 128)
!2577 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !166, line: 281, baseType: !2578)
!2578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !166, line: 281, size: 128, elements: !2579)
!2579 = !{!2580, !2581, !2582}
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2578, file: !166, line: 281, baseType: !7, size: 32)
!2581 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2578, file: !166, line: 281, baseType: !7, size: 32, offset: 32)
!2582 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2578, file: !166, line: 281, baseType: !2583, size: 64, offset: 64)
!2583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2496, size: 64, elements: !2155)
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !2493, file: !166, line: 384, baseType: !2116, size: 32, offset: 192)
!2585 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !2493, file: !166, line: 387, baseType: !2116, size: 32, offset: 224)
!2586 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !2493, file: !166, line: 390, baseType: !2116, size: 32, offset: 256)
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !2493, file: !166, line: 394, baseType: !2572, size: 64, offset: 320)
!2588 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !2493, file: !166, line: 396, baseType: !165, size: 32, offset: 384)
!2589 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !2493, file: !166, line: 399, baseType: !2590, size: 64, offset: 416)
!2590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 64, elements: !2191)
!2591 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !2493, file: !166, line: 402, baseType: !2592, size: 64, offset: 480)
!2592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !2191)
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !2493, file: !166, line: 406, baseType: !2116, size: 32, offset: 544)
!2594 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !2493, file: !166, line: 409, baseType: !2116, size: 32, offset: 576)
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2485, file: !2486, line: 470, baseType: !2524, size: 64, offset: 128)
!2596 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2485, file: !2486, line: 473, baseType: !2597, size: 64, offset: 192)
!2597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2598, size: 64)
!2598 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2486, line: 166, flags: DIFlagFwdDecl)
!2599 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !2485, file: !2486, line: 476, baseType: !2600, size: 64, offset: 256)
!2600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2601, size: 64)
!2601 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !2486, line: 476, flags: DIFlagFwdDecl)
!2602 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !2485, file: !2486, line: 479, baseType: !2603, size: 64, offset: 320)
!2603 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2604, line: 144, baseType: !2605)
!2604 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2606, size: 64)
!2606 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2604, line: 100, size: 896, elements: !2607)
!2607 = !{!2608, !2616, !2621, !2626, !2628, !2631, !2632, !2633, !2634, !2635, !2640, !2642, !2643, !2648, !2653}
!2608 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2606, file: !2604, line: 102, baseType: !2609, size: 64)
!2609 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2604, line: 52, baseType: !2610)
!2610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2611, size: 64)
!2611 = !DISubroutineType(types: !2612)
!2612 = !{!2613, !2614}
!2613 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2604, line: 47, baseType: !7)
!2614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2615, size: 64)
!2615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2616 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2606, file: !2604, line: 105, baseType: !2617, size: 64, offset: 64)
!2617 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2604, line: 59, baseType: !2618)
!2618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2619, size: 64)
!2619 = !DISubroutineType(types: !2620)
!2620 = !{!2116, !2614, !2614}
!2621 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2606, file: !2604, line: 108, baseType: !2622, size: 64, offset: 128)
!2622 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2604, line: 63, baseType: !2623)
!2623 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2624, size: 64)
!2624 = !DISubroutineType(types: !2625)
!2625 = !{null, !2228}
!2626 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2606, file: !2604, line: 111, baseType: !2627, size: 64, offset: 192)
!2627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2228, size: 64)
!2628 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2606, file: !2604, line: 114, baseType: !2629, size: 64, offset: 256)
!2629 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2630, line: 46, baseType: !2190)
!2630 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2631 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2606, file: !2604, line: 117, baseType: !2629, size: 64, offset: 320)
!2632 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2606, file: !2604, line: 120, baseType: !2629, size: 64, offset: 384)
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2606, file: !2604, line: 124, baseType: !7, size: 32, offset: 448)
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2606, file: !2604, line: 128, baseType: !7, size: 32, offset: 480)
!2635 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2606, file: !2604, line: 131, baseType: !2636, size: 64, offset: 512)
!2636 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2604, line: 75, baseType: !2637)
!2637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2638, size: 64)
!2638 = !DISubroutineType(types: !2639)
!2639 = !{!2228, !2629, !2629}
!2640 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2606, file: !2604, line: 132, baseType: !2641, size: 64, offset: 576)
!2641 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2604, line: 78, baseType: !2623)
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2606, file: !2604, line: 135, baseType: !2228, size: 64, offset: 640)
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2606, file: !2604, line: 136, baseType: !2644, size: 64, offset: 704)
!2644 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2604, line: 82, baseType: !2645)
!2645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2646, size: 64)
!2646 = !DISubroutineType(types: !2647)
!2647 = !{!2228, !2228, !2629, !2629}
!2648 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2606, file: !2604, line: 137, baseType: !2649, size: 64, offset: 768)
!2649 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2604, line: 83, baseType: !2650)
!2650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2651, size: 64)
!2651 = !DISubroutineType(types: !2652)
!2652 = !{null, !2228, !2228}
!2653 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2606, file: !2604, line: 141, baseType: !7, size: 32, offset: 832)
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2485, file: !2486, line: 484, baseType: !2238, size: 64, offset: 384)
!2655 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !2485, file: !2486, line: 488, baseType: !2238, size: 64, offset: 448)
!2656 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !2485, file: !2486, line: 493, baseType: !2238, size: 64, offset: 512)
!2657 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !2485, file: !2486, line: 496, baseType: !2238, size: 64, offset: 576)
!2658 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2485, file: !2486, line: 501, baseType: !2659, size: 64, offset: 640)
!2659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2660, size: 64)
!2660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !6, line: 2355, size: 576, elements: !2661)
!2661 = !{!2662, !2665, !2666, !2667, !2668, !2670, !2671, !2676, !2677, !2678, !2679, !2680, !2681}
!2662 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2660, file: !6, line: 2356, baseType: !2663, size: 64)
!2663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2664, size: 64)
!2664 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !6, line: 2356, flags: DIFlagFwdDecl)
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2660, file: !6, line: 2357, baseType: !2143, size: 64, offset: 64)
!2666 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2660, file: !6, line: 2358, baseType: !2116, size: 32, offset: 128)
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2660, file: !6, line: 2359, baseType: !2116, size: 32, offset: 160)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2660, file: !6, line: 2360, baseType: !2669, size: 128, offset: 192)
!2669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2116, size: 128, elements: !2217)
!2670 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2660, file: !6, line: 2364, baseType: !2116, size: 32, offset: 320)
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2660, file: !6, line: 2367, baseType: !2672, size: 128, offset: 384)
!2672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !6, line: 2349, size: 128, elements: !2673)
!2673 = !{!2674, !2675}
!2674 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2672, file: !6, line: 2351, baseType: !2117, size: 64)
!2675 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2672, file: !6, line: 2352, baseType: !2207, size: 64, offset: 64)
!2676 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2660, file: !6, line: 2371, baseType: !176, size: 32, offset: 512)
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2660, file: !6, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2660, file: !6, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2660, file: !6, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2680 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2660, file: !6, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2681 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2660, file: !6, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2682 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !2485, file: !2486, line: 504, baseType: !2683, size: 64, offset: 704)
!2683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2684, size: 64)
!2684 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !2486, line: 504, flags: DIFlagFwdDecl)
!2685 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !2485, file: !2486, line: 507, baseType: !2603, size: 64, offset: 768)
!2686 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !2485, file: !2486, line: 510, baseType: !2116, size: 32, offset: 832)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !2485, file: !2486, line: 513, baseType: !2116, size: 32, offset: 864)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !2485, file: !2486, line: 516, baseType: !2359, size: 32, offset: 896)
!2689 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !2485, file: !2486, line: 519, baseType: !2359, size: 32, offset: 928)
!2690 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !2485, file: !2486, line: 522, baseType: !7, size: 32, offset: 960)
!2691 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !2485, file: !2486, line: 523, baseType: !7, size: 32, offset: 992)
!2692 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !2485, file: !2486, line: 528, baseType: !2143, size: 64, offset: 1024)
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !2485, file: !2486, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2694 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !2485, file: !2486, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2695 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !2485, file: !2486, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !2485, file: !2486, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2697 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !2485, file: !2486, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2698 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !2485, file: !2486, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2699 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !2485, file: !2486, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2700 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !2485, file: !2486, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2701 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !2485, file: !2486, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2702 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !2485, file: !2486, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2703 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !2485, file: !2486, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2704 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !2485, file: !2486, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !2485, file: !2486, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2706 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !2485, file: !2486, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2707 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !2485, file: !2486, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2708 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !2485, file: !2486, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2709 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !2480, file: !181, line: 3254, baseType: !2238, size: 64, offset: 1536)
!2710 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !2480, file: !181, line: 3257, baseType: !2238, size: 64, offset: 1600)
!2711 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !2480, file: !181, line: 3258, baseType: !2238, size: 64, offset: 1664)
!2712 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !2480, file: !181, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2713 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !2480, file: !181, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2714 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !2480, file: !181, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2715 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !2480, file: !181, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2716 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !2480, file: !181, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2717 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !2480, file: !181, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2718 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !2480, file: !181, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2719 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !2480, file: !181, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2720 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !2480, file: !181, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2721 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !2480, file: !181, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!2722 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !2480, file: !181, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!2723 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !2480, file: !181, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!2724 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !2480, file: !181, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!2725 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !2480, file: !181, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!2726 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !2480, file: !181, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!2727 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !2480, file: !181, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!2728 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !2480, file: !181, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!2729 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !2480, file: !181, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!2730 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2240, file: !181, line: 3394, baseType: !2731, size: 1344)
!2731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !181, line: 2279, size: 1344, elements: !2732)
!2732 = !{!2733, !2734, !2735, !2736, !2737, !2738, !2739, !2740, !2741, !2742, !2743, !2744, !2745, !2746, !2747, !2748, !2749, !2750, !2751, !2752, !2753, !2754, !2755, !2758, !2759, !2760, !2768, !2769, !2770, !2771, !2772, !2773, !2774, !2775, !2776}
!2733 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2731, file: !181, line: 2280, baseType: !2276, size: 192)
!2734 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2731, file: !181, line: 2281, baseType: !2238, size: 64, offset: 192)
!2735 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2731, file: !181, line: 2282, baseType: !2238, size: 64, offset: 256)
!2736 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2731, file: !181, line: 2283, baseType: !2238, size: 64, offset: 320)
!2737 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2731, file: !181, line: 2284, baseType: !2238, size: 64, offset: 384)
!2738 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2731, file: !181, line: 2285, baseType: !7, size: 32, offset: 448)
!2739 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !2731, file: !181, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!2740 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !2731, file: !181, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!2741 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !2731, file: !181, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!2742 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !2731, file: !181, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!2743 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !2731, file: !181, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!2744 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !2731, file: !181, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!2745 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2731, file: !181, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!2746 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !2731, file: !181, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!2747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2731, file: !181, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!2748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2731, file: !181, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!2749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2731, file: !181, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!2750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2731, file: !181, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!2751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2731, file: !181, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!2752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2731, file: !181, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!2753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2731, file: !181, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!2754 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2731, file: !181, line: 2305, baseType: !7, size: 32, offset: 512)
!2755 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !2731, file: !181, line: 2306, baseType: !2756, size: 32, offset: 544)
!2756 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2757, line: 31, baseType: !2116)
!2757 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2758 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !2731, file: !181, line: 2307, baseType: !2238, size: 64, offset: 576)
!2759 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !2731, file: !181, line: 2308, baseType: !2238, size: 64, offset: 640)
!2760 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !2731, file: !181, line: 2314, baseType: !2761, size: 64, offset: 704)
!2761 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !181, line: 2309, size: 64, elements: !2762)
!2762 = !{!2763, !2764, !2765}
!2763 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !2761, file: !181, line: 2310, baseType: !2116, size: 32)
!2764 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !2761, file: !181, line: 2311, baseType: !2143, size: 64)
!2765 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !2761, file: !181, line: 2312, baseType: !2766, size: 64)
!2766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2767, size: 64)
!2767 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !181, line: 2277, flags: DIFlagFwdDecl)
!2768 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2731, file: !181, line: 2315, baseType: !2238, size: 64, offset: 768)
!2769 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !2731, file: !181, line: 2316, baseType: !2238, size: 64, offset: 832)
!2770 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !2731, file: !181, line: 2317, baseType: !2238, size: 64, offset: 896)
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !2731, file: !181, line: 2318, baseType: !2238, size: 64, offset: 960)
!2772 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !2731, file: !181, line: 2319, baseType: !2238, size: 64, offset: 1024)
!2773 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !2731, file: !181, line: 2320, baseType: !2238, size: 64, offset: 1088)
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2731, file: !181, line: 2321, baseType: !2238, size: 64, offset: 1152)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2731, file: !181, line: 2322, baseType: !2238, size: 64, offset: 1216)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2731, file: !181, line: 2324, baseType: !2777, size: 64, offset: 1280)
!2777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2778, size: 64)
!2778 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !181, line: 2324, flags: DIFlagFwdDecl)
!2779 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !2240, file: !181, line: 3395, baseType: !2780, size: 320)
!2780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !181, line: 1469, size: 320, elements: !2781)
!2781 = !{!2782, !2783, !2784}
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2780, file: !181, line: 1470, baseType: !2276, size: 192)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !2780, file: !181, line: 1471, baseType: !2238, size: 64, offset: 192)
!2784 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2780, file: !181, line: 1472, baseType: !2238, size: 64, offset: 256)
!2785 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2240, file: !181, line: 3396, baseType: !2786, size: 320)
!2786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !181, line: 1482, size: 320, elements: !2787)
!2787 = !{!2788, !2789, !2790}
!2788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2786, file: !181, line: 1483, baseType: !2276, size: 192)
!2789 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2786, file: !181, line: 1484, baseType: !2116, size: 32, offset: 192)
!2790 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !2786, file: !181, line: 1485, baseType: !2791, size: 64, offset: 256)
!2791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2238, size: 64, elements: !2155)
!2792 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !2240, file: !181, line: 3397, baseType: !2793, size: 384)
!2793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !181, line: 1829, size: 384, elements: !2794)
!2794 = !{!2795, !2796, !2797, !2798}
!2795 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2793, file: !181, line: 1830, baseType: !2276, size: 192)
!2796 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2793, file: !181, line: 1831, baseType: !2359, size: 32, offset: 192)
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2793, file: !181, line: 1832, baseType: !2238, size: 64, offset: 256)
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !2793, file: !181, line: 1835, baseType: !2791, size: 64, offset: 320)
!2799 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2240, file: !181, line: 3398, baseType: !2800, size: 704)
!2800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !181, line: 1898, size: 704, elements: !2801)
!2801 = !{!2802, !2803, !2804, !2808, !2809, !2812}
!2802 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2800, file: !181, line: 1899, baseType: !2276, size: 192)
!2803 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !2800, file: !181, line: 1902, baseType: !2238, size: 64, offset: 192)
!2804 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !2800, file: !181, line: 1905, baseType: !2805, size: 64, offset: 256)
!2805 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2118, line: 58, baseType: !2806)
!2806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2807, size: 64)
!2807 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !2118, line: 57, flags: DIFlagFwdDecl)
!2808 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !2800, file: !181, line: 1908, baseType: !7, size: 32, offset: 320)
!2809 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !2800, file: !181, line: 1911, baseType: !2810, size: 64, offset: 384)
!2810 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2811, size: 64)
!2811 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !181, line: 1876, flags: DIFlagFwdDecl)
!2812 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !2800, file: !181, line: 1914, baseType: !2813, size: 256, offset: 448)
!2813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !181, line: 1883, size: 256, elements: !2814)
!2814 = !{!2815, !2817, !2818, !2823}
!2815 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2813, file: !181, line: 1884, baseType: !2816, size: 64)
!2816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2813, size: 64)
!2817 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2813, file: !181, line: 1885, baseType: !2816, size: 64, offset: 64)
!2818 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2813, file: !181, line: 1891, baseType: !2819, size: 64, offset: 128)
!2819 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2813, file: !181, line: 1891, size: 64, elements: !2820)
!2820 = !{!2821, !2822}
!2821 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2819, file: !181, line: 1891, baseType: !2805, size: 64)
!2822 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2819, file: !181, line: 1891, baseType: !2238, size: 64)
!2823 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2813, file: !181, line: 1892, baseType: !2824, size: 64, offset: 192)
!2824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2238, size: 64)
!2825 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2240, file: !181, line: 3399, baseType: !2826, size: 704)
!2826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !181, line: 2008, size: 704, elements: !2827)
!2827 = !{!2828, !2829, !2830, !2831, !2832, !2833, !2845, !2846, !2847, !2848, !2849}
!2828 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2826, file: !181, line: 2009, baseType: !2276, size: 192)
!2829 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2826, file: !181, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!2830 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !2826, file: !181, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!2831 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2826, file: !181, line: 2014, baseType: !2359, size: 32, offset: 224)
!2832 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2826, file: !181, line: 2016, baseType: !2238, size: 64, offset: 256)
!2833 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !2826, file: !181, line: 2017, baseType: !2834, size: 64, offset: 320)
!2834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2835, size: 64)
!2835 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !181, line: 183, baseType: !2836)
!2836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !181, line: 183, size: 128, elements: !2837)
!2837 = !{!2838}
!2838 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2836, file: !181, line: 183, baseType: !2839, size: 128)
!2839 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !181, line: 182, baseType: !2840)
!2840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !181, line: 182, size: 128, elements: !2841)
!2841 = !{!2842, !2843, !2844}
!2842 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2840, file: !181, line: 182, baseType: !7, size: 32)
!2843 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2840, file: !181, line: 182, baseType: !7, size: 32, offset: 32)
!2844 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2840, file: !181, line: 182, baseType: !2791, size: 64, offset: 64)
!2845 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !2826, file: !181, line: 2019, baseType: !2238, size: 64, offset: 384)
!2846 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !2826, file: !181, line: 2020, baseType: !2238, size: 64, offset: 448)
!2847 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2826, file: !181, line: 2021, baseType: !2238, size: 64, offset: 512)
!2848 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !2826, file: !181, line: 2022, baseType: !2238, size: 64, offset: 576)
!2849 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !2826, file: !181, line: 2023, baseType: !2238, size: 64, offset: 640)
!2850 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !2240, file: !181, line: 3400, baseType: !2851, size: 832)
!2851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !181, line: 2430, size: 832, elements: !2852)
!2852 = !{!2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862}
!2853 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2851, file: !181, line: 2431, baseType: !2276, size: 192)
!2854 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2851, file: !181, line: 2433, baseType: !2238, size: 64, offset: 192)
