; ModuleID = 'reload1.bc'
source_filename = "reload1.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.insn_chain = type { %struct.insn_chain*, %struct.insn_chain*, %struct.insn_chain*, %struct.rtx_def*, i32, i8, %struct.bitmap_head_def, %struct.bitmap_head_def, %struct.reload*, i32, i64 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }

!2064 = !{!2065, !2066, !2067, !2068, !2069, !2070, !2071, !2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096}
!2065 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!2066 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!2067 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!2068 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!2069 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!2070 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!2071 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!2072 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!2073 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!2074 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!2075 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!2076 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!2077 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!2078 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!2079 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!2080 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!2081 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!2082 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!2083 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!2084 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!2085 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!2086 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!2087 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!2088 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!2089 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!2090 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!2091 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!2092 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!2093 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!2094 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!2095 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!2096 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!2097 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !2098, line: 36, baseType: !7, size: 32, elements: !2099)
!2098 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2099 = !{!2100, !2101, !2102, !2103, !2104, !2105, !2106, !2107, !2108, !2109, !2110, !2111, !2112, !2113, !2114, !2115, !2116, !2117, !2118}
!2100 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!2101 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!2102 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!2103 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!2104 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!2105 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!2106 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!2107 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!2108 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!2109 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!2110 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!2111 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!2112 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!2113 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!2114 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!2115 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!2116 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!2117 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!2118 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!2119 = !{!2120, !2121, !2122, !2123, !2126, !2127, !2129, !2133, !2124, !2136, !5, !3346, !3347, !3348, !3350, !3344, !1920, !2143, !3351, !3353, !3354, !2063, !3355, !2213, !7, !3356, !3317, !3357, !3359, !3372, !3385, !2097, !414}
!2120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2121, size: 64)
!2121 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2122 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2124, size: 64)
!2124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2125, size: 64)
!2125 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2128, size: 64)
!2128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2125)
!2129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2130, size: 64)
!2130 = !DISubroutineType(types: !2131)
!2131 = !{!2126, !2132}
!2132 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2134, size: 64)
!2134 = !DISubroutineType(types: !2135)
!2135 = !{null, !2126}
!2136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2137, size: 64)
!2137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "insn_chain", file: !1907, line: 200, size: 1024, elements: !2138)
!2138 = !{!2139, !2140, !2141, !2142, !3307, !3308, !3309, !3310, !3311, !3312, !3315, !3316, !3342, !3343}
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2137, file: !1907, line: 203, baseType: !2136, size: 64)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2137, file: !1907, line: 203, baseType: !2136, size: 64, offset: 64)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "next_need_reload", scope: !2137, file: !1907, line: 207, baseType: !2136, size: 64, offset: 128)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "insn", scope: !2137, file: !1907, line: 210, baseType: !2143, size: 64, offset: 192)
!2143 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2144, line: 50, baseType: !2145)
!2144 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2146, size: 64)
!2146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1921, line: 240, size: 384, elements: !2147)
!2147 = !{!2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155, !2156, !2157, !2158}
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2146, file: !1921, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2149 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2146, file: !1921, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2146, file: !1921, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2146, file: !1921, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2146, file: !1921, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2146, file: !1921, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2146, file: !1921, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2146, file: !1921, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2156 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2146, file: !1921, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2157 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2146, file: !1921, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2146, file: !1921, line: 321, baseType: !2159, size: 320, offset: 64)
!2159 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1921, line: 315, size: 320, elements: !2160)
!2160 = !{!2161, !3242, !3244, !3305, !3306}
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2159, file: !1921, line: 316, baseType: !2162, size: 64)
!2162 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2163, size: 64, elements: !2178)
!2163 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1921, line: 183, baseType: !2164)
!2164 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1921, line: 166, size: 64, elements: !2165)
!2165 = !{!2166, !2167, !2168, !2169, !2170, !2180, !2181, !2193, !2196, !2257, !3220, !3221, !3232, !3239}
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2164, file: !1921, line: 168, baseType: !2122, size: 32)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2164, file: !1921, line: 169, baseType: !7, size: 32)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2164, file: !1921, line: 170, baseType: !2127, size: 64)
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2164, file: !1921, line: 171, baseType: !2143, size: 64)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2164, file: !1921, line: 172, baseType: !2171, size: 64)
!2171 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2144, line: 53, baseType: !2172)
!2172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2173, size: 64)
!2173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1921, line: 359, size: 128, elements: !2174)
!2174 = !{!2175, !2176}
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2173, file: !1921, line: 360, baseType: !2122, size: 32)
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2173, file: !1921, line: 361, baseType: !2177, size: 64, offset: 64)
!2177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2143, size: 64, elements: !2178)
!2178 = !{!2179}
!2179 = !DISubrange(count: 1)
!2180 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2164, file: !1921, line: 173, baseType: !5, size: 32)
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2164, file: !1921, line: 174, baseType: !2182, size: 32)
!2182 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1921, line: 133, baseType: !2183)
!2183 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1921, line: 115, size: 32, elements: !2184)
!2184 = !{!2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192}
!2185 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2183, file: !1921, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2183, file: !1921, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2183, file: !1921, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2183, file: !1921, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2189 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2183, file: !1921, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2190 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2183, file: !1921, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2183, file: !1921, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2183, file: !1921, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2164, file: !1921, line: 175, baseType: !2194, size: 64)
!2194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2195, size: 64)
!2195 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1921, line: 175, flags: DIFlagFwdDecl)
!2196 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2164, file: !1921, line: 176, baseType: !2197, size: 64)
!2197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2198, size: 64)
!2198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2199, line: 75, size: 256, elements: !2200)
!2199 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2200 = !{!2201, !2216, !2217, !2218}
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2198, file: !2199, line: 76, baseType: !2202, size: 64)
!2202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2203, size: 64)
!2203 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2199, line: 68, baseType: !2204)
!2204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2199, line: 63, size: 320, elements: !2205)
!2205 = !{!2206, !2208, !2209, !2210}
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2204, file: !2199, line: 64, baseType: !2207, size: 64)
!2207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2204, size: 64)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2204, file: !2199, line: 65, baseType: !2207, size: 64, offset: 64)
!2209 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2204, file: !2199, line: 66, baseType: !7, size: 32, offset: 128)
!2210 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2204, file: !2199, line: 67, baseType: !2211, size: 128, offset: 192)
!2211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2212, size: 128, elements: !2214)
!2212 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2199, line: 29, baseType: !2213)
!2213 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2214 = !{!2215}
!2215 = !DISubrange(count: 2)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2198, file: !2199, line: 77, baseType: !2202, size: 64, offset: 64)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2198, file: !2199, line: 78, baseType: !7, size: 32, offset: 128)
!2218 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2198, file: !2199, line: 79, baseType: !2219, size: 64, offset: 192)
!2219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2220, size: 64)
!2220 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2199, line: 49, baseType: !2221)
!2221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2199, line: 45, size: 832, elements: !2222)
!2222 = !{!2223, !2224, !2225}
!2223 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2221, file: !2199, line: 46, baseType: !2207, size: 64)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2221, file: !2199, line: 47, baseType: !2197, size: 64, offset: 64)
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2221, file: !2199, line: 48, baseType: !2226, size: 704, offset: 128)
!2226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2227, line: 164, size: 704, elements: !2228)
!2227 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2228 = !{!2229, !2230, !2240, !2241, !2242, !2243, !2244, !2245, !2249, !2253, !2254, !2255, !2256}
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2226, file: !2227, line: 166, baseType: !2132, size: 64)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2226, file: !2227, line: 167, baseType: !2231, size: 64, offset: 64)
!2231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2232, size: 64)
!2232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2227, line: 157, size: 192, elements: !2233)
!2233 = !{!2234, !2235, !2236}
!2234 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2232, file: !2227, line: 159, baseType: !2124, size: 64)
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2232, file: !2227, line: 160, baseType: !2231, size: 64, offset: 64)
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2232, file: !2227, line: 161, baseType: !2237, size: 32, offset: 128)
!2237 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2125, size: 32, elements: !2238)
!2238 = !{!2239}
!2239 = !DISubrange(count: 4)
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2226, file: !2227, line: 168, baseType: !2124, size: 64, offset: 128)
!2241 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2226, file: !2227, line: 169, baseType: !2124, size: 64, offset: 192)
!2242 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2226, file: !2227, line: 170, baseType: !2124, size: 64, offset: 256)
!2243 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2226, file: !2227, line: 171, baseType: !2132, size: 64, offset: 320)
!2244 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2226, file: !2227, line: 172, baseType: !2122, size: 32, offset: 384)
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2226, file: !2227, line: 176, baseType: !2246, size: 64, offset: 448)
!2246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2247, size: 64)
!2247 = !DISubroutineType(types: !2248)
!2248 = !{!2231, !2126, !2132}
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2226, file: !2227, line: 177, baseType: !2250, size: 64, offset: 512)
!2250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2251, size: 64)
!2251 = !DISubroutineType(types: !2252)
!2252 = !{null, !2126, !2231}
!2253 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2226, file: !2227, line: 178, baseType: !2126, size: 64, offset: 576)
!2254 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2226, file: !2227, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2226, file: !2227, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2226, file: !2227, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2164, file: !1921, line: 177, baseType: !2258, size: 64)
!2258 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2144, line: 56, baseType: !2259)
!2259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2260, size: 64)
!2260 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !2261)
!2261 = !{!2262, !2295, !2301, !2312, !2331, !2342, !2347, !2354, !2360, !2373, !2385, !2423, !2428, !2456, !2464, !2465, !2470, !2479, !2485, !2490, !2494, !2498, !2856, !2905, !2911, !2917, !2924, !2950, !2964, !2981, !2993, !3015, !3030, !3202}
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2260, file: !158, line: 3372, baseType: !2263, size: 64)
!2263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !2264)
!2264 = !{!2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287, !2288, !2289, !2290, !2291, !2292, !2293, !2294}
!2265 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2263, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2266 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2263, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2267 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2263, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2263, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2263, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2263, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2263, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2272 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2263, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2263, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2263, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2275 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2263, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2276 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2263, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2277 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2263, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2263, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2263, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2280 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2263, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2263, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2263, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2263, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2263, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2263, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2263, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2263, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2263, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2263, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2290 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2263, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2263, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2263, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2293 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2263, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2263, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2260, file: !158, line: 3373, baseType: !2296, size: 192)
!2296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !2297)
!2297 = !{!2298, !2299, !2300}
!2298 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2296, file: !158, line: 403, baseType: !2263, size: 64)
!2299 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2296, file: !158, line: 404, baseType: !2258, size: 64, offset: 64)
!2300 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2296, file: !158, line: 405, baseType: !2258, size: 64, offset: 128)
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2260, file: !158, line: 3374, baseType: !2302, size: 320)
!2302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !2303)
!2303 = !{!2304, !2305}
!2304 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2302, file: !158, line: 1385, baseType: !2296, size: 192)
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2302, file: !158, line: 1386, baseType: !2306, size: 128, offset: 192)
!2306 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2307, line: 58, baseType: !2308)
!2307 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2308 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2307, line: 54, size: 128, elements: !2309)
!2309 = !{!2310, !2311}
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2308, file: !2307, line: 56, baseType: !2213, size: 64)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2308, file: !2307, line: 57, baseType: !2132, size: 64, offset: 64)
!2312 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2260, file: !158, line: 3375, baseType: !2313, size: 256)
!2313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !2314)
!2314 = !{!2315, !2316}
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2313, file: !158, line: 1398, baseType: !2296, size: 192)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2313, file: !158, line: 1399, baseType: !2317, size: 64, offset: 192)
!2317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2318, size: 64)
!2318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2319, line: 52, size: 256, elements: !2320)
!2319 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2320 = !{!2321, !2322, !2323, !2324, !2325, !2326, !2327}
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2318, file: !2319, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2318, file: !2319, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2318, file: !2319, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2318, file: !2319, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2318, file: !2319, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2318, file: !2319, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2327 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2318, file: !2319, line: 62, baseType: !2328, size: 192, offset: 64)
!2328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2213, size: 192, elements: !2329)
!2329 = !{!2330}
!2330 = !DISubrange(count: 3)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2260, file: !158, line: 3376, baseType: !2332, size: 256)
!2332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !2333)
!2333 = !{!2334, !2335}
!2334 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2332, file: !158, line: 1409, baseType: !2296, size: 192)
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2332, file: !158, line: 1410, baseType: !2336, size: 64, offset: 192)
!2336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2337, size: 64)
!2337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2338, line: 27, size: 192, elements: !2339)
!2338 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2339 = !{!2340, !2341}
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2337, file: !2338, line: 29, baseType: !2306, size: 128)
!2341 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2337, file: !2338, line: 30, baseType: !5, size: 32, offset: 128)
!2342 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2260, file: !158, line: 3377, baseType: !2343, size: 256)
!2343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !2344)
!2344 = !{!2345, !2346}
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2343, file: !158, line: 1438, baseType: !2296, size: 192)
!2346 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2343, file: !158, line: 1439, baseType: !2258, size: 64, offset: 192)
!2347 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2260, file: !158, line: 3378, baseType: !2348, size: 256)
!2348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !2349)
!2349 = !{!2350, !2351, !2352}
!2350 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2348, file: !158, line: 1419, baseType: !2296, size: 192)
!2351 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2348, file: !158, line: 1420, baseType: !2122, size: 32, offset: 192)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2348, file: !158, line: 1421, baseType: !2353, size: 8, offset: 224)
!2353 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2125, size: 8, elements: !2178)
!2354 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2260, file: !158, line: 3379, baseType: !2355, size: 320)
!2355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !2356)
!2356 = !{!2357, !2358, !2359}
!2357 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2355, file: !158, line: 1429, baseType: !2296, size: 192)
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2355, file: !158, line: 1430, baseType: !2258, size: 64, offset: 192)
!2359 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2355, file: !158, line: 1431, baseType: !2258, size: 64, offset: 256)
!2360 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2260, file: !158, line: 3380, baseType: !2361, size: 320)
!2361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !2362)
!2362 = !{!2363, !2364}
!2363 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2361, file: !158, line: 1461, baseType: !2296, size: 192)
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2361, file: !158, line: 1462, baseType: !2365, size: 128, offset: 192)
!2365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2366, line: 31, size: 128, elements: !2367)
!2366 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2367 = !{!2368, !2371, !2372}
!2368 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2365, file: !2366, line: 32, baseType: !2369, size: 64)
!2369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2370, size: 64)
!2370 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2121)
!2371 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2365, file: !2366, line: 33, baseType: !7, size: 32, offset: 64)
!2372 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2365, file: !2366, line: 34, baseType: !7, size: 32, offset: 96)
!2373 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2260, file: !158, line: 3381, baseType: !2374, size: 384)
!2374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !2375)
!2375 = !{!2376, !2377, !2382, !2383, !2384}
!2376 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2374, file: !158, line: 2508, baseType: !2296, size: 192)
!2377 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2374, file: !158, line: 2509, baseType: !2378, size: 32, offset: 192)
!2378 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2379, line: 58, baseType: !2380)
!2379 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2380 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2381, line: 44, baseType: !7)
!2381 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2382 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2374, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2374, file: !158, line: 2511, baseType: !2258, size: 64, offset: 256)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2374, file: !158, line: 2512, baseType: !2258, size: 64, offset: 320)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2260, file: !158, line: 3382, baseType: !2386, size: 896)
!2386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !2387)
!2387 = !{!2388, !2389, !2390, !2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408, !2409, !2410, !2411, !2412, !2413, !2414, !2415, !2416, !2417, !2418, !2419, !2420}
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2386, file: !158, line: 2653, baseType: !2374, size: 384)
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2386, file: !158, line: 2654, baseType: !2258, size: 64, offset: 384)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2386, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2386, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2386, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2386, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2386, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2386, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2386, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2397 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2386, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2386, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2386, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2400 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2386, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2401 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2386, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2386, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2386, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2386, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2405 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2386, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2406 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2386, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2386, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2386, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2386, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2410 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2386, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2386, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2386, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2386, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2414 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2386, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2415 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2386, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2386, file: !158, line: 2705, baseType: !2258, size: 64, offset: 576)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2386, file: !158, line: 2706, baseType: !2258, size: 64, offset: 640)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2386, file: !158, line: 2707, baseType: !2258, size: 64, offset: 704)
!2419 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2386, file: !158, line: 2708, baseType: !2258, size: 64, offset: 768)
!2420 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2386, file: !158, line: 2711, baseType: !2421, size: 64, offset: 832)
!2421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2422, size: 64)
!2422 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2260, file: !158, line: 3383, baseType: !2424, size: 960)
!2424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !2425)
!2425 = !{!2426, !2427}
!2426 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2424, file: !158, line: 2757, baseType: !2386, size: 896)
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2424, file: !158, line: 2758, baseType: !2143, size: 64, offset: 896)
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2260, file: !158, line: 3384, baseType: !2429, size: 1472)
!2429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !2430)
!2430 = !{!2431, !2452, !2453, !2454, !2455}
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2429, file: !158, line: 3115, baseType: !2432, size: 1216)
!2432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !2433)
!2433 = !{!2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451}
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2432, file: !158, line: 2985, baseType: !2424, size: 960)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2432, file: !158, line: 2986, baseType: !2258, size: 64, offset: 960)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2432, file: !158, line: 2987, baseType: !2258, size: 64, offset: 1024)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2432, file: !158, line: 2988, baseType: !2258, size: 64, offset: 1088)
!2438 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2432, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2439 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2432, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2432, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2432, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2432, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2443 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2432, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2444 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2432, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2445 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2432, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2432, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2432, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2432, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2432, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2432, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2432, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2452 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2429, file: !158, line: 3117, baseType: !2258, size: 64, offset: 1216)
!2453 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2429, file: !158, line: 3119, baseType: !2258, size: 64, offset: 1280)
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2429, file: !158, line: 3121, baseType: !2258, size: 64, offset: 1344)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2429, file: !158, line: 3123, baseType: !2258, size: 64, offset: 1408)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2260, file: !158, line: 3385, baseType: !2457, size: 1088)
!2457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !2458)
!2458 = !{!2459, !2460, !2461}
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2457, file: !158, line: 2875, baseType: !2424, size: 960)
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2457, file: !158, line: 2876, baseType: !2143, size: 64, offset: 960)
!2461 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2457, file: !158, line: 2877, baseType: !2462, size: 64, offset: 1024)
!2462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2463, size: 64)
!2463 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2260, file: !158, line: 3386, baseType: !2432, size: 1216)
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2260, file: !158, line: 3387, baseType: !2466, size: 1280)
!2466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !2467)
!2467 = !{!2468, !2469}
!2468 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2466, file: !158, line: 3094, baseType: !2432, size: 1216)
!2469 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2466, file: !158, line: 3095, baseType: !2462, size: 64, offset: 1216)
!2470 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2260, file: !158, line: 3388, baseType: !2471, size: 1216)
!2471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !2472)
!2472 = !{!2473, !2474, !2475, !2476, !2477, !2478}
!2473 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2471, file: !158, line: 2825, baseType: !2386, size: 896)
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2471, file: !158, line: 2827, baseType: !2258, size: 64, offset: 896)
!2475 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2471, file: !158, line: 2828, baseType: !2258, size: 64, offset: 960)
!2476 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2471, file: !158, line: 2829, baseType: !2258, size: 64, offset: 1024)
!2477 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2471, file: !158, line: 2830, baseType: !2258, size: 64, offset: 1088)
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2471, file: !158, line: 2831, baseType: !2258, size: 64, offset: 1152)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2260, file: !158, line: 3389, baseType: !2480, size: 1024)
!2480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !2481)
!2481 = !{!2482, !2483, !2484}
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2480, file: !158, line: 2851, baseType: !2424, size: 960)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2480, file: !158, line: 2852, baseType: !2122, size: 32, offset: 960)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2480, file: !158, line: 2853, baseType: !2122, size: 32, offset: 992)
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2260, file: !158, line: 3390, baseType: !2486, size: 1024)
!2486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !2487)
!2487 = !{!2488, !2489}
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2486, file: !158, line: 2858, baseType: !2424, size: 960)
!2489 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2486, file: !158, line: 2859, baseType: !2462, size: 64, offset: 960)
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2260, file: !158, line: 3391, baseType: !2491, size: 960)
!2491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !2492)
!2492 = !{!2493}
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2491, file: !158, line: 2863, baseType: !2424, size: 960)
!2494 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2260, file: !158, line: 3392, baseType: !2495, size: 1472)
!2495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !2496)
!2496 = !{!2497}
!2497 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2495, file: !158, line: 3305, baseType: !2429, size: 1472)
!2498 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2260, file: !158, line: 3393, baseType: !2499, size: 1792)
!2499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !2500)
!2500 = !{!2501, !2502, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855}
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2499, file: !158, line: 3249, baseType: !2429, size: 1472)
!2502 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2499, file: !158, line: 3251, baseType: !2503, size: 64, offset: 1472)
!2503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2504, size: 64)
!2504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2505, line: 463, size: 1152, elements: !2506)
!2505 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2506 = !{!2507, !2668, !2772, !2773, !2776, !2779, !2780, !2781, !2782, !2783, !2784, !2808, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834}
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2504, file: !2505, line: 464, baseType: !2508, size: 64)
!2508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2509, size: 64)
!2509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !2510)
!2510 = !{!2511, !2560, !2573, !2587, !2636, !2649}
!2511 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !2509, file: !135, line: 197, baseType: !2512, size: 64)
!2512 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !2513)
!2513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2514, size: 64)
!2514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !2515)
!2515 = !{!2516, !2517, !2518, !2519, !2520, !2521, !2548, !2557, !2558, !2559}
!2516 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !2514, file: !135, line: 119, baseType: !2513, size: 64)
!2517 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2514, file: !135, line: 122, baseType: !2513, size: 64, offset: 64)
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !2514, file: !135, line: 123, baseType: !2513, size: 64, offset: 128)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2514, file: !135, line: 126, baseType: !2122, size: 32, offset: 192)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2514, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!2521 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2514, file: !135, line: 165, baseType: !2522, size: 192, offset: 256)
!2522 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !2523)
!2523 = !{!2524, !2537, !2543}
!2524 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !2522, file: !135, line: 137, baseType: !2525, size: 128)
!2525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !2526)
!2526 = !{!2527, !2536}
!2527 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !2525, file: !135, line: 135, baseType: !2528, size: 64)
!2528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2529, size: 64)
!2529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !2530)
!2530 = !{!2531, !2532, !2533, !2534, !2535}
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !2529, file: !135, line: 96, baseType: !2528, size: 64)
!2532 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !2529, file: !135, line: 97, baseType: !2528, size: 64, offset: 64)
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !2529, file: !135, line: 101, baseType: !2258, size: 64, offset: 128)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !2529, file: !135, line: 106, baseType: !2258, size: 64, offset: 192)
!2535 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !2529, file: !135, line: 111, baseType: !2258, size: 64, offset: 256)
!2536 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !2525, file: !135, line: 136, baseType: !2528, size: 64, offset: 64)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !2522, file: !135, line: 151, baseType: !2538, size: 192)
!2538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !2539)
!2539 = !{!2540, !2541, !2542}
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !2538, file: !135, line: 141, baseType: !2258, size: 64)
!2541 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !2538, file: !135, line: 145, baseType: !2258, size: 64, offset: 64)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !2538, file: !135, line: 150, baseType: !2122, size: 32, offset: 128)
!2543 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !2522, file: !135, line: 164, baseType: !2544, size: 128)
!2544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !2545)
!2545 = !{!2546, !2547}
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !2544, file: !135, line: 161, baseType: !2258, size: 64)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !2544, file: !135, line: 163, baseType: !2378, size: 32, offset: 64)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !2514, file: !135, line: 168, baseType: !2549, size: 64, offset: 448)
!2549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2550, size: 64)
!2550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !2551)
!2551 = !{!2552, !2553, !2554, !2555, !2556}
!2552 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !2550, file: !135, line: 70, baseType: !2549, size: 64)
!2553 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2550, file: !135, line: 73, baseType: !2513, size: 64, offset: 64)
!2554 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !2550, file: !135, line: 78, baseType: !2258, size: 64, offset: 128)
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !2550, file: !135, line: 85, baseType: !2143, size: 64, offset: 192)
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2550, file: !135, line: 88, baseType: !2122, size: 32, offset: 256)
!2557 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !2514, file: !135, line: 173, baseType: !2143, size: 64, offset: 512)
!2558 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !2514, file: !135, line: 173, baseType: !2143, size: 64, offset: 576)
!2559 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !2514, file: !135, line: 177, baseType: !2121, size: 8, offset: 640)
!2560 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !2509, file: !135, line: 200, baseType: !2561, size: 64, offset: 64)
!2561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2562, size: 64)
!2562 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !2563)
!2563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !2564)
!2564 = !{!2565}
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2563, file: !135, line: 185, baseType: !2566, size: 128)
!2566 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !2567)
!2567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !2568)
!2568 = !{!2569, !2570, !2571}
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2567, file: !135, line: 184, baseType: !7, size: 32)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2567, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2567, file: !135, line: 184, baseType: !2572, size: 64, offset: 64)
!2572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2512, size: 64, elements: !2178)
!2573 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !2509, file: !135, line: 203, baseType: !2574, size: 64, offset: 128)
!2574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2575, size: 64)
!2575 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !2576)
!2576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !2577)
!2577 = !{!2578}
!2578 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2576, file: !135, line: 189, baseType: !2579, size: 128)
!2579 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !2580)
!2580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !2581)
!2581 = !{!2582, !2583, !2584}
!2582 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2580, file: !135, line: 188, baseType: !7, size: 32)
!2583 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2580, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2580, file: !135, line: 188, baseType: !2585, size: 64, offset: 64)
!2585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2586, size: 64, elements: !2178)
!2586 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !2549)
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !2509, file: !135, line: 207, baseType: !2588, size: 64, offset: 192)
!2588 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2589, line: 144, baseType: !2590)
!2589 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2591, size: 64)
!2591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2589, line: 100, size: 896, elements: !2592)
!2592 = !{!2593, !2601, !2606, !2608, !2610, !2613, !2614, !2615, !2616, !2617, !2622, !2624, !2625, !2630, !2635}
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2591, file: !2589, line: 102, baseType: !2594, size: 64)
!2594 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2589, line: 52, baseType: !2595)
!2595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2596, size: 64)
!2596 = !DISubroutineType(types: !2597)
!2597 = !{!2598, !2599}
!2598 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2589, line: 47, baseType: !7)
!2599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2600, size: 64)
!2600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2601 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2591, file: !2589, line: 105, baseType: !2602, size: 64, offset: 64)
!2602 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2589, line: 59, baseType: !2603)
!2603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2604, size: 64)
!2604 = !DISubroutineType(types: !2605)
!2605 = !{!2122, !2599, !2599}
!2606 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2591, file: !2589, line: 108, baseType: !2607, size: 64, offset: 128)
!2607 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2589, line: 63, baseType: !2133)
!2608 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2591, file: !2589, line: 111, baseType: !2609, size: 64, offset: 192)
!2609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2126, size: 64)
!2610 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2591, file: !2589, line: 114, baseType: !2611, size: 64, offset: 256)
!2611 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2612, line: 46, baseType: !2213)
!2612 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2613 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2591, file: !2589, line: 117, baseType: !2611, size: 64, offset: 320)
!2614 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2591, file: !2589, line: 120, baseType: !2611, size: 64, offset: 384)
!2615 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2591, file: !2589, line: 124, baseType: !7, size: 32, offset: 448)
!2616 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2591, file: !2589, line: 128, baseType: !7, size: 32, offset: 480)
!2617 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2591, file: !2589, line: 131, baseType: !2618, size: 64, offset: 512)
!2618 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2589, line: 75, baseType: !2619)
!2619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2620, size: 64)
!2620 = !DISubroutineType(types: !2621)
!2621 = !{!2126, !2611, !2611}
!2622 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2591, file: !2589, line: 132, baseType: !2623, size: 64, offset: 576)
!2623 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2589, line: 78, baseType: !2133)
!2624 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2591, file: !2589, line: 135, baseType: !2126, size: 64, offset: 640)
!2625 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2591, file: !2589, line: 136, baseType: !2626, size: 64, offset: 704)
!2626 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2589, line: 82, baseType: !2627)
!2627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2628, size: 64)
!2628 = !DISubroutineType(types: !2629)
!2629 = !{!2126, !2126, !2611, !2611}
!2630 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2591, file: !2589, line: 137, baseType: !2631, size: 64, offset: 768)
!2631 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2589, line: 83, baseType: !2632)
!2632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2633, size: 64)
!2633 = !DISubroutineType(types: !2634)
!2634 = !{null, !2126, !2126}
!2635 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2591, file: !2589, line: 141, baseType: !7, size: 32, offset: 832)
!2636 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !2509, file: !135, line: 211, baseType: !2637, size: 64, offset: 256)
!2637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2638, size: 64)
!2638 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !2639)
!2639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !2640)
!2640 = !{!2641}
!2641 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2639, file: !158, line: 183, baseType: !2642, size: 128)
!2642 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !2643)
!2643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !2644)
!2644 = !{!2645, !2646, !2647}
!2645 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2643, file: !158, line: 182, baseType: !7, size: 32)
!2646 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2643, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2643, file: !158, line: 182, baseType: !2648, size: 64, offset: 64)
!2648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2258, size: 64, elements: !2178)
!2649 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !2509, file: !135, line: 220, baseType: !2650, size: 64, offset: 320)
!2650 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !2651)
!2651 = !{!2652, !2653}
!2652 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !2650, file: !135, line: 218, baseType: !2637, size: 64)
!2653 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !2650, file: !135, line: 219, baseType: !2654, size: 64)
!2654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2655, size: 64)
!2655 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !2656, line: 29, baseType: !2657)
!2656 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !2656, line: 29, size: 96, elements: !2658)
!2658 = !{!2659}
!2659 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2657, file: !2656, line: 29, baseType: !2660, size: 96)
!2660 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !2656, line: 27, baseType: !2661)
!2661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !2656, line: 27, size: 96, elements: !2662)
!2662 = !{!2663, !2664, !2665}
!2663 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2661, file: !2656, line: 27, baseType: !7, size: 32)
!2664 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2661, file: !2656, line: 27, baseType: !7, size: 32, offset: 32)
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2661, file: !2656, line: 27, baseType: !2666, size: 8, offset: 64)
!2666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2667, size: 8, elements: !2178)
!2667 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !2656, line: 26, baseType: !2121)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2504, file: !2505, line: 467, baseType: !2669, size: 64, offset: 64)
!2669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2670, size: 64)
!2670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !2671)
!2671 = !{!2672, !2747, !2748, !2761, !2762, !2763, !2764, !2765, !2766, !2768, !2770, !2771}
!2672 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2670, file: !142, line: 377, baseType: !2673, size: 64)
!2673 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2144, line: 111, baseType: !2674)
!2674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2675, size: 64)
!2675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !2676)
!2676 = !{!2677, !2712, !2713, !2714, !2717, !2721, !2722, !2723, !2741, !2742, !2743, !2744, !2745, !2746}
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2675, file: !142, line: 219, baseType: !2678, size: 64)
!2678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2679, size: 64)
!2679 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !2680)
!2680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !2681)
!2681 = !{!2682}
!2682 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2680, file: !142, line: 151, baseType: !2683, size: 128)
!2683 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !2684)
!2684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !2685)
!2685 = !{!2686, !2687, !2688}
!2686 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2684, file: !142, line: 150, baseType: !7, size: 32)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2684, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2684, file: !142, line: 150, baseType: !2689, size: 64, offset: 64)
!2689 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2690, size: 64, elements: !2178)
!2690 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2144, line: 108, baseType: !2691)
!2691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2692, size: 64)
!2692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !2693)
!2693 = !{!2694, !2695, !2696, !2704, !2705, !2706, !2707, !2708, !2709, !2710}
!2694 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2692, file: !142, line: 124, baseType: !2674, size: 64)
!2695 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2692, file: !142, line: 125, baseType: !2674, size: 64, offset: 64)
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2692, file: !142, line: 131, baseType: !2697, size: 64, offset: 128)
!2697 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !2698)
!2698 = !{!2699, !2703}
!2699 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2697, file: !142, line: 129, baseType: !2700, size: 64)
!2700 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2144, line: 66, baseType: !2701)
!2701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2702, size: 64)
!2702 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2144, line: 65, flags: DIFlagFwdDecl)
!2703 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2697, file: !142, line: 130, baseType: !2143, size: 64)
!2704 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2692, file: !142, line: 134, baseType: !2126, size: 64, offset: 192)
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !2692, file: !142, line: 137, baseType: !2258, size: 64, offset: 256)
!2706 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !2692, file: !142, line: 138, baseType: !2378, size: 32, offset: 320)
!2707 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !2692, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!2708 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2692, file: !142, line: 144, baseType: !2122, size: 32, offset: 384)
!2709 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !2692, file: !142, line: 145, baseType: !2122, size: 32, offset: 416)
!2710 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2692, file: !142, line: 146, baseType: !2711, size: 64, offset: 448)
!2711 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !2132)
!2712 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !2675, file: !142, line: 220, baseType: !2678, size: 64, offset: 64)
!2713 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2675, file: !142, line: 223, baseType: !2126, size: 64, offset: 128)
!2714 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !2675, file: !142, line: 226, baseType: !2715, size: 64, offset: 192)
!2715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2716, size: 64)
!2716 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!2717 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !2675, file: !142, line: 229, baseType: !2718, size: 128, offset: 256)
!2718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2719, size: 128, elements: !2214)
!2719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2720, size: 64)
!2720 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!2721 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !2675, file: !142, line: 232, baseType: !2674, size: 64, offset: 384)
!2722 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !2675, file: !142, line: 233, baseType: !2674, size: 64, offset: 448)
!2723 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !2675, file: !142, line: 238, baseType: !2724, size: 64, offset: 512)
!2724 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !2725)
!2725 = !{!2726, !2732}
!2726 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2724, file: !142, line: 236, baseType: !2727, size: 64)
!2727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2728, size: 64)
!2728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !2729)
!2729 = !{!2730, !2731}
!2730 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2728, file: !142, line: 275, baseType: !2700, size: 64)
!2731 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2728, file: !142, line: 278, baseType: !2700, size: 64, offset: 64)
!2732 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2724, file: !142, line: 237, baseType: !2733, size: 64)
!2733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2734, size: 64)
!2734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !2735)
!2735 = !{!2736, !2737, !2738, !2739, !2740}
!2736 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2734, file: !142, line: 261, baseType: !2143, size: 64)
!2737 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2734, file: !142, line: 262, baseType: !2143, size: 64, offset: 64)
!2738 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2734, file: !142, line: 266, baseType: !2143, size: 64, offset: 128)
!2739 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2734, file: !142, line: 267, baseType: !2143, size: 64, offset: 192)
!2740 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2734, file: !142, line: 270, baseType: !2122, size: 32, offset: 256)
!2741 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2675, file: !142, line: 241, baseType: !2711, size: 64, offset: 576)
!2742 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2675, file: !142, line: 244, baseType: !2122, size: 32, offset: 640)
!2743 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !2675, file: !142, line: 247, baseType: !2122, size: 32, offset: 672)
!2744 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !2675, file: !142, line: 250, baseType: !2122, size: 32, offset: 704)
!2745 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !2675, file: !142, line: 253, baseType: !2122, size: 32, offset: 736)
!2746 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2675, file: !142, line: 256, baseType: !2122, size: 32, offset: 768)
!2747 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2670, file: !142, line: 378, baseType: !2673, size: 64, offset: 64)
!2748 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2670, file: !142, line: 381, baseType: !2749, size: 64, offset: 128)
!2749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2750, size: 64)
!2750 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !2751)
!2751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !2752)
!2752 = !{!2753}
!2753 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2751, file: !142, line: 282, baseType: !2754, size: 128)
!2754 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !2755)
!2755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !2756)
!2756 = !{!2757, !2758, !2759}
!2757 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2755, file: !142, line: 281, baseType: !7, size: 32)
!2758 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2755, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!2759 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2755, file: !142, line: 281, baseType: !2760, size: 64, offset: 64)
!2760 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2673, size: 64, elements: !2178)
!2761 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !2670, file: !142, line: 384, baseType: !2122, size: 32, offset: 192)
!2762 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !2670, file: !142, line: 387, baseType: !2122, size: 32, offset: 224)
!2763 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !2670, file: !142, line: 390, baseType: !2122, size: 32, offset: 256)
!2764 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !2670, file: !142, line: 394, baseType: !2749, size: 64, offset: 320)
!2765 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !2670, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!2766 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !2670, file: !142, line: 399, baseType: !2767, size: 64, offset: 416)
!2767 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !2214)
!2768 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !2670, file: !142, line: 402, baseType: !2769, size: 64, offset: 480)
!2769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !2214)
!2770 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !2670, file: !142, line: 406, baseType: !2122, size: 32, offset: 544)
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !2670, file: !142, line: 409, baseType: !2122, size: 32, offset: 576)
!2772 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2504, file: !2505, line: 470, baseType: !2701, size: 64, offset: 128)
!2773 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2504, file: !2505, line: 473, baseType: !2774, size: 64, offset: 192)
!2774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2775, size: 64)
!2775 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2505, line: 166, flags: DIFlagFwdDecl)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !2504, file: !2505, line: 476, baseType: !2777, size: 64, offset: 256)
!2777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2778, size: 64)
!2778 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !2505, line: 476, flags: DIFlagFwdDecl)
!2779 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !2504, file: !2505, line: 479, baseType: !2588, size: 64, offset: 320)
!2780 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2504, file: !2505, line: 484, baseType: !2258, size: 64, offset: 384)
!2781 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !2504, file: !2505, line: 488, baseType: !2258, size: 64, offset: 448)
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !2504, file: !2505, line: 493, baseType: !2258, size: 64, offset: 512)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !2504, file: !2505, line: 496, baseType: !2258, size: 64, offset: 576)
!2784 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2504, file: !2505, line: 501, baseType: !2785, size: 64, offset: 640)
!2785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2786, size: 64)
!2786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !2787)
!2787 = !{!2788, !2791, !2792, !2793, !2794, !2796, !2797, !2802, !2803, !2804, !2805, !2806, !2807}
!2788 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2786, file: !153, line: 2356, baseType: !2789, size: 64)
!2789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2790, size: 64)
!2790 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2786, file: !153, line: 2357, baseType: !2127, size: 64, offset: 64)
!2792 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2786, file: !153, line: 2358, baseType: !2122, size: 32, offset: 128)
!2793 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2786, file: !153, line: 2359, baseType: !2122, size: 32, offset: 160)
!2794 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2786, file: !153, line: 2360, baseType: !2795, size: 128, offset: 192)
!2795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2122, size: 128, elements: !2238)
!2796 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2786, file: !153, line: 2364, baseType: !2122, size: 32, offset: 320)
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2786, file: !153, line: 2367, baseType: !2798, size: 128, offset: 384)
!2798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !2799)
!2799 = !{!2800, !2801}
!2800 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2798, file: !153, line: 2351, baseType: !2143, size: 64)
!2801 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2798, file: !153, line: 2352, baseType: !2132, size: 64, offset: 64)
!2802 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2786, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!2803 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2786, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2804 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2786, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2805 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2786, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2806 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2786, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2807 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2786, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2808 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !2504, file: !2505, line: 504, baseType: !2809, size: 64, offset: 704)
!2809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2810, size: 64)
!2810 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !2505, line: 504, flags: DIFlagFwdDecl)
!2811 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !2504, file: !2505, line: 507, baseType: !2588, size: 64, offset: 768)
!2812 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !2504, file: !2505, line: 510, baseType: !2122, size: 32, offset: 832)
!2813 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !2504, file: !2505, line: 513, baseType: !2122, size: 32, offset: 864)
!2814 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !2504, file: !2505, line: 516, baseType: !2378, size: 32, offset: 896)
!2815 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !2504, file: !2505, line: 519, baseType: !2378, size: 32, offset: 928)
!2816 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !2504, file: !2505, line: 522, baseType: !7, size: 32, offset: 960)
!2817 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !2504, file: !2505, line: 523, baseType: !7, size: 32, offset: 992)
!2818 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !2504, file: !2505, line: 528, baseType: !2127, size: 64, offset: 1024)
!2819 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !2504, file: !2505, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2820 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !2504, file: !2505, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2821 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !2504, file: !2505, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2822 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !2504, file: !2505, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2823 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !2504, file: !2505, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2824 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !2504, file: !2505, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2825 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !2504, file: !2505, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2826 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !2504, file: !2505, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2827 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !2504, file: !2505, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2828 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !2504, file: !2505, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2829 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !2504, file: !2505, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2830 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !2504, file: !2505, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2831 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !2504, file: !2505, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2832 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !2504, file: !2505, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2833 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !2504, file: !2505, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2834 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !2504, file: !2505, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2835 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !2499, file: !158, line: 3254, baseType: !2258, size: 64, offset: 1536)
!2836 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !2499, file: !158, line: 3257, baseType: !2258, size: 64, offset: 1600)
!2837 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !2499, file: !158, line: 3258, baseType: !2258, size: 64, offset: 1664)
!2838 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !2499, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2839 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !2499, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2840 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !2499, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2841 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !2499, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2842 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !2499, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2843 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !2499, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2844 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !2499, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2845 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !2499, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2846 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !2499, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2847 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !2499, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!2848 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !2499, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!2849 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !2499, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!2850 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !2499, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!2851 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !2499, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!2852 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !2499, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!2853 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !2499, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!2854 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !2499, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!2855 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !2499, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!2856 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2260, file: !158, line: 3394, baseType: !2857, size: 1344)
!2857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !2858)
!2858 = !{!2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2884, !2885, !2886, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902}
!2859 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2857, file: !158, line: 2280, baseType: !2296, size: 192)
!2860 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2857, file: !158, line: 2281, baseType: !2258, size: 64, offset: 192)
!2861 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2857, file: !158, line: 2282, baseType: !2258, size: 64, offset: 256)
!2862 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2857, file: !158, line: 2283, baseType: !2258, size: 64, offset: 320)
!2863 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2857, file: !158, line: 2284, baseType: !2258, size: 64, offset: 384)
!2864 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2857, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!2865 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !2857, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!2866 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !2857, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!2867 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !2857, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!2868 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !2857, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!2869 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !2857, file: !158, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
