; ModuleID = 'reorg.bc'
source_filename = "reorg.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }

!128 = !DIEnumerator(name: "TV_DOMINANCE", value: 112, isUnsigned: true)
!129 = !DIEnumerator(name: "TV_CONTROL_DEPENDENCES", value: 113, isUnsigned: true)
!130 = !DIEnumerator(name: "TV_OVERLOAD", value: 114, isUnsigned: true)
!131 = !DIEnumerator(name: "TV_TEMPLATE_INSTANTIATION", value: 115, isUnsigned: true)
!132 = !DIEnumerator(name: "TV_EXPAND", value: 116, isUnsigned: true)
!133 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!134 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!135 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!136 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!137 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!138 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!139 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!140 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!141 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!142 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!143 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!144 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!145 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!146 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!147 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!148 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!149 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!150 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!151 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!152 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!153 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!154 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!155 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!156 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!157 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!158 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!159 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!160 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!161 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!162 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!163 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!164 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!165 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!166 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!167 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!168 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!169 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!170 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!171 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!172 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!173 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!174 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!175 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!176 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!177 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!178 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!179 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!180 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!181 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!182 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!183 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!184 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!185 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!186 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!187 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!188 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!189 = !{!190, !191, !192, !193, !196, !197}
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!192 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !195, size: 64)
!195 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !195)
!199 = !{!0, !200}
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "pass_machine_reorg", scope: !2, file: !3, line: 4107, type: !202, isLocal: false, isDefinition: true)
!202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_opt_pass", file: !6, line: 162, size: 640, elements: !203)
!203 = !{!204}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !202, file: !6, line: 164, baseType: !205, size: 640)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opt_pass", file: !6, line: 114, size: 640, elements: !206)
!206 = !{!207, !208, !209, !213, !217, !219, !220, !221, !223, !224, !225, !226, !227}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !205, file: !6, line: 117, baseType: !5, size: 32)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !6, line: 121, baseType: !197, size: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "gate", scope: !205, file: !6, line: 125, baseType: !210, size: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DISubroutineType(types: !212)
!212 = !{!191}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !205, file: !6, line: 130, baseType: !214, size: 64, offset: 192)
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = !DISubroutineType(types: !216)
!216 = !{!7}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !205, file: !6, line: 133, baseType: !218, size: 64, offset: 256)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !6, line: 136, baseType: !218, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "static_pass_number", scope: !205, file: !6, line: 139, baseType: !192, size: 32, offset: 384)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "tv_id", scope: !205, file: !6, line: 143, baseType: !222, size: 32, offset: 416)
!222 = !DIDerivedType(tag: DW_TAG_typedef, name: "timevar_id_t", file: !14, line: 80, baseType: !13)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "properties_required", scope: !205, file: !6, line: 146, baseType: !7, size: 32, offset: 448)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "properties_provided", scope: !205, file: !6, line: 147, baseType: !7, size: 32, offset: 480)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "properties_destroyed", scope: !205, file: !6, line: 148, baseType: !7, size: 32, offset: 512)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_start", scope: !205, file: !6, line: 151, baseType: !7, size: 32, offset: 544)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_finish", scope: !205, file: !6, line: 152, baseType: !7, size: 32, offset: 576)
!228 = !{i32 2, !"Dwarf Version", i32 4}
!229 = !{i32 2, !"Debug Info Version", i32 3}
!230 = !{i32 1, !"wchar_size", i32 4}
!231 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!232 = distinct !DISubprogram(name: "vprintf", scope: !233, file: !233, line: 39, type: !234, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !244)
!233 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!234 = !DISubroutineType(types: !235)
!235 = !{!192, !236, !237}
!236 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !197)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !239)
!239 = !{!240, !241, !242, !243}
!240 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !238, file: !3, baseType: !7, size: 32)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !238, file: !3, baseType: !7, size: 32, offset: 32)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !238, file: !3, baseType: !196, size: 64, offset: 64)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !238, file: !3, baseType: !196, size: 64, offset: 128)
!244 = !{!245, !246}
!245 = !DILocalVariable(name: "__fmt", arg: 1, scope: !232, file: !233, line: 39, type: !236)
!246 = !DILocalVariable(name: "__arg", arg: 2, scope: !232, file: !233, line: 39, type: !237)
!247 = !DILocation(line: 0, scope: !232)
!248 = !DILocation(line: 41, column: 20, scope: !232)
!249 = !DILocation(line: 41, column: 10, scope: !232)
!250 = !DILocation(line: 41, column: 3, scope: !232)
!251 = distinct !DISubprogram(name: "getchar", scope: !233, file: !233, line: 47, type: !252, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!252 = !DISubroutineType(types: !253)
!253 = !{!192}
!254 = !{}
!255 = !DILocation(line: 49, column: 16, scope: !251)
!256 = !DILocation(line: 49, column: 10, scope: !251)
!257 = !DILocation(line: 49, column: 3, scope: !251)
!258 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !233, file: !233, line: 56, type: !259, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !320)
!259 = !DISubroutineType(types: !260)
!260 = !{!192, !261}
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !263, line: 7, baseType: !264)
!263 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !265, line: 49, size: 1728, elements: !266)
!265 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!266 = !{!267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !282, !284, !285, !286, !290, !292, !294, !298, !301, !303, !306, !309, !310, !311, !315, !316}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !264, file: !265, line: 51, baseType: !192, size: 32)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !264, file: !265, line: 54, baseType: !194, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !264, file: !265, line: 55, baseType: !194, size: 64, offset: 128)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !264, file: !265, line: 56, baseType: !194, size: 64, offset: 192)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !264, file: !265, line: 57, baseType: !194, size: 64, offset: 256)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !264, file: !265, line: 58, baseType: !194, size: 64, offset: 320)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !264, file: !265, line: 59, baseType: !194, size: 64, offset: 384)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !264, file: !265, line: 60, baseType: !194, size: 64, offset: 448)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !264, file: !265, line: 61, baseType: !194, size: 64, offset: 512)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !264, file: !265, line: 64, baseType: !194, size: 64, offset: 576)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !264, file: !265, line: 65, baseType: !194, size: 64, offset: 640)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !264, file: !265, line: 66, baseType: !194, size: 64, offset: 704)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !264, file: !265, line: 68, baseType: !280, size: 64, offset: 768)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !281, size: 64)
!281 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !265, line: 36, flags: DIFlagFwdDecl)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !264, file: !265, line: 70, baseType: !283, size: 64, offset: 832)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !264, file: !265, line: 72, baseType: !192, size: 32, offset: 896)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !264, file: !265, line: 73, baseType: !192, size: 32, offset: 928)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !264, file: !265, line: 74, baseType: !287, size: 64, offset: 960)
!287 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !288, line: 152, baseType: !289)
!288 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!289 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !264, file: !265, line: 77, baseType: !291, size: 16, offset: 1024)
!291 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !264, file: !265, line: 78, baseType: !293, size: 8, offset: 1040)
!293 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !264, file: !265, line: 79, baseType: !295, size: 8, offset: 1048)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 8, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 1)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !264, file: !265, line: 81, baseType: !299, size: 64, offset: 1088)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !300, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !265, line: 43, baseType: null)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !264, file: !265, line: 89, baseType: !302, size: 64, offset: 1152)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !288, line: 153, baseType: !289)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !264, file: !265, line: 91, baseType: !304, size: 64, offset: 1216)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !265, line: 37, flags: DIFlagFwdDecl)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !264, file: !265, line: 92, baseType: !307, size: 64, offset: 1280)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !265, line: 38, flags: DIFlagFwdDecl)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !264, file: !265, line: 93, baseType: !283, size: 64, offset: 1344)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !264, file: !265, line: 94, baseType: !196, size: 64, offset: 1408)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !264, file: !265, line: 95, baseType: !312, size: 64, offset: 1472)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !313, line: 46, baseType: !314)
!313 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!314 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !264, file: !265, line: 96, baseType: !192, size: 32, offset: 1536)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !264, file: !265, line: 98, baseType: !317, size: 160, offset: 1568)
!317 = !DICompositeType(tag: DW_TAG_array_type, baseType: !195, size: 160, elements: !318)
!318 = !{!319}
!319 = !DISubrange(count: 20)
!320 = !{!321}
!321 = !DILocalVariable(name: "__fp", arg: 1, scope: !258, file: !233, line: 56, type: !261)
!322 = !DILocation(line: 0, scope: !258)
!323 = !DILocation(line: 58, column: 10, scope: !258)
!324 = !DILocation(line: 58, column: 3, scope: !258)
!325 = distinct !DISubprogram(name: "getc_unlocked", scope: !233, file: !233, line: 66, type: !259, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !326)
!326 = !{!327}
!327 = !DILocalVariable(name: "__fp", arg: 1, scope: !325, file: !233, line: 66, type: !261)
!328 = !DILocation(line: 0, scope: !325)
!329 = !DILocation(line: 68, column: 10, scope: !325)
!330 = !DILocation(line: 68, column: 3, scope: !325)
!331 = distinct !DISubprogram(name: "getchar_unlocked", scope: !233, file: !233, line: 73, type: !252, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!332 = !DILocation(line: 75, column: 10, scope: !331)
!333 = !DILocation(line: 75, column: 3, scope: !331)
!334 = distinct !DISubprogram(name: "putchar", scope: !233, file: !233, line: 82, type: !335, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!192, !192}
!337 = !{!338}
!338 = !DILocalVariable(name: "__c", arg: 1, scope: !334, file: !233, line: 82, type: !192)
!339 = !DILocation(line: 0, scope: !334)
!340 = !DILocation(line: 84, column: 21, scope: !334)
!341 = !DILocation(line: 84, column: 10, scope: !334)
!342 = !DILocation(line: 84, column: 3, scope: !334)
!343 = distinct !DISubprogram(name: "fputc_unlocked", scope: !233, file: !233, line: 91, type: !344, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !346)
!344 = !DISubroutineType(types: !345)
!345 = !{!192, !192, !261}
!346 = !{!347, !348}
!347 = !DILocalVariable(name: "__c", arg: 1, scope: !343, file: !233, line: 91, type: !192)
!348 = !DILocalVariable(name: "__stream", arg: 2, scope: !343, file: !233, line: 91, type: !261)
!349 = !DILocation(line: 0, scope: !343)
!350 = !DILocation(line: 93, column: 10, scope: !343)
!351 = !DILocation(line: 93, column: 3, scope: !343)
!352 = distinct !DISubprogram(name: "putc_unlocked", scope: !233, file: !233, line: 101, type: !344, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !353)
!353 = !{!354, !355}
!354 = !DILocalVariable(name: "__c", arg: 1, scope: !352, file: !233, line: 101, type: !192)
!355 = !DILocalVariable(name: "__stream", arg: 2, scope: !352, file: !233, line: 101, type: !261)
!356 = !DILocation(line: 0, scope: !352)
!357 = !DILocation(line: 103, column: 10, scope: !352)
!358 = !DILocation(line: 103, column: 3, scope: !352)
!359 = distinct !DISubprogram(name: "putchar_unlocked", scope: !233, file: !233, line: 108, type: !335, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !360)
!360 = !{!361}
!361 = !DILocalVariable(name: "__c", arg: 1, scope: !359, file: !233, line: 108, type: !192)
!362 = !DILocation(line: 0, scope: !359)
!363 = !DILocation(line: 110, column: 10, scope: !359)
!364 = !DILocation(line: 110, column: 3, scope: !359)
!365 = distinct !DISubprogram(name: "getline", scope: !233, file: !233, line: 118, type: !366, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !370)
!366 = !DISubroutineType(types: !367)
!367 = !{!368, !193, !369, !261}
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !288, line: 193, baseType: !289)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!370 = !{!371, !372, !373}
!371 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !365, file: !233, line: 118, type: !193)
!372 = !DILocalVariable(name: "__n", arg: 2, scope: !365, file: !233, line: 118, type: !369)
!373 = !DILocalVariable(name: "__stream", arg: 3, scope: !365, file: !233, line: 118, type: !261)
!374 = !DILocation(line: 0, scope: !365)
!375 = !DILocation(line: 120, column: 10, scope: !365)
!376 = !DILocation(line: 120, column: 3, scope: !365)
!377 = distinct !DISubprogram(name: "feof_unlocked", scope: !233, file: !233, line: 128, type: !259, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !378)
!378 = !{!379}
!379 = !DILocalVariable(name: "__stream", arg: 1, scope: !377, file: !233, line: 128, type: !261)
!380 = !DILocation(line: 0, scope: !377)
!381 = !DILocation(line: 130, column: 10, scope: !377)
!382 = !DILocation(line: 130, column: 3, scope: !377)
!383 = distinct !DISubprogram(name: "ferror_unlocked", scope: !233, file: !233, line: 135, type: !259, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !384)
!384 = !{!385}
!385 = !DILocalVariable(name: "__stream", arg: 1, scope: !383, file: !233, line: 135, type: !261)
!386 = !DILocation(line: 0, scope: !383)
!387 = !DILocation(line: 137, column: 10, scope: !383)
!388 = !DILocation(line: 137, column: 3, scope: !383)
!389 = distinct !DISubprogram(name: "tolower", scope: !390, file: !390, line: 207, type: !335, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !391)
!390 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!391 = !{!392}
!392 = !DILocalVariable(name: "__c", arg: 1, scope: !389, file: !390, line: 207, type: !192)
!393 = !DILocation(line: 0, scope: !389)
!394 = !DILocation(line: 209, column: 22, scope: !389)
!395 = !DILocation(line: 209, column: 39, scope: !389)
!396 = !DILocation(line: 209, column: 38, scope: !389)
!397 = !DILocation(line: 209, column: 37, scope: !389)
!398 = !DILocation(line: 209, column: 10, scope: !389)
!399 = !DILocation(line: 209, column: 3, scope: !389)
!400 = distinct !DISubprogram(name: "toupper", scope: !390, file: !390, line: 213, type: !335, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !401)
!401 = !{!402}
!402 = !DILocalVariable(name: "__c", arg: 1, scope: !400, file: !390, line: 213, type: !192)
!403 = !DILocation(line: 0, scope: !400)
!404 = !DILocation(line: 215, column: 22, scope: !400)
!405 = !DILocation(line: 215, column: 39, scope: !400)
!406 = !DILocation(line: 215, column: 38, scope: !400)
!407 = !DILocation(line: 215, column: 37, scope: !400)
!408 = !DILocation(line: 215, column: 10, scope: !400)
!409 = !DILocation(line: 215, column: 3, scope: !400)
!410 = distinct !DISubprogram(name: "atoi", scope: !411, file: !411, line: 361, type: !412, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !414)
!411 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!412 = !DISubroutineType(types: !413)
!413 = !{!192, !197}
!414 = !{!415}
!415 = !DILocalVariable(name: "__nptr", arg: 1, scope: !410, file: !411, line: 361, type: !197)
!416 = !DILocation(line: 0, scope: !410)
!417 = !DILocation(line: 363, column: 16, scope: !410)
!418 = !DILocation(line: 363, column: 10, scope: !410)
!419 = !DILocation(line: 363, column: 3, scope: !410)
!420 = distinct !DISubprogram(name: "atol", scope: !411, file: !411, line: 366, type: !421, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !423)
!421 = !DISubroutineType(types: !422)
!422 = !{!289, !197}
!423 = !{!424}
!424 = !DILocalVariable(name: "__nptr", arg: 1, scope: !420, file: !411, line: 366, type: !197)
!425 = !DILocation(line: 0, scope: !420)
!426 = !DILocation(line: 368, column: 10, scope: !420)
!427 = !DILocation(line: 368, column: 3, scope: !420)
!428 = distinct !DISubprogram(name: "atoll", scope: !411, file: !411, line: 373, type: !429, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !432)
!429 = !DISubroutineType(types: !430)
!430 = !{!431, !197}
!431 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!432 = !{!433}
!433 = !DILocalVariable(name: "__nptr", arg: 1, scope: !428, file: !411, line: 373, type: !197)
!434 = !DILocation(line: 0, scope: !428)
!435 = !DILocation(line: 375, column: 10, scope: !428)
!436 = !DILocation(line: 375, column: 3, scope: !428)
!437 = distinct !DISubprogram(name: "bsearch", scope: !438, file: !438, line: 20, type: !439, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !447)
!438 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!439 = !DISubroutineType(types: !440)
!440 = !{!196, !441, !441, !312, !312, !443}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !411, line: 808, baseType: !444)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DISubroutineType(types: !446)
!446 = !{!192, !441, !441}
!447 = !{!448, !449, !450, !451, !452, !453, !454, !455, !456, !457}
!448 = !DILocalVariable(name: "__key", arg: 1, scope: !437, file: !438, line: 20, type: !441)
!449 = !DILocalVariable(name: "__base", arg: 2, scope: !437, file: !438, line: 20, type: !441)
!450 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !437, file: !438, line: 20, type: !312)
!451 = !DILocalVariable(name: "__size", arg: 4, scope: !437, file: !438, line: 20, type: !312)
!452 = !DILocalVariable(name: "__compar", arg: 5, scope: !437, file: !438, line: 21, type: !443)
!453 = !DILocalVariable(name: "__l", scope: !437, file: !438, line: 23, type: !312)
!454 = !DILocalVariable(name: "__u", scope: !437, file: !438, line: 23, type: !312)
!455 = !DILocalVariable(name: "__idx", scope: !437, file: !438, line: 23, type: !312)
!456 = !DILocalVariable(name: "__p", scope: !437, file: !438, line: 24, type: !441)
!457 = !DILocalVariable(name: "__comparison", scope: !437, file: !438, line: 25, type: !192)
!458 = !DILocation(line: 0, scope: !437)
!459 = !DILocation(line: 29, column: 3, scope: !437)
!460 = !DILocation(line: 27, column: 7, scope: !437)
!461 = !DILocation(line: 29, column: 14, scope: !437)
!462 = !DILocation(line: 31, column: 20, scope: !463)
!463 = distinct !DILexicalBlock(scope: !437, file: !438, line: 30, column: 5)
!464 = !DILocation(line: 31, column: 27, scope: !463)
!465 = !DILocation(line: 32, column: 56, scope: !463)
!466 = !DILocation(line: 32, column: 47, scope: !463)
!467 = !DILocation(line: 33, column: 22, scope: !463)
!468 = !DILocation(line: 34, column: 24, scope: !469)
!469 = distinct !DILexicalBlock(scope: !463, file: !438, line: 34, column: 11)
!470 = !DILocation(line: 34, column: 11, scope: !463)
!471 = !DILocation(line: 36, column: 29, scope: !472)
!472 = distinct !DILexicalBlock(scope: !469, file: !438, line: 36, column: 16)
!473 = !DILocation(line: 36, column: 16, scope: !469)
!474 = !DILocation(line: 37, column: 14, scope: !472)
!475 = distinct !{!475, !459, !476}
!476 = !DILocation(line: 40, column: 5, scope: !437)
!477 = !DILocation(line: 43, column: 1, scope: !437)
!478 = distinct !DISubprogram(name: "atof", scope: !479, file: !479, line: 25, type: !480, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !483)
!479 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!480 = !DISubroutineType(types: !481)
!481 = !{!482, !197}
!482 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!483 = !{!484}
!484 = !DILocalVariable(name: "__nptr", arg: 1, scope: !478, file: !479, line: 25, type: !197)
!485 = !DILocation(line: 0, scope: !478)
!486 = !DILocation(line: 27, column: 10, scope: !478)
!487 = !DILocation(line: 27, column: 3, scope: !478)
!488 = distinct !DISubprogram(name: "strtoimax", scope: !489, file: !489, line: 324, type: !490, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !496)
!489 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!490 = !DISubroutineType(types: !491)
!491 = !{!492, !236, !495, !192}
!492 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !493, line: 101, baseType: !494)
!493 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!494 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !288, line: 72, baseType: !289)
!495 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !193)
!496 = !{!497, !498, !499}
!497 = !DILocalVariable(name: "nptr", arg: 1, scope: !488, file: !489, line: 324, type: !236)
!498 = !DILocalVariable(name: "endptr", arg: 2, scope: !488, file: !489, line: 324, type: !495)
!499 = !DILocalVariable(name: "base", arg: 3, scope: !488, file: !489, line: 324, type: !192)
!500 = !DILocation(line: 0, scope: !488)
!501 = !DILocation(line: 327, column: 10, scope: !488)
!502 = !DILocation(line: 327, column: 3, scope: !488)
!503 = distinct !DISubprogram(name: "strtoumax", scope: !489, file: !489, line: 336, type: !504, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !508)
!504 = !DISubroutineType(types: !505)
!505 = !{!506, !236, !495, !192}
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !493, line: 102, baseType: !507)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !288, line: 73, baseType: !314)
!508 = !{!509, !510, !511}
!509 = !DILocalVariable(name: "nptr", arg: 1, scope: !503, file: !489, line: 336, type: !236)
!510 = !DILocalVariable(name: "endptr", arg: 2, scope: !503, file: !489, line: 336, type: !495)
!511 = !DILocalVariable(name: "base", arg: 3, scope: !503, file: !489, line: 336, type: !192)
!512 = !DILocation(line: 0, scope: !503)
!513 = !DILocation(line: 339, column: 10, scope: !503)
!514 = !DILocation(line: 339, column: 3, scope: !503)
!515 = distinct !DISubprogram(name: "wcstoimax", scope: !489, file: !489, line: 348, type: !516, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !525)
!516 = !DISubroutineType(types: !517)
!517 = !{!492, !518, !522, !192}
!518 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !519)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !520, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !521)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !489, line: 34, baseType: !192)
!522 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !523)
!523 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!525 = !{!526, !527, !528}
!526 = !DILocalVariable(name: "nptr", arg: 1, scope: !515, file: !489, line: 348, type: !518)
!527 = !DILocalVariable(name: "endptr", arg: 2, scope: !515, file: !489, line: 348, type: !522)
!528 = !DILocalVariable(name: "base", arg: 3, scope: !515, file: !489, line: 348, type: !192)
!529 = !DILocation(line: 0, scope: !515)
!530 = !DILocation(line: 351, column: 10, scope: !515)
!531 = !DILocation(line: 351, column: 3, scope: !515)
!532 = distinct !DISubprogram(name: "wcstoumax", scope: !489, file: !489, line: 362, type: !533, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !535)
!533 = !DISubroutineType(types: !534)
!534 = !{!506, !518, !522, !192}
!535 = !{!536, !537, !538}
!536 = !DILocalVariable(name: "nptr", arg: 1, scope: !532, file: !489, line: 362, type: !518)
!537 = !DILocalVariable(name: "endptr", arg: 2, scope: !532, file: !489, line: 362, type: !522)
!538 = !DILocalVariable(name: "base", arg: 3, scope: !532, file: !489, line: 362, type: !192)
!539 = !DILocation(line: 0, scope: !532)
!540 = !DILocation(line: 365, column: 10, scope: !532)
!541 = !DILocation(line: 365, column: 3, scope: !532)
!542 = distinct !DISubprogram(name: "stat", scope: !543, file: !543, line: 453, type: !544, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !583)
!543 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!544 = !DISubroutineType(types: !545)
!545 = !{!192, !197, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !548, line: 46, size: 1152, elements: !549)
!548 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!549 = !{!550, !552, !554, !556, !558, !560, !562, !563, !564, !565, !567, !569, !577, !578, !579}
!550 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !547, file: !548, line: 48, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !288, line: 145, baseType: !314)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !547, file: !548, line: 53, baseType: !553, size: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !288, line: 148, baseType: !314)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !547, file: !548, line: 61, baseType: !555, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !288, line: 151, baseType: !314)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !547, file: !548, line: 62, baseType: !557, size: 32, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !288, line: 150, baseType: !7)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !547, file: !548, line: 64, baseType: !559, size: 32, offset: 224)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !288, line: 146, baseType: !7)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !547, file: !548, line: 65, baseType: !561, size: 32, offset: 256)
!561 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !288, line: 147, baseType: !7)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !547, file: !548, line: 67, baseType: !192, size: 32, offset: 288)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !547, file: !548, line: 69, baseType: !551, size: 64, offset: 320)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !547, file: !548, line: 74, baseType: !287, size: 64, offset: 384)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !547, file: !548, line: 78, baseType: !566, size: 64, offset: 448)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !288, line: 174, baseType: !289)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !547, file: !548, line: 80, baseType: !568, size: 64, offset: 512)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !288, line: 179, baseType: !289)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !547, file: !548, line: 91, baseType: !570, size: 128, offset: 576)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !571, line: 10, size: 128, elements: !572)
!571 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!572 = !{!573, !575}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !570, file: !571, line: 12, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !288, line: 160, baseType: !289)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !570, file: !571, line: 16, baseType: !576, size: 64, offset: 64)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !288, line: 196, baseType: !289)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !547, file: !548, line: 92, baseType: !570, size: 128, offset: 704)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !547, file: !548, line: 93, baseType: !570, size: 128, offset: 832)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !547, file: !548, line: 106, baseType: !580, size: 192, offset: 960)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !576, size: 192, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 3)
!583 = !{!584, !585}
!584 = !DILocalVariable(name: "__path", arg: 1, scope: !542, file: !543, line: 453, type: !197)
!585 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !542, file: !543, line: 453, type: !546)
!586 = !DILocation(line: 0, scope: !542)
!587 = !DILocation(line: 455, column: 10, scope: !542)
!588 = !DILocation(line: 455, column: 3, scope: !542)
!589 = distinct !DISubprogram(name: "lstat", scope: !543, file: !543, line: 460, type: !544, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !590)
!590 = !{!591, !592}
!591 = !DILocalVariable(name: "__path", arg: 1, scope: !589, file: !543, line: 460, type: !197)
!592 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !589, file: !543, line: 460, type: !546)
!593 = !DILocation(line: 0, scope: !589)
!594 = !DILocation(line: 462, column: 10, scope: !589)
!595 = !DILocation(line: 462, column: 3, scope: !589)
!596 = distinct !DISubprogram(name: "fstat", scope: !543, file: !543, line: 467, type: !597, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !599)
!597 = !DISubroutineType(types: !598)
!598 = !{!192, !192, !546}
!599 = !{!600, !601}
!600 = !DILocalVariable(name: "__fd", arg: 1, scope: !596, file: !543, line: 467, type: !192)
!601 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !596, file: !543, line: 467, type: !546)
!602 = !DILocation(line: 0, scope: !596)
!603 = !DILocation(line: 469, column: 10, scope: !596)
!604 = !DILocation(line: 469, column: 3, scope: !596)
!605 = distinct !DISubprogram(name: "fstatat", scope: !543, file: !543, line: 474, type: !606, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !608)
!606 = !DISubroutineType(types: !607)
!607 = !{!192, !192, !197, !546, !192}
!608 = !{!609, !610, !611, !612}
!609 = !DILocalVariable(name: "__fd", arg: 1, scope: !605, file: !543, line: 474, type: !192)
!610 = !DILocalVariable(name: "__filename", arg: 2, scope: !605, file: !543, line: 474, type: !197)
!611 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !605, file: !543, line: 474, type: !546)
!612 = !DILocalVariable(name: "__flag", arg: 4, scope: !605, file: !543, line: 474, type: !192)
!613 = !DILocation(line: 0, scope: !605)
!614 = !DILocation(line: 477, column: 10, scope: !605)
!615 = !DILocation(line: 477, column: 3, scope: !605)
!616 = distinct !DISubprogram(name: "mknod", scope: !543, file: !543, line: 483, type: !617, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!192, !197, !557, !551}
!619 = !{!620, !621, !622}
!620 = !DILocalVariable(name: "__path", arg: 1, scope: !616, file: !543, line: 483, type: !197)
!621 = !DILocalVariable(name: "__mode", arg: 2, scope: !616, file: !543, line: 483, type: !557)
!622 = !DILocalVariable(name: "__dev", arg: 3, scope: !616, file: !543, line: 483, type: !551)
!623 = !DILocation(line: 0, scope: !616)
!624 = !DILocation(line: 485, column: 10, scope: !616)
!625 = !DILocation(line: 485, column: 3, scope: !616)
!626 = distinct !DISubprogram(name: "mknodat", scope: !543, file: !543, line: 491, type: !627, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !629)
!627 = !DISubroutineType(types: !628)
!628 = !{!192, !192, !197, !557, !551}
!629 = !{!630, !631, !632, !633}
!630 = !DILocalVariable(name: "__fd", arg: 1, scope: !626, file: !543, line: 491, type: !192)
!631 = !DILocalVariable(name: "__path", arg: 2, scope: !626, file: !543, line: 491, type: !197)
!632 = !DILocalVariable(name: "__mode", arg: 3, scope: !626, file: !543, line: 491, type: !557)
!633 = !DILocalVariable(name: "__dev", arg: 4, scope: !626, file: !543, line: 491, type: !551)
!634 = !DILocation(line: 0, scope: !626)
!635 = !DILocation(line: 494, column: 10, scope: !626)
!636 = !DILocation(line: 494, column: 3, scope: !626)
!637 = distinct !DISubprogram(name: "stat64", scope: !543, file: !543, line: 502, type: !638, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !660)
!638 = !DISubroutineType(types: !639)
!639 = !{!192, !197, !640}
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !548, line: 119, size: 1152, elements: !642)
!642 = !{!643, !644, !646, !647, !648, !649, !650, !651, !652, !653, !654, !656, !657, !658, !659}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !641, file: !548, line: 121, baseType: !551, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !641, file: !548, line: 123, baseType: !645, size: 64, offset: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !288, line: 149, baseType: !314)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !641, file: !548, line: 124, baseType: !555, size: 64, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !641, file: !548, line: 125, baseType: !557, size: 32, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !641, file: !548, line: 132, baseType: !559, size: 32, offset: 224)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !641, file: !548, line: 133, baseType: !561, size: 32, offset: 256)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !641, file: !548, line: 135, baseType: !192, size: 32, offset: 288)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !641, file: !548, line: 136, baseType: !551, size: 64, offset: 320)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !641, file: !548, line: 137, baseType: !287, size: 64, offset: 384)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !641, file: !548, line: 143, baseType: !566, size: 64, offset: 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !641, file: !548, line: 144, baseType: !655, size: 64, offset: 512)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !288, line: 180, baseType: !289)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !641, file: !548, line: 152, baseType: !570, size: 128, offset: 576)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !641, file: !548, line: 153, baseType: !570, size: 128, offset: 704)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !641, file: !548, line: 154, baseType: !570, size: 128, offset: 832)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !641, file: !548, line: 164, baseType: !580, size: 192, offset: 960)
!660 = !{!661, !662}
!661 = !DILocalVariable(name: "__path", arg: 1, scope: !637, file: !543, line: 502, type: !197)
!662 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !637, file: !543, line: 502, type: !640)
!663 = !DILocation(line: 0, scope: !637)
!664 = !DILocation(line: 504, column: 10, scope: !637)
!665 = !DILocation(line: 504, column: 3, scope: !637)
!666 = distinct !DISubprogram(name: "lstat64", scope: !543, file: !543, line: 509, type: !638, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !667)
!667 = !{!668, !669}
!668 = !DILocalVariable(name: "__path", arg: 1, scope: !666, file: !543, line: 509, type: !197)
!669 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !666, file: !543, line: 509, type: !640)
!670 = !DILocation(line: 0, scope: !666)
!671 = !DILocation(line: 511, column: 10, scope: !666)
!672 = !DILocation(line: 511, column: 3, scope: !666)
!673 = distinct !DISubprogram(name: "fstat64", scope: !543, file: !543, line: 516, type: !674, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !676)
!674 = !DISubroutineType(types: !675)
!675 = !{!192, !192, !640}
!676 = !{!677, !678}
!677 = !DILocalVariable(name: "__fd", arg: 1, scope: !673, file: !543, line: 516, type: !192)
!678 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !673, file: !543, line: 516, type: !640)
!679 = !DILocation(line: 0, scope: !673)
!680 = !DILocation(line: 518, column: 10, scope: !673)
!681 = !DILocation(line: 518, column: 3, scope: !673)
!682 = distinct !DISubprogram(name: "fstatat64", scope: !543, file: !543, line: 523, type: !683, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !685)
!683 = !DISubroutineType(types: !684)
!684 = !{!192, !192, !197, !640, !192}
!685 = !{!686, !687, !688, !689}
!686 = !DILocalVariable(name: "__fd", arg: 1, scope: !682, file: !543, line: 523, type: !192)
!687 = !DILocalVariable(name: "__filename", arg: 2, scope: !682, file: !543, line: 523, type: !197)
!688 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !682, file: !543, line: 523, type: !640)
!689 = !DILocalVariable(name: "__flag", arg: 4, scope: !682, file: !543, line: 523, type: !192)
!690 = !DILocation(line: 0, scope: !682)
!691 = !DILocation(line: 526, column: 10, scope: !682)
!692 = !DILocation(line: 526, column: 3, scope: !682)
!693 = distinct !DISubprogram(name: "gate_handle_delay_slots", scope: !3, file: !3, line: 4052, type: !211, scopeLine: 4053, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!694 = !DILocation(line: 4058, column: 3, scope: !693)
!695 = distinct !DISubprogram(name: "rest_of_handle_delay_slots", scope: !3, file: !3, line: 4064, type: !215, scopeLine: 4065, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!696 = !DILocation(line: 4069, column: 3, scope: !695)
!697 = distinct !DISubprogram(name: "gate_handle_machine_reorg", scope: !3, file: !3, line: 4094, type: !211, scopeLine: 4095, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!698 = !DILocation(line: 4096, column: 18, scope: !697)
!699 = !DILocation(line: 4096, column: 42, scope: !697)
!700 = !DILocation(line: 4096, column: 10, scope: !697)
!701 = !DILocation(line: 4096, column: 3, scope: !697)
!702 = distinct !DISubprogram(name: "rest_of_handle_machine_reorg", scope: !3, file: !3, line: 4101, type: !215, scopeLine: 4102, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!703 = !DILocation(line: 4103, column: 11, scope: !702)
