; ModuleID = 'resource.bc'
source_filename = "resource.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_data = type { %struct.expr_status, %struct.emit_status, %struct.varasm_status, %struct.incoming_args, %struct.function_subsections, %struct.rtl_eh, i32, %struct.rtx_def*, %struct.initial_value_struct*, %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, i64, %struct.rtx_def*, %struct.VEC_temp_slot_p_gc*, %struct.temp_slot*, i32, i32, i32, i32, i32, i32, %struct.rtx_def*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.expr_status = type { i32, i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def* }
%struct.emit_status = type { i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack*, i32, i32, i32, i32, i8* }
%struct.sequence_stack = type { %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack* }
%struct.varasm_status = type { %struct.rtx_constant_pool*, i32 }

!506 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!507 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!508 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!509 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!510 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!511 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!512 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!513 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!514 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!515 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!516 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!517 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!518 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!519 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!520 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!521 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!522 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!523 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!524 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!525 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!526 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mark_resource_type", file: !528, line: 43, baseType: !7, size: 32, elements: !529)
!528 = !DIFile(filename: "./resource.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!529 = !{!530, !531}
!530 = !DIEnumerator(name: "MARK_SRC_DEST", value: 0, isUnsigned: true)
!531 = !DIEnumerator(name: "MARK_SRC_DEST_CALL", value: 1, isUnsigned: true)
!532 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !385, line: 836, baseType: !7, size: 32, elements: !533)
!533 = !{!534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565}
!534 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!535 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!536 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!537 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!538 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!539 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!540 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!541 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!542 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!543 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!544 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!545 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!546 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!547 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!548 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!549 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!550 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!551 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!552 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!553 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!554 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!555 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!556 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!557 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!558 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!559 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!560 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!561 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!562 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!563 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!564 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!565 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!566 = !{!567, !568, !569, !570, !573, !574, !384, !576, !5, !579, !532, !587, !588, !589}
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !568, size: 64)
!568 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!569 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !572)
!576 = !DIDerivedType(tag: DW_TAG_typedef, name: "HARD_REG_ELT_TYPE", file: !577, line: 42, baseType: !578)
!577 = !DIFile(filename: "./hard-reg-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!578 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "target_info", file: !3, line: 44, size: 256, elements: !581)
!581 = !{!582, !583, !584, !585, !586}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !580, file: !3, line: 46, baseType: !569, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !580, file: !3, line: 47, baseType: !579, size: 64, offset: 64)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "live_regs", scope: !580, file: !3, line: 48, baseType: !576, size: 64, offset: 128)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !580, file: !3, line: 49, baseType: !569, size: 32, offset: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "bb_tick", scope: !580, file: !3, line: 50, baseType: !569, size: 32, offset: 224)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "df_lr_bb_info", file: !591, line: 826, size: 256, elements: !592)
!591 = !DIFile(filename: "./df.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!592 = !{!593, !656, !657, !658}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !590, file: !591, line: 829, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !595, line: 47, baseType: !596)
!595 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !598, line: 75, size: 256, elements: !599)
!598 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!599 = !{!600, !614, !615, !616}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !597, file: !598, line: 76, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !598, line: 68, baseType: !603)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !598, line: 63, size: 320, elements: !604)
!604 = !{!605, !607, !608, !609}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !603, file: !598, line: 64, baseType: !606, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !603, file: !598, line: 65, baseType: !606, size: 64, offset: 64)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !603, file: !598, line: 66, baseType: !7, size: 32, offset: 128)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !603, file: !598, line: 67, baseType: !610, size: 128, offset: 192)
!610 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 128, elements: !612)
!611 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !598, line: 29, baseType: !578)
!612 = !{!613}
!613 = !DISubrange(count: 2)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !597, file: !598, line: 77, baseType: !601, size: 64, offset: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !597, file: !598, line: 78, baseType: !7, size: 32, offset: 128)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !597, file: !598, line: 79, baseType: !617, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !598, line: 49, baseType: !619)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !598, line: 45, size: 832, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !619, file: !598, line: 46, baseType: !606, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !619, file: !598, line: 47, baseType: !596, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !619, file: !598, line: 48, baseType: !624, size: 704, offset: 128)
!624 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !625, line: 164, size: 704, elements: !626)
!625 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!626 = !{!627, !629, !639, !640, !641, !642, !643, !644, !648, !652, !653, !654, !655}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !624, file: !625, line: 166, baseType: !628, size: 64)
!628 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !624, file: !625, line: 167, baseType: !630, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !625, line: 157, size: 192, elements: !632)
!632 = !{!633, !634, !635}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !631, file: !625, line: 159, baseType: !571, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !631, file: !625, line: 160, baseType: !630, size: 64, offset: 64)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !631, file: !625, line: 161, baseType: !636, size: 32, offset: 128)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 32, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 4)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !624, file: !625, line: 168, baseType: !571, size: 64, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !624, file: !625, line: 169, baseType: !571, size: 64, offset: 192)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !624, file: !625, line: 170, baseType: !571, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !624, file: !625, line: 171, baseType: !628, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !624, file: !625, line: 172, baseType: !569, size: 32, offset: 384)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !624, file: !625, line: 176, baseType: !645, size: 64, offset: 448)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DISubroutineType(types: !647)
!647 = !{!630, !573, !628}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !624, file: !625, line: 177, baseType: !649, size: 64, offset: 512)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DISubroutineType(types: !651)
!651 = !{null, !573, !630}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !624, file: !625, line: 178, baseType: !573, size: 64, offset: 576)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !624, file: !625, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !624, file: !625, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !624, file: !625, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !590, file: !591, line: 831, baseType: !594, size: 64, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "in", scope: !590, file: !591, line: 834, baseType: !594, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "out", scope: !590, file: !591, line: 835, baseType: !594, size: 64, offset: 192)
!659 = !{!660, !0, !669, !671, !673, !675}
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "start_of_epilogue_needs", scope: !2, file: !3, line: 56, type: !662, isLocal: true, isDefinition: true)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "resources", file: !528, line: 33, size: 128, elements: !663)
!663 = !{!664, !665, !666, !667, !668}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "memory", scope: !662, file: !528, line: 35, baseType: !572, size: 8)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "unch_memory", scope: !662, file: !528, line: 36, baseType: !572, size: 8, offset: 8)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !662, file: !528, line: 37, baseType: !572, size: 8, offset: 16)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "cc", scope: !662, file: !528, line: 38, baseType: !572, size: 8, offset: 24)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "regs", scope: !662, file: !528, line: 39, baseType: !576, size: 64, offset: 64)
!669 = !DIGlobalVariableExpression(var: !670, expr: !DIExpression())
!670 = distinct !DIGlobalVariable(name: "bb_ticks", scope: !2, file: !3, line: 69, type: !588, isLocal: true, isDefinition: true)
!671 = !DIGlobalVariableExpression(var: !672, expr: !DIExpression())
!672 = distinct !DIGlobalVariable(name: "current_live_regs", scope: !2, file: !3, line: 74, type: !576, isLocal: true, isDefinition: true)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "pending_dead_regs", scope: !2, file: !3, line: 79, type: !576, isLocal: true, isDefinition: true)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "target_hash_table", scope: !2, file: !3, line: 62, type: !587, isLocal: true, isDefinition: true)
!677 = !{i32 2, !"Dwarf Version", i32 4}
!678 = !{i32 2, !"Debug Info Version", i32 3}
!679 = !{i32 1, !"wchar_size", i32 4}
!680 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!681 = distinct !DISubprogram(name: "vprintf", scope: !682, file: !682, line: 39, type: !683, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !693)
!682 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!683 = !DISubroutineType(types: !684)
!684 = !{!569, !685, !686}
!685 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !574)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !688)
!688 = !{!689, !690, !691, !692}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !687, file: !3, baseType: !7, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !687, file: !3, baseType: !7, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !687, file: !3, baseType: !573, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !687, file: !3, baseType: !573, size: 64, offset: 128)
!693 = !{!694, !695}
!694 = !DILocalVariable(name: "__fmt", arg: 1, scope: !681, file: !682, line: 39, type: !685)
!695 = !DILocalVariable(name: "__arg", arg: 2, scope: !681, file: !682, line: 39, type: !686)
!696 = !DILocation(line: 0, scope: !681)
!697 = !DILocation(line: 41, column: 20, scope: !681)
!698 = !DILocation(line: 41, column: 10, scope: !681)
!699 = !DILocation(line: 41, column: 3, scope: !681)
!700 = distinct !DISubprogram(name: "getchar", scope: !682, file: !682, line: 47, type: !701, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !703)
!701 = !DISubroutineType(types: !702)
!702 = !{!569}
!703 = !{}
!704 = !DILocation(line: 49, column: 16, scope: !700)
!705 = !DILocation(line: 49, column: 10, scope: !700)
!706 = !DILocation(line: 49, column: 3, scope: !700)
!707 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !682, file: !682, line: 56, type: !708, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !767)
!708 = !DISubroutineType(types: !709)
!709 = !{!569, !710}
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !712, line: 7, baseType: !713)
!712 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !714, line: 49, size: 1728, elements: !715)
!714 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!715 = !{!716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !731, !733, !734, !735, !738, !740, !742, !746, !749, !751, !754, !757, !758, !759, !762, !763}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !713, file: !714, line: 51, baseType: !569, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !713, file: !714, line: 54, baseType: !571, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !713, file: !714, line: 55, baseType: !571, size: 64, offset: 128)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !713, file: !714, line: 56, baseType: !571, size: 64, offset: 192)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !713, file: !714, line: 57, baseType: !571, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !713, file: !714, line: 58, baseType: !571, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !713, file: !714, line: 59, baseType: !571, size: 64, offset: 384)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !713, file: !714, line: 60, baseType: !571, size: 64, offset: 448)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !713, file: !714, line: 61, baseType: !571, size: 64, offset: 512)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !713, file: !714, line: 64, baseType: !571, size: 64, offset: 576)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !713, file: !714, line: 65, baseType: !571, size: 64, offset: 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !713, file: !714, line: 66, baseType: !571, size: 64, offset: 704)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !713, file: !714, line: 68, baseType: !729, size: 64, offset: 768)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !714, line: 36, flags: DIFlagFwdDecl)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !713, file: !714, line: 70, baseType: !732, size: 64, offset: 832)
!732 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !713, file: !714, line: 72, baseType: !569, size: 32, offset: 896)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !713, file: !714, line: 73, baseType: !569, size: 32, offset: 928)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !713, file: !714, line: 74, baseType: !736, size: 64, offset: 960)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !737, line: 152, baseType: !628)
!737 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!738 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !713, file: !714, line: 77, baseType: !739, size: 16, offset: 1024)
!739 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !713, file: !714, line: 78, baseType: !741, size: 8, offset: 1040)
!741 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !713, file: !714, line: 79, baseType: !743, size: 8, offset: 1048)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 8, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 1)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !713, file: !714, line: 81, baseType: !747, size: 64, offset: 1088)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !714, line: 43, baseType: null)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !713, file: !714, line: 89, baseType: !750, size: 64, offset: 1152)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !737, line: 153, baseType: !628)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !713, file: !714, line: 91, baseType: !752, size: 64, offset: 1216)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !714, line: 37, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !713, file: !714, line: 92, baseType: !755, size: 64, offset: 1280)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !714, line: 38, flags: DIFlagFwdDecl)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !713, file: !714, line: 93, baseType: !732, size: 64, offset: 1344)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !713, file: !714, line: 94, baseType: !573, size: 64, offset: 1408)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !713, file: !714, line: 95, baseType: !760, size: 64, offset: 1472)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !761, line: 46, baseType: !578)
!761 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!762 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !713, file: !714, line: 96, baseType: !569, size: 32, offset: 1536)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !713, file: !714, line: 98, baseType: !764, size: 160, offset: 1568)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !572, size: 160, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 20)
!767 = !{!768}
!768 = !DILocalVariable(name: "__fp", arg: 1, scope: !707, file: !682, line: 56, type: !710)
!769 = !DILocation(line: 0, scope: !707)
!770 = !DILocation(line: 58, column: 10, scope: !707)
!771 = !DILocation(line: 58, column: 3, scope: !707)
!772 = distinct !DISubprogram(name: "getc_unlocked", scope: !682, file: !682, line: 66, type: !708, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !773)
!773 = !{!774}
!774 = !DILocalVariable(name: "__fp", arg: 1, scope: !772, file: !682, line: 66, type: !710)
!775 = !DILocation(line: 0, scope: !772)
!776 = !DILocation(line: 68, column: 10, scope: !772)
!777 = !DILocation(line: 68, column: 3, scope: !772)
!778 = distinct !DISubprogram(name: "getchar_unlocked", scope: !682, file: !682, line: 73, type: !701, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !703)
!779 = !DILocation(line: 75, column: 10, scope: !778)
!780 = !DILocation(line: 75, column: 3, scope: !778)
!781 = distinct !DISubprogram(name: "putchar", scope: !682, file: !682, line: 82, type: !782, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !784)
!782 = !DISubroutineType(types: !783)
!783 = !{!569, !569}
!784 = !{!785}
!785 = !DILocalVariable(name: "__c", arg: 1, scope: !781, file: !682, line: 82, type: !569)
!786 = !DILocation(line: 0, scope: !781)
!787 = !DILocation(line: 84, column: 21, scope: !781)
!788 = !DILocation(line: 84, column: 10, scope: !781)
!789 = !DILocation(line: 84, column: 3, scope: !781)
!790 = distinct !DISubprogram(name: "fputc_unlocked", scope: !682, file: !682, line: 91, type: !791, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !793)
!791 = !DISubroutineType(types: !792)
!792 = !{!569, !569, !710}
!793 = !{!794, !795}
!794 = !DILocalVariable(name: "__c", arg: 1, scope: !790, file: !682, line: 91, type: !569)
!795 = !DILocalVariable(name: "__stream", arg: 2, scope: !790, file: !682, line: 91, type: !710)
!796 = !DILocation(line: 0, scope: !790)
!797 = !DILocation(line: 93, column: 10, scope: !790)
!798 = !DILocation(line: 93, column: 3, scope: !790)
!799 = distinct !DISubprogram(name: "putc_unlocked", scope: !682, file: !682, line: 101, type: !791, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !800)
!800 = !{!801, !802}
!801 = !DILocalVariable(name: "__c", arg: 1, scope: !799, file: !682, line: 101, type: !569)
!802 = !DILocalVariable(name: "__stream", arg: 2, scope: !799, file: !682, line: 101, type: !710)
!803 = !DILocation(line: 0, scope: !799)
!804 = !DILocation(line: 103, column: 10, scope: !799)
!805 = !DILocation(line: 103, column: 3, scope: !799)
!806 = distinct !DISubprogram(name: "putchar_unlocked", scope: !682, file: !682, line: 108, type: !782, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !807)
!807 = !{!808}
!808 = !DILocalVariable(name: "__c", arg: 1, scope: !806, file: !682, line: 108, type: !569)
!809 = !DILocation(line: 0, scope: !806)
!810 = !DILocation(line: 110, column: 10, scope: !806)
!811 = !DILocation(line: 110, column: 3, scope: !806)
!812 = distinct !DISubprogram(name: "getline", scope: !682, file: !682, line: 118, type: !813, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !817)
!813 = !DISubroutineType(types: !814)
!814 = !{!815, !570, !816, !710}
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !737, line: 193, baseType: !628)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!817 = !{!818, !819, !820}
!818 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !812, file: !682, line: 118, type: !570)
!819 = !DILocalVariable(name: "__n", arg: 2, scope: !812, file: !682, line: 118, type: !816)
!820 = !DILocalVariable(name: "__stream", arg: 3, scope: !812, file: !682, line: 118, type: !710)
!821 = !DILocation(line: 0, scope: !812)
!822 = !DILocation(line: 120, column: 10, scope: !812)
!823 = !DILocation(line: 120, column: 3, scope: !812)
!824 = distinct !DISubprogram(name: "feof_unlocked", scope: !682, file: !682, line: 128, type: !708, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !825)
!825 = !{!826}
!826 = !DILocalVariable(name: "__stream", arg: 1, scope: !824, file: !682, line: 128, type: !710)
!827 = !DILocation(line: 0, scope: !824)
!828 = !DILocation(line: 130, column: 10, scope: !824)
!829 = !DILocation(line: 130, column: 3, scope: !824)
!830 = distinct !DISubprogram(name: "ferror_unlocked", scope: !682, file: !682, line: 135, type: !708, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !831)
!831 = !{!832}
!832 = !DILocalVariable(name: "__stream", arg: 1, scope: !830, file: !682, line: 135, type: !710)
!833 = !DILocation(line: 0, scope: !830)
!834 = !DILocation(line: 137, column: 10, scope: !830)
!835 = !DILocation(line: 137, column: 3, scope: !830)
!836 = distinct !DISubprogram(name: "tolower", scope: !837, file: !837, line: 207, type: !782, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !838)
!837 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!838 = !{!839}
!839 = !DILocalVariable(name: "__c", arg: 1, scope: !836, file: !837, line: 207, type: !569)
!840 = !DILocation(line: 0, scope: !836)
!841 = !DILocation(line: 209, column: 22, scope: !836)
!842 = !DILocation(line: 209, column: 39, scope: !836)
!843 = !DILocation(line: 209, column: 38, scope: !836)
!844 = !DILocation(line: 209, column: 37, scope: !836)
!845 = !DILocation(line: 209, column: 10, scope: !836)
!846 = !DILocation(line: 209, column: 3, scope: !836)
!847 = distinct !DISubprogram(name: "toupper", scope: !837, file: !837, line: 213, type: !782, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !848)
!848 = !{!849}
!849 = !DILocalVariable(name: "__c", arg: 1, scope: !847, file: !837, line: 213, type: !569)
!850 = !DILocation(line: 0, scope: !847)
!851 = !DILocation(line: 215, column: 22, scope: !847)
!852 = !DILocation(line: 215, column: 39, scope: !847)
!853 = !DILocation(line: 215, column: 38, scope: !847)
!854 = !DILocation(line: 215, column: 37, scope: !847)
!855 = !DILocation(line: 215, column: 10, scope: !847)
!856 = !DILocation(line: 215, column: 3, scope: !847)
!857 = distinct !DISubprogram(name: "atoi", scope: !858, file: !858, line: 361, type: !859, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !861)
!858 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!859 = !DISubroutineType(types: !860)
!860 = !{!569, !574}
!861 = !{!862}
!862 = !DILocalVariable(name: "__nptr", arg: 1, scope: !857, file: !858, line: 361, type: !574)
!863 = !DILocation(line: 0, scope: !857)
!864 = !DILocation(line: 363, column: 16, scope: !857)
!865 = !DILocation(line: 363, column: 10, scope: !857)
!866 = !DILocation(line: 363, column: 3, scope: !857)
!867 = distinct !DISubprogram(name: "atol", scope: !858, file: !858, line: 366, type: !868, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !870)
!868 = !DISubroutineType(types: !869)
!869 = !{!628, !574}
!870 = !{!871}
!871 = !DILocalVariable(name: "__nptr", arg: 1, scope: !867, file: !858, line: 366, type: !574)
!872 = !DILocation(line: 0, scope: !867)
!873 = !DILocation(line: 368, column: 10, scope: !867)
!874 = !DILocation(line: 368, column: 3, scope: !867)
!875 = distinct !DISubprogram(name: "atoll", scope: !858, file: !858, line: 373, type: !876, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !879)
!876 = !DISubroutineType(types: !877)
!877 = !{!878, !574}
!878 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!879 = !{!880}
!880 = !DILocalVariable(name: "__nptr", arg: 1, scope: !875, file: !858, line: 373, type: !574)
!881 = !DILocation(line: 0, scope: !875)
!882 = !DILocation(line: 375, column: 10, scope: !875)
!883 = !DILocation(line: 375, column: 3, scope: !875)
!884 = distinct !DISubprogram(name: "bsearch", scope: !885, file: !885, line: 20, type: !886, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !894)
!885 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!886 = !DISubroutineType(types: !887)
!887 = !{!573, !888, !888, !760, !760, !890}
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !858, line: 808, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{!569, !888, !888}
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!895 = !DILocalVariable(name: "__key", arg: 1, scope: !884, file: !885, line: 20, type: !888)
!896 = !DILocalVariable(name: "__base", arg: 2, scope: !884, file: !885, line: 20, type: !888)
!897 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !884, file: !885, line: 20, type: !760)
!898 = !DILocalVariable(name: "__size", arg: 4, scope: !884, file: !885, line: 20, type: !760)
!899 = !DILocalVariable(name: "__compar", arg: 5, scope: !884, file: !885, line: 21, type: !890)
!900 = !DILocalVariable(name: "__l", scope: !884, file: !885, line: 23, type: !760)
!901 = !DILocalVariable(name: "__u", scope: !884, file: !885, line: 23, type: !760)
!902 = !DILocalVariable(name: "__idx", scope: !884, file: !885, line: 23, type: !760)
!903 = !DILocalVariable(name: "__p", scope: !884, file: !885, line: 24, type: !888)
!904 = !DILocalVariable(name: "__comparison", scope: !884, file: !885, line: 25, type: !569)
!905 = !DILocation(line: 0, scope: !884)
!906 = !DILocation(line: 29, column: 3, scope: !884)
!907 = !DILocation(line: 27, column: 7, scope: !884)
!908 = !DILocation(line: 29, column: 14, scope: !884)
!909 = !DILocation(line: 31, column: 20, scope: !910)
!910 = distinct !DILexicalBlock(scope: !884, file: !885, line: 30, column: 5)
!911 = !DILocation(line: 31, column: 27, scope: !910)
!912 = !DILocation(line: 32, column: 56, scope: !910)
!913 = !DILocation(line: 32, column: 47, scope: !910)
!914 = !DILocation(line: 33, column: 22, scope: !910)
!915 = !DILocation(line: 34, column: 24, scope: !916)
!916 = distinct !DILexicalBlock(scope: !910, file: !885, line: 34, column: 11)
!917 = !DILocation(line: 34, column: 11, scope: !910)
!918 = !DILocation(line: 36, column: 29, scope: !919)
!919 = distinct !DILexicalBlock(scope: !916, file: !885, line: 36, column: 16)
!920 = !DILocation(line: 36, column: 16, scope: !916)
!921 = !DILocation(line: 37, column: 14, scope: !919)
!922 = distinct !{!922, !906, !923}
!923 = !DILocation(line: 40, column: 5, scope: !884)
!924 = !DILocation(line: 43, column: 1, scope: !884)
!925 = distinct !DISubprogram(name: "atof", scope: !926, file: !926, line: 25, type: !927, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !930)
!926 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!927 = !DISubroutineType(types: !928)
!928 = !{!929, !574}
!929 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!930 = !{!931}
!931 = !DILocalVariable(name: "__nptr", arg: 1, scope: !925, file: !926, line: 25, type: !574)
!932 = !DILocation(line: 0, scope: !925)
!933 = !DILocation(line: 27, column: 10, scope: !925)
!934 = !DILocation(line: 27, column: 3, scope: !925)
!935 = distinct !DISubprogram(name: "strtoimax", scope: !936, file: !936, line: 324, type: !937, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !943)
!936 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!937 = !DISubroutineType(types: !938)
!938 = !{!939, !685, !942, !569}
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !940, line: 101, baseType: !941)
!940 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !737, line: 72, baseType: !628)
!942 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !570)
!943 = !{!944, !945, !946}
!944 = !DILocalVariable(name: "nptr", arg: 1, scope: !935, file: !936, line: 324, type: !685)
!945 = !DILocalVariable(name: "endptr", arg: 2, scope: !935, file: !936, line: 324, type: !942)
!946 = !DILocalVariable(name: "base", arg: 3, scope: !935, file: !936, line: 324, type: !569)
!947 = !DILocation(line: 0, scope: !935)
!948 = !DILocation(line: 327, column: 10, scope: !935)
!949 = !DILocation(line: 327, column: 3, scope: !935)
!950 = distinct !DISubprogram(name: "strtoumax", scope: !936, file: !936, line: 336, type: !951, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !955)
!951 = !DISubroutineType(types: !952)
!952 = !{!953, !685, !942, !569}
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !940, line: 102, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !737, line: 73, baseType: !578)
!955 = !{!956, !957, !958}
!956 = !DILocalVariable(name: "nptr", arg: 1, scope: !950, file: !936, line: 336, type: !685)
!957 = !DILocalVariable(name: "endptr", arg: 2, scope: !950, file: !936, line: 336, type: !942)
!958 = !DILocalVariable(name: "base", arg: 3, scope: !950, file: !936, line: 336, type: !569)
!959 = !DILocation(line: 0, scope: !950)
!960 = !DILocation(line: 339, column: 10, scope: !950)
!961 = !DILocation(line: 339, column: 3, scope: !950)
!962 = distinct !DISubprogram(name: "wcstoimax", scope: !936, file: !936, line: 348, type: !963, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !972)
!963 = !DISubroutineType(types: !964)
!964 = !{!939, !965, !969, !569}
!965 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !936, line: 34, baseType: !569)
!969 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!972 = !{!973, !974, !975}
!973 = !DILocalVariable(name: "nptr", arg: 1, scope: !962, file: !936, line: 348, type: !965)
!974 = !DILocalVariable(name: "endptr", arg: 2, scope: !962, file: !936, line: 348, type: !969)
!975 = !DILocalVariable(name: "base", arg: 3, scope: !962, file: !936, line: 348, type: !569)
!976 = !DILocation(line: 0, scope: !962)
!977 = !DILocation(line: 351, column: 10, scope: !962)
!978 = !DILocation(line: 351, column: 3, scope: !962)
!979 = distinct !DISubprogram(name: "wcstoumax", scope: !936, file: !936, line: 362, type: !980, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !982)
!980 = !DISubroutineType(types: !981)
!981 = !{!953, !965, !969, !569}
!982 = !{!983, !984, !985}
!983 = !DILocalVariable(name: "nptr", arg: 1, scope: !979, file: !936, line: 362, type: !965)
!984 = !DILocalVariable(name: "endptr", arg: 2, scope: !979, file: !936, line: 362, type: !969)
!985 = !DILocalVariable(name: "base", arg: 3, scope: !979, file: !936, line: 362, type: !569)
!986 = !DILocation(line: 0, scope: !979)
!987 = !DILocation(line: 365, column: 10, scope: !979)
!988 = !DILocation(line: 365, column: 3, scope: !979)
!989 = distinct !DISubprogram(name: "stat", scope: !990, file: !990, line: 453, type: !991, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1030)
!990 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!991 = !DISubroutineType(types: !992)
!992 = !{!569, !574, !993}
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !995, line: 46, size: 1152, elements: !996)
!995 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!996 = !{!997, !999, !1001, !1003, !1005, !1007, !1009, !1010, !1011, !1012, !1014, !1016, !1024, !1025, !1026}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !994, file: !995, line: 48, baseType: !998, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !737, line: 145, baseType: !578)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !994, file: !995, line: 53, baseType: !1000, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !737, line: 148, baseType: !578)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !994, file: !995, line: 61, baseType: !1002, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !737, line: 151, baseType: !578)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !994, file: !995, line: 62, baseType: !1004, size: 32, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !737, line: 150, baseType: !7)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !994, file: !995, line: 64, baseType: !1006, size: 32, offset: 224)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !737, line: 146, baseType: !7)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !994, file: !995, line: 65, baseType: !1008, size: 32, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !737, line: 147, baseType: !7)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !994, file: !995, line: 67, baseType: !569, size: 32, offset: 288)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !994, file: !995, line: 69, baseType: !998, size: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !994, file: !995, line: 74, baseType: !736, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !994, file: !995, line: 78, baseType: !1013, size: 64, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !737, line: 174, baseType: !628)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !994, file: !995, line: 80, baseType: !1015, size: 64, offset: 512)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !737, line: 179, baseType: !628)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !994, file: !995, line: 91, baseType: !1017, size: 128, offset: 576)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1018, line: 10, size: 128, elements: !1019)
!1018 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!1019 = !{!1020, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1017, file: !1018, line: 12, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !737, line: 160, baseType: !628)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1017, file: !1018, line: 16, baseType: !1023, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !737, line: 196, baseType: !628)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !994, file: !995, line: 92, baseType: !1017, size: 128, offset: 704)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !994, file: !995, line: 93, baseType: !1017, size: 128, offset: 832)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !994, file: !995, line: 106, baseType: !1027, size: 192, offset: 960)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1023, size: 192, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 3)
!1030 = !{!1031, !1032}
!1031 = !DILocalVariable(name: "__path", arg: 1, scope: !989, file: !990, line: 453, type: !574)
!1032 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !989, file: !990, line: 453, type: !993)
!1033 = !DILocation(line: 0, scope: !989)
!1034 = !DILocation(line: 455, column: 10, scope: !989)
!1035 = !DILocation(line: 455, column: 3, scope: !989)
!1036 = distinct !DISubprogram(name: "lstat", scope: !990, file: !990, line: 460, type: !991, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1037)
!1037 = !{!1038, !1039}
!1038 = !DILocalVariable(name: "__path", arg: 1, scope: !1036, file: !990, line: 460, type: !574)
!1039 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1036, file: !990, line: 460, type: !993)
!1040 = !DILocation(line: 0, scope: !1036)
!1041 = !DILocation(line: 462, column: 10, scope: !1036)
!1042 = !DILocation(line: 462, column: 3, scope: !1036)
!1043 = distinct !DISubprogram(name: "fstat", scope: !990, file: !990, line: 467, type: !1044, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1046)
!1044 = !DISubroutineType(types: !1045)
!1045 = !{!569, !569, !993}
!1046 = !{!1047, !1048}
!1047 = !DILocalVariable(name: "__fd", arg: 1, scope: !1043, file: !990, line: 467, type: !569)
!1048 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1043, file: !990, line: 467, type: !993)
!1049 = !DILocation(line: 0, scope: !1043)
!1050 = !DILocation(line: 469, column: 10, scope: !1043)
!1051 = !DILocation(line: 469, column: 3, scope: !1043)
!1052 = distinct !DISubprogram(name: "fstatat", scope: !990, file: !990, line: 474, type: !1053, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1055)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!569, !569, !574, !993, !569}
!1055 = !{!1056, !1057, !1058, !1059}
!1056 = !DILocalVariable(name: "__fd", arg: 1, scope: !1052, file: !990, line: 474, type: !569)
!1057 = !DILocalVariable(name: "__filename", arg: 2, scope: !1052, file: !990, line: 474, type: !574)
!1058 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !1052, file: !990, line: 474, type: !993)
!1059 = !DILocalVariable(name: "__flag", arg: 4, scope: !1052, file: !990, line: 474, type: !569)
!1060 = !DILocation(line: 0, scope: !1052)
!1061 = !DILocation(line: 477, column: 10, scope: !1052)
!1062 = !DILocation(line: 477, column: 3, scope: !1052)
!1063 = distinct !DISubprogram(name: "mknod", scope: !990, file: !990, line: 483, type: !1064, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1066)
!1064 = !DISubroutineType(types: !1065)
!1065 = !{!569, !574, !1004, !998}
!1066 = !{!1067, !1068, !1069}
!1067 = !DILocalVariable(name: "__path", arg: 1, scope: !1063, file: !990, line: 483, type: !574)
!1068 = !DILocalVariable(name: "__mode", arg: 2, scope: !1063, file: !990, line: 483, type: !1004)
!1069 = !DILocalVariable(name: "__dev", arg: 3, scope: !1063, file: !990, line: 483, type: !998)
!1070 = !DILocation(line: 0, scope: !1063)
!1071 = !DILocation(line: 485, column: 10, scope: !1063)
!1072 = !DILocation(line: 485, column: 3, scope: !1063)
!1073 = distinct !DISubprogram(name: "mknodat", scope: !990, file: !990, line: 491, type: !1074, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1076)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{!569, !569, !574, !1004, !998}
!1076 = !{!1077, !1078, !1079, !1080}
!1077 = !DILocalVariable(name: "__fd", arg: 1, scope: !1073, file: !990, line: 491, type: !569)
!1078 = !DILocalVariable(name: "__path", arg: 2, scope: !1073, file: !990, line: 491, type: !574)
!1079 = !DILocalVariable(name: "__mode", arg: 3, scope: !1073, file: !990, line: 491, type: !1004)
!1080 = !DILocalVariable(name: "__dev", arg: 4, scope: !1073, file: !990, line: 491, type: !998)
!1081 = !DILocation(line: 0, scope: !1073)
!1082 = !DILocation(line: 494, column: 10, scope: !1073)
!1083 = !DILocation(line: 494, column: 3, scope: !1073)
!1084 = distinct !DISubprogram(name: "stat64", scope: !990, file: !990, line: 502, type: !1085, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1107)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!569, !574, !1087}
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !995, line: 119, size: 1152, elements: !1089)
!1089 = !{!1090, !1091, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1103, !1104, !1105, !1106}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1088, file: !995, line: 121, baseType: !998, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1088, file: !995, line: 123, baseType: !1092, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !737, line: 149, baseType: !578)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1088, file: !995, line: 124, baseType: !1002, size: 64, offset: 128)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1088, file: !995, line: 125, baseType: !1004, size: 32, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1088, file: !995, line: 132, baseType: !1006, size: 32, offset: 224)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1088, file: !995, line: 133, baseType: !1008, size: 32, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1088, file: !995, line: 135, baseType: !569, size: 32, offset: 288)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1088, file: !995, line: 136, baseType: !998, size: 64, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1088, file: !995, line: 137, baseType: !736, size: 64, offset: 384)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1088, file: !995, line: 143, baseType: !1013, size: 64, offset: 448)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1088, file: !995, line: 144, baseType: !1102, size: 64, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !737, line: 180, baseType: !628)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1088, file: !995, line: 152, baseType: !1017, size: 128, offset: 576)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1088, file: !995, line: 153, baseType: !1017, size: 128, offset: 704)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1088, file: !995, line: 154, baseType: !1017, size: 128, offset: 832)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1088, file: !995, line: 164, baseType: !1027, size: 192, offset: 960)
!1107 = !{!1108, !1109}
!1108 = !DILocalVariable(name: "__path", arg: 1, scope: !1084, file: !990, line: 502, type: !574)
!1109 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1084, file: !990, line: 502, type: !1087)
!1110 = !DILocation(line: 0, scope: !1084)
!1111 = !DILocation(line: 504, column: 10, scope: !1084)
!1112 = !DILocation(line: 504, column: 3, scope: !1084)
!1113 = distinct !DISubprogram(name: "lstat64", scope: !990, file: !990, line: 509, type: !1085, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1114)
!1114 = !{!1115, !1116}
!1115 = !DILocalVariable(name: "__path", arg: 1, scope: !1113, file: !990, line: 509, type: !574)
!1116 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1113, file: !990, line: 509, type: !1087)
!1117 = !DILocation(line: 0, scope: !1113)
!1118 = !DILocation(line: 511, column: 10, scope: !1113)
!1119 = !DILocation(line: 511, column: 3, scope: !1113)
!1120 = distinct !DISubprogram(name: "fstat64", scope: !990, file: !990, line: 516, type: !1121, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1123)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!569, !569, !1087}
!1123 = !{!1124, !1125}
!1124 = !DILocalVariable(name: "__fd", arg: 1, scope: !1120, file: !990, line: 516, type: !569)
!1125 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1120, file: !990, line: 516, type: !1087)
!1126 = !DILocation(line: 0, scope: !1120)
!1127 = !DILocation(line: 518, column: 10, scope: !1120)
!1128 = !DILocation(line: 518, column: 3, scope: !1120)
!1129 = distinct !DISubprogram(name: "fstatat64", scope: !990, file: !990, line: 523, type: !1130, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1132)
!1130 = !DISubroutineType(types: !1131)
!1131 = !{!569, !569, !574, !1087, !569}
!1132 = !{!1133, !1134, !1135, !1136}
!1133 = !DILocalVariable(name: "__fd", arg: 1, scope: !1129, file: !990, line: 523, type: !569)
!1134 = !DILocalVariable(name: "__filename", arg: 2, scope: !1129, file: !990, line: 523, type: !574)
!1135 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !1129, file: !990, line: 523, type: !1087)
!1136 = !DILocalVariable(name: "__flag", arg: 4, scope: !1129, file: !990, line: 523, type: !569)
!1137 = !DILocation(line: 0, scope: !1129)
!1138 = !DILocation(line: 526, column: 10, scope: !1129)
!1139 = !DILocation(line: 526, column: 3, scope: !1129)
!1140 = distinct !DISubprogram(name: "mark_referenced_resources", scope: !3, file: !3, line: 205, type: !1141, scopeLine: 207, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !2237)
!1141 = !DISubroutineType(types: !1142)
!1142 = !{null, !1143, !2236, !568}
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !595, line: 50, baseType: !1144)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1145, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1145, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1145, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1145, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1145, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1145, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1145, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1145, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1145, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1145, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1145, file: !385, line: 321, baseType: !1158, size: 320, offset: 64)
!1158 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !1159)
!1159 = !{!1160, !2171, !2173, !2234, !2235}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1158, file: !385, line: 316, baseType: !1161, size: 64)
!1161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1162, size: 64, elements: !744)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !1163)
!1163 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !1164)
!1164 = !{!1165, !1166, !1167, !1168, !1169, !1177, !1178, !1190, !1193, !1194, !2149, !2150, !2161, !2168}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1163, file: !385, line: 168, baseType: !569, size: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1163, file: !385, line: 169, baseType: !7, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1163, file: !385, line: 170, baseType: !574, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1163, file: !385, line: 171, baseType: !1143, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1163, file: !385, line: 172, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !595, line: 53, baseType: !1171)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !1173)
!1173 = !{!1174, !1175}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1172, file: !385, line: 360, baseType: !569, size: 32)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1172, file: !385, line: 361, baseType: !1176, size: 64, offset: 64)
!1176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1143, size: 64, elements: !744)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1163, file: !385, line: 173, baseType: !5, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1163, file: !385, line: 174, baseType: !1179, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !1181)
!1181 = !{!1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1180, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1180, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1180, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1180, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1180, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1180, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1180, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1180, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1163, file: !385, line: 175, baseType: !1191, size: 64)
!1191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1192, size: 64)
!1192 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1163, file: !385, line: 176, baseType: !596, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1163, file: !385, line: 177, baseType: !1195, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !595, line: 56, baseType: !1196)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !1198)
!1198 = !{!1199, !1232, !1238, !1249, !1266, !1277, !1282, !1288, !1294, !1307, !1319, !1357, !1362, !1390, !1398, !1399, !1404, !1413, !1419, !1424, !1428, !1432, !1786, !1835, !1841, !1847, !1854, !1880, !1894, !1911, !1923, !1945, !1960, !2131}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1197, file: !158, line: 3372, baseType: !1200, size: 64)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !1201)
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1200, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1200, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1200, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1200, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1200, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1200, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1200, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1200, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1200, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1200, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1200, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1200, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1200, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1200, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1200, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1200, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1200, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1200, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1200, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1200, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1200, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1200, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1200, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1200, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1200, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1200, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1200, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1200, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1200, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1200, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1197, file: !158, line: 3373, baseType: !1233, size: 192)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !1234)
!1234 = !{!1235, !1236, !1237}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1233, file: !158, line: 403, baseType: !1200, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1233, file: !158, line: 404, baseType: !1195, size: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1233, file: !158, line: 405, baseType: !1195, size: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1197, file: !158, line: 3374, baseType: !1239, size: 320)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !1240)
!1240 = !{!1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1239, file: !158, line: 1385, baseType: !1233, size: 192)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1239, file: !158, line: 1386, baseType: !1243, size: 128, offset: 192)
!1243 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1244, line: 58, baseType: !1245)
!1244 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1244, line: 54, size: 128, elements: !1246)
!1246 = !{!1247, !1248}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1245, file: !1244, line: 56, baseType: !578, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1245, file: !1244, line: 57, baseType: !628, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1197, file: !158, line: 3375, baseType: !1250, size: 256)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !1251)
!1251 = !{!1252, !1253}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1250, file: !158, line: 1398, baseType: !1233, size: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1250, file: !158, line: 1399, baseType: !1254, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1256, line: 52, size: 256, elements: !1257)
!1256 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1264}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1255, file: !1256, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1255, file: !1256, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1255, file: !1256, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1255, file: !1256, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1255, file: !1256, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1255, file: !1256, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1255, file: !1256, line: 62, baseType: !1265, size: 192, offset: 64)
!1265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !578, size: 192, elements: !1028)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1197, file: !158, line: 3376, baseType: !1267, size: 256)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !1268)
!1268 = !{!1269, !1270}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1267, file: !158, line: 1409, baseType: !1233, size: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1267, file: !158, line: 1410, baseType: !1271, size: 64, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1273, line: 27, size: 192, elements: !1274)
!1273 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1274 = !{!1275, !1276}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1272, file: !1273, line: 29, baseType: !1243, size: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1272, file: !1273, line: 30, baseType: !5, size: 32, offset: 128)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1197, file: !158, line: 3377, baseType: !1278, size: 256)
!1278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !1279)
!1279 = !{!1280, !1281}
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1278, file: !158, line: 1438, baseType: !1233, size: 192)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1278, file: !158, line: 1439, baseType: !1195, size: 64, offset: 192)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1197, file: !158, line: 3378, baseType: !1283, size: 256)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !1284)
!1284 = !{!1285, !1286, !1287}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1283, file: !158, line: 1419, baseType: !1233, size: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1283, file: !158, line: 1420, baseType: !569, size: 32, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1283, file: !158, line: 1421, baseType: !743, size: 8, offset: 224)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1197, file: !158, line: 3379, baseType: !1289, size: 320)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !1290)
!1290 = !{!1291, !1292, !1293}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1289, file: !158, line: 1429, baseType: !1233, size: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1289, file: !158, line: 1430, baseType: !1195, size: 64, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1289, file: !158, line: 1431, baseType: !1195, size: 64, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1197, file: !158, line: 3380, baseType: !1295, size: 320)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !1296)
!1296 = !{!1297, !1298}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1295, file: !158, line: 1461, baseType: !1233, size: 192)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1295, file: !158, line: 1462, baseType: !1299, size: 128, offset: 192)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1300, line: 31, size: 128, elements: !1301)
!1300 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1301 = !{!1302, !1305, !1306}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1299, file: !1300, line: 32, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1304, size: 64)
!1304 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1299, file: !1300, line: 33, baseType: !7, size: 32, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1299, file: !1300, line: 34, baseType: !7, size: 32, offset: 96)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1197, file: !158, line: 3381, baseType: !1308, size: 384)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !1309)
!1309 = !{!1310, !1311, !1316, !1317, !1318}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1308, file: !158, line: 2508, baseType: !1233, size: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1308, file: !158, line: 2509, baseType: !1312, size: 32, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1313, line: 58, baseType: !1314)
!1313 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1314 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1315, line: 44, baseType: !7)
!1315 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1308, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1308, file: !158, line: 2511, baseType: !1195, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1308, file: !158, line: 2512, baseType: !1195, size: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1197, file: !158, line: 3382, baseType: !1320, size: 896)
!1320 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !1321)
!1321 = !{!1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354}
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1320, file: !158, line: 2653, baseType: !1308, size: 384)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1320, file: !158, line: 2654, baseType: !1195, size: 64, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1320, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1320, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1320, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1320, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1320, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1320, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1320, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1320, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1320, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1320, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1320, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1320, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1320, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1320, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1320, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1320, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1320, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1320, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1320, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1320, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1320, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1320, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1320, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1320, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1320, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1320, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1320, file: !158, line: 2705, baseType: !1195, size: 64, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1320, file: !158, line: 2706, baseType: !1195, size: 64, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1320, file: !158, line: 2707, baseType: !1195, size: 64, offset: 704)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1320, file: !158, line: 2708, baseType: !1195, size: 64, offset: 768)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1320, file: !158, line: 2711, baseType: !1355, size: 64, offset: 832)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1197, file: !158, line: 3383, baseType: !1358, size: 960)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !1359)
!1359 = !{!1360, !1361}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1358, file: !158, line: 2757, baseType: !1320, size: 896)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1358, file: !158, line: 2758, baseType: !1143, size: 64, offset: 896)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1197, file: !158, line: 3384, baseType: !1363, size: 1472)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1364)
!1364 = !{!1365, !1386, !1387, !1388, !1389}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1363, file: !158, line: 3115, baseType: !1366, size: 1216)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1366, file: !158, line: 2985, baseType: !1358, size: 960)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1366, file: !158, line: 2986, baseType: !1195, size: 64, offset: 960)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1366, file: !158, line: 2987, baseType: !1195, size: 64, offset: 1024)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1366, file: !158, line: 2988, baseType: !1195, size: 64, offset: 1088)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1366, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1366, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1366, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1366, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1366, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1366, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1366, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1366, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1366, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1366, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1366, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1366, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1366, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1366, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1363, file: !158, line: 3117, baseType: !1195, size: 64, offset: 1216)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1363, file: !158, line: 3119, baseType: !1195, size: 64, offset: 1280)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1363, file: !158, line: 3121, baseType: !1195, size: 64, offset: 1344)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1363, file: !158, line: 3123, baseType: !1195, size: 64, offset: 1408)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1197, file: !158, line: 3385, baseType: !1391, size: 1088)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1392)
!1392 = !{!1393, !1394, !1395}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1391, file: !158, line: 2875, baseType: !1358, size: 960)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1391, file: !158, line: 2876, baseType: !1143, size: 64, offset: 960)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1391, file: !158, line: 2877, baseType: !1396, size: 64, offset: 1024)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1197, file: !158, line: 3386, baseType: !1366, size: 1216)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1197, file: !158, line: 3387, baseType: !1400, size: 1280)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1401)
!1401 = !{!1402, !1403}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1400, file: !158, line: 3094, baseType: !1366, size: 1216)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1400, file: !158, line: 3095, baseType: !1396, size: 64, offset: 1216)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1197, file: !158, line: 3388, baseType: !1405, size: 1216)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410, !1411, !1412}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1405, file: !158, line: 2825, baseType: !1320, size: 896)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1405, file: !158, line: 2827, baseType: !1195, size: 64, offset: 896)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1405, file: !158, line: 2828, baseType: !1195, size: 64, offset: 960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1405, file: !158, line: 2829, baseType: !1195, size: 64, offset: 1024)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1405, file: !158, line: 2830, baseType: !1195, size: 64, offset: 1088)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1405, file: !158, line: 2831, baseType: !1195, size: 64, offset: 1152)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1197, file: !158, line: 3389, baseType: !1414, size: 1024)
!1414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1415)
!1415 = !{!1416, !1417, !1418}
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1414, file: !158, line: 2851, baseType: !1358, size: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1414, file: !158, line: 2852, baseType: !569, size: 32, offset: 960)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1414, file: !158, line: 2853, baseType: !569, size: 32, offset: 992)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1197, file: !158, line: 3390, baseType: !1420, size: 1024)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1421)
!1421 = !{!1422, !1423}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1420, file: !158, line: 2858, baseType: !1358, size: 960)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1420, file: !158, line: 2859, baseType: !1396, size: 64, offset: 960)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1197, file: !158, line: 3391, baseType: !1425, size: 960)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1426)
!1426 = !{!1427}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1425, file: !158, line: 2863, baseType: !1358, size: 960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1197, file: !158, line: 3392, baseType: !1429, size: 1472)
!1429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1430)
!1430 = !{!1431}
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1429, file: !158, line: 3305, baseType: !1363, size: 1472)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1197, file: !158, line: 3393, baseType: !1433, size: 1792)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1434)
!1434 = !{!1435, !1436, !1765, !1766, !1767, !1768, !1769, !1770, !1771, !1772, !1773, !1774, !1775, !1776, !1777, !1778, !1779, !1780, !1781, !1782, !1783, !1784, !1785}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1433, file: !158, line: 3249, baseType: !1363, size: 1472)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1433, file: !158, line: 3251, baseType: !1437, size: 64, offset: 1472)
!1437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1438, size: 64)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1439, line: 463, size: 1152, elements: !1440)
!1439 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1440 = !{!1441, !1598, !1702, !1703, !1706, !1709, !1710, !1711, !1712, !1713, !1714, !1738, !1741, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762, !1763, !1764}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1438, file: !1439, line: 464, baseType: !1442, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1443, size: 64)
!1443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1444)
!1444 = !{!1445, !1494, !1507, !1521, !1566, !1579}
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1443, file: !135, line: 197, baseType: !1446, size: 64)
!1446 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1447)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1449)
!1449 = !{!1450, !1451, !1452, !1453, !1454, !1455, !1482, !1491, !1492, !1493}
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1448, file: !135, line: 119, baseType: !1447, size: 64)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1448, file: !135, line: 122, baseType: !1447, size: 64, offset: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1448, file: !135, line: 123, baseType: !1447, size: 64, offset: 128)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1448, file: !135, line: 126, baseType: !569, size: 32, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1448, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1448, file: !135, line: 165, baseType: !1456, size: 192, offset: 256)
!1456 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1457)
!1457 = !{!1458, !1471, !1477}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1456, file: !135, line: 137, baseType: !1459, size: 128)
!1459 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1460)
!1460 = !{!1461, !1470}
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1459, file: !135, line: 135, baseType: !1462, size: 64)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1464)
!1464 = !{!1465, !1466, !1467, !1468, !1469}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1463, file: !135, line: 96, baseType: !1462, size: 64)
