; ModuleID = 'rtl.bc'
source_filename = "rtl.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.rtvec_def = type { i32, [1 x %struct.rtx_def*] }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.mem_attrs = type { %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, i32, i32, i8 }

!223 = !DIEnumerator(name: "SMAX", value: 71, isUnsigned: true)
!224 = !DIEnumerator(name: "UMIN", value: 72, isUnsigned: true)
!225 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!226 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!227 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!228 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!229 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!230 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!231 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!232 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!233 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!234 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!235 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!236 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!237 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!238 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!239 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!240 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!241 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!242 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!243 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!244 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!245 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!246 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!247 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!248 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!249 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!250 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!251 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!252 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!253 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!254 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!255 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!256 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!257 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!258 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!259 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!260 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!261 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!262 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!263 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!264 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!265 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!266 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!267 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!268 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!269 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!270 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!271 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!272 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!273 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!274 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!275 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!276 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!277 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!278 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!279 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!280 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!281 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!282 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!283 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!284 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!285 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!286 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!287 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!288 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!289 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!290 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!291 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!292 = !{!293, !294, !295, !296, !299, !300, !302, !150, !310, !22}
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!295 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !298)
!302 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !303, line: 53, baseType: !304)
!303 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !6, line: 359, size: 128, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !305, file: !6, line: 360, baseType: !295, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !305, file: !6, line: 361, baseType: !309, size: 64, offset: 64)
!309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !310, size: 64, elements: !387)
!310 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !303, line: 50, baseType: !311)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !6, line: 240, size: 384, elements: !313)
!313 = !{!314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !312, file: !6, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !312, file: !6, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !312, file: !6, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !312, file: !6, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !312, file: !6, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !312, file: !6, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !312, file: !6, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !312, file: !6, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !312, file: !6, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !312, file: !6, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !312, file: !6, line: 321, baseType: !325, size: 320, offset: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !6, line: 315, size: 320, elements: !326)
!326 = !{!327, !389, !391, !422, !435}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !325, file: !6, line: 316, baseType: !328, size: 64)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 64, elements: !387)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !6, line: 183, baseType: !330)
!330 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !6, line: 166, size: 64, elements: !331)
!331 = !{!332, !333, !334, !335, !336, !337, !338, !350, !353, !356, !360, !363, !376, !384}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !330, file: !6, line: 168, baseType: !295, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !330, file: !6, line: 169, baseType: !7, size: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !330, file: !6, line: 170, baseType: !300, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !330, file: !6, line: 171, baseType: !310, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !330, file: !6, line: 172, baseType: !302, size: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !330, file: !6, line: 173, baseType: !22, size: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !330, file: !6, line: 174, baseType: !339, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !6, line: 133, baseType: !340)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !6, line: 115, size: 32, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347, !348, !349}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !340, file: !6, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !340, file: !6, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !340, file: !6, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !340, file: !6, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !340, file: !6, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !340, file: !6, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !340, file: !6, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !340, file: !6, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !330, file: !6, line: 175, baseType: !351, size: 64)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !6, line: 175, flags: DIFlagFwdDecl)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !330, file: !6, line: 176, baseType: !354, size: 64)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !303, line: 46, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !330, file: !6, line: 177, baseType: !357, size: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !303, line: 56, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !303, line: 55, flags: DIFlagFwdDecl)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !330, file: !6, line: 178, baseType: !361, size: 64)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !303, line: 110, flags: DIFlagFwdDecl)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !330, file: !6, line: 179, baseType: !364, size: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !6, line: 150, baseType: !366)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !6, line: 142, size: 320, elements: !367)
!367 = !{!368, !369, !370, !371, !374, !375}
!368 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !366, file: !6, line: 144, baseType: !357, size: 64)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !366, file: !6, line: 145, baseType: !310, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !366, file: !6, line: 146, baseType: !310, size: 64, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !366, file: !6, line: 147, baseType: !372, size: 32, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !373, line: 31, baseType: !295)
!373 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!374 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !366, file: !6, line: 148, baseType: !7, size: 32, offset: 224)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !366, file: !6, line: 149, baseType: !294, size: 8, offset: 256)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !330, file: !6, line: 180, baseType: !377, size: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !6, line: 162, baseType: !379)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !6, line: 159, size: 128, elements: !380)
!380 = !{!381, !382}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !379, file: !6, line: 160, baseType: !357, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !379, file: !6, line: 161, baseType: !383, size: 64, offset: 64)
!383 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !330, file: !6, line: 181, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !6, line: 181, flags: DIFlagFwdDecl)
!387 = !{!388}
!388 = !DISubrange(count: 1)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !325, file: !6, line: 317, baseType: !390, size: 64)
!390 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 64, elements: !387)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !325, file: !6, line: 318, baseType: !392, size: 320)
!392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !6, line: 188, size: 320, elements: !393)
!393 = !{!394, !398, !421}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !392, file: !6, line: 190, baseType: !395, size: 192)
!395 = !DICompositeType(tag: DW_TAG_array_type, baseType: !329, size: 192, elements: !396)
!396 = !{!397}
!397 = !DISubrange(count: 3)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !392, file: !6, line: 193, baseType: !399, size: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !6, line: 206, size: 320, elements: !401)
!401 = !{!402, !406, !407, !408, !420}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !400, file: !6, line: 208, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !303, line: 62, baseType: !405)
!405 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !303, line: 61, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !400, file: !6, line: 211, baseType: !7, size: 32, offset: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !400, file: !6, line: 214, baseType: !383, size: 64, offset: 128)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !400, file: !6, line: 224, baseType: !409, size: 64, offset: 192)
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !6, line: 202, baseType: !411)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !6, line: 202, size: 128, elements: !412)
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !411, file: !6, line: 202, baseType: !414, size: 128)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !6, line: 200, baseType: !415)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !6, line: 200, size: 128, elements: !416)
!416 = !{!417, !418, !419}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !415, file: !6, line: 200, baseType: !7, size: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !415, file: !6, line: 200, baseType: !7, size: 32, offset: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !415, file: !6, line: 200, baseType: !309, size: 64, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !400, file: !6, line: 234, baseType: !409, size: 64, offset: 256)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !392, file: !6, line: 197, baseType: !383, size: 64, offset: 256)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !325, file: !6, line: 319, baseType: !423, size: 256)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !424, line: 52, size: 256, elements: !425)
!424 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!425 = !{!426, !427, !428, !429, !430, !431, !432}
!426 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !423, file: !424, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !423, file: !424, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !423, file: !424, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !423, file: !424, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !423, file: !424, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !423, file: !424, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !423, file: !424, line: 62, baseType: !433, size: 192, offset: 64)
!433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !434, size: 192, elements: !396)
!434 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !325, file: !6, line: 320, baseType: !436, size: 192)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !437, line: 27, size: 192, elements: !438)
!437 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!438 = !{!439, !446}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !436, file: !437, line: 29, baseType: !440, size: 128)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !441, line: 58, baseType: !442)
!441 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !441, line: 54, size: 128, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !442, file: !441, line: 56, baseType: !434, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !442, file: !441, line: 57, baseType: !383, size: 64, offset: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !436, file: !437, line: 30, baseType: !22, size: 32, offset: 128)
!447 = !{!0, !448, !454, !456, !460, !464, !469, !474, !476}
!448 = !DIGlobalVariableExpression(var: !449, expr: !DIExpression())
!449 = distinct !DIGlobalVariable(name: "rtx_name", scope: !2, file: !3, line: 57, type: !450, isLocal: false, isDefinition: true)
!450 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 8896, elements: !452)
!451 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !300)
!452 = !{!453}
!453 = !DISubrange(count: 139)
!454 = !DIGlobalVariableExpression(var: !455, expr: !DIExpression())
!455 = distinct !DIGlobalVariable(name: "rtx_format", scope: !2, file: !3, line: 67, type: !450, isLocal: false, isDefinition: true)
!456 = !DIGlobalVariableExpression(var: !457, expr: !DIExpression())
!457 = distinct !DIGlobalVariable(name: "rtx_class", scope: !2, file: !3, line: 103, type: !458, isLocal: false, isDefinition: true)
!458 = !DICompositeType(tag: DW_TAG_array_type, baseType: !459, size: 4448, elements: !452)
!459 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!460 = !DIGlobalVariableExpression(var: !461, expr: !DIExpression())
!461 = distinct !DIGlobalVariable(name: "rtx_code_size", scope: !2, file: !3, line: 111, type: !462, isLocal: false, isDefinition: true)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 1112, elements: !452)
!463 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !294)
!464 = !DIGlobalVariableExpression(var: !465, expr: !DIExpression())
!465 = distinct !DIGlobalVariable(name: "note_insn_name", scope: !2, file: !3, line: 123, type: !466, isLocal: false, isDefinition: true)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 832, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 13)
!469 = !DIGlobalVariableExpression(var: !470, expr: !DIExpression())
!470 = distinct !DIGlobalVariable(name: "reg_note_name", scope: !2, file: !3, line: 130, type: !471, isLocal: false, isDefinition: true)
!471 = !DICompositeType(tag: DW_TAG_array_type, baseType: !451, size: 1984, elements: !472)
!472 = !{!473}
!473 = !DISubrange(count: 31)
!474 = !DIGlobalVariableExpression(var: !475, expr: !DIExpression())
!475 = distinct !DIGlobalVariable(name: "generating_concat_p", scope: !2, file: !3, line: 346, type: !295, isLocal: false, isDefinition: true)
!476 = !DIGlobalVariableExpression(var: !477, expr: !DIExpression())
!477 = distinct !DIGlobalVariable(name: "currently_expanding_to_rtl", scope: !2, file: !3, line: 349, type: !295, isLocal: false, isDefinition: true)
!478 = !{i32 2, !"Dwarf Version", i32 4}
!479 = !{i32 2, !"Debug Info Version", i32 3}
!480 = !{i32 1, !"wchar_size", i32 4}
!481 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!482 = distinct !DISubprogram(name: "vprintf", scope: !483, file: !483, line: 39, type: !484, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !494)
!483 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!484 = !DISubroutineType(types: !485)
!485 = !{!295, !486, !487}
!486 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !300)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !489)
!489 = !{!490, !491, !492, !493}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !488, file: !3, baseType: !7, size: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !488, file: !3, baseType: !7, size: 32, offset: 32)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !488, file: !3, baseType: !299, size: 64, offset: 64)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !488, file: !3, baseType: !299, size: 64, offset: 128)
!494 = !{!495, !496}
!495 = !DILocalVariable(name: "__fmt", arg: 1, scope: !482, file: !483, line: 39, type: !486)
!496 = !DILocalVariable(name: "__arg", arg: 2, scope: !482, file: !483, line: 39, type: !487)
!497 = !DILocation(line: 0, scope: !482)
!498 = !DILocation(line: 41, column: 20, scope: !482)
!499 = !DILocation(line: 41, column: 10, scope: !482)
!500 = !DILocation(line: 41, column: 3, scope: !482)
!501 = distinct !DISubprogram(name: "getchar", scope: !483, file: !483, line: 47, type: !502, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !504)
!502 = !DISubroutineType(types: !503)
!503 = !{!295}
!504 = !{}
!505 = !DILocation(line: 49, column: 16, scope: !501)
!506 = !DILocation(line: 49, column: 10, scope: !501)
!507 = !DILocation(line: 49, column: 3, scope: !501)
!508 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !483, file: !483, line: 56, type: !509, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !566)
!509 = !DISubroutineType(types: !510)
!510 = !{!295, !511}
!511 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !512, size: 64)
!512 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !513, line: 7, baseType: !514)
!513 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !515, line: 49, size: 1728, elements: !516)
!515 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!516 = !{!517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !532, !534, !535, !536, !539, !541, !543, !545, !548, !550, !553, !556, !557, !558, !561, !562}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !514, file: !515, line: 51, baseType: !295, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !514, file: !515, line: 54, baseType: !297, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !514, file: !515, line: 55, baseType: !297, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !514, file: !515, line: 56, baseType: !297, size: 64, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !514, file: !515, line: 57, baseType: !297, size: 64, offset: 256)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !514, file: !515, line: 58, baseType: !297, size: 64, offset: 320)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !514, file: !515, line: 59, baseType: !297, size: 64, offset: 384)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !514, file: !515, line: 60, baseType: !297, size: 64, offset: 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !514, file: !515, line: 61, baseType: !297, size: 64, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !514, file: !515, line: 64, baseType: !297, size: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !514, file: !515, line: 65, baseType: !297, size: 64, offset: 640)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !514, file: !515, line: 66, baseType: !297, size: 64, offset: 704)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !514, file: !515, line: 68, baseType: !530, size: 64, offset: 768)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !515, line: 36, flags: DIFlagFwdDecl)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !514, file: !515, line: 70, baseType: !533, size: 64, offset: 832)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !514, file: !515, line: 72, baseType: !295, size: 32, offset: 896)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !514, file: !515, line: 73, baseType: !295, size: 32, offset: 928)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !514, file: !515, line: 74, baseType: !537, size: 64, offset: 960)
!537 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !538, line: 152, baseType: !383)
!538 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !514, file: !515, line: 77, baseType: !540, size: 16, offset: 1024)
!540 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !514, file: !515, line: 78, baseType: !542, size: 8, offset: 1040)
!542 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !514, file: !515, line: 79, baseType: !544, size: 8, offset: 1048)
!544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 8, elements: !387)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !514, file: !515, line: 81, baseType: !546, size: 64, offset: 1088)
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !515, line: 43, baseType: null)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !514, file: !515, line: 89, baseType: !549, size: 64, offset: 1152)
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !538, line: 153, baseType: !383)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !514, file: !515, line: 91, baseType: !551, size: 64, offset: 1216)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !552, size: 64)
!552 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !515, line: 37, flags: DIFlagFwdDecl)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !514, file: !515, line: 92, baseType: !554, size: 64, offset: 1280)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !515, line: 38, flags: DIFlagFwdDecl)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !514, file: !515, line: 93, baseType: !533, size: 64, offset: 1344)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !514, file: !515, line: 94, baseType: !299, size: 64, offset: 1408)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !514, file: !515, line: 95, baseType: !559, size: 64, offset: 1472)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !560, line: 46, baseType: !434)
!560 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !514, file: !515, line: 96, baseType: !295, size: 32, offset: 1536)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !514, file: !515, line: 98, baseType: !563, size: 160, offset: 1568)
!563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !298, size: 160, elements: !564)
!564 = !{!565}
!565 = !DISubrange(count: 20)
!566 = !{!567}
!567 = !DILocalVariable(name: "__fp", arg: 1, scope: !508, file: !483, line: 56, type: !511)
!568 = !DILocation(line: 0, scope: !508)
!569 = !DILocation(line: 58, column: 10, scope: !508)
!570 = !DILocation(line: 58, column: 3, scope: !508)
!571 = distinct !DISubprogram(name: "getc_unlocked", scope: !483, file: !483, line: 66, type: !509, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !572)
!572 = !{!573}
!573 = !DILocalVariable(name: "__fp", arg: 1, scope: !571, file: !483, line: 66, type: !511)
!574 = !DILocation(line: 0, scope: !571)
!575 = !DILocation(line: 68, column: 10, scope: !571)
!576 = !DILocation(line: 68, column: 3, scope: !571)
!577 = distinct !DISubprogram(name: "getchar_unlocked", scope: !483, file: !483, line: 73, type: !502, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !504)
!578 = !DILocation(line: 75, column: 10, scope: !577)
!579 = !DILocation(line: 75, column: 3, scope: !577)
!580 = distinct !DISubprogram(name: "putchar", scope: !483, file: !483, line: 82, type: !581, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !583)
!581 = !DISubroutineType(types: !582)
!582 = !{!295, !295}
!583 = !{!584}
!584 = !DILocalVariable(name: "__c", arg: 1, scope: !580, file: !483, line: 82, type: !295)
!585 = !DILocation(line: 0, scope: !580)
!586 = !DILocation(line: 84, column: 21, scope: !580)
!587 = !DILocation(line: 84, column: 10, scope: !580)
!588 = !DILocation(line: 84, column: 3, scope: !580)
!589 = distinct !DISubprogram(name: "fputc_unlocked", scope: !483, file: !483, line: 91, type: !590, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !592)
!590 = !DISubroutineType(types: !591)
!591 = !{!295, !295, !511}
!592 = !{!593, !594}
!593 = !DILocalVariable(name: "__c", arg: 1, scope: !589, file: !483, line: 91, type: !295)
!594 = !DILocalVariable(name: "__stream", arg: 2, scope: !589, file: !483, line: 91, type: !511)
!595 = !DILocation(line: 0, scope: !589)
!596 = !DILocation(line: 93, column: 10, scope: !589)
!597 = !DILocation(line: 93, column: 3, scope: !589)
!598 = distinct !DISubprogram(name: "putc_unlocked", scope: !483, file: !483, line: 101, type: !590, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !599)
!599 = !{!600, !601}
!600 = !DILocalVariable(name: "__c", arg: 1, scope: !598, file: !483, line: 101, type: !295)
!601 = !DILocalVariable(name: "__stream", arg: 2, scope: !598, file: !483, line: 101, type: !511)
!602 = !DILocation(line: 0, scope: !598)
!603 = !DILocation(line: 103, column: 10, scope: !598)
!604 = !DILocation(line: 103, column: 3, scope: !598)
!605 = distinct !DISubprogram(name: "putchar_unlocked", scope: !483, file: !483, line: 108, type: !581, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !606)
!606 = !{!607}
!607 = !DILocalVariable(name: "__c", arg: 1, scope: !605, file: !483, line: 108, type: !295)
!608 = !DILocation(line: 0, scope: !605)
!609 = !DILocation(line: 110, column: 10, scope: !605)
!610 = !DILocation(line: 110, column: 3, scope: !605)
!611 = distinct !DISubprogram(name: "getline", scope: !483, file: !483, line: 118, type: !612, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !616)
!612 = !DISubroutineType(types: !613)
!613 = !{!614, !296, !615, !511}
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !538, line: 193, baseType: !383)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!616 = !{!617, !618, !619}
!617 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !611, file: !483, line: 118, type: !296)
!618 = !DILocalVariable(name: "__n", arg: 2, scope: !611, file: !483, line: 118, type: !615)
!619 = !DILocalVariable(name: "__stream", arg: 3, scope: !611, file: !483, line: 118, type: !511)
!620 = !DILocation(line: 0, scope: !611)
!621 = !DILocation(line: 120, column: 10, scope: !611)
!622 = !DILocation(line: 120, column: 3, scope: !611)
!623 = distinct !DISubprogram(name: "feof_unlocked", scope: !483, file: !483, line: 128, type: !509, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !624)
!624 = !{!625}
!625 = !DILocalVariable(name: "__stream", arg: 1, scope: !623, file: !483, line: 128, type: !511)
!626 = !DILocation(line: 0, scope: !623)
!627 = !DILocation(line: 130, column: 10, scope: !623)
!628 = !DILocation(line: 130, column: 3, scope: !623)
!629 = distinct !DISubprogram(name: "ferror_unlocked", scope: !483, file: !483, line: 135, type: !509, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !630)
!630 = !{!631}
!631 = !DILocalVariable(name: "__stream", arg: 1, scope: !629, file: !483, line: 135, type: !511)
!632 = !DILocation(line: 0, scope: !629)
!633 = !DILocation(line: 137, column: 10, scope: !629)
!634 = !DILocation(line: 137, column: 3, scope: !629)
!635 = distinct !DISubprogram(name: "tolower", scope: !636, file: !636, line: 207, type: !581, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !637)
!636 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!637 = !{!638}
!638 = !DILocalVariable(name: "__c", arg: 1, scope: !635, file: !636, line: 207, type: !295)
!639 = !DILocation(line: 0, scope: !635)
!640 = !DILocation(line: 209, column: 22, scope: !635)
!641 = !DILocation(line: 209, column: 39, scope: !635)
!642 = !DILocation(line: 209, column: 38, scope: !635)
!643 = !DILocation(line: 209, column: 37, scope: !635)
!644 = !DILocation(line: 209, column: 10, scope: !635)
!645 = !DILocation(line: 209, column: 3, scope: !635)
!646 = distinct !DISubprogram(name: "toupper", scope: !636, file: !636, line: 213, type: !581, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !647)
!647 = !{!648}
!648 = !DILocalVariable(name: "__c", arg: 1, scope: !646, file: !636, line: 213, type: !295)
!649 = !DILocation(line: 0, scope: !646)
!650 = !DILocation(line: 215, column: 22, scope: !646)
!651 = !DILocation(line: 215, column: 39, scope: !646)
!652 = !DILocation(line: 215, column: 38, scope: !646)
!653 = !DILocation(line: 215, column: 37, scope: !646)
!654 = !DILocation(line: 215, column: 10, scope: !646)
!655 = !DILocation(line: 215, column: 3, scope: !646)
!656 = distinct !DISubprogram(name: "atoi", scope: !657, file: !657, line: 361, type: !658, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !660)
!657 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!658 = !DISubroutineType(types: !659)
!659 = !{!295, !300}
!660 = !{!661}
!661 = !DILocalVariable(name: "__nptr", arg: 1, scope: !656, file: !657, line: 361, type: !300)
!662 = !DILocation(line: 0, scope: !656)
!663 = !DILocation(line: 363, column: 16, scope: !656)
!664 = !DILocation(line: 363, column: 10, scope: !656)
!665 = !DILocation(line: 363, column: 3, scope: !656)
!666 = distinct !DISubprogram(name: "atol", scope: !657, file: !657, line: 366, type: !667, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !669)
!667 = !DISubroutineType(types: !668)
!668 = !{!383, !300}
!669 = !{!670}
!670 = !DILocalVariable(name: "__nptr", arg: 1, scope: !666, file: !657, line: 366, type: !300)
!671 = !DILocation(line: 0, scope: !666)
!672 = !DILocation(line: 368, column: 10, scope: !666)
!673 = !DILocation(line: 368, column: 3, scope: !666)
!674 = distinct !DISubprogram(name: "atoll", scope: !657, file: !657, line: 373, type: !675, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !678)
!675 = !DISubroutineType(types: !676)
!676 = !{!677, !300}
!677 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!678 = !{!679}
!679 = !DILocalVariable(name: "__nptr", arg: 1, scope: !674, file: !657, line: 373, type: !300)
!680 = !DILocation(line: 0, scope: !674)
!681 = !DILocation(line: 375, column: 10, scope: !674)
!682 = !DILocation(line: 375, column: 3, scope: !674)
!683 = distinct !DISubprogram(name: "bsearch", scope: !684, file: !684, line: 20, type: !685, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !693)
!684 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!685 = !DISubroutineType(types: !686)
!686 = !{!299, !687, !687, !559, !559, !689}
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !657, line: 808, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DISubroutineType(types: !692)
!692 = !{!295, !687, !687}
!693 = !{!694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!694 = !DILocalVariable(name: "__key", arg: 1, scope: !683, file: !684, line: 20, type: !687)
!695 = !DILocalVariable(name: "__base", arg: 2, scope: !683, file: !684, line: 20, type: !687)
!696 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !683, file: !684, line: 20, type: !559)
!697 = !DILocalVariable(name: "__size", arg: 4, scope: !683, file: !684, line: 20, type: !559)
!698 = !DILocalVariable(name: "__compar", arg: 5, scope: !683, file: !684, line: 21, type: !689)
!699 = !DILocalVariable(name: "__l", scope: !683, file: !684, line: 23, type: !559)
!700 = !DILocalVariable(name: "__u", scope: !683, file: !684, line: 23, type: !559)
!701 = !DILocalVariable(name: "__idx", scope: !683, file: !684, line: 23, type: !559)
!702 = !DILocalVariable(name: "__p", scope: !683, file: !684, line: 24, type: !687)
!703 = !DILocalVariable(name: "__comparison", scope: !683, file: !684, line: 25, type: !295)
!704 = !DILocation(line: 0, scope: !683)
!705 = !DILocation(line: 29, column: 3, scope: !683)
!706 = !DILocation(line: 27, column: 7, scope: !683)
!707 = !DILocation(line: 29, column: 14, scope: !683)
!708 = !DILocation(line: 31, column: 20, scope: !709)
!709 = distinct !DILexicalBlock(scope: !683, file: !684, line: 30, column: 5)
!710 = !DILocation(line: 31, column: 27, scope: !709)
!711 = !DILocation(line: 32, column: 56, scope: !709)
!712 = !DILocation(line: 32, column: 47, scope: !709)
!713 = !DILocation(line: 33, column: 22, scope: !709)
!714 = !DILocation(line: 34, column: 24, scope: !715)
!715 = distinct !DILexicalBlock(scope: !709, file: !684, line: 34, column: 11)
!716 = !DILocation(line: 34, column: 11, scope: !709)
!717 = !DILocation(line: 36, column: 29, scope: !718)
!718 = distinct !DILexicalBlock(scope: !715, file: !684, line: 36, column: 16)
!719 = !DILocation(line: 36, column: 16, scope: !715)
!720 = !DILocation(line: 37, column: 14, scope: !718)
!721 = distinct !{!721, !705, !722}
!722 = !DILocation(line: 40, column: 5, scope: !683)
!723 = !DILocation(line: 43, column: 1, scope: !683)
!724 = distinct !DISubprogram(name: "atof", scope: !725, file: !725, line: 25, type: !726, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !729)
!725 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!726 = !DISubroutineType(types: !727)
!727 = !{!728, !300}
!728 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!729 = !{!730}
!730 = !DILocalVariable(name: "__nptr", arg: 1, scope: !724, file: !725, line: 25, type: !300)
!731 = !DILocation(line: 0, scope: !724)
!732 = !DILocation(line: 27, column: 10, scope: !724)
!733 = !DILocation(line: 27, column: 3, scope: !724)
!734 = distinct !DISubprogram(name: "strtoimax", scope: !735, file: !735, line: 324, type: !736, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !742)
!735 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!736 = !DISubroutineType(types: !737)
!737 = !{!738, !486, !741, !295}
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !739, line: 101, baseType: !740)
!739 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !538, line: 72, baseType: !383)
!741 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !296)
!742 = !{!743, !744, !745}
!743 = !DILocalVariable(name: "nptr", arg: 1, scope: !734, file: !735, line: 324, type: !486)
!744 = !DILocalVariable(name: "endptr", arg: 2, scope: !734, file: !735, line: 324, type: !741)
!745 = !DILocalVariable(name: "base", arg: 3, scope: !734, file: !735, line: 324, type: !295)
!746 = !DILocation(line: 0, scope: !734)
!747 = !DILocation(line: 327, column: 10, scope: !734)
!748 = !DILocation(line: 327, column: 3, scope: !734)
!749 = distinct !DISubprogram(name: "strtoumax", scope: !735, file: !735, line: 336, type: !750, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !754)
!750 = !DISubroutineType(types: !751)
!751 = !{!752, !486, !741, !295}
!752 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !739, line: 102, baseType: !753)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !538, line: 73, baseType: !434)
!754 = !{!755, !756, !757}
!755 = !DILocalVariable(name: "nptr", arg: 1, scope: !749, file: !735, line: 336, type: !486)
!756 = !DILocalVariable(name: "endptr", arg: 2, scope: !749, file: !735, line: 336, type: !741)
!757 = !DILocalVariable(name: "base", arg: 3, scope: !749, file: !735, line: 336, type: !295)
!758 = !DILocation(line: 0, scope: !749)
!759 = !DILocation(line: 339, column: 10, scope: !749)
!760 = !DILocation(line: 339, column: 3, scope: !749)
!761 = distinct !DISubprogram(name: "wcstoimax", scope: !735, file: !735, line: 348, type: !762, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !771)
!762 = !DISubroutineType(types: !763)
!763 = !{!738, !764, !768, !295}
!764 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !765)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !767)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !735, line: 34, baseType: !295)
!768 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !769)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!771 = !{!772, !773, !774}
!772 = !DILocalVariable(name: "nptr", arg: 1, scope: !761, file: !735, line: 348, type: !764)
!773 = !DILocalVariable(name: "endptr", arg: 2, scope: !761, file: !735, line: 348, type: !768)
!774 = !DILocalVariable(name: "base", arg: 3, scope: !761, file: !735, line: 348, type: !295)
!775 = !DILocation(line: 0, scope: !761)
!776 = !DILocation(line: 351, column: 10, scope: !761)
!777 = !DILocation(line: 351, column: 3, scope: !761)
!778 = distinct !DISubprogram(name: "wcstoumax", scope: !735, file: !735, line: 362, type: !779, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !781)
!779 = !DISubroutineType(types: !780)
!780 = !{!752, !764, !768, !295}
!781 = !{!782, !783, !784}
!782 = !DILocalVariable(name: "nptr", arg: 1, scope: !778, file: !735, line: 362, type: !764)
!783 = !DILocalVariable(name: "endptr", arg: 2, scope: !778, file: !735, line: 362, type: !768)
!784 = !DILocalVariable(name: "base", arg: 3, scope: !778, file: !735, line: 362, type: !295)
!785 = !DILocation(line: 0, scope: !778)
!786 = !DILocation(line: 365, column: 10, scope: !778)
!787 = !DILocation(line: 365, column: 3, scope: !778)
!788 = distinct !DISubprogram(name: "stat", scope: !789, file: !789, line: 453, type: !790, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !827)
!789 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!790 = !DISubroutineType(types: !791)
!791 = !{!295, !300, !792}
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !794, line: 46, size: 1152, elements: !795)
!794 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!795 = !{!796, !798, !800, !802, !804, !806, !808, !809, !810, !811, !813, !815, !823, !824, !825}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !793, file: !794, line: 48, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !538, line: 145, baseType: !434)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !793, file: !794, line: 53, baseType: !799, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !538, line: 148, baseType: !434)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !793, file: !794, line: 61, baseType: !801, size: 64, offset: 128)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !538, line: 151, baseType: !434)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !793, file: !794, line: 62, baseType: !803, size: 32, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !538, line: 150, baseType: !7)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !793, file: !794, line: 64, baseType: !805, size: 32, offset: 224)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !538, line: 146, baseType: !7)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !793, file: !794, line: 65, baseType: !807, size: 32, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !538, line: 147, baseType: !7)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !793, file: !794, line: 67, baseType: !295, size: 32, offset: 288)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !793, file: !794, line: 69, baseType: !797, size: 64, offset: 320)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !793, file: !794, line: 74, baseType: !537, size: 64, offset: 384)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !793, file: !794, line: 78, baseType: !812, size: 64, offset: 448)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !538, line: 174, baseType: !383)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !793, file: !794, line: 80, baseType: !814, size: 64, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !538, line: 179, baseType: !383)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !793, file: !794, line: 91, baseType: !816, size: 128, offset: 576)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !817, line: 10, size: 128, elements: !818)
!817 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!818 = !{!819, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !816, file: !817, line: 12, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !538, line: 160, baseType: !383)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !816, file: !817, line: 16, baseType: !822, size: 64, offset: 64)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !538, line: 196, baseType: !383)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !793, file: !794, line: 92, baseType: !816, size: 128, offset: 704)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !793, file: !794, line: 93, baseType: !816, size: 128, offset: 832)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !793, file: !794, line: 106, baseType: !826, size: 192, offset: 960)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !822, size: 192, elements: !396)
!827 = !{!828, !829}
!828 = !DILocalVariable(name: "__path", arg: 1, scope: !788, file: !789, line: 453, type: !300)
!829 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !788, file: !789, line: 453, type: !792)
!830 = !DILocation(line: 0, scope: !788)
!831 = !DILocation(line: 455, column: 10, scope: !788)
!832 = !DILocation(line: 455, column: 3, scope: !788)
!833 = distinct !DISubprogram(name: "lstat", scope: !789, file: !789, line: 460, type: !790, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !834)
!834 = !{!835, !836}
!835 = !DILocalVariable(name: "__path", arg: 1, scope: !833, file: !789, line: 460, type: !300)
!836 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !833, file: !789, line: 460, type: !792)
!837 = !DILocation(line: 0, scope: !833)
!838 = !DILocation(line: 462, column: 10, scope: !833)
!839 = !DILocation(line: 462, column: 3, scope: !833)
!840 = distinct !DISubprogram(name: "fstat", scope: !789, file: !789, line: 467, type: !841, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !843)
!841 = !DISubroutineType(types: !842)
!842 = !{!295, !295, !792}
!843 = !{!844, !845}
!844 = !DILocalVariable(name: "__fd", arg: 1, scope: !840, file: !789, line: 467, type: !295)
!845 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !840, file: !789, line: 467, type: !792)
!846 = !DILocation(line: 0, scope: !840)
!847 = !DILocation(line: 469, column: 10, scope: !840)
!848 = !DILocation(line: 469, column: 3, scope: !840)
!849 = distinct !DISubprogram(name: "fstatat", scope: !789, file: !789, line: 474, type: !850, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !852)
!850 = !DISubroutineType(types: !851)
!851 = !{!295, !295, !300, !792, !295}
!852 = !{!853, !854, !855, !856}
!853 = !DILocalVariable(name: "__fd", arg: 1, scope: !849, file: !789, line: 474, type: !295)
!854 = !DILocalVariable(name: "__filename", arg: 2, scope: !849, file: !789, line: 474, type: !300)
!855 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !849, file: !789, line: 474, type: !792)
!856 = !DILocalVariable(name: "__flag", arg: 4, scope: !849, file: !789, line: 474, type: !295)
!857 = !DILocation(line: 0, scope: !849)
!858 = !DILocation(line: 477, column: 10, scope: !849)
!859 = !DILocation(line: 477, column: 3, scope: !849)
!860 = distinct !DISubprogram(name: "mknod", scope: !789, file: !789, line: 483, type: !861, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !863)
!861 = !DISubroutineType(types: !862)
!862 = !{!295, !300, !803, !797}
!863 = !{!864, !865, !866}
!864 = !DILocalVariable(name: "__path", arg: 1, scope: !860, file: !789, line: 483, type: !300)
!865 = !DILocalVariable(name: "__mode", arg: 2, scope: !860, file: !789, line: 483, type: !803)
!866 = !DILocalVariable(name: "__dev", arg: 3, scope: !860, file: !789, line: 483, type: !797)
!867 = !DILocation(line: 0, scope: !860)
!868 = !DILocation(line: 485, column: 10, scope: !860)
!869 = !DILocation(line: 485, column: 3, scope: !860)
!870 = distinct !DISubprogram(name: "mknodat", scope: !789, file: !789, line: 491, type: !871, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !873)
!871 = !DISubroutineType(types: !872)
!872 = !{!295, !295, !300, !803, !797}
!873 = !{!874, !875, !876, !877}
!874 = !DILocalVariable(name: "__fd", arg: 1, scope: !870, file: !789, line: 491, type: !295)
!875 = !DILocalVariable(name: "__path", arg: 2, scope: !870, file: !789, line: 491, type: !300)
!876 = !DILocalVariable(name: "__mode", arg: 3, scope: !870, file: !789, line: 491, type: !803)
!877 = !DILocalVariable(name: "__dev", arg: 4, scope: !870, file: !789, line: 491, type: !797)
!878 = !DILocation(line: 0, scope: !870)
!879 = !DILocation(line: 494, column: 10, scope: !870)
!880 = !DILocation(line: 494, column: 3, scope: !870)
!881 = distinct !DISubprogram(name: "stat64", scope: !789, file: !789, line: 502, type: !882, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !904)
!882 = !DISubroutineType(types: !883)
!883 = !{!295, !300, !884}
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !794, line: 119, size: 1152, elements: !886)
!886 = !{!887, !888, !890, !891, !892, !893, !894, !895, !896, !897, !898, !900, !901, !902, !903}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !885, file: !794, line: 121, baseType: !797, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !885, file: !794, line: 123, baseType: !889, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !538, line: 149, baseType: !434)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !885, file: !794, line: 124, baseType: !801, size: 64, offset: 128)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !885, file: !794, line: 125, baseType: !803, size: 32, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !885, file: !794, line: 132, baseType: !805, size: 32, offset: 224)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !885, file: !794, line: 133, baseType: !807, size: 32, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !885, file: !794, line: 135, baseType: !295, size: 32, offset: 288)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !885, file: !794, line: 136, baseType: !797, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !885, file: !794, line: 137, baseType: !537, size: 64, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !885, file: !794, line: 143, baseType: !812, size: 64, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !885, file: !794, line: 144, baseType: !899, size: 64, offset: 512)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !538, line: 180, baseType: !383)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !885, file: !794, line: 152, baseType: !816, size: 128, offset: 576)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !885, file: !794, line: 153, baseType: !816, size: 128, offset: 704)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !885, file: !794, line: 154, baseType: !816, size: 128, offset: 832)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !885, file: !794, line: 164, baseType: !826, size: 192, offset: 960)
!904 = !{!905, !906}
!905 = !DILocalVariable(name: "__path", arg: 1, scope: !881, file: !789, line: 502, type: !300)
!906 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !881, file: !789, line: 502, type: !884)
!907 = !DILocation(line: 0, scope: !881)
!908 = !DILocation(line: 504, column: 10, scope: !881)
!909 = !DILocation(line: 504, column: 3, scope: !881)
!910 = distinct !DISubprogram(name: "lstat64", scope: !789, file: !789, line: 509, type: !882, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !911)
!911 = !{!912, !913}
!912 = !DILocalVariable(name: "__path", arg: 1, scope: !910, file: !789, line: 509, type: !300)
!913 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !910, file: !789, line: 509, type: !884)
!914 = !DILocation(line: 0, scope: !910)
!915 = !DILocation(line: 511, column: 10, scope: !910)
!916 = !DILocation(line: 511, column: 3, scope: !910)
!917 = distinct !DISubprogram(name: "fstat64", scope: !789, file: !789, line: 516, type: !918, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !920)
!918 = !DISubroutineType(types: !919)
!919 = !{!295, !295, !884}
!920 = !{!921, !922}
!921 = !DILocalVariable(name: "__fd", arg: 1, scope: !917, file: !789, line: 516, type: !295)
!922 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !917, file: !789, line: 516, type: !884)
!923 = !DILocation(line: 0, scope: !917)
!924 = !DILocation(line: 518, column: 10, scope: !917)
!925 = !DILocation(line: 518, column: 3, scope: !917)
!926 = distinct !DISubprogram(name: "fstatat64", scope: !789, file: !789, line: 523, type: !927, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !929)
!927 = !DISubroutineType(types: !928)
!928 = !{!295, !295, !300, !884, !295}
!929 = !{!930, !931, !932, !933}
!930 = !DILocalVariable(name: "__fd", arg: 1, scope: !926, file: !789, line: 523, type: !295)
!931 = !DILocalVariable(name: "__filename", arg: 2, scope: !926, file: !789, line: 523, type: !300)
!932 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !926, file: !789, line: 523, type: !884)
!933 = !DILocalVariable(name: "__flag", arg: 4, scope: !926, file: !789, line: 523, type: !295)
!934 = !DILocation(line: 0, scope: !926)
!935 = !DILocation(line: 526, column: 10, scope: !926)
!936 = !DILocation(line: 526, column: 3, scope: !926)
!937 = distinct !DISubprogram(name: "rtvec_alloc", scope: !3, file: !3, line: 149, type: !938, scopeLine: 150, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !940)
!938 = !DISubroutineType(types: !939)
!939 = !{!302, !295}
!940 = !{!941, !942}
!941 = !DILocalVariable(name: "n", arg: 1, scope: !937, file: !3, line: 149, type: !295)
!942 = !DILocalVariable(name: "rt", scope: !937, file: !3, line: 151, type: !302)
!943 = !DILocation(line: 0, scope: !937)
!944 = !DILocation(line: 153, column: 8, scope: !937)
!945 = !DILocation(line: 155, column: 16, scope: !937)
!946 = !DILocation(line: 155, column: 28, scope: !937)
!947 = !DILocation(line: 155, column: 30, scope: !937)
!948 = !DILocation(line: 155, column: 3, scope: !937)
!949 = !DILocation(line: 157, column: 3, scope: !937)
!950 = !DILocation(line: 164, column: 3, scope: !937)
!951 = distinct !DISubprogram(name: "shallow_copy_rtvec", scope: !3, file: !3, line: 170, type: !952, scopeLine: 171, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !954)
!952 = !DISubroutineType(types: !953)
!953 = !{!302, !302}
!954 = !{!955, !956, !957}
!955 = !DILocalVariable(name: "vec", arg: 1, scope: !951, file: !3, line: 170, type: !302)
!956 = !DILocalVariable(name: "newvec", scope: !951, file: !3, line: 172, type: !302)
