; ModuleID = 'rtlanal.bc'
source_filename = "rtlanal.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type { %struct.unnamed_section }
%struct.unnamed_section = type { %struct.section_common, void (i8*)*, i8*, %union.section* }
%struct.section_common = type { i32 }
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }

!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !378, line: 836, baseType: !7, size: 32, elements: !521)
!521 = !{!522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553}
!522 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!523 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!524 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!525 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!526 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!527 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!528 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!529 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!530 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!531 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!532 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!533 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!534 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!535 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!536 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!537 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!538 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!539 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!540 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!541 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!542 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!543 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!544 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!545 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!546 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!547 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!548 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!549 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!550 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!551 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!552 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!553 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!554 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !555, line: 36, baseType: !7, size: 32, elements: !556)
!555 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!556 = !{!557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575}
!557 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!558 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!559 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!560 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!561 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!562 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!563 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!564 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!565 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!566 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!567 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!568 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!569 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!570 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!571 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!572 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!573 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!574 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!575 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!576 = !{!577, !578, !579, !580, !583, !584, !377, !5, !586, !587, !588, !1657, !520, !554, !1658, !1665, !590, !1667, !674, !183, !1669, !1675}
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!579 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !585, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!586 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!587 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!588 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !589, line: 50, baseType: !590)
!589 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !591, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !591, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !591, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !591, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !591, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !591, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !591, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !591, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !591, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !591, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !591, file: !378, line: 321, baseType: !604, size: 320, offset: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !605)
!605 = !{!606, !1592, !1594, !1655, !1656}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !604, file: !378, line: 316, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 64, elements: !623)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !625, !626, !638, !641, !702, !1570, !1571, !1582, !1589}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !609, file: !378, line: 168, baseType: !579, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !609, file: !378, line: 169, baseType: !7, size: 32)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !609, file: !378, line: 170, baseType: !584, size: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !609, file: !378, line: 171, baseType: !588, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !609, file: !378, line: 172, baseType: !616, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !589, line: 53, baseType: !617)
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !619)
!619 = !{!620, !621}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !618, file: !378, line: 360, baseType: !579, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !618, file: !378, line: 361, baseType: !622, size: 64, offset: 64)
!622 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 64, elements: !623)
!623 = !{!624}
!624 = !DISubrange(count: 1)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !609, file: !378, line: 173, baseType: !5, size: 32)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !609, file: !378, line: 174, baseType: !627, size: 32)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !635, !636, !637}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !628, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !628, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !628, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !628, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !628, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !628, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !628, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !628, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !609, file: !378, line: 175, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !378, line: 175, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !609, file: !378, line: 176, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !644, line: 75, size: 256, elements: !645)
!644 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!645 = !{!646, !660, !661, !662}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !643, file: !644, line: 76, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !644, line: 68, baseType: !649)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !644, line: 63, size: 320, elements: !650)
!650 = !{!651, !653, !654, !655}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !649, file: !644, line: 64, baseType: !652, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !649, file: !644, line: 65, baseType: !652, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !649, file: !644, line: 66, baseType: !7, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !649, file: !644, line: 67, baseType: !656, size: 128, offset: 192)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 128, elements: !658)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !644, line: 29, baseType: !587)
!658 = !{!659}
!659 = !DISubrange(count: 2)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !643, file: !644, line: 77, baseType: !647, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !643, file: !644, line: 78, baseType: !7, size: 32, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !643, file: !644, line: 79, baseType: !663, size: 64, offset: 192)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !644, line: 49, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !644, line: 45, size: 832, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !665, file: !644, line: 46, baseType: !652, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !665, file: !644, line: 47, baseType: !642, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !665, file: !644, line: 48, baseType: !670, size: 704, offset: 128)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !671, line: 164, size: 704, elements: !672)
!671 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!672 = !{!673, !675, !685, !686, !687, !688, !689, !690, !694, !698, !699, !700, !701}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !670, file: !671, line: 166, baseType: !674, size: 64)
!674 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !670, file: !671, line: 167, baseType: !676, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !671, line: 157, size: 192, elements: !678)
!678 = !{!679, !680, !681}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !677, file: !671, line: 159, baseType: !581, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !677, file: !671, line: 160, baseType: !676, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !677, file: !671, line: 161, baseType: !682, size: 32, offset: 128)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 32, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 4)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !670, file: !671, line: 168, baseType: !581, size: 64, offset: 128)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !670, file: !671, line: 169, baseType: !581, size: 64, offset: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !670, file: !671, line: 170, baseType: !581, size: 64, offset: 256)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !670, file: !671, line: 171, baseType: !674, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !670, file: !671, line: 172, baseType: !579, size: 32, offset: 384)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !670, file: !671, line: 176, baseType: !691, size: 64, offset: 448)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = !DISubroutineType(types: !693)
!693 = !{!676, !583, !674}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !670, file: !671, line: 177, baseType: !695, size: 64, offset: 512)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DISubroutineType(types: !697)
!697 = !{null, !583, !676}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !670, file: !671, line: 178, baseType: !583, size: 64, offset: 576)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !670, file: !671, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !670, file: !671, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !670, file: !671, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !609, file: !378, line: 177, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !589, line: 56, baseType: !704)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !706)
!706 = !{!707, !740, !746, !757, !776, !787, !792, !799, !805, !818, !830, !868, !873, !901, !909, !910, !915, !924, !930, !935, !939, !943, !1194, !1243, !1249, !1256, !1263, !1289, !1314, !1331, !1343, !1365, !1380, !1552}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !705, file: !151, line: 3372, baseType: !708, size: 64)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !709)
!709 = !{!710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !708, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !708, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !708, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !708, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !708, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !708, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !708, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !708, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !708, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !708, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !708, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !708, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !708, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !708, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !708, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !708, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !708, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !708, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !708, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !708, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !708, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !708, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !708, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !708, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !708, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !708, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !708, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !708, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !708, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !708, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !151, line: 3373, baseType: !741, size: 192)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !742)
!742 = !{!743, !744, !745}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !741, file: !151, line: 403, baseType: !708, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !741, file: !151, line: 404, baseType: !703, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !741, file: !151, line: 405, baseType: !703, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !705, file: !151, line: 3374, baseType: !747, size: 320)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !747, file: !151, line: 1385, baseType: !741, size: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !747, file: !151, line: 1386, baseType: !751, size: 128, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !752, line: 58, baseType: !753)
!752 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !752, line: 54, size: 128, elements: !754)
!754 = !{!755, !756}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !753, file: !752, line: 56, baseType: !587, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !753, file: !752, line: 57, baseType: !674, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !705, file: !151, line: 3375, baseType: !758, size: 256)
!758 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !759)
!759 = !{!760, !761}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !758, file: !151, line: 1398, baseType: !741, size: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !758, file: !151, line: 1399, baseType: !762, size: 64, offset: 192)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !764, line: 52, size: 256, elements: !765)
!764 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!765 = !{!766, !767, !768, !769, !770, !771, !772}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !763, file: !764, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !763, file: !764, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !763, file: !764, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !763, file: !764, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !763, file: !764, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !763, file: !764, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !763, file: !764, line: 62, baseType: !773, size: 192, offset: 64)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 192, elements: !774)
!774 = !{!775}
!775 = !DISubrange(count: 3)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !705, file: !151, line: 3376, baseType: !777, size: 256)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !777, file: !151, line: 1409, baseType: !741, size: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !777, file: !151, line: 1410, baseType: !781, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !783, line: 27, size: 192, elements: !784)
!783 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!784 = !{!785, !786}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !782, file: !783, line: 29, baseType: !751, size: 128)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !782, file: !783, line: 30, baseType: !5, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !705, file: !151, line: 3377, baseType: !788, size: 256)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !789)
!789 = !{!790, !791}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !788, file: !151, line: 1438, baseType: !741, size: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !788, file: !151, line: 1439, baseType: !703, size: 64, offset: 192)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !705, file: !151, line: 3378, baseType: !793, size: 256)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !793, file: !151, line: 1419, baseType: !741, size: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !793, file: !151, line: 1420, baseType: !579, size: 32, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !793, file: !151, line: 1421, baseType: !798, size: 8, offset: 224)
!798 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 8, elements: !623)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !705, file: !151, line: 3379, baseType: !800, size: 320)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !801)
!801 = !{!802, !803, !804}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !800, file: !151, line: 1429, baseType: !741, size: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !800, file: !151, line: 1430, baseType: !703, size: 64, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !800, file: !151, line: 1431, baseType: !703, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !705, file: !151, line: 3380, baseType: !806, size: 320)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !151, line: 1461, baseType: !741, size: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !806, file: !151, line: 1462, baseType: !810, size: 128, offset: 192)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !811, line: 31, size: 128, elements: !812)
!811 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!812 = !{!813, !816, !817}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !810, file: !811, line: 32, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !810, file: !811, line: 33, baseType: !7, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !810, file: !811, line: 34, baseType: !7, size: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !705, file: !151, line: 3381, baseType: !819, size: 384)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !820)
!820 = !{!821, !822, !827, !828, !829}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !151, line: 2508, baseType: !741, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !819, file: !151, line: 2509, baseType: !823, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !824, line: 58, baseType: !825)
!824 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !826, line: 44, baseType: !7)
!826 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!827 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !819, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !819, file: !151, line: 2511, baseType: !703, size: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !819, file: !151, line: 2512, baseType: !703, size: 64, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !705, file: !151, line: 3382, baseType: !831, size: 896)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !832)
!832 = !{!833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !831, file: !151, line: 2653, baseType: !819, size: 384)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !831, file: !151, line: 2654, baseType: !703, size: 64, offset: 384)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !831, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !831, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !831, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !831, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !831, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !831, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !831, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !831, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !831, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !831, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !831, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !831, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !831, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !831, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !831, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !831, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !831, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !831, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !831, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !831, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !831, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !831, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !831, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !831, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !831, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !831, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !831, file: !151, line: 2705, baseType: !703, size: 64, offset: 576)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !831, file: !151, line: 2706, baseType: !703, size: 64, offset: 640)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !831, file: !151, line: 2707, baseType: !703, size: 64, offset: 704)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !831, file: !151, line: 2708, baseType: !703, size: 64, offset: 768)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !831, file: !151, line: 2711, baseType: !866, size: 64, offset: 832)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !705, file: !151, line: 3383, baseType: !869, size: 960)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !869, file: !151, line: 2757, baseType: !831, size: 896)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !869, file: !151, line: 2758, baseType: !588, size: 64, offset: 896)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !705, file: !151, line: 3384, baseType: !874, size: 1472)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !875)
!875 = !{!876, !897, !898, !899, !900}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !874, file: !151, line: 3115, baseType: !877, size: 1216)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !878)
!878 = !{!879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !151, line: 2985, baseType: !869, size: 960)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !877, file: !151, line: 2986, baseType: !703, size: 64, offset: 960)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !877, file: !151, line: 2987, baseType: !703, size: 64, offset: 1024)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !877, file: !151, line: 2988, baseType: !703, size: 64, offset: 1088)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !877, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !877, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !877, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !877, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !877, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !877, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !877, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !877, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !877, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !877, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !877, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !877, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !877, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !877, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !874, file: !151, line: 3117, baseType: !703, size: 64, offset: 1216)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !874, file: !151, line: 3119, baseType: !703, size: 64, offset: 1280)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !874, file: !151, line: 3121, baseType: !703, size: 64, offset: 1344)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !874, file: !151, line: 3123, baseType: !703, size: 64, offset: 1408)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !705, file: !151, line: 3385, baseType: !902, size: 1088)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !151, line: 2875, baseType: !869, size: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !902, file: !151, line: 2876, baseType: !588, size: 64, offset: 960)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !902, file: !151, line: 2877, baseType: !907, size: 64, offset: 1024)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !151, line: 2856, flags: DIFlagFwdDecl)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !705, file: !151, line: 3386, baseType: !877, size: 1216)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !705, file: !151, line: 3387, baseType: !911, size: 1280)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !912)
!912 = !{!913, !914}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !151, line: 3094, baseType: !877, size: 1216)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !911, file: !151, line: 3095, baseType: !907, size: 64, offset: 1216)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !705, file: !151, line: 3388, baseType: !916, size: 1216)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !917)
!917 = !{!918, !919, !920, !921, !922, !923}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !916, file: !151, line: 2825, baseType: !831, size: 896)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !916, file: !151, line: 2827, baseType: !703, size: 64, offset: 896)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !916, file: !151, line: 2828, baseType: !703, size: 64, offset: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !916, file: !151, line: 2829, baseType: !703, size: 64, offset: 1024)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !916, file: !151, line: 2830, baseType: !703, size: 64, offset: 1088)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !916, file: !151, line: 2831, baseType: !703, size: 64, offset: 1152)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !705, file: !151, line: 3389, baseType: !925, size: 1024)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !926)
!926 = !{!927, !928, !929}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !151, line: 2851, baseType: !869, size: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !925, file: !151, line: 2852, baseType: !579, size: 32, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !925, file: !151, line: 2853, baseType: !579, size: 32, offset: 992)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !705, file: !151, line: 3390, baseType: !931, size: 1024)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !931, file: !151, line: 2858, baseType: !869, size: 960)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !931, file: !151, line: 2859, baseType: !907, size: 64, offset: 960)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !705, file: !151, line: 3391, baseType: !936, size: 960)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !937)
!937 = !{!938}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !151, line: 2863, baseType: !869, size: 960)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !705, file: !151, line: 3392, baseType: !940, size: 1472)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !941)
!941 = !{!942}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !940, file: !151, line: 3305, baseType: !874, size: 1472)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !705, file: !151, line: 3393, baseType: !944, size: 1792)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !945)
!945 = !{!946, !947, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !151, line: 3249, baseType: !874, size: 1472)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !944, file: !151, line: 3251, baseType: !948, size: 64, offset: 1472)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !950, line: 463, size: 1152, elements: !951)
!950 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!951 = !{!952, !955, !1059, !1060, !1063, !1066, !1118, !1119, !1120, !1121, !1122, !1146, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !949, file: !950, line: 464, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !950, line: 464, flags: DIFlagFwdDecl)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !949, file: !950, line: 467, baseType: !956, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !958)
!958 = !{!959, !1034, !1035, !1048, !1049, !1050, !1051, !1052, !1053, !1055, !1057, !1058}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !957, file: !135, line: 377, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !589, line: 111, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !963)
!963 = !{!964, !999, !1000, !1001, !1004, !1008, !1009, !1010, !1028, !1029, !1030, !1031, !1032, !1033}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !962, file: !135, line: 219, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !968)
!968 = !{!969}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !967, file: !135, line: 151, baseType: !970, size: 128)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !971, file: !135, line: 150, baseType: !7, size: 32)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !971, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !971, file: !135, line: 150, baseType: !976, size: 64, offset: 64)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 64, elements: !623)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !589, line: 108, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !980)
!980 = !{!981, !982, !983, !991, !992, !993, !994, !995, !996, !997}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !979, file: !135, line: 124, baseType: !961, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !979, file: !135, line: 125, baseType: !961, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !979, file: !135, line: 131, baseType: !984, size: 64, offset: 128)
!984 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !985)
!985 = !{!986, !990}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !984, file: !135, line: 129, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !589, line: 66, baseType: !988)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !589, line: 65, flags: DIFlagFwdDecl)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !984, file: !135, line: 130, baseType: !588, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !979, file: !135, line: 134, baseType: !583, size: 64, offset: 192)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !979, file: !135, line: 137, baseType: !703, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !979, file: !135, line: 138, baseType: !823, size: 32, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !979, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !979, file: !135, line: 144, baseType: !579, size: 32, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !979, file: !135, line: 145, baseType: !579, size: 32, offset: 416)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !979, file: !135, line: 146, baseType: !998, size: 64, offset: 448)
!998 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !674)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !962, file: !135, line: 220, baseType: !965, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !962, file: !135, line: 223, baseType: !583, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !962, file: !135, line: 226, baseType: !1002, size: 64, offset: 192)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !962, file: !135, line: 229, baseType: !1005, size: 128, offset: 256)
!1005 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1006, size: 128, elements: !658)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !962, file: !135, line: 232, baseType: !961, size: 64, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !962, file: !135, line: 233, baseType: !961, size: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !962, file: !135, line: 238, baseType: !1011, size: 64, offset: 512)
!1011 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1012)
!1012 = !{!1013, !1019}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1011, file: !135, line: 236, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1016)
!1016 = !{!1017, !1018}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1015, file: !135, line: 275, baseType: !987, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1015, file: !135, line: 278, baseType: !987, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1011, file: !135, line: 237, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1021, file: !135, line: 261, baseType: !588, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1021, file: !135, line: 262, baseType: !588, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1021, file: !135, line: 266, baseType: !588, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1021, file: !135, line: 267, baseType: !588, size: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1021, file: !135, line: 270, baseType: !579, size: 32, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !962, file: !135, line: 241, baseType: !998, size: 64, offset: 576)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !962, file: !135, line: 244, baseType: !579, size: 32, offset: 640)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !962, file: !135, line: 247, baseType: !579, size: 32, offset: 672)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !962, file: !135, line: 250, baseType: !579, size: 32, offset: 704)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !962, file: !135, line: 253, baseType: !579, size: 32, offset: 736)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !962, file: !135, line: 256, baseType: !579, size: 32, offset: 768)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !957, file: !135, line: 378, baseType: !960, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !957, file: !135, line: 381, baseType: !1036, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1039)
!1039 = !{!1040}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1038, file: !135, line: 282, baseType: !1041, size: 128)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1043)
!1043 = !{!1044, !1045, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1042, file: !135, line: 281, baseType: !7, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1042, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1042, file: !135, line: 281, baseType: !1047, size: 64, offset: 64)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 64, elements: !623)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !957, file: !135, line: 384, baseType: !579, size: 32, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !957, file: !135, line: 387, baseType: !579, size: 32, offset: 224)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !957, file: !135, line: 390, baseType: !579, size: 32, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !957, file: !135, line: 394, baseType: !1036, size: 64, offset: 320)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !957, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !957, file: !135, line: 399, baseType: !1054, size: 64, offset: 416)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !658)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !957, file: !135, line: 402, baseType: !1056, size: 64, offset: 480)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !658)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !957, file: !135, line: 406, baseType: !579, size: 32, offset: 544)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !957, file: !135, line: 409, baseType: !579, size: 32, offset: 576)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !949, file: !950, line: 470, baseType: !988, size: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !949, file: !950, line: 473, baseType: !1061, size: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !950, line: 166, flags: DIFlagFwdDecl)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !949, file: !950, line: 476, baseType: !1064, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !950, line: 476, flags: DIFlagFwdDecl)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !949, file: !950, line: 479, baseType: !1067, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1068, line: 144, baseType: !1069)
!1068 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1068, line: 100, size: 896, elements: !1071)
!1071 = !{!1072, !1080, !1085, !1090, !1092, !1095, !1096, !1097, !1098, !1099, !1104, !1106, !1107, !1112, !1117}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1070, file: !1068, line: 102, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1068, line: 52, baseType: !1074)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = !DISubroutineType(types: !1076)
!1076 = !{!1077, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1068, line: 47, baseType: !7)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1070, file: !1068, line: 105, baseType: !1081, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1068, line: 59, baseType: !1082)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DISubroutineType(types: !1084)
!1084 = !{!579, !1078, !1078}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1070, file: !1068, line: 108, baseType: !1086, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1068, line: 63, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{null, !583}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1070, file: !1068, line: 111, baseType: !1091, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1070, file: !1068, line: 114, baseType: !1093, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1094, line: 46, baseType: !587)
!1094 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1070, file: !1068, line: 117, baseType: !1093, size: 64, offset: 320)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1070, file: !1068, line: 120, baseType: !1093, size: 64, offset: 384)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1070, file: !1068, line: 124, baseType: !7, size: 32, offset: 448)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1070, file: !1068, line: 128, baseType: !7, size: 32, offset: 480)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1070, file: !1068, line: 131, baseType: !1100, size: 64, offset: 512)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1068, line: 75, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!583, !1093, !1093}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1070, file: !1068, line: 132, baseType: !1105, size: 64, offset: 576)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1068, line: 78, baseType: !1087)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1070, file: !1068, line: 135, baseType: !583, size: 64, offset: 640)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1070, file: !1068, line: 136, baseType: !1108, size: 64, offset: 704)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1068, line: 82, baseType: !1109)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = !DISubroutineType(types: !1111)
!1111 = !{!583, !583, !1093, !1093}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1070, file: !1068, line: 137, baseType: !1113, size: 64, offset: 768)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1068, line: 83, baseType: !1114)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DISubroutineType(types: !1116)
!1116 = !{null, !583, !583}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1070, file: !1068, line: 141, baseType: !7, size: 32, offset: 832)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !949, file: !950, line: 484, baseType: !703, size: 64, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !949, file: !950, line: 488, baseType: !703, size: 64, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !949, file: !950, line: 493, baseType: !703, size: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !949, file: !950, line: 496, baseType: !703, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !949, file: !950, line: 501, baseType: !1123, size: 64, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1125)
!1125 = !{!1126, !1129, !1130, !1131, !1132, !1134, !1135, !1140, !1141, !1142, !1143, !1144, !1145}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1124, file: !146, line: 2356, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1124, file: !146, line: 2357, baseType: !584, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1124, file: !146, line: 2358, baseType: !579, size: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1124, file: !146, line: 2359, baseType: !579, size: 32, offset: 160)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1124, file: !146, line: 2360, baseType: !1133, size: 128, offset: 192)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 128, elements: !683)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1124, file: !146, line: 2364, baseType: !579, size: 32, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1124, file: !146, line: 2367, baseType: !1136, size: 128, offset: 384)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1137)
!1137 = !{!1138, !1139}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1136, file: !146, line: 2351, baseType: !588, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1136, file: !146, line: 2352, baseType: !674, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1124, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1124, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1124, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1124, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1124, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1124, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !949, file: !950, line: 504, baseType: !1147, size: 64, offset: 704)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !950, line: 504, flags: DIFlagFwdDecl)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !949, file: !950, line: 507, baseType: !1067, size: 64, offset: 768)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !949, file: !950, line: 510, baseType: !579, size: 32, offset: 832)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !949, file: !950, line: 513, baseType: !579, size: 32, offset: 864)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !949, file: !950, line: 516, baseType: !823, size: 32, offset: 896)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !949, file: !950, line: 519, baseType: !823, size: 32, offset: 928)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !949, file: !950, line: 522, baseType: !7, size: 32, offset: 960)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !949, file: !950, line: 523, baseType: !7, size: 32, offset: 992)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !949, file: !950, line: 528, baseType: !584, size: 64, offset: 1024)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !949, file: !950, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !949, file: !950, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !949, file: !950, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !949, file: !950, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !949, file: !950, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !949, file: !950, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !949, file: !950, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !949, file: !950, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !949, file: !950, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !949, file: !950, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !949, file: !950, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !949, file: !950, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !949, file: !950, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !949, file: !950, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !949, file: !950, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !949, file: !950, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !944, file: !151, line: 3254, baseType: !703, size: 64, offset: 1536)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !944, file: !151, line: 3257, baseType: !703, size: 64, offset: 1600)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !944, file: !151, line: 3258, baseType: !703, size: 64, offset: 1664)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !944, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !944, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !944, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !944, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !944, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !944, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !944, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !944, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !944, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !944, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !944, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !944, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !944, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !944, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !944, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !944, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !944, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !944, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !705, file: !151, line: 3394, baseType: !1195, size: 1344)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1222, !1223, !1224, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1195, file: !151, line: 2280, baseType: !741, size: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1195, file: !151, line: 2281, baseType: !703, size: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1195, file: !151, line: 2282, baseType: !703, size: 64, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1195, file: !151, line: 2283, baseType: !703, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1195, file: !151, line: 2284, baseType: !703, size: 64, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1195, file: !151, line: 2285, baseType: !7, size: 32, offset: 448)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1195, file: !151, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1195, file: !151, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1195, file: !151, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1195, file: !151, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1195, file: !151, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1195, file: !151, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1195, file: !151, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1195, file: !151, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1195, file: !151, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1195, file: !151, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1195, file: !151, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1195, file: !151, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1195, file: !151, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1195, file: !151, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1195, file: !151, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1195, file: !151, line: 2305, baseType: !7, size: 32, offset: 512)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1195, file: !151, line: 2306, baseType: !1220, size: 32, offset: 544)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1221, line: 31, baseType: !579)
!1221 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1195, file: !151, line: 2307, baseType: !703, size: 64, offset: 576)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1195, file: !151, line: 2308, baseType: !703, size: 64, offset: 640)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1195, file: !151, line: 2314, baseType: !1225, size: 64, offset: 704)
!1225 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !151, line: 2309, size: 64, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1225, file: !151, line: 2310, baseType: !579, size: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1225, file: !151, line: 2311, baseType: !584, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1225, file: !151, line: 2312, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !151, line: 2277, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1195, file: !151, line: 2315, baseType: !703, size: 64, offset: 768)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1195, file: !151, line: 2316, baseType: !703, size: 64, offset: 832)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1195, file: !151, line: 2317, baseType: !703, size: 64, offset: 896)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1195, file: !151, line: 2318, baseType: !703, size: 64, offset: 960)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1195, file: !151, line: 2319, baseType: !703, size: 64, offset: 1024)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1195, file: !151, line: 2320, baseType: !703, size: 64, offset: 1088)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1195, file: !151, line: 2321, baseType: !703, size: 64, offset: 1152)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1195, file: !151, line: 2322, baseType: !703, size: 64, offset: 1216)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1195, file: !151, line: 2324, baseType: !1241, size: 64, offset: 1280)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !151, line: 2324, flags: DIFlagFwdDecl)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !705, file: !151, line: 3395, baseType: !1244, size: 320)
!1244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !151, line: 1469, size: 320, elements: !1245)
!1245 = !{!1246, !1247, !1248}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1244, file: !151, line: 1470, baseType: !741, size: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1244, file: !151, line: 1471, baseType: !703, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1244, file: !151, line: 1472, baseType: !703, size: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !705, file: !151, line: 3396, baseType: !1250, size: 320)
!1250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !151, line: 1482, size: 320, elements: !1251)
!1251 = !{!1252, !1253, !1254}
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1250, file: !151, line: 1483, baseType: !741, size: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1250, file: !151, line: 1484, baseType: !579, size: 32, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1250, file: !151, line: 1485, baseType: !1255, size: 64, offset: 256)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 64, elements: !623)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !705, file: !151, line: 3397, baseType: !1257, size: 384)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !151, line: 1829, size: 384, elements: !1258)
!1258 = !{!1259, !1260, !1261, !1262}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1257, file: !151, line: 1830, baseType: !741, size: 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1257, file: !151, line: 1831, baseType: !823, size: 32, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1257, file: !151, line: 1832, baseType: !703, size: 64, offset: 256)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1257, file: !151, line: 1835, baseType: !1255, size: 64, offset: 320)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !705, file: !151, line: 3398, baseType: !1264, size: 704)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !151, line: 1898, size: 704, elements: !1265)
!1265 = !{!1266, !1267, !1268, !1272, !1273, !1276}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1264, file: !151, line: 1899, baseType: !741, size: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1264, file: !151, line: 1902, baseType: !703, size: 64, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1264, file: !151, line: 1905, baseType: !1269, size: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !589, line: 58, baseType: !1270)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !589, line: 57, flags: DIFlagFwdDecl)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1264, file: !151, line: 1908, baseType: !7, size: 32, offset: 320)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1264, file: !151, line: 1911, baseType: !1274, size: 64, offset: 384)
!1274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1275, size: 64)
!1275 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !151, line: 1876, flags: DIFlagFwdDecl)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1264, file: !151, line: 1914, baseType: !1277, size: 256, offset: 448)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1278)
!1278 = !{!1279, !1281, !1282, !1287}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1277, file: !151, line: 1884, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1277, file: !151, line: 1885, baseType: !1280, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1277, file: !151, line: 1891, baseType: !1283, size: 64, offset: 128)
!1283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1277, file: !151, line: 1891, size: 64, elements: !1284)
!1284 = !{!1285, !1286}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1283, file: !151, line: 1891, baseType: !1269, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1283, file: !151, line: 1891, baseType: !703, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1277, file: !151, line: 1892, baseType: !1288, size: 64, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !705, file: !151, line: 3399, baseType: !1290, size: 704)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !151, line: 2008, size: 704, elements: !1291)
!1291 = !{!1292, !1293, !1294, !1295, !1296, !1297, !1309, !1310, !1311, !1312, !1313}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1290, file: !151, line: 2009, baseType: !741, size: 192)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1290, file: !151, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1290, file: !151, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1290, file: !151, line: 2014, baseType: !823, size: 32, offset: 224)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1290, file: !151, line: 2016, baseType: !703, size: 64, offset: 256)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1290, file: !151, line: 2017, baseType: !1298, size: 64, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1300)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1301)
!1301 = !{!1302}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1300, file: !151, line: 183, baseType: !1303, size: 128)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1305)
!1305 = !{!1306, !1307, !1308}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1304, file: !151, line: 182, baseType: !7, size: 32)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1304, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1304, file: !151, line: 182, baseType: !1255, size: 64, offset: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1290, file: !151, line: 2019, baseType: !703, size: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1290, file: !151, line: 2020, baseType: !703, size: 64, offset: 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1290, file: !151, line: 2021, baseType: !703, size: 64, offset: 512)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1290, file: !151, line: 2022, baseType: !703, size: 64, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1290, file: !151, line: 2023, baseType: !703, size: 64, offset: 640)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !705, file: !151, line: 3400, baseType: !1315, size: 832)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !151, line: 2430, size: 832, elements: !1316)
!1316 = !{!1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1315, file: !151, line: 2431, baseType: !741, size: 192)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1315, file: !151, line: 2433, baseType: !703, size: 64, offset: 192)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1315, file: !151, line: 2434, baseType: !703, size: 64, offset: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1315, file: !151, line: 2435, baseType: !703, size: 64, offset: 320)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1315, file: !151, line: 2436, baseType: !703, size: 64, offset: 384)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1315, file: !151, line: 2437, baseType: !1298, size: 64, offset: 448)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1315, file: !151, line: 2438, baseType: !703, size: 64, offset: 512)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1315, file: !151, line: 2440, baseType: !703, size: 64, offset: 576)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1315, file: !151, line: 2441, baseType: !703, size: 64, offset: 640)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1315, file: !151, line: 2443, baseType: !1327, size: 128, offset: 704)
!1327 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !151, line: 182, baseType: !1328)
