; ModuleID = 'rtlhooks.bc'
source_filename = "rtlhooks.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_hooks = type { %struct.rtx_def* (i32, %struct.rtx_def*)*, %struct.rtx_def* (i32, %struct.rtx_def*)*, %struct.rtx_def* (%struct.rtx_def*, i32, %struct.rtx_def*, i32, i64, i64*)*, %struct.rtx_def* (%struct.rtx_def*, i32, %struct.rtx_def*, i32, i32, i32*)*, i8 (i32, %struct.rtx_def*)* }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }

!479 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!480 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!481 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!482 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!483 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!484 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!485 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!486 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!487 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!488 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!489 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!490 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!491 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!492 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!493 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!494 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!495 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!496 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!497 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!498 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!499 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!500 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!501 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!502 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!503 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!504 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!505 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!506 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!507 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!508 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!509 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !510, line: 36, baseType: !7, size: 32, elements: !511)
!510 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!512 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!513 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!514 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!515 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!516 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!517 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!518 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!519 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!520 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!521 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!522 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!523 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!524 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!525 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!526 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!527 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!528 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!529 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!530 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!531 = !{!532, !533, !534, !535, !538, !539, !366, !541, !5, !509}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!534 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !537)
!541 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!542 = !{!0, !543}
!543 = !DIGlobalVariableExpression(var: !544, expr: !DIExpression())
!544 = distinct !DIGlobalVariable(name: "rtl_hooks", scope: !2, file: !3, line: 37, type: !545, isLocal: false, isDefinition: true)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_hooks", file: !367, line: 2441, size: 320, elements: !546)
!546 = !{!547, !1438, !1439, !1447, !1452}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "gen_lowpart", scope: !545, file: !367, line: 2443, baseType: !548, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DISubroutineType(types: !550)
!550 = !{!551, !5, !551}
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !552, line: 50, baseType: !553)
!552 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !367, line: 240, size: 384, elements: !555)
!555 = !{!556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !554, file: !367, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !554, file: !367, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !554, file: !367, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !554, file: !367, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !554, file: !367, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !554, file: !367, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !554, file: !367, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !554, file: !367, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !554, file: !367, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !554, file: !367, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !554, file: !367, line: 321, baseType: !567, size: 320, offset: 64)
!567 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !367, line: 315, size: 320, elements: !568)
!568 = !{!569, !1405, !1407, !1436, !1437}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !567, file: !367, line: 316, baseType: !570, size: 64)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !571, size: 64, elements: !586)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !367, line: 183, baseType: !572)
!572 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !367, line: 166, size: 64, elements: !573)
!573 = !{!574, !575, !576, !577, !578, !588, !589, !601, !604, !607, !1381, !1384, !1395, !1402}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !572, file: !367, line: 168, baseType: !534, size: 32)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !572, file: !367, line: 169, baseType: !7, size: 32)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !572, file: !367, line: 170, baseType: !539, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !572, file: !367, line: 171, baseType: !551, size: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !572, file: !367, line: 172, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !552, line: 53, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !367, line: 359, size: 128, elements: !582)
!582 = !{!583, !584}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !581, file: !367, line: 360, baseType: !534, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !581, file: !367, line: 361, baseType: !585, size: 64, offset: 64)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 64, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 1)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !572, file: !367, line: 173, baseType: !5, size: 32)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !572, file: !367, line: 174, baseType: !590, size: 32)
!590 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !367, line: 133, baseType: !591)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 115, size: 32, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !591, file: !367, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !591, file: !367, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !591, file: !367, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !591, file: !367, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !591, file: !367, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !591, file: !367, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !591, file: !367, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !591, file: !367, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !572, file: !367, line: 175, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !367, line: 175, flags: DIFlagFwdDecl)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !572, file: !367, line: 176, baseType: !605, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !552, line: 46, flags: DIFlagFwdDecl)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !572, file: !367, line: 177, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !552, line: 56, baseType: !609)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 3371, size: 1792, elements: !611)
!611 = !{!612, !645, !651, !664, !683, !694, !699, !706, !712, !725, !737, !775, !780, !808, !816, !817, !822, !831, !837, !842, !846, !850, !1004, !1053, !1059, !1066, !1073, !1099, !1124, !1141, !1153, !1175, !1191, !1363}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !610, file: !140, line: 3372, baseType: !613, size: 64)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !140, line: 360, size: 64, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !613, file: !140, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !613, file: !140, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !613, file: !140, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !613, file: !140, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !613, file: !140, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !613, file: !140, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !613, file: !140, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !613, file: !140, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !613, file: !140, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !613, file: !140, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !613, file: !140, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !613, file: !140, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !613, file: !140, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !613, file: !140, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !613, file: !140, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !613, file: !140, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !613, file: !140, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !613, file: !140, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !613, file: !140, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !613, file: !140, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !613, file: !140, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !613, file: !140, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !613, file: !140, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !613, file: !140, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !613, file: !140, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !613, file: !140, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !613, file: !140, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !613, file: !140, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !613, file: !140, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !613, file: !140, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !610, file: !140, line: 3373, baseType: !646, size: 192)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !140, line: 402, size: 192, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !646, file: !140, line: 403, baseType: !613, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !646, file: !140, line: 404, baseType: !608, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !646, file: !140, line: 405, baseType: !608, size: 64, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !610, file: !140, line: 3374, baseType: !652, size: 320)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !140, line: 1384, size: 320, elements: !653)
!653 = !{!654, !655}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !652, file: !140, line: 1385, baseType: !646, size: 192)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !652, file: !140, line: 1386, baseType: !656, size: 128, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !657, line: 58, baseType: !658)
!657 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !657, line: 54, size: 128, elements: !659)
!659 = !{!660, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !658, file: !657, line: 56, baseType: !661, size: 64)
!661 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !658, file: !657, line: 57, baseType: !663, size: 64, offset: 64)
!663 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !610, file: !140, line: 3375, baseType: !665, size: 256)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !140, line: 1397, size: 256, elements: !666)
!666 = !{!667, !668}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !665, file: !140, line: 1398, baseType: !646, size: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !665, file: !140, line: 1399, baseType: !669, size: 64, offset: 192)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !671, line: 52, size: 256, elements: !672)
!671 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!672 = !{!673, !674, !675, !676, !677, !678, !679}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !670, file: !671, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !670, file: !671, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !670, file: !671, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !670, file: !671, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !670, file: !671, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !670, file: !671, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !670, file: !671, line: 62, baseType: !680, size: 192, offset: 64)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 192, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 3)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !610, file: !140, line: 3376, baseType: !684, size: 256)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !140, line: 1408, size: 256, elements: !685)
!685 = !{!686, !687}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !140, line: 1409, baseType: !646, size: 192)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !684, file: !140, line: 1410, baseType: !688, size: 64, offset: 192)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !690, line: 27, size: 192, elements: !691)
!690 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!691 = !{!692, !693}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !689, file: !690, line: 29, baseType: !656, size: 128)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !689, file: !690, line: 30, baseType: !5, size: 32, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !610, file: !140, line: 3377, baseType: !695, size: 256)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !140, line: 1437, size: 256, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !695, file: !140, line: 1438, baseType: !646, size: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !695, file: !140, line: 1439, baseType: !608, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !610, file: !140, line: 3378, baseType: !700, size: 256)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !140, line: 1418, size: 256, elements: !701)
!701 = !{!702, !703, !704}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !700, file: !140, line: 1419, baseType: !646, size: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !700, file: !140, line: 1420, baseType: !534, size: 32, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !700, file: !140, line: 1421, baseType: !705, size: 8, offset: 224)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 8, elements: !586)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !610, file: !140, line: 3379, baseType: !707, size: 320)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !140, line: 1428, size: 320, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !707, file: !140, line: 1429, baseType: !646, size: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !707, file: !140, line: 1430, baseType: !608, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !707, file: !140, line: 1431, baseType: !608, size: 64, offset: 256)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !610, file: !140, line: 3380, baseType: !713, size: 320)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !140, line: 1460, size: 320, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !140, line: 1461, baseType: !646, size: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !713, file: !140, line: 1462, baseType: !717, size: 128, offset: 192)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !718, line: 31, size: 128, elements: !719)
!718 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!719 = !{!720, !723, !724}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !717, file: !718, line: 32, baseType: !721, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !533)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !717, file: !718, line: 33, baseType: !7, size: 32, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !717, file: !718, line: 34, baseType: !7, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !610, file: !140, line: 3381, baseType: !726, size: 384)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !140, line: 2507, size: 384, elements: !727)
!727 = !{!728, !729, !734, !735, !736}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !726, file: !140, line: 2508, baseType: !646, size: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !726, file: !140, line: 2509, baseType: !730, size: 32, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !731, line: 58, baseType: !732)
!731 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !733, line: 44, baseType: !7)
!733 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!734 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !726, file: !140, line: 2510, baseType: !7, size: 32, offset: 224)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !726, file: !140, line: 2511, baseType: !608, size: 64, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !726, file: !140, line: 2512, baseType: !608, size: 64, offset: 320)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !610, file: !140, line: 3382, baseType: !738, size: 896)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !140, line: 2652, size: 896, elements: !739)
!739 = !{!740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !738, file: !140, line: 2653, baseType: !726, size: 384)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !738, file: !140, line: 2654, baseType: !608, size: 64, offset: 384)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !738, file: !140, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !738, file: !140, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !738, file: !140, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !738, file: !140, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !738, file: !140, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !738, file: !140, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !738, file: !140, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !738, file: !140, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !738, file: !140, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !738, file: !140, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !738, file: !140, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !738, file: !140, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !738, file: !140, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !738, file: !140, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !738, file: !140, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !738, file: !140, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !738, file: !140, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !738, file: !140, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !738, file: !140, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !738, file: !140, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !738, file: !140, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !738, file: !140, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !738, file: !140, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !738, file: !140, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !738, file: !140, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !738, file: !140, line: 2703, baseType: !7, size: 32, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !738, file: !140, line: 2705, baseType: !608, size: 64, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !738, file: !140, line: 2706, baseType: !608, size: 64, offset: 640)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !738, file: !140, line: 2707, baseType: !608, size: 64, offset: 704)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !738, file: !140, line: 2708, baseType: !608, size: 64, offset: 768)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !738, file: !140, line: 2711, baseType: !773, size: 64, offset: 832)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !140, line: 2711, flags: DIFlagFwdDecl)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !610, file: !140, line: 3383, baseType: !776, size: 960)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !140, line: 2756, size: 960, elements: !777)
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !140, line: 2757, baseType: !738, size: 896)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !776, file: !140, line: 2758, baseType: !551, size: 64, offset: 896)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !610, file: !140, line: 3384, baseType: !781, size: 1472)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !140, line: 3114, size: 1472, elements: !782)
!782 = !{!783, !804, !805, !806, !807}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !140, line: 3115, baseType: !784, size: 1216)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !140, line: 2984, size: 1216, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !140, line: 2985, baseType: !776, size: 960)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !784, file: !140, line: 2986, baseType: !608, size: 64, offset: 960)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !784, file: !140, line: 2987, baseType: !608, size: 64, offset: 1024)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !784, file: !140, line: 2988, baseType: !608, size: 64, offset: 1088)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !784, file: !140, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !784, file: !140, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !784, file: !140, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !784, file: !140, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !784, file: !140, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !784, file: !140, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !784, file: !140, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !784, file: !140, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !784, file: !140, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !784, file: !140, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !784, file: !140, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !784, file: !140, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !784, file: !140, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !784, file: !140, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !781, file: !140, line: 3117, baseType: !608, size: 64, offset: 1216)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !781, file: !140, line: 3119, baseType: !608, size: 64, offset: 1280)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !781, file: !140, line: 3121, baseType: !608, size: 64, offset: 1344)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !781, file: !140, line: 3123, baseType: !608, size: 64, offset: 1408)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !610, file: !140, line: 3385, baseType: !809, size: 1088)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !140, line: 2874, size: 1088, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !809, file: !140, line: 2875, baseType: !776, size: 960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !809, file: !140, line: 2876, baseType: !551, size: 64, offset: 960)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !809, file: !140, line: 2877, baseType: !814, size: 64, offset: 1024)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !140, line: 2856, flags: DIFlagFwdDecl)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !610, file: !140, line: 3386, baseType: !784, size: 1216)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !610, file: !140, line: 3387, baseType: !818, size: 1280)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !140, line: 3093, size: 1280, elements: !819)
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !818, file: !140, line: 3094, baseType: !784, size: 1216)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !818, file: !140, line: 3095, baseType: !814, size: 64, offset: 1216)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !610, file: !140, line: 3388, baseType: !823, size: 1216)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !140, line: 2824, size: 1216, elements: !824)
!824 = !{!825, !826, !827, !828, !829, !830}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !823, file: !140, line: 2825, baseType: !738, size: 896)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !823, file: !140, line: 2827, baseType: !608, size: 64, offset: 896)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !823, file: !140, line: 2828, baseType: !608, size: 64, offset: 960)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !823, file: !140, line: 2829, baseType: !608, size: 64, offset: 1024)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !823, file: !140, line: 2830, baseType: !608, size: 64, offset: 1088)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !823, file: !140, line: 2831, baseType: !608, size: 64, offset: 1152)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !610, file: !140, line: 3389, baseType: !832, size: 1024)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !140, line: 2850, size: 1024, elements: !833)
!833 = !{!834, !835, !836}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !832, file: !140, line: 2851, baseType: !776, size: 960)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !832, file: !140, line: 2852, baseType: !534, size: 32, offset: 960)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !832, file: !140, line: 2853, baseType: !534, size: 32, offset: 992)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !610, file: !140, line: 3390, baseType: !838, size: 1024)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !140, line: 2857, size: 1024, elements: !839)
!839 = !{!840, !841}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !140, line: 2858, baseType: !776, size: 960)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !838, file: !140, line: 2859, baseType: !814, size: 64, offset: 960)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !610, file: !140, line: 3391, baseType: !843, size: 960)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !140, line: 2862, size: 960, elements: !844)
!844 = !{!845}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !843, file: !140, line: 2863, baseType: !776, size: 960)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !610, file: !140, line: 3392, baseType: !847, size: 1472)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !140, line: 3304, size: 1472, elements: !848)
!848 = !{!849}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !140, line: 3305, baseType: !781, size: 1472)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !610, file: !140, line: 3393, baseType: !851, size: 1792)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !140, line: 3248, size: 1792, elements: !852)
!852 = !{!853, !854, !983, !984, !985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !851, file: !140, line: 3249, baseType: !781, size: 1472)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !851, file: !140, line: 3251, baseType: !855, size: 64, offset: 1472)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !857, line: 463, size: 1152, elements: !858)
!857 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!858 = !{!859, !862, !865, !868, !871, !874, !926, !927, !928, !929, !930, !956, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !856, file: !857, line: 464, baseType: !860, size: 64)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !857, line: 464, flags: DIFlagFwdDecl)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !856, file: !857, line: 467, baseType: !863, size: 64, offset: 64)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !857, line: 467, flags: DIFlagFwdDecl)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !856, file: !857, line: 470, baseType: !866, size: 64, offset: 128)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !552, line: 65, flags: DIFlagFwdDecl)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !856, file: !857, line: 473, baseType: !869, size: 64, offset: 192)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !857, line: 166, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !856, file: !857, line: 476, baseType: !872, size: 64, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !857, line: 476, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !856, file: !857, line: 479, baseType: !875, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !876, line: 144, baseType: !877)
!876 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !876, line: 100, size: 896, elements: !879)
!879 = !{!880, !888, !893, !898, !900, !903, !904, !905, !906, !907, !912, !914, !915, !920, !925}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !878, file: !876, line: 102, baseType: !881, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !876, line: 52, baseType: !882)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DISubroutineType(types: !884)
!884 = !{!885, !886}
!885 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !876, line: 47, baseType: !7)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !878, file: !876, line: 105, baseType: !889, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !876, line: 59, baseType: !890)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DISubroutineType(types: !892)
!892 = !{!534, !886, !886}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !878, file: !876, line: 108, baseType: !894, size: 64, offset: 128)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !876, line: 63, baseType: !895)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DISubroutineType(types: !897)
!897 = !{null, !538}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !878, file: !876, line: 111, baseType: !899, size: 64, offset: 192)
!899 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !878, file: !876, line: 114, baseType: !901, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !902, line: 46, baseType: !661)
!902 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!903 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !878, file: !876, line: 117, baseType: !901, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !878, file: !876, line: 120, baseType: !901, size: 64, offset: 384)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !878, file: !876, line: 124, baseType: !7, size: 32, offset: 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !878, file: !876, line: 128, baseType: !7, size: 32, offset: 480)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !878, file: !876, line: 131, baseType: !908, size: 64, offset: 512)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !876, line: 75, baseType: !909)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!538, !901, !901}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !878, file: !876, line: 132, baseType: !913, size: 64, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !876, line: 78, baseType: !895)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !878, file: !876, line: 135, baseType: !538, size: 64, offset: 640)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !878, file: !876, line: 136, baseType: !916, size: 64, offset: 704)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !876, line: 82, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DISubroutineType(types: !919)
!919 = !{!538, !538, !901, !901}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !878, file: !876, line: 137, baseType: !921, size: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !876, line: 83, baseType: !922)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DISubroutineType(types: !924)
!924 = !{null, !538, !538}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !878, file: !876, line: 141, baseType: !7, size: 32, offset: 832)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !856, file: !857, line: 484, baseType: !608, size: 64, offset: 384)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !856, file: !857, line: 488, baseType: !608, size: 64, offset: 448)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !856, file: !857, line: 493, baseType: !608, size: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !856, file: !857, line: 496, baseType: !608, size: 64, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !856, file: !857, line: 501, baseType: !931, size: 64, offset: 640)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !135, line: 2355, size: 576, elements: !933)
!933 = !{!934, !937, !938, !939, !940, !944, !945, !950, !951, !952, !953, !954, !955}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !932, file: !135, line: 2356, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !135, line: 2356, flags: DIFlagFwdDecl)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !932, file: !135, line: 2357, baseType: !539, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !932, file: !135, line: 2358, baseType: !534, size: 32, offset: 128)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !932, file: !135, line: 2359, baseType: !534, size: 32, offset: 160)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !932, file: !135, line: 2360, baseType: !941, size: 128, offset: 192)
!941 = !DICompositeType(tag: DW_TAG_array_type, baseType: !534, size: 128, elements: !942)
!942 = !{!943}
!943 = !DISubrange(count: 4)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !932, file: !135, line: 2364, baseType: !534, size: 32, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !932, file: !135, line: 2367, baseType: !946, size: 128, offset: 384)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !135, line: 2349, size: 128, elements: !947)
!947 = !{!948, !949}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !946, file: !135, line: 2351, baseType: !551, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !946, file: !135, line: 2352, baseType: !663, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !932, file: !135, line: 2371, baseType: !134, size: 32, offset: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !932, file: !135, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !932, file: !135, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !932, file: !135, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !932, file: !135, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !932, file: !135, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !856, file: !857, line: 504, baseType: !957, size: 64, offset: 704)
!957 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !958, size: 64)
!958 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !857, line: 504, flags: DIFlagFwdDecl)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !856, file: !857, line: 507, baseType: !875, size: 64, offset: 768)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !856, file: !857, line: 510, baseType: !534, size: 32, offset: 832)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !856, file: !857, line: 513, baseType: !534, size: 32, offset: 864)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !856, file: !857, line: 516, baseType: !730, size: 32, offset: 896)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !856, file: !857, line: 519, baseType: !730, size: 32, offset: 928)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !856, file: !857, line: 522, baseType: !7, size: 32, offset: 960)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !856, file: !857, line: 523, baseType: !7, size: 32, offset: 992)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !856, file: !857, line: 528, baseType: !539, size: 64, offset: 1024)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !856, file: !857, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !856, file: !857, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !856, file: !857, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !856, file: !857, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !856, file: !857, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !856, file: !857, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !856, file: !857, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !856, file: !857, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !856, file: !857, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !856, file: !857, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !856, file: !857, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !856, file: !857, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !856, file: !857, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !856, file: !857, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !856, file: !857, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !856, file: !857, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !851, file: !140, line: 3254, baseType: !608, size: 64, offset: 1536)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !851, file: !140, line: 3257, baseType: !608, size: 64, offset: 1600)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !851, file: !140, line: 3258, baseType: !608, size: 64, offset: 1664)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !851, file: !140, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !851, file: !140, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !851, file: !140, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !851, file: !140, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !851, file: !140, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !851, file: !140, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !851, file: !140, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !851, file: !140, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !851, file: !140, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !851, file: !140, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !851, file: !140, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !851, file: !140, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !851, file: !140, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !851, file: !140, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !851, file: !140, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !851, file: !140, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !851, file: !140, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !851, file: !140, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !610, file: !140, line: 3394, baseType: !1005, size: 1344)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !140, line: 2279, size: 1344, elements: !1006)
!1006 = !{!1007, !1008, !1009, !1010, !1011, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1032, !1033, !1034, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1005, file: !140, line: 2280, baseType: !646, size: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1005, file: !140, line: 2281, baseType: !608, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1005, file: !140, line: 2282, baseType: !608, size: 64, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1005, file: !140, line: 2283, baseType: !608, size: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1005, file: !140, line: 2284, baseType: !608, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1005, file: !140, line: 2285, baseType: !7, size: 32, offset: 448)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1005, file: !140, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1005, file: !140, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1005, file: !140, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1005, file: !140, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1005, file: !140, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1005, file: !140, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1005, file: !140, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1005, file: !140, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1005, file: !140, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1005, file: !140, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1005, file: !140, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1005, file: !140, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1005, file: !140, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1005, file: !140, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1005, file: !140, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1005, file: !140, line: 2305, baseType: !7, size: 32, offset: 512)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1005, file: !140, line: 2306, baseType: !1030, size: 32, offset: 544)
!1030 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1031, line: 31, baseType: !534)
!1031 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1005, file: !140, line: 2307, baseType: !608, size: 64, offset: 576)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1005, file: !140, line: 2308, baseType: !608, size: 64, offset: 640)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1005, file: !140, line: 2314, baseType: !1035, size: 64, offset: 704)
!1035 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !140, line: 2309, size: 64, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1035, file: !140, line: 2310, baseType: !534, size: 32)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1035, file: !140, line: 2311, baseType: !539, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1035, file: !140, line: 2312, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !140, line: 2277, flags: DIFlagFwdDecl)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1005, file: !140, line: 2315, baseType: !608, size: 64, offset: 768)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1005, file: !140, line: 2316, baseType: !608, size: 64, offset: 832)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1005, file: !140, line: 2317, baseType: !608, size: 64, offset: 896)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1005, file: !140, line: 2318, baseType: !608, size: 64, offset: 960)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1005, file: !140, line: 2319, baseType: !608, size: 64, offset: 1024)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1005, file: !140, line: 2320, baseType: !608, size: 64, offset: 1088)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1005, file: !140, line: 2321, baseType: !608, size: 64, offset: 1152)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1005, file: !140, line: 2322, baseType: !608, size: 64, offset: 1216)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1005, file: !140, line: 2324, baseType: !1051, size: 64, offset: 1280)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !140, line: 2324, flags: DIFlagFwdDecl)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !610, file: !140, line: 3395, baseType: !1054, size: 320)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !140, line: 1469, size: 320, elements: !1055)
!1055 = !{!1056, !1057, !1058}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1054, file: !140, line: 1470, baseType: !646, size: 192)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1054, file: !140, line: 1471, baseType: !608, size: 64, offset: 192)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1054, file: !140, line: 1472, baseType: !608, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !610, file: !140, line: 3396, baseType: !1060, size: 320)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !140, line: 1482, size: 320, elements: !1061)
!1061 = !{!1062, !1063, !1064}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1060, file: !140, line: 1483, baseType: !646, size: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1060, file: !140, line: 1484, baseType: !534, size: 32, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1060, file: !140, line: 1485, baseType: !1065, size: 64, offset: 256)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !608, size: 64, elements: !586)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !610, file: !140, line: 3397, baseType: !1067, size: 384)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !140, line: 1829, size: 384, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !140, line: 1830, baseType: !646, size: 192)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1067, file: !140, line: 1831, baseType: !730, size: 32, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1067, file: !140, line: 1832, baseType: !608, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1067, file: !140, line: 1835, baseType: !1065, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !610, file: !140, line: 3398, baseType: !1074, size: 704)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !140, line: 1898, size: 704, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1082, !1083, !1086}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1074, file: !140, line: 1899, baseType: !646, size: 192)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1074, file: !140, line: 1902, baseType: !608, size: 64, offset: 192)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1074, file: !140, line: 1905, baseType: !1079, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !552, line: 58, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !552, line: 57, flags: DIFlagFwdDecl)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1074, file: !140, line: 1908, baseType: !7, size: 32, offset: 320)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1074, file: !140, line: 1911, baseType: !1084, size: 64, offset: 384)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !140, line: 1876, flags: DIFlagFwdDecl)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1074, file: !140, line: 1914, baseType: !1087, size: 256, offset: 448)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !140, line: 1883, size: 256, elements: !1088)
!1088 = !{!1089, !1091, !1092, !1097}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1087, file: !140, line: 1884, baseType: !1090, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1087, file: !140, line: 1885, baseType: !1090, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1087, file: !140, line: 1891, baseType: !1093, size: 64, offset: 128)
!1093 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1087, file: !140, line: 1891, size: 64, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1093, file: !140, line: 1891, baseType: !1079, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1093, file: !140, line: 1891, baseType: !608, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1087, file: !140, line: 1892, baseType: !1098, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !610, file: !140, line: 3399, baseType: !1100, size: 704)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !140, line: 2008, size: 704, elements: !1101)
!1101 = !{!1102, !1103, !1104, !1105, !1106, !1107, !1119, !1120, !1121, !1122, !1123}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1100, file: !140, line: 2009, baseType: !646, size: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1100, file: !140, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1100, file: !140, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1100, file: !140, line: 2014, baseType: !730, size: 32, offset: 224)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1100, file: !140, line: 2016, baseType: !608, size: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1100, file: !140, line: 2017, baseType: !1108, size: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !140, line: 183, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !140, line: 183, size: 128, elements: !1111)
!1111 = !{!1112}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1110, file: !140, line: 183, baseType: !1113, size: 128)
!1113 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !140, line: 182, baseType: !1114)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !140, line: 182, size: 128, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1114, file: !140, line: 182, baseType: !7, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1114, file: !140, line: 182, baseType: !7, size: 32, offset: 32)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1114, file: !140, line: 182, baseType: !1065, size: 64, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1100, file: !140, line: 2019, baseType: !608, size: 64, offset: 384)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1100, file: !140, line: 2020, baseType: !608, size: 64, offset: 448)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1100, file: !140, line: 2021, baseType: !608, size: 64, offset: 512)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1100, file: !140, line: 2022, baseType: !608, size: 64, offset: 576)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1100, file: !140, line: 2023, baseType: !608, size: 64, offset: 640)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !610, file: !140, line: 3400, baseType: !1125, size: 832)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !140, line: 2430, size: 832, elements: !1126)
!1126 = !{!1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1125, file: !140, line: 2431, baseType: !646, size: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1125, file: !140, line: 2433, baseType: !608, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1125, file: !140, line: 2434, baseType: !608, size: 64, offset: 256)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1125, file: !140, line: 2435, baseType: !608, size: 64, offset: 320)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1125, file: !140, line: 2436, baseType: !608, size: 64, offset: 384)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1125, file: !140, line: 2437, baseType: !1108, size: 64, offset: 448)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1125, file: !140, line: 2438, baseType: !608, size: 64, offset: 512)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1125, file: !140, line: 2440, baseType: !608, size: 64, offset: 576)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1125, file: !140, line: 2441, baseType: !608, size: 64, offset: 640)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1125, file: !140, line: 2443, baseType: !1137, size: 128, offset: 704)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !140, line: 182, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !140, line: 182, size: 128, elements: !1139)
!1139 = !{!1140}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1138, file: !140, line: 182, baseType: !1113, size: 128)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !610, file: !140, line: 3401, baseType: !1142, size: 320)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !140, line: 3327, size: 320, elements: !1143)
!1143 = !{!1144, !1145, !1152}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !140, line: 3329, baseType: !646, size: 192)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1142, file: !140, line: 3330, baseType: !1146, size: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !140, line: 3320, size: 192, elements: !1148)
!1148 = !{!1149, !1150, !1151}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1147, file: !140, line: 3322, baseType: !1146, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1147, file: !140, line: 3323, baseType: !1146, size: 64, offset: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1147, file: !140, line: 3324, baseType: !608, size: 64, offset: 128)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1142, file: !140, line: 3331, baseType: !1146, size: 64, offset: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !610, file: !140, line: 3402, baseType: !1154, size: 256)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !140, line: 1540, size: 256, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !140, line: 1541, baseType: !646, size: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1154, file: !140, line: 1542, baseType: !1158, size: 64, offset: 192)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !140, line: 1538, baseType: !1160)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !140, line: 1538, size: 192, elements: !1161)
!1161 = !{!1162}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1160, file: !140, line: 1538, baseType: !1163, size: 192)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !140, line: 1537, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !140, line: 1537, size: 192, elements: !1165)
!1165 = !{!1166, !1167, !1168}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1164, file: !140, line: 1537, baseType: !7, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1164, file: !140, line: 1537, baseType: !7, size: 32, offset: 32)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1164, file: !140, line: 1537, baseType: !1169, size: 128, offset: 64)
!1169 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1170, size: 128, elements: !586)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !140, line: 1535, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !140, line: 1532, size: 128, elements: !1172)
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1171, file: !140, line: 1533, baseType: !608, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1171, file: !140, line: 1534, baseType: !608, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !610, file: !140, line: 3403, baseType: !1176, size: 512)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !140, line: 1938, size: 512, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1187, !1189, !1190}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1176, file: !140, line: 1939, baseType: !646, size: 192)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1176, file: !140, line: 1940, baseType: !730, size: 32, offset: 192)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1176, file: !140, line: 1941, baseType: !139, size: 32, offset: 224)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1176, file: !140, line: 1946, baseType: !1182, size: 32, offset: 256)
!1182 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !140, line: 1942, size: 32, elements: !1183)
!1183 = !{!1184, !1185, !1186}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !1182, file: !140, line: 1943, baseType: !158, size: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !1182, file: !140, line: 1944, baseType: !165, size: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !1182, file: !140, line: 1945, baseType: !172, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !1176, file: !140, line: 1950, baseType: !1188, size: 64, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !552, line: 66, baseType: !866)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !1176, file: !140, line: 1951, baseType: !1188, size: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !1176, file: !140, line: 1953, baseType: !1065, size: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !610, file: !140, line: 3404, baseType: !1192, size: 1664)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !140, line: 3337, size: 1664, elements: !1193)
!1193 = !{!1194, !1195}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1192, file: !140, line: 3338, baseType: !646, size: 192)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !1192, file: !140, line: 3341, baseType: !1196, size: 1472, offset: 192)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !1197, line: 410, size: 1472, elements: !1198)
!1197 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !1196, file: !1197, line: 412, baseType: !534, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !1196, file: !1197, line: 413, baseType: !534, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !1196, file: !1197, line: 414, baseType: !534, size: 32, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !1196, file: !1197, line: 415, baseType: !534, size: 32, offset: 96)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !1196, file: !1197, line: 416, baseType: !534, size: 32, offset: 128)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !1196, file: !1197, line: 417, baseType: !534, size: 32, offset: 160)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !1196, file: !1197, line: 418, baseType: !533, size: 8, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !1196, file: !1197, line: 419, baseType: !533, size: 8, offset: 200)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !1196, file: !1197, line: 420, baseType: !1208, size: 8, offset: 208)
!1208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !1196, file: !1197, line: 421, baseType: !1208, size: 8, offset: 216)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !1196, file: !1197, line: 422, baseType: !1208, size: 8, offset: 224)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !1196, file: !1197, line: 423, baseType: !1208, size: 8, offset: 232)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !1196, file: !1197, line: 424, baseType: !1208, size: 8, offset: 240)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !1196, file: !1197, line: 425, baseType: !1208, size: 8, offset: 248)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !1196, file: !1197, line: 426, baseType: !1208, size: 8, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !1196, file: !1197, line: 427, baseType: !1208, size: 8, offset: 264)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !1196, file: !1197, line: 428, baseType: !1208, size: 8, offset: 272)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !1196, file: !1197, line: 429, baseType: !1208, size: 8, offset: 280)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !1196, file: !1197, line: 430, baseType: !1208, size: 8, offset: 288)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !1196, file: !1197, line: 431, baseType: !1208, size: 8, offset: 296)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !1196, file: !1197, line: 432, baseType: !1208, size: 8, offset: 304)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !1196, file: !1197, line: 433, baseType: !1208, size: 8, offset: 312)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !1196, file: !1197, line: 434, baseType: !1208, size: 8, offset: 320)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !1196, file: !1197, line: 435, baseType: !1208, size: 8, offset: 328)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !1196, file: !1197, line: 436, baseType: !1208, size: 8, offset: 336)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !1196, file: !1197, line: 437, baseType: !1208, size: 8, offset: 344)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !1196, file: !1197, line: 438, baseType: !1208, size: 8, offset: 352)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !1196, file: !1197, line: 439, baseType: !1208, size: 8, offset: 360)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !1196, file: !1197, line: 440, baseType: !1208, size: 8, offset: 368)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !1196, file: !1197, line: 441, baseType: !1208, size: 8, offset: 376)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !1196, file: !1197, line: 442, baseType: !1208, size: 8, offset: 384)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !1196, file: !1197, line: 443, baseType: !1208, size: 8, offset: 392)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !1196, file: !1197, line: 444, baseType: !1208, size: 8, offset: 400)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !1196, file: !1197, line: 445, baseType: !1208, size: 8, offset: 408)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !1196, file: !1197, line: 446, baseType: !1208, size: 8, offset: 416)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !1196, file: !1197, line: 447, baseType: !1208, size: 8, offset: 424)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !1196, file: !1197, line: 448, baseType: !1208, size: 8, offset: 432)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !1196, file: !1197, line: 449, baseType: !1208, size: 8, offset: 440)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !1196, file: !1197, line: 450, baseType: !1208, size: 8, offset: 448)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !1196, file: !1197, line: 451, baseType: !1208, size: 8, offset: 456)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !1196, file: !1197, line: 452, baseType: !1208, size: 8, offset: 464)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !1196, file: !1197, line: 453, baseType: !1208, size: 8, offset: 472)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !1196, file: !1197, line: 454, baseType: !1208, size: 8, offset: 480)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !1196, file: !1197, line: 455, baseType: !1208, size: 8, offset: 488)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !1196, file: !1197, line: 456, baseType: !1208, size: 8, offset: 496)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !1196, file: !1197, line: 457, baseType: !1208, size: 8, offset: 504)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !1196, file: !1197, line: 458, baseType: !1208, size: 8, offset: 512)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !1196, file: !1197, line: 459, baseType: !1208, size: 8, offset: 520)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !1196, file: !1197, line: 460, baseType: !1208, size: 8, offset: 528)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !1196, file: !1197, line: 461, baseType: !1208, size: 8, offset: 536)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !1196, file: !1197, line: 462, baseType: !1208, size: 8, offset: 544)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !1196, file: !1197, line: 463, baseType: !1208, size: 8, offset: 552)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !1196, file: !1197, line: 464, baseType: !1208, size: 8, offset: 560)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !1196, file: !1197, line: 465, baseType: !1208, size: 8, offset: 568)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !1196, file: !1197, line: 466, baseType: !1208, size: 8, offset: 576)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !1196, file: !1197, line: 467, baseType: !1208, size: 8, offset: 584)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !1196, file: !1197, line: 468, baseType: !1208, size: 8, offset: 592)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !1196, file: !1197, line: 469, baseType: !1208, size: 8, offset: 600)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !1196, file: !1197, line: 470, baseType: !1208, size: 8, offset: 608)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !1196, file: !1197, line: 471, baseType: !1208, size: 8, offset: 616)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !1196, file: !1197, line: 472, baseType: !1208, size: 8, offset: 624)
