; ModuleID = 'sbitmap.bc'
source_filename = "sbitmap.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!315 = !DIEnumerator(name: "TRY_CATCH_EXPR", value: 130, isUnsigned: true)
!316 = !DIEnumerator(name: "TRY_FINALLY_EXPR", value: 131, isUnsigned: true)
!317 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!318 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!319 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!320 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!321 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!322 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!323 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!324 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!325 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!326 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!327 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!328 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!329 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!330 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!331 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!332 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!333 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!334 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!335 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!336 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!337 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!338 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!339 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!340 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!341 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!342 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!343 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!344 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!345 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!346 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!347 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!348 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!349 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!350 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!351 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!352 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!353 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!354 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!355 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!356 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!357 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!358 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!359 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!360 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!361 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!362 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!363 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!364 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!365 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!366 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!367 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!368 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!369 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!370 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!371 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!372 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!373 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!374 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!375 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!376 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!377 = !{!378, !379, !380, !381, !384, !385, !7, !387, !397, !382, !400}
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !379, size: 64)
!379 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!380 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !386, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !383)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "sbitmap", file: !388, line: 45, baseType: !389)
!388 = !DIFile(filename: "./sbitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "simple_bitmap_def", file: !388, line: 39, size: 192, elements: !391)
!391 = !{!392, !393, !394, !395}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "popcount", scope: !390, file: !388, line: 41, baseType: !378, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "n_bits", scope: !390, file: !388, line: 42, baseType: !7, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !390, file: !388, line: 43, baseType: !7, size: 32, offset: 96)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "elms", scope: !390, file: !388, line: 44, baseType: !396, size: 64, offset: 128)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !397, size: 64, elements: !398)
!397 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!398 = !{!399}
!399 = !DISubrange(count: 1)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!401 = !{!0}
!402 = !DICompositeType(tag: DW_TAG_array_type, baseType: !403, size: 2048, elements: !404)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !379)
!404 = !{!405}
!405 = !DISubrange(count: 256)
!406 = !{i32 2, !"Dwarf Version", i32 4}
!407 = !{i32 2, !"Debug Info Version", i32 3}
!408 = !{i32 1, !"wchar_size", i32 4}
!409 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!410 = distinct !DISubprogram(name: "vprintf", scope: !411, file: !411, line: 39, type: !412, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !422)
!411 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!412 = !DISubroutineType(types: !413)
!413 = !{!380, !414, !415}
!414 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !385)
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !416, file: !3, baseType: !7, size: 32)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !416, file: !3, baseType: !7, size: 32, offset: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !416, file: !3, baseType: !384, size: 64, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !416, file: !3, baseType: !384, size: 64, offset: 128)
!422 = !{!423, !424}
!423 = !DILocalVariable(name: "__fmt", arg: 1, scope: !410, file: !411, line: 39, type: !414)
!424 = !DILocalVariable(name: "__arg", arg: 2, scope: !410, file: !411, line: 39, type: !415)
!425 = !DILocation(line: 0, scope: !410)
!426 = !DILocation(line: 41, column: 20, scope: !410)
!427 = !DILocation(line: 41, column: 10, scope: !410)
!428 = !DILocation(line: 41, column: 3, scope: !410)
!429 = distinct !DISubprogram(name: "getchar", scope: !411, file: !411, line: 47, type: !430, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !432)
!430 = !DISubroutineType(types: !431)
!431 = !{!380}
!432 = !{}
!433 = !DILocation(line: 49, column: 16, scope: !429)
!434 = !DILocation(line: 49, column: 10, scope: !429)
!435 = !DILocation(line: 49, column: 3, scope: !429)
!436 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !411, file: !411, line: 56, type: !437, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !495)
!437 = !DISubroutineType(types: !438)
!438 = !{!380, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !441, line: 7, baseType: !442)
!441 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !443, line: 49, size: 1728, elements: !444)
!443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!444 = !{!445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !460, !462, !463, !464, !468, !470, !472, !474, !477, !479, !482, !485, !486, !487, !490, !491}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !442, file: !443, line: 51, baseType: !380, size: 32)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !442, file: !443, line: 54, baseType: !382, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !442, file: !443, line: 55, baseType: !382, size: 64, offset: 128)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !442, file: !443, line: 56, baseType: !382, size: 64, offset: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !442, file: !443, line: 57, baseType: !382, size: 64, offset: 256)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !442, file: !443, line: 58, baseType: !382, size: 64, offset: 320)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !442, file: !443, line: 59, baseType: !382, size: 64, offset: 384)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !442, file: !443, line: 60, baseType: !382, size: 64, offset: 448)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !442, file: !443, line: 61, baseType: !382, size: 64, offset: 512)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !442, file: !443, line: 64, baseType: !382, size: 64, offset: 576)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !442, file: !443, line: 65, baseType: !382, size: 64, offset: 640)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !442, file: !443, line: 66, baseType: !382, size: 64, offset: 704)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !442, file: !443, line: 68, baseType: !458, size: 64, offset: 768)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !443, line: 36, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !442, file: !443, line: 70, baseType: !461, size: 64, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !442, file: !443, line: 72, baseType: !380, size: 32, offset: 896)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !442, file: !443, line: 73, baseType: !380, size: 32, offset: 928)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !442, file: !443, line: 74, baseType: !465, size: 64, offset: 960)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !466, line: 152, baseType: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!467 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !442, file: !443, line: 77, baseType: !469, size: 16, offset: 1024)
!469 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !442, file: !443, line: 78, baseType: !471, size: 8, offset: 1040)
!471 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !442, file: !443, line: 79, baseType: !473, size: 8, offset: 1048)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 8, elements: !398)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !442, file: !443, line: 81, baseType: !475, size: 64, offset: 1088)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !443, line: 43, baseType: null)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !442, file: !443, line: 89, baseType: !478, size: 64, offset: 1152)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !466, line: 153, baseType: !467)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !442, file: !443, line: 91, baseType: !480, size: 64, offset: 1216)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !443, line: 37, flags: DIFlagFwdDecl)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !442, file: !443, line: 92, baseType: !483, size: 64, offset: 1280)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !443, line: 38, flags: DIFlagFwdDecl)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !442, file: !443, line: 93, baseType: !461, size: 64, offset: 1344)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !442, file: !443, line: 94, baseType: !384, size: 64, offset: 1408)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !442, file: !443, line: 95, baseType: !488, size: 64, offset: 1472)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !489, line: 46, baseType: !397)
!489 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!490 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !442, file: !443, line: 96, baseType: !380, size: 32, offset: 1536)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !442, file: !443, line: 98, baseType: !492, size: 160, offset: 1568)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 160, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 20)
!495 = !{!496}
!496 = !DILocalVariable(name: "__fp", arg: 1, scope: !436, file: !411, line: 56, type: !439)
!497 = !DILocation(line: 0, scope: !436)
!498 = !DILocation(line: 58, column: 10, scope: !436)
!499 = !DILocation(line: 58, column: 3, scope: !436)
!500 = distinct !DISubprogram(name: "getc_unlocked", scope: !411, file: !411, line: 66, type: !437, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !501)
!501 = !{!502}
!502 = !DILocalVariable(name: "__fp", arg: 1, scope: !500, file: !411, line: 66, type: !439)
!503 = !DILocation(line: 0, scope: !500)
!504 = !DILocation(line: 68, column: 10, scope: !500)
!505 = !DILocation(line: 68, column: 3, scope: !500)
!506 = distinct !DISubprogram(name: "getchar_unlocked", scope: !411, file: !411, line: 73, type: !430, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !432)
!507 = !DILocation(line: 75, column: 10, scope: !506)
!508 = !DILocation(line: 75, column: 3, scope: !506)
!509 = distinct !DISubprogram(name: "putchar", scope: !411, file: !411, line: 82, type: !510, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !512)
!510 = !DISubroutineType(types: !511)
!511 = !{!380, !380}
!512 = !{!513}
!513 = !DILocalVariable(name: "__c", arg: 1, scope: !509, file: !411, line: 82, type: !380)
!514 = !DILocation(line: 0, scope: !509)
!515 = !DILocation(line: 84, column: 21, scope: !509)
!516 = !DILocation(line: 84, column: 10, scope: !509)
!517 = !DILocation(line: 84, column: 3, scope: !509)
!518 = distinct !DISubprogram(name: "fputc_unlocked", scope: !411, file: !411, line: 91, type: !519, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !521)
!519 = !DISubroutineType(types: !520)
!520 = !{!380, !380, !439}
!521 = !{!522, !523}
!522 = !DILocalVariable(name: "__c", arg: 1, scope: !518, file: !411, line: 91, type: !380)
!523 = !DILocalVariable(name: "__stream", arg: 2, scope: !518, file: !411, line: 91, type: !439)
!524 = !DILocation(line: 0, scope: !518)
!525 = !DILocation(line: 93, column: 10, scope: !518)
!526 = !DILocation(line: 93, column: 3, scope: !518)
!527 = distinct !DISubprogram(name: "putc_unlocked", scope: !411, file: !411, line: 101, type: !519, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !528)
!528 = !{!529, !530}
!529 = !DILocalVariable(name: "__c", arg: 1, scope: !527, file: !411, line: 101, type: !380)
!530 = !DILocalVariable(name: "__stream", arg: 2, scope: !527, file: !411, line: 101, type: !439)
!531 = !DILocation(line: 0, scope: !527)
!532 = !DILocation(line: 103, column: 10, scope: !527)
!533 = !DILocation(line: 103, column: 3, scope: !527)
!534 = distinct !DISubprogram(name: "putchar_unlocked", scope: !411, file: !411, line: 108, type: !510, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !535)
!535 = !{!536}
!536 = !DILocalVariable(name: "__c", arg: 1, scope: !534, file: !411, line: 108, type: !380)
!537 = !DILocation(line: 0, scope: !534)
!538 = !DILocation(line: 110, column: 10, scope: !534)
!539 = !DILocation(line: 110, column: 3, scope: !534)
!540 = distinct !DISubprogram(name: "getline", scope: !411, file: !411, line: 118, type: !541, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !545)
!541 = !DISubroutineType(types: !542)
!542 = !{!543, !381, !544, !439}
!543 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !466, line: 193, baseType: !467)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!545 = !{!546, !547, !548}
!546 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !540, file: !411, line: 118, type: !381)
!547 = !DILocalVariable(name: "__n", arg: 2, scope: !540, file: !411, line: 118, type: !544)
!548 = !DILocalVariable(name: "__stream", arg: 3, scope: !540, file: !411, line: 118, type: !439)
!549 = !DILocation(line: 0, scope: !540)
!550 = !DILocation(line: 120, column: 10, scope: !540)
!551 = !DILocation(line: 120, column: 3, scope: !540)
!552 = distinct !DISubprogram(name: "feof_unlocked", scope: !411, file: !411, line: 128, type: !437, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !553)
!553 = !{!554}
!554 = !DILocalVariable(name: "__stream", arg: 1, scope: !552, file: !411, line: 128, type: !439)
!555 = !DILocation(line: 0, scope: !552)
!556 = !DILocation(line: 130, column: 10, scope: !552)
!557 = !DILocation(line: 130, column: 3, scope: !552)
!558 = distinct !DISubprogram(name: "ferror_unlocked", scope: !411, file: !411, line: 135, type: !437, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !559)
!559 = !{!560}
!560 = !DILocalVariable(name: "__stream", arg: 1, scope: !558, file: !411, line: 135, type: !439)
!561 = !DILocation(line: 0, scope: !558)
!562 = !DILocation(line: 137, column: 10, scope: !558)
!563 = !DILocation(line: 137, column: 3, scope: !558)
!564 = distinct !DISubprogram(name: "tolower", scope: !565, file: !565, line: 207, type: !510, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !566)
!565 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!566 = !{!567}
!567 = !DILocalVariable(name: "__c", arg: 1, scope: !564, file: !565, line: 207, type: !380)
!568 = !DILocation(line: 0, scope: !564)
!569 = !DILocation(line: 209, column: 22, scope: !564)
!570 = !DILocation(line: 209, column: 39, scope: !564)
!571 = !DILocation(line: 209, column: 38, scope: !564)
!572 = !DILocation(line: 209, column: 37, scope: !564)
!573 = !DILocation(line: 209, column: 10, scope: !564)
!574 = !DILocation(line: 209, column: 3, scope: !564)
!575 = distinct !DISubprogram(name: "toupper", scope: !565, file: !565, line: 213, type: !510, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !576)
!576 = !{!577}
!577 = !DILocalVariable(name: "__c", arg: 1, scope: !575, file: !565, line: 213, type: !380)
!578 = !DILocation(line: 0, scope: !575)
!579 = !DILocation(line: 215, column: 22, scope: !575)
!580 = !DILocation(line: 215, column: 39, scope: !575)
!581 = !DILocation(line: 215, column: 38, scope: !575)
!582 = !DILocation(line: 215, column: 37, scope: !575)
!583 = !DILocation(line: 215, column: 10, scope: !575)
!584 = !DILocation(line: 215, column: 3, scope: !575)
!585 = distinct !DISubprogram(name: "atoi", scope: !586, file: !586, line: 361, type: !587, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !589)
!586 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!587 = !DISubroutineType(types: !588)
!588 = !{!380, !385}
!589 = !{!590}
!590 = !DILocalVariable(name: "__nptr", arg: 1, scope: !585, file: !586, line: 361, type: !385)
!591 = !DILocation(line: 0, scope: !585)
!592 = !DILocation(line: 363, column: 16, scope: !585)
!593 = !DILocation(line: 363, column: 10, scope: !585)
!594 = !DILocation(line: 363, column: 3, scope: !585)
!595 = distinct !DISubprogram(name: "atol", scope: !586, file: !586, line: 366, type: !596, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !598)
!596 = !DISubroutineType(types: !597)
!597 = !{!467, !385}
!598 = !{!599}
!599 = !DILocalVariable(name: "__nptr", arg: 1, scope: !595, file: !586, line: 366, type: !385)
!600 = !DILocation(line: 0, scope: !595)
!601 = !DILocation(line: 368, column: 10, scope: !595)
!602 = !DILocation(line: 368, column: 3, scope: !595)
!603 = distinct !DISubprogram(name: "atoll", scope: !586, file: !586, line: 373, type: !604, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !607)
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !385}
!606 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!607 = !{!608}
!608 = !DILocalVariable(name: "__nptr", arg: 1, scope: !603, file: !586, line: 373, type: !385)
!609 = !DILocation(line: 0, scope: !603)
!610 = !DILocation(line: 375, column: 10, scope: !603)
!611 = !DILocation(line: 375, column: 3, scope: !603)
!612 = distinct !DISubprogram(name: "bsearch", scope: !613, file: !613, line: 20, type: !614, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !622)
!613 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!614 = !DISubroutineType(types: !615)
!615 = !{!384, !616, !616, !488, !488, !618}
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !586, line: 808, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!380, !616, !616}
!622 = !{!623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!623 = !DILocalVariable(name: "__key", arg: 1, scope: !612, file: !613, line: 20, type: !616)
!624 = !DILocalVariable(name: "__base", arg: 2, scope: !612, file: !613, line: 20, type: !616)
!625 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !612, file: !613, line: 20, type: !488)
!626 = !DILocalVariable(name: "__size", arg: 4, scope: !612, file: !613, line: 20, type: !488)
!627 = !DILocalVariable(name: "__compar", arg: 5, scope: !612, file: !613, line: 21, type: !618)
!628 = !DILocalVariable(name: "__l", scope: !612, file: !613, line: 23, type: !488)
!629 = !DILocalVariable(name: "__u", scope: !612, file: !613, line: 23, type: !488)
!630 = !DILocalVariable(name: "__idx", scope: !612, file: !613, line: 23, type: !488)
!631 = !DILocalVariable(name: "__p", scope: !612, file: !613, line: 24, type: !616)
!632 = !DILocalVariable(name: "__comparison", scope: !612, file: !613, line: 25, type: !380)
!633 = !DILocation(line: 0, scope: !612)
!634 = !DILocation(line: 29, column: 3, scope: !612)
!635 = !DILocation(line: 27, column: 7, scope: !612)
!636 = !DILocation(line: 29, column: 14, scope: !612)
!637 = !DILocation(line: 31, column: 20, scope: !638)
!638 = distinct !DILexicalBlock(scope: !612, file: !613, line: 30, column: 5)
!639 = !DILocation(line: 31, column: 27, scope: !638)
!640 = !DILocation(line: 32, column: 56, scope: !638)
!641 = !DILocation(line: 32, column: 47, scope: !638)
!642 = !DILocation(line: 33, column: 22, scope: !638)
!643 = !DILocation(line: 34, column: 24, scope: !644)
!644 = distinct !DILexicalBlock(scope: !638, file: !613, line: 34, column: 11)
!645 = !DILocation(line: 34, column: 11, scope: !638)
!646 = !DILocation(line: 36, column: 29, scope: !647)
!647 = distinct !DILexicalBlock(scope: !644, file: !613, line: 36, column: 16)
!648 = !DILocation(line: 36, column: 16, scope: !644)
!649 = !DILocation(line: 37, column: 14, scope: !647)
!650 = distinct !{!650, !634, !651}
!651 = !DILocation(line: 40, column: 5, scope: !612)
!652 = !DILocation(line: 43, column: 1, scope: !612)
!653 = distinct !DISubprogram(name: "atof", scope: !654, file: !654, line: 25, type: !655, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !658)
!654 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!655 = !DISubroutineType(types: !656)
!656 = !{!657, !385}
!657 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!658 = !{!659}
!659 = !DILocalVariable(name: "__nptr", arg: 1, scope: !653, file: !654, line: 25, type: !385)
!660 = !DILocation(line: 0, scope: !653)
!661 = !DILocation(line: 27, column: 10, scope: !653)
!662 = !DILocation(line: 27, column: 3, scope: !653)
!663 = distinct !DISubprogram(name: "strtoimax", scope: !664, file: !664, line: 324, type: !665, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !671)
!664 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !414, !670, !380}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !668, line: 101, baseType: !669)
!668 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !466, line: 72, baseType: !467)
!670 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !381)
!671 = !{!672, !673, !674}
!672 = !DILocalVariable(name: "nptr", arg: 1, scope: !663, file: !664, line: 324, type: !414)
!673 = !DILocalVariable(name: "endptr", arg: 2, scope: !663, file: !664, line: 324, type: !670)
!674 = !DILocalVariable(name: "base", arg: 3, scope: !663, file: !664, line: 324, type: !380)
!675 = !DILocation(line: 0, scope: !663)
!676 = !DILocation(line: 327, column: 10, scope: !663)
!677 = !DILocation(line: 327, column: 3, scope: !663)
!678 = distinct !DISubprogram(name: "strtoumax", scope: !664, file: !664, line: 336, type: !679, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !683)
!679 = !DISubroutineType(types: !680)
!680 = !{!681, !414, !670, !380}
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !668, line: 102, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !466, line: 73, baseType: !397)
!683 = !{!684, !685, !686}
!684 = !DILocalVariable(name: "nptr", arg: 1, scope: !678, file: !664, line: 336, type: !414)
!685 = !DILocalVariable(name: "endptr", arg: 2, scope: !678, file: !664, line: 336, type: !670)
!686 = !DILocalVariable(name: "base", arg: 3, scope: !678, file: !664, line: 336, type: !380)
!687 = !DILocation(line: 0, scope: !678)
!688 = !DILocation(line: 339, column: 10, scope: !678)
!689 = !DILocation(line: 339, column: 3, scope: !678)
!690 = distinct !DISubprogram(name: "wcstoimax", scope: !664, file: !664, line: 348, type: !691, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !700)
!691 = !DISubroutineType(types: !692)
!692 = !{!667, !693, !697, !380}
!693 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !664, line: 34, baseType: !380)
!697 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!700 = !{!701, !702, !703}
!701 = !DILocalVariable(name: "nptr", arg: 1, scope: !690, file: !664, line: 348, type: !693)
!702 = !DILocalVariable(name: "endptr", arg: 2, scope: !690, file: !664, line: 348, type: !697)
!703 = !DILocalVariable(name: "base", arg: 3, scope: !690, file: !664, line: 348, type: !380)
!704 = !DILocation(line: 0, scope: !690)
!705 = !DILocation(line: 351, column: 10, scope: !690)
!706 = !DILocation(line: 351, column: 3, scope: !690)
!707 = distinct !DISubprogram(name: "wcstoumax", scope: !664, file: !664, line: 362, type: !708, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !710)
!708 = !DISubroutineType(types: !709)
!709 = !{!681, !693, !697, !380}
!710 = !{!711, !712, !713}
!711 = !DILocalVariable(name: "nptr", arg: 1, scope: !707, file: !664, line: 362, type: !693)
!712 = !DILocalVariable(name: "endptr", arg: 2, scope: !707, file: !664, line: 362, type: !697)
!713 = !DILocalVariable(name: "base", arg: 3, scope: !707, file: !664, line: 362, type: !380)
!714 = !DILocation(line: 0, scope: !707)
!715 = !DILocation(line: 365, column: 10, scope: !707)
!716 = !DILocation(line: 365, column: 3, scope: !707)
!717 = distinct !DISubprogram(name: "stat", scope: !718, file: !718, line: 453, type: !719, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !758)
!718 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!719 = !DISubroutineType(types: !720)
!720 = !{!380, !385, !721}
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !723, line: 46, size: 1152, elements: !724)
!723 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!724 = !{!725, !727, !729, !731, !733, !735, !737, !738, !739, !740, !742, !744, !752, !753, !754}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !722, file: !723, line: 48, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !466, line: 145, baseType: !397)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !722, file: !723, line: 53, baseType: !728, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !466, line: 148, baseType: !397)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !722, file: !723, line: 61, baseType: !730, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !466, line: 151, baseType: !397)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !722, file: !723, line: 62, baseType: !732, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !466, line: 150, baseType: !7)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !722, file: !723, line: 64, baseType: !734, size: 32, offset: 224)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !466, line: 146, baseType: !7)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !722, file: !723, line: 65, baseType: !736, size: 32, offset: 256)
!736 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !466, line: 147, baseType: !7)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !722, file: !723, line: 67, baseType: !380, size: 32, offset: 288)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !722, file: !723, line: 69, baseType: !726, size: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !722, file: !723, line: 74, baseType: !465, size: 64, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !722, file: !723, line: 78, baseType: !741, size: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !466, line: 174, baseType: !467)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !722, file: !723, line: 80, baseType: !743, size: 64, offset: 512)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !466, line: 179, baseType: !467)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !722, file: !723, line: 91, baseType: !745, size: 128, offset: 576)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !746, line: 10, size: 128, elements: !747)
!746 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!747 = !{!748, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !745, file: !746, line: 12, baseType: !749, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !466, line: 160, baseType: !467)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !745, file: !746, line: 16, baseType: !751, size: 64, offset: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !466, line: 196, baseType: !467)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !722, file: !723, line: 92, baseType: !745, size: 128, offset: 704)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !722, file: !723, line: 93, baseType: !745, size: 128, offset: 832)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !722, file: !723, line: 106, baseType: !755, size: 192, offset: 960)
!755 = !DICompositeType(tag: DW_TAG_array_type, baseType: !751, size: 192, elements: !756)
!756 = !{!757}
!757 = !DISubrange(count: 3)
!758 = !{!759, !760}
!759 = !DILocalVariable(name: "__path", arg: 1, scope: !717, file: !718, line: 453, type: !385)
!760 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !717, file: !718, line: 453, type: !721)
!761 = !DILocation(line: 0, scope: !717)
!762 = !DILocation(line: 455, column: 10, scope: !717)
!763 = !DILocation(line: 455, column: 3, scope: !717)
!764 = distinct !DISubprogram(name: "lstat", scope: !718, file: !718, line: 460, type: !719, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !765)
!765 = !{!766, !767}
!766 = !DILocalVariable(name: "__path", arg: 1, scope: !764, file: !718, line: 460, type: !385)
!767 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !764, file: !718, line: 460, type: !721)
!768 = !DILocation(line: 0, scope: !764)
!769 = !DILocation(line: 462, column: 10, scope: !764)
!770 = !DILocation(line: 462, column: 3, scope: !764)
!771 = distinct !DISubprogram(name: "fstat", scope: !718, file: !718, line: 467, type: !772, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !774)
!772 = !DISubroutineType(types: !773)
!773 = !{!380, !380, !721}
!774 = !{!775, !776}
!775 = !DILocalVariable(name: "__fd", arg: 1, scope: !771, file: !718, line: 467, type: !380)
!776 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !771, file: !718, line: 467, type: !721)
!777 = !DILocation(line: 0, scope: !771)
!778 = !DILocation(line: 469, column: 10, scope: !771)
!779 = !DILocation(line: 469, column: 3, scope: !771)
!780 = distinct !DISubprogram(name: "fstatat", scope: !718, file: !718, line: 474, type: !781, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !783)
!781 = !DISubroutineType(types: !782)
!782 = !{!380, !380, !385, !721, !380}
!783 = !{!784, !785, !786, !787}
!784 = !DILocalVariable(name: "__fd", arg: 1, scope: !780, file: !718, line: 474, type: !380)
!785 = !DILocalVariable(name: "__filename", arg: 2, scope: !780, file: !718, line: 474, type: !385)
!786 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !780, file: !718, line: 474, type: !721)
!787 = !DILocalVariable(name: "__flag", arg: 4, scope: !780, file: !718, line: 474, type: !380)
!788 = !DILocation(line: 0, scope: !780)
!789 = !DILocation(line: 477, column: 10, scope: !780)
!790 = !DILocation(line: 477, column: 3, scope: !780)
!791 = distinct !DISubprogram(name: "mknod", scope: !718, file: !718, line: 483, type: !792, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !794)
!792 = !DISubroutineType(types: !793)
!793 = !{!380, !385, !732, !726}
!794 = !{!795, !796, !797}
!795 = !DILocalVariable(name: "__path", arg: 1, scope: !791, file: !718, line: 483, type: !385)
!796 = !DILocalVariable(name: "__mode", arg: 2, scope: !791, file: !718, line: 483, type: !732)
!797 = !DILocalVariable(name: "__dev", arg: 3, scope: !791, file: !718, line: 483, type: !726)
!798 = !DILocation(line: 0, scope: !791)
!799 = !DILocation(line: 485, column: 10, scope: !791)
!800 = !DILocation(line: 485, column: 3, scope: !791)
!801 = distinct !DISubprogram(name: "mknodat", scope: !718, file: !718, line: 491, type: !802, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !804)
!802 = !DISubroutineType(types: !803)
!803 = !{!380, !380, !385, !732, !726}
!804 = !{!805, !806, !807, !808}
!805 = !DILocalVariable(name: "__fd", arg: 1, scope: !801, file: !718, line: 491, type: !380)
!806 = !DILocalVariable(name: "__path", arg: 2, scope: !801, file: !718, line: 491, type: !385)
!807 = !DILocalVariable(name: "__mode", arg: 3, scope: !801, file: !718, line: 491, type: !732)
!808 = !DILocalVariable(name: "__dev", arg: 4, scope: !801, file: !718, line: 491, type: !726)
!809 = !DILocation(line: 0, scope: !801)
!810 = !DILocation(line: 494, column: 10, scope: !801)
!811 = !DILocation(line: 494, column: 3, scope: !801)
!812 = distinct !DISubprogram(name: "stat64", scope: !718, file: !718, line: 502, type: !813, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !835)
!813 = !DISubroutineType(types: !814)
!814 = !{!380, !385, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !723, line: 119, size: 1152, elements: !817)
!817 = !{!818, !819, !821, !822, !823, !824, !825, !826, !827, !828, !829, !831, !832, !833, !834}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !816, file: !723, line: 121, baseType: !726, size: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !816, file: !723, line: 123, baseType: !820, size: 64, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !466, line: 149, baseType: !397)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !816, file: !723, line: 124, baseType: !730, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !816, file: !723, line: 125, baseType: !732, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !816, file: !723, line: 132, baseType: !734, size: 32, offset: 224)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !816, file: !723, line: 133, baseType: !736, size: 32, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !816, file: !723, line: 135, baseType: !380, size: 32, offset: 288)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !816, file: !723, line: 136, baseType: !726, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !816, file: !723, line: 137, baseType: !465, size: 64, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !816, file: !723, line: 143, baseType: !741, size: 64, offset: 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !816, file: !723, line: 144, baseType: !830, size: 64, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !466, line: 180, baseType: !467)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !816, file: !723, line: 152, baseType: !745, size: 128, offset: 576)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !816, file: !723, line: 153, baseType: !745, size: 128, offset: 704)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !816, file: !723, line: 154, baseType: !745, size: 128, offset: 832)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !816, file: !723, line: 164, baseType: !755, size: 192, offset: 960)
!835 = !{!836, !837}
!836 = !DILocalVariable(name: "__path", arg: 1, scope: !812, file: !718, line: 502, type: !385)
!837 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !812, file: !718, line: 502, type: !815)
!838 = !DILocation(line: 0, scope: !812)
!839 = !DILocation(line: 504, column: 10, scope: !812)
!840 = !DILocation(line: 504, column: 3, scope: !812)
!841 = distinct !DISubprogram(name: "lstat64", scope: !718, file: !718, line: 509, type: !813, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !842)
!842 = !{!843, !844}
!843 = !DILocalVariable(name: "__path", arg: 1, scope: !841, file: !718, line: 509, type: !385)
!844 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !841, file: !718, line: 509, type: !815)
!845 = !DILocation(line: 0, scope: !841)
!846 = !DILocation(line: 511, column: 10, scope: !841)
!847 = !DILocation(line: 511, column: 3, scope: !841)
!848 = distinct !DISubprogram(name: "fstat64", scope: !718, file: !718, line: 516, type: !849, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !851)
!849 = !DISubroutineType(types: !850)
!850 = !{!380, !380, !815}
!851 = !{!852, !853}
!852 = !DILocalVariable(name: "__fd", arg: 1, scope: !848, file: !718, line: 516, type: !380)
!853 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !848, file: !718, line: 516, type: !815)
!854 = !DILocation(line: 0, scope: !848)
!855 = !DILocation(line: 518, column: 10, scope: !848)
!856 = !DILocation(line: 518, column: 3, scope: !848)
!857 = distinct !DISubprogram(name: "fstatat64", scope: !718, file: !718, line: 523, type: !858, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !860)
!858 = !DISubroutineType(types: !859)
!859 = !{!380, !380, !385, !815, !380}
!860 = !{!861, !862, !863, !864}
!861 = !DILocalVariable(name: "__fd", arg: 1, scope: !857, file: !718, line: 523, type: !380)
!862 = !DILocalVariable(name: "__filename", arg: 2, scope: !857, file: !718, line: 523, type: !385)
!863 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !857, file: !718, line: 523, type: !815)
!864 = !DILocalVariable(name: "__flag", arg: 4, scope: !857, file: !718, line: 523, type: !380)
!865 = !DILocation(line: 0, scope: !857)
!866 = !DILocation(line: 526, column: 10, scope: !857)
!867 = !DILocation(line: 526, column: 3, scope: !857)
!868 = distinct !DISubprogram(name: "sbitmap_alloc", scope: !3, file: !3, line: 73, type: !869, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !871)
!869 = !DISubroutineType(types: !870)
!870 = !{!387, !7}
!871 = !{!872, !873, !874, !875, !876}
!872 = !DILocalVariable(name: "n_elms", arg: 1, scope: !868, file: !3, line: 73, type: !7)
!873 = !DILocalVariable(name: "bytes", scope: !868, file: !3, line: 75, type: !7)
!874 = !DILocalVariable(name: "size", scope: !868, file: !3, line: 75, type: !7)
!875 = !DILocalVariable(name: "amt", scope: !868, file: !3, line: 75, type: !7)
!876 = !DILocalVariable(name: "bmap", scope: !868, file: !3, line: 76, type: !387)
!877 = !DILocation(line: 0, scope: !868)
!878 = !DILocation(line: 78, column: 10, scope: !868)
!879 = !DILocation(line: 79, column: 16, scope: !868)
!880 = !DILocation(line: 81, column: 11, scope: !868)
!881 = !DILocation(line: 82, column: 29, scope: !868)
!882 = !DILocation(line: 82, column: 20, scope: !868)
!883 = !DILocation(line: 82, column: 10, scope: !868)
!884 = !DILocation(line: 83, column: 9, scope: !868)
!885 = !DILocation(line: 83, column: 16, scope: !868)
!886 = !DILocation(line: 84, column: 9, scope: !868)
!887 = !DILocation(line: 84, column: 14, scope: !868)
!888 = !DILocation(line: 85, column: 9, scope: !868)
!889 = !DILocation(line: 85, column: 18, scope: !868)
!890 = !DILocation(line: 86, column: 3, scope: !868)
!891 = distinct !DISubprogram(name: "sbitmap_alloc_with_popcount", scope: !3, file: !3, line: 92, type: !869, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !892)
!892 = !{!893, !894}
!893 = !DILocalVariable(name: "n_elms", arg: 1, scope: !891, file: !3, line: 92, type: !7)
!894 = !DILocalVariable(name: "bmap", scope: !891, file: !3, line: 94, type: !895)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !387)
!896 = !DILocation(line: 0, scope: !891)
!897 = !DILocation(line: 94, column: 24, scope: !891)
!898 = !DILocation(line: 95, column: 20, scope: !891)
!899 = !DILocation(line: 95, column: 9, scope: !891)
!900 = !DILocation(line: 95, column: 18, scope: !891)
!901 = !DILocation(line: 96, column: 3, scope: !891)
!902 = distinct !DISubprogram(name: "sbitmap_resize", scope: !3, file: !3, line: 104, type: !903, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !905)
!903 = !DISubroutineType(types: !904)
!904 = !{!387, !387, !7, !380}
!905 = !{!906, !907, !908, !909, !910, !911, !912}
!906 = !DILocalVariable(name: "bmap", arg: 1, scope: !902, file: !3, line: 104, type: !387)
!907 = !DILocalVariable(name: "n_elms", arg: 2, scope: !902, file: !3, line: 104, type: !7)
!908 = !DILocalVariable(name: "def", arg: 3, scope: !902, file: !3, line: 104, type: !380)
!909 = !DILocalVariable(name: "bytes", scope: !902, file: !3, line: 106, type: !7)
!910 = !DILocalVariable(name: "size", scope: !902, file: !3, line: 106, type: !7)
!911 = !DILocalVariable(name: "amt", scope: !902, file: !3, line: 106, type: !7)
!912 = !DILocalVariable(name: "last_bit", scope: !902, file: !3, line: 107, type: !7)
!913 = !DILocation(line: 0, scope: !902)
!914 = !DILocation(line: 109, column: 10, scope: !902)
!915 = !DILocation(line: 110, column: 16, scope: !902)
!916 = !DILocation(line: 111, column: 7, scope: !917)
!917 = distinct !DILexicalBlock(scope: !902, file: !3, line: 111, column: 7)
!918 = !DILocation(line: 111, column: 15, scope: !917)
!919 = !DILocation(line: 111, column: 13, scope: !917)
!920 = !DILocation(line: 111, column: 7, scope: !902)
!921 = !DILocation(line: 114, column: 14, scope: !922)
!922 = distinct !DILexicalBlock(scope: !917, file: !3, line: 112, column: 5)
!923 = !DILocation(line: 115, column: 34, scope: !922)
!924 = !DILocation(line: 115, column: 40, scope: !922)
!925 = !DILocation(line: 115, column: 24, scope: !922)
!926 = !DILocation(line: 115, column: 14, scope: !922)
!927 = !DILocation(line: 116, column: 17, scope: !928)
!928 = distinct !DILexicalBlock(scope: !922, file: !3, line: 116, column: 11)
!929 = !DILocation(line: 116, column: 11, scope: !928)
!930 = !DILocation(line: 116, column: 11, scope: !922)
!931 = !DILocation(line: 117, column: 19, scope: !928)
!932 = !DILocation(line: 117, column: 17, scope: !928)
!933 = !DILocation(line: 117, column: 2, scope: !928)
!934 = !DILocation(line: 120, column: 22, scope: !935)
!935 = distinct !DILexicalBlock(scope: !902, file: !3, line: 120, column: 7)
!936 = !DILocation(line: 120, column: 14, scope: !935)
!937 = !DILocation(line: 120, column: 7, scope: !902)
!938 = !DILocation(line: 122, column: 11, scope: !939)
!939 = distinct !DILexicalBlock(scope: !940, file: !3, line: 122, column: 11)
!940 = distinct !DILexicalBlock(scope: !935, file: !3, line: 121, column: 5)
!941 = !DILocation(line: 0, scope: !939)
!942 = !DILocation(line: 122, column: 11, scope: !940)
!943 = !DILocation(line: 124, column: 4, scope: !944)
!944 = distinct !DILexicalBlock(scope: !939, file: !3, line: 123, column: 2)
!945 = !DILocation(line: 128, column: 21, scope: !944)
!946 = !DILocation(line: 128, column: 28, scope: !944)
!947 = !DILocation(line: 129, column: 8, scope: !948)
!948 = distinct !DILexicalBlock(scope: !944, file: !3, line: 129, column: 8)
!949 = !DILocation(line: 129, column: 8, scope: !944)
!950 = !DILocation(line: 131, column: 55, scope: !948)
!951 = !DILocation(line: 131, column: 34, scope: !948)
!952 = !DILocation(line: 131, column: 11, scope: !948)
!953 = !DILocation(line: 130, column: 23, scope: !948)
!954 = !DILocation(line: 130, column: 28, scope: !948)
!955 = !DILocation(line: 130, column: 6, scope: !948)
!956 = !DILocation(line: 131, column: 8, scope: !948)
!957 = !DILocation(line: 134, column: 22, scope: !944)
!958 = !DILocation(line: 135, column: 8, scope: !959)
!959 = distinct !DILexicalBlock(scope: !944, file: !3, line: 135, column: 8)
!960 = !DILocation(line: 135, column: 8, scope: !944)
!961 = !DILocation(line: 137, column: 53, scope: !959)
!962 = !DILocation(line: 137, column: 32, scope: !959)
!963 = !DILocation(line: 136, column: 22, scope: !959)
!964 = !DILocation(line: 136, column: 6, scope: !959)
!965 = !DILocation(line: 137, column: 8, scope: !959)
!966 = !DILocation(line: 141, column: 4, scope: !967)
!967 = distinct !DILexicalBlock(scope: !939, file: !3, line: 140, column: 2)
!968 = !DILocation(line: 143, column: 14, scope: !969)
!969 = distinct !DILexicalBlock(scope: !967, file: !3, line: 143, column: 8)
!970 = !DILocation(line: 143, column: 8, scope: !969)
!971 = !DILocation(line: 143, column: 8, scope: !967)
!972 = !DILocation(line: 144, column: 37, scope: !969)
!973 = !DILocation(line: 144, column: 29, scope: !969)
!974 = !DILocation(line: 145, column: 8, scope: !969)
!975 = !DILocation(line: 146, column: 7, scope: !969)
!976 = !DILocation(line: 144, column: 6, scope: !969)
!977 = !DILocation(line: 150, column: 19, scope: !978)
!978 = distinct !DILexicalBlock(scope: !935, file: !3, line: 150, column: 12)
!979 = !DILocation(line: 150, column: 12, scope: !935)
!980 = !DILocation(line: 153, column: 25, scope: !981)
!981 = distinct !DILexicalBlock(scope: !978, file: !3, line: 151, column: 5)
!982 = !DILocation(line: 154, column: 11, scope: !983)
!983 = distinct !DILexicalBlock(scope: !981, file: !3, line: 154, column: 11)
!984 = !DILocation(line: 154, column: 11, scope: !981)
!985 = !DILocation(line: 157, column: 51, scope: !986)
!986 = distinct !DILexicalBlock(scope: !983, file: !3, line: 155, column: 2)
!987 = !DILocation(line: 157, column: 30, scope: !986)
!988 = !DILocation(line: 156, column: 20, scope: !986)
!989 = !DILocation(line: 156, column: 4, scope: !986)
!990 = !DILocation(line: 157, column: 6, scope: !986)
!991 = !DILocation(line: 158, column: 14, scope: !992)
!992 = distinct !DILexicalBlock(scope: !986, file: !3, line: 158, column: 8)
!993 = !DILocation(line: 158, column: 8, scope: !992)
!994 = !DILocation(line: 158, column: 8, scope: !986)
!995 = !DILocation(line: 159, column: 33, scope: !992)
!996 = !DILocation(line: 159, column: 12, scope: !992)
!997 = !DILocation(line: 159, column: 6, scope: !992)
!998 = !DILocation(line: 159, column: 31, scope: !992)
!999 = !DILocation(line: 163, column: 16, scope: !902)
!1000 = !DILocation(line: 164, column: 9, scope: !902)
!1001 = !DILocation(line: 164, column: 14, scope: !902)
!1002 = !DILocation(line: 165, column: 3, scope: !902)
!1003 = distinct !DISubprogram(name: "sbitmap_elt_popcount", scope: !3, file: !3, line: 1038, type: !1004, scopeLine: 1039, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1006)
!1004 = !DISubroutineType(types: !1005)
!1005 = !{!397, !397}
!1006 = !{!1007, !1008, !1009}
!1007 = !DILocalVariable(name: "a", arg: 1, scope: !1003, file: !3, line: 1038, type: !397)
!1008 = !DILocalVariable(name: "ret", scope: !1003, file: !3, line: 1040, type: !397)
!1009 = !DILocalVariable(name: "i", scope: !1003, file: !3, line: 1041, type: !7)
!1010 = !DILocation(line: 0, scope: !1003)
!1011 = !DILocation(line: 1043, column: 9, scope: !1012)
!1012 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 1043, column: 7)
!1013 = !DILocation(line: 1043, column: 7, scope: !1003)
!1014 = !DILocation(line: 1047, column: 3, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1003, file: !3, line: 1047, column: 3)
!1016 = !DILocation(line: 0, scope: !1015)
!1017 = !DILocation(line: 1047, column: 17, scope: !1018)
!1018 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 1047, column: 3)
!1019 = !DILocation(line: 1048, column: 30, scope: !1018)
!1020 = !DILocation(line: 1048, column: 36, scope: !1018)
!1021 = !DILocation(line: 1048, column: 12, scope: !1018)
!1022 = !DILocation(line: 1048, column: 9, scope: !1018)
!1023 = !DILocation(line: 1047, column: 39, scope: !1018)
!1024 = !DILocation(line: 1047, column: 3, scope: !1018)
!1025 = distinct !{!1025, !1014, !1026}
!1026 = !DILocation(line: 1048, column: 42, scope: !1015)
!1027 = !DILocation(line: 1050, column: 1, scope: !1003)
!1028 = distinct !DISubprogram(name: "sbitmap_realloc", scope: !3, file: !3, line: 171, type: !1029, scopeLine: 172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1031)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{!387, !387, !7}
!1031 = !{!1032, !1033, !1034, !1035, !1036, !1037}
!1032 = !DILocalVariable(name: "src", arg: 1, scope: !1028, file: !3, line: 171, type: !387)
!1033 = !DILocalVariable(name: "n_elms", arg: 2, scope: !1028, file: !3, line: 171, type: !7)
!1034 = !DILocalVariable(name: "bytes", scope: !1028, file: !3, line: 173, type: !7)
!1035 = !DILocalVariable(name: "size", scope: !1028, file: !3, line: 173, type: !7)
!1036 = !DILocalVariable(name: "amt", scope: !1028, file: !3, line: 173, type: !7)
!1037 = !DILocalVariable(name: "bmap", scope: !1028, file: !3, line: 174, type: !387)
!1038 = !DILocation(line: 0, scope: !1028)
!1039 = !DILocation(line: 176, column: 10, scope: !1028)
!1040 = !DILocation(line: 177, column: 16, scope: !1028)
!1041 = !DILocation(line: 181, column: 7, scope: !1042)
!1042 = distinct !DILexicalBlock(scope: !1028, file: !3, line: 181, column: 7)
!1043 = !DILocation(line: 181, column: 36, scope: !1042)
!1044 = !DILocation(line: 181, column: 33, scope: !1042)
!1045 = !DILocation(line: 181, column: 7, scope: !1028)
!1046 = !DILocation(line: 183, column: 12, scope: !1047)
!1047 = distinct !DILexicalBlock(scope: !1042, file: !3, line: 182, column: 5)
!1048 = !DILocation(line: 183, column: 19, scope: !1047)
!1049 = !DILocation(line: 184, column: 7, scope: !1047)
!1050 = !DILocation(line: 179, column: 11, scope: !1028)
!1051 = !DILocation(line: 187, column: 30, scope: !1028)
!1052 = !DILocation(line: 187, column: 35, scope: !1028)
!1053 = !DILocation(line: 187, column: 20, scope: !1028)
!1054 = !DILocation(line: 187, column: 10, scope: !1028)
!1055 = !DILocation(line: 188, column: 9, scope: !1028)
!1056 = !DILocation(line: 188, column: 16, scope: !1028)
!1057 = !DILocation(line: 189, column: 9, scope: !1028)
!1058 = !DILocation(line: 189, column: 14, scope: !1028)
!1059 = !DILocation(line: 190, column: 3, scope: !1028)
!1060 = !DILocation(line: 191, column: 1, scope: !1028)
!1061 = distinct !DISubprogram(name: "sbitmap_vector_alloc", scope: !3, file: !3, line: 196, type: !1062, scopeLine: 197, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1064)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{!400, !7, !7}
!1064 = !{!1065, !1066, !1067, !1068, !1069, !1070, !1071, !1072, !1073, !1074, !1075, !1081, !1082}
!1065 = !DILocalVariable(name: "n_vecs", arg: 1, scope: !1061, file: !3, line: 196, type: !7)
!1066 = !DILocalVariable(name: "n_elms", arg: 2, scope: !1061, file: !3, line: 196, type: !7)
!1067 = !DILocalVariable(name: "i", scope: !1061, file: !3, line: 198, type: !7)
!1068 = !DILocalVariable(name: "bytes", scope: !1061, file: !3, line: 198, type: !7)
!1069 = !DILocalVariable(name: "offset", scope: !1061, file: !3, line: 198, type: !7)
!1070 = !DILocalVariable(name: "elm_bytes", scope: !1061, file: !3, line: 198, type: !7)
!1071 = !DILocalVariable(name: "size", scope: !1061, file: !3, line: 198, type: !7)
!1072 = !DILocalVariable(name: "amt", scope: !1061, file: !3, line: 198, type: !7)
!1073 = !DILocalVariable(name: "vector_bytes", scope: !1061, file: !3, line: 198, type: !7)
!1074 = !DILocalVariable(name: "bitmap_vector", scope: !1061, file: !3, line: 199, type: !400)
!1075 = !DILocalVariable(name: "align", scope: !1076, file: !3, line: 214, type: !1077)
!1076 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 212, column: 3)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !1061, file: !3, line: 214, size: 128, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !1077, file: !3, line: 214, baseType: !383, size: 8)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !1077, file: !3, line: 214, baseType: !397, size: 64, offset: 64)
!1081 = !DILocalVariable(name: "alignment", scope: !1076, file: !3, line: 215, type: !380)
!1082 = !DILocalVariable(name: "b", scope: !1083, file: !3, line: 224, type: !387)
!1083 = distinct !DILexicalBlock(scope: !1084, file: !3, line: 223, column: 5)
!1084 = distinct !DILexicalBlock(scope: !1085, file: !3, line: 222, column: 3)
!1085 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 222, column: 3)
!1086 = !DILocation(line: 0, scope: !1061)
!1087 = !DILocation(line: 201, column: 10, scope: !1061)
!1088 = !DILocation(line: 202, column: 16, scope: !1061)
!1089 = !DILocation(line: 204, column: 17, scope: !1061)
!1090 = !DILocation(line: 205, column: 25, scope: !1061)
!1091 = !DILocation(line: 219, column: 32, scope: !1061)
!1092 = !DILocation(line: 219, column: 22, scope: !1061)
!1093 = !DILocation(line: 220, column: 40, scope: !1061)
!1094 = !DILocation(line: 220, column: 31, scope: !1061)
!1095 = !DILocation(line: 220, column: 19, scope: !1061)
!1096 = !DILocation(line: 222, column: 40, scope: !1084)
!1097 = !DILocation(line: 222, column: 8, scope: !1085)
!1098 = !DILocation(line: 0, scope: !1085)
!1099 = !DILocation(line: 222, column: 3, scope: !1085)
!1100 = !DILocation(line: 224, column: 53, scope: !1083)
!1101 = !DILocation(line: 0, scope: !1083)
!1102 = !DILocation(line: 226, column: 7, scope: !1083)
!1103 = !DILocation(line: 226, column: 24, scope: !1083)
!1104 = !DILocation(line: 227, column: 10, scope: !1083)
!1105 = !DILocation(line: 227, column: 17, scope: !1083)
!1106 = !DILocation(line: 228, column: 10, scope: !1083)
!1107 = !DILocation(line: 228, column: 15, scope: !1083)
!1108 = !DILocation(line: 229, column: 10, scope: !1083)
!1109 = !DILocation(line: 229, column: 19, scope: !1083)
!1110 = !DILocation(line: 222, column: 62, scope: !1084)
!1111 = !DILocation(line: 222, column: 51, scope: !1084)
!1112 = !DILocation(line: 222, column: 3, scope: !1084)
!1113 = distinct !{!1113, !1099, !1114}
!1114 = !DILocation(line: 230, column: 5, scope: !1085)
!1115 = !DILocation(line: 232, column: 3, scope: !1061)
!1116 = distinct !DISubprogram(name: "sbitmap_copy", scope: !3, file: !3, line: 238, type: !1117, scopeLine: 239, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1122)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{null, !387, !1119}
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_sbitmap", file: !388, line: 46, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !390)
!1122 = !{!1123, !1124}
!1123 = !DILocalVariable(name: "dst", arg: 1, scope: !1116, file: !3, line: 238, type: !387)
!1124 = !DILocalVariable(name: "src", arg: 2, scope: !1116, file: !3, line: 238, type: !1119)
!1125 = !DILocation(line: 0, scope: !1116)
!1126 = !DILocation(line: 240, column: 11, scope: !1116)
!1127 = !DILocation(line: 240, column: 22, scope: !1116)
!1128 = !DILocation(line: 240, column: 66, scope: !1116)
!1129 = !DILocation(line: 240, column: 61, scope: !1116)
!1130 = !DILocation(line: 240, column: 59, scope: !1116)
!1131 = !DILocation(line: 240, column: 3, scope: !1116)
!1132 = !DILocation(line: 241, column: 12, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1116, file: !3, line: 241, column: 7)
!1134 = !DILocation(line: 241, column: 7, scope: !1133)
!1135 = !DILocation(line: 241, column: 7, scope: !1116)
!1136 = !DILocation(line: 242, column: 33, scope: !1133)
!1137 = !DILocation(line: 242, column: 73, scope: !1133)
!1138 = !DILocation(line: 242, column: 68, scope: !1133)
!1139 = !DILocation(line: 242, column: 5, scope: !1133)
!1140 = !DILocation(line: 243, column: 1, scope: !1116)
!1141 = distinct !DISubprogram(name: "sbitmap_copy_n", scope: !3, file: !3, line: 248, type: !1142, scopeLine: 249, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1144)
!1142 = !DISubroutineType(types: !1143)
!1143 = !{null, !387, !1119, !7}
!1144 = !{!1145, !1146, !1147}
!1145 = !DILocalVariable(name: "dst", arg: 1, scope: !1141, file: !3, line: 248, type: !387)
!1146 = !DILocalVariable(name: "src", arg: 2, scope: !1141, file: !3, line: 248, type: !1119)
!1147 = !DILocalVariable(name: "n", arg: 3, scope: !1141, file: !3, line: 248, type: !7)
!1148 = !DILocation(line: 0, scope: !1141)
!1149 = !DILocation(line: 250, column: 11, scope: !1141)
!1150 = !DILocation(line: 250, column: 22, scope: !1141)
!1151 = !DILocation(line: 250, column: 61, scope: !1141)
!1152 = !DILocation(line: 250, column: 59, scope: !1141)
!1153 = !DILocation(line: 250, column: 3, scope: !1141)
!1154 = !DILocation(line: 251, column: 12, scope: !1155)
!1155 = distinct !DILexicalBlock(scope: !1141, file: !3, line: 251, column: 7)
!1156 = !DILocation(line: 251, column: 7, scope: !1155)
!1157 = !DILocation(line: 251, column: 7, scope: !1141)
!1158 = !DILocation(line: 252, column: 33, scope: !1155)
!1159 = !DILocation(line: 252, column: 5, scope: !1155)
!1160 = !DILocation(line: 253, column: 1, scope: !1141)
!1161 = distinct !DISubprogram(name: "sbitmap_equal", scope: !3, file: !3, line: 257, type: !1162, scopeLine: 258, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1164)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!380, !1119, !1119}
!1164 = !{!1165, !1166}
!1165 = !DILocalVariable(name: "a", arg: 1, scope: !1161, file: !3, line: 257, type: !1119)
!1166 = !DILocalVariable(name: "b", arg: 2, scope: !1161, file: !3, line: 257, type: !1119)
!1167 = !DILocation(line: 0, scope: !1161)
!1168 = !DILocation(line: 259, column: 19, scope: !1161)
!1169 = !DILocation(line: 259, column: 28, scope: !1161)
!1170 = !DILocation(line: 259, column: 68, scope: !1161)
!1171 = !DILocation(line: 259, column: 65, scope: !1161)
!1172 = !DILocation(line: 259, column: 63, scope: !1161)
!1173 = !DILocation(line: 259, column: 11, scope: !1161)
!1174 = !DILocation(line: 259, column: 10, scope: !1161)
!1175 = !DILocation(line: 259, column: 3, scope: !1161)
!1176 = distinct !DISubprogram(name: "sbitmap_empty_p", scope: !3, file: !3, line: 265, type: !1177, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1179)
!1177 = !DISubroutineType(types: !1178)
!1178 = !{!379, !1119}
!1179 = !{!1180, !1181}
!1180 = !DILocalVariable(name: "bmap", arg: 1, scope: !1176, file: !3, line: 265, type: !1119)
!1181 = !DILocalVariable(name: "i", scope: !1176, file: !3, line: 267, type: !7)
!1182 = !DILocation(line: 0, scope: !1176)
!1183 = !DILocation(line: 0, scope: !1184)
!1184 = distinct !DILexicalBlock(scope: !1185, file: !3, line: 268, column: 3)
!1185 = distinct !DILexicalBlock(scope: !1176, file: !3, line: 268, column: 3)
!1186 = !DILocation(line: 268, column: 8, scope: !1185)
!1187 = !DILocation(line: 0, scope: !1185)
!1188 = !DILocation(line: 268, column: 14, scope: !1184)
!1189 = !DILocation(line: 268, column: 3, scope: !1185)
!1190 = !DILocation(line: 269, column: 9, scope: !1191)
!1191 = distinct !DILexicalBlock(scope: !1184, file: !3, line: 269, column: 9)
!1192 = !DILocation(line: 269, column: 9, scope: !1184)
!1193 = !DILocation(line: 268, column: 28, scope: !1184)
!1194 = !DILocation(line: 268, column: 3, scope: !1184)
!1195 = distinct !{!1195, !1189, !1196}
!1196 = !DILocation(line: 270, column: 14, scope: !1185)
!1197 = !DILocation(line: 273, column: 1, scope: !1176)
!1198 = distinct !DISubprogram(name: "sbitmap_range_empty_p", scope: !3, file: !3, line: 279, type: !1199, scopeLine: 280, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1201)
!1199 = !DISubroutineType(types: !1200)
!1200 = !{!379, !1119, !7, !7}
!1201 = !{!1202, !1203, !1204, !1205, !1206, !1207}
!1202 = !DILocalVariable(name: "bmap", arg: 1, scope: !1198, file: !3, line: 279, type: !1119)
!1203 = !DILocalVariable(name: "start", arg: 2, scope: !1198, file: !3, line: 279, type: !7)
!1204 = !DILocalVariable(name: "n", arg: 3, scope: !1198, file: !3, line: 279, type: !7)
!1205 = !DILocalVariable(name: "i", scope: !1198, file: !3, line: 281, type: !7)
!1206 = !DILocalVariable(name: "elm", scope: !1198, file: !3, line: 282, type: !397)
!1207 = !DILocalVariable(name: "shift", scope: !1198, file: !3, line: 283, type: !7)
!1208 = !DILocation(line: 0, scope: !1198)
!1209 = !DILocation(line: 281, column: 26, scope: !1198)
!1210 = !DILocation(line: 283, column: 30, scope: !1198)
!1211 = !DILocation(line: 285, column: 3, scope: !1198)
!1212 = !DILocation(line: 287, column: 9, scope: !1198)
!1213 = !DILocation(line: 288, column: 13, scope: !1198)
!1214 = !DILocation(line: 290, column: 13, scope: !1215)
!1215 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 290, column: 7)
!1216 = !DILocation(line: 290, column: 17, scope: !1215)
!1217 = !DILocation(line: 290, column: 7, scope: !1198)
!1218 = !DILocation(line: 293, column: 21, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 293, column: 11)
!1220 = distinct !DILexicalBlock(scope: !1215, file: !3, line: 291, column: 5)
!1221 = !DILocation(line: 293, column: 11, scope: !1220)
!1222 = !DILocation(line: 294, column: 26, scope: !1219)
!1223 = !DILocation(line: 294, column: 16, scope: !1219)
!1224 = !DILocation(line: 294, column: 13, scope: !1219)
!1225 = !DILocation(line: 294, column: 9, scope: !1219)
!1226 = !DILocation(line: 295, column: 19, scope: !1220)
!1227 = !DILocation(line: 295, column: 7, scope: !1220)
!1228 = !DILocation(line: 298, column: 7, scope: !1229)
!1229 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 298, column: 7)
!1230 = !DILocation(line: 298, column: 7, scope: !1198)
!1231 = !DILocation(line: 301, column: 5, scope: !1198)
!1232 = !DILocation(line: 305, column: 3, scope: !1198)
!1233 = !DILocation(line: 305, column: 12, scope: !1198)
!1234 = !DILocation(line: 307, column: 11, scope: !1235)
!1235 = distinct !DILexicalBlock(scope: !1236, file: !3, line: 307, column: 11)
!1236 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 306, column: 5)
!1237 = !DILocation(line: 307, column: 11, scope: !1236)
!1238 = !DILocation(line: 310, column: 9, scope: !1236)
!1239 = distinct !{!1239, !1232, !1240}
!1240 = !DILocation(line: 311, column: 5, scope: !1198)
!1241 = !DILocation(line: 314, column: 7, scope: !1242)
!1242 = distinct !DILexicalBlock(scope: !1198, file: !3, line: 314, column: 7)
!1243 = !DILocation(line: 314, column: 7, scope: !1198)
!1244 = !DILocation(line: 316, column: 13, scope: !1245)
!1245 = distinct !DILexicalBlock(scope: !1242, file: !3, line: 315, column: 5)
!1246 = !DILocation(line: 317, column: 24, scope: !1245)
!1247 = !DILocation(line: 317, column: 14, scope: !1245)
!1248 = !DILocation(line: 317, column: 11, scope: !1245)
!1249 = !DILocation(line: 318, column: 19, scope: !1245)
!1250 = !DILocation(line: 318, column: 7, scope: !1245)
!1251 = !DILocation(line: 322, column: 1, scope: !1198)
!1252 = distinct !DISubprogram(name: "sbitmap_zero", scope: !3, file: !3, line: 329, type: !1253, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1255)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{null, !387}
!1255 = !{!1256}
!1256 = !DILocalVariable(name: "bmap", arg: 1, scope: !1252, file: !3, line: 329, type: !387)
!1257 = !DILocation(line: 0, scope: !1252)
!1258 = !DILocation(line: 331, column: 11, scope: !1252)
!1259 = !DILocation(line: 331, column: 26, scope: !1252)
!1260 = !DILocation(line: 331, column: 3, scope: !1252)
!1261 = !DILocation(line: 332, column: 13, scope: !1262)
!1262 = distinct !DILexicalBlock(scope: !1252, file: !3, line: 332, column: 7)
!1263 = !DILocation(line: 332, column: 7, scope: !1262)
!1264 = !DILocation(line: 332, column: 7, scope: !1252)
!1265 = !DILocation(line: 333, column: 38, scope: !1262)
!1266 = !DILocation(line: 333, column: 32, scope: !1262)
!1267 = !DILocation(line: 333, column: 5, scope: !1262)
!1268 = !DILocation(line: 334, column: 1, scope: !1252)
!1269 = distinct !DISubprogram(name: "sbitmap_ones", scope: !3, file: !3, line: 339, type: !1253, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1270)
!1270 = !{!1271, !1272}
!1271 = !DILocalVariable(name: "bmap", arg: 1, scope: !1269, file: !3, line: 339, type: !387)
!1272 = !DILocalVariable(name: "last_bit", scope: !1269, file: !3, line: 341, type: !7)
!1273 = !DILocation(line: 0, scope: !1269)
!1274 = !DILocation(line: 343, column: 11, scope: !1269)
!1275 = !DILocation(line: 343, column: 27, scope: !1269)
!1276 = !DILocation(line: 343, column: 3, scope: !1269)
!1277 = !DILocation(line: 344, column: 13, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !1269, file: !3, line: 344, column: 7)
!1279 = !DILocation(line: 344, column: 7, scope: !1278)
!1280 = !DILocation(line: 344, column: 7, scope: !1269)
!1281 = !DILocation(line: 345, column: 39, scope: !1278)
!1282 = !DILocation(line: 345, column: 33, scope: !1278)
!1283 = !DILocation(line: 345, column: 5, scope: !1278)
!1284 = !DILocation(line: 347, column: 20, scope: !1269)
!1285 = !DILocation(line: 347, column: 27, scope: !1269)
!1286 = !DILocation(line: 348, column: 7, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1269, file: !3, line: 348, column: 7)
!1288 = !DILocation(line: 348, column: 7, scope: !1269)
!1289 = !DILocation(line: 351, column: 46, scope: !1290)
!1290 = distinct !DILexicalBlock(scope: !1287, file: !3, line: 349, column: 5)
!1291 = !DILocation(line: 351, column: 25, scope: !1290)
!1292 = !DILocation(line: 350, column: 24, scope: !1290)
!1293 = !DILocation(line: 350, column: 29, scope: !1290)
!1294 = !DILocation(line: 350, column: 7, scope: !1290)
!1295 = !DILocation(line: 351, column: 2, scope: !1290)
!1296 = !DILocation(line: 352, column: 17, scope: !1297)
!1297 = distinct !DILexicalBlock(scope: !1290, file: !3, line: 352, column: 11)
!1298 = !DILocation(line: 352, column: 11, scope: !1297)
!1299 = !DILocation(line: 352, column: 11, scope: !1290)
!1300 = !DILocation(line: 354, column: 6, scope: !1297)
!1301 = !DILocation(line: 353, column: 8, scope: !1297)
!1302 = !DILocation(line: 353, column: 23, scope: !1297)
!1303 = !DILocation(line: 353, column: 28, scope: !1297)
!1304 = !DILocation(line: 353, column: 2, scope: !1297)
!1305 = !DILocation(line: 354, column: 4, scope: !1297)
!1306 = !DILocation(line: 356, column: 1, scope: !1269)
!1307 = distinct !DISubprogram(name: "sbitmap_vector_zero", scope: !3, file: !3, line: 361, type: !1308, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1310)
!1308 = !DISubroutineType(types: !1309)
!1309 = !{null, !400, !7}
!1310 = !{!1311, !1312, !1313}
!1311 = !DILocalVariable(name: "bmap", arg: 1, scope: !1307, file: !3, line: 361, type: !400)
!1312 = !DILocalVariable(name: "n_vecs", arg: 2, scope: !1307, file: !3, line: 361, type: !7)
!1313 = !DILocalVariable(name: "i", scope: !1307, file: !3, line: 363, type: !7)
!1314 = !DILocation(line: 0, scope: !1307)
!1315 = !DILocation(line: 365, column: 17, scope: !1316)
!1316 = distinct !DILexicalBlock(scope: !1317, file: !3, line: 365, column: 3)
!1317 = distinct !DILexicalBlock(scope: !1307, file: !3, line: 365, column: 3)
!1318 = !DILocation(line: 365, column: 8, scope: !1317)
!1319 = !DILocation(line: 0, scope: !1317)
!1320 = !DILocation(line: 365, column: 3, scope: !1317)
!1321 = !DILocation(line: 366, column: 19, scope: !1316)
!1322 = !DILocation(line: 366, column: 5, scope: !1316)
!1323 = !DILocation(line: 365, column: 28, scope: !1316)
!1324 = !DILocation(line: 365, column: 3, scope: !1316)
!1325 = distinct !{!1325, !1320, !1326}
!1326 = !DILocation(line: 366, column: 26, scope: !1317)
!1327 = !DILocation(line: 367, column: 1, scope: !1307)
!1328 = distinct !DISubprogram(name: "sbitmap_vector_ones", scope: !3, file: !3, line: 372, type: !1308, scopeLine: 373, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1329)
!1329 = !{!1330, !1331, !1332}
!1330 = !DILocalVariable(name: "bmap", arg: 1, scope: !1328, file: !3, line: 372, type: !400)
!1331 = !DILocalVariable(name: "n_vecs", arg: 2, scope: !1328, file: !3, line: 372, type: !7)
!1332 = !DILocalVariable(name: "i", scope: !1328, file: !3, line: 374, type: !7)
!1333 = !DILocation(line: 0, scope: !1328)
!1334 = !DILocation(line: 376, column: 17, scope: !1335)
!1335 = distinct !DILexicalBlock(scope: !1336, file: !3, line: 376, column: 3)
!1336 = distinct !DILexicalBlock(scope: !1328, file: !3, line: 376, column: 3)
!1337 = !DILocation(line: 376, column: 8, scope: !1336)
!1338 = !DILocation(line: 0, scope: !1336)
!1339 = !DILocation(line: 376, column: 3, scope: !1336)
!1340 = !DILocation(line: 377, column: 19, scope: !1335)
!1341 = !DILocation(line: 377, column: 5, scope: !1335)
!1342 = !DILocation(line: 376, column: 28, scope: !1335)
!1343 = !DILocation(line: 376, column: 3, scope: !1335)
!1344 = distinct !{!1344, !1339, !1345}
!1345 = !DILocation(line: 377, column: 26, scope: !1336)
!1346 = !DILocation(line: 378, column: 1, scope: !1328)
!1347 = distinct !DISubprogram(name: "sbitmap_union_of_diff_cg", scope: !3, file: !3, line: 385, type: !1348, scopeLine: 386, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1350)
!1348 = !DISubroutineType(types: !1349)
!1349 = !{!379, !387, !1119, !1119, !1119}
!1350 = !{!1351, !1352, !1353, !1354, !1355, !1356, !1357, !1360, !1364, !1365, !1366, !1367}
!1351 = !DILocalVariable(name: "dst", arg: 1, scope: !1347, file: !3, line: 385, type: !387)
!1352 = !DILocalVariable(name: "a", arg: 2, scope: !1347, file: !3, line: 385, type: !1119)
!1353 = !DILocalVariable(name: "b", arg: 3, scope: !1347, file: !3, line: 385, type: !1119)
!1354 = !DILocalVariable(name: "c", arg: 4, scope: !1347, file: !3, line: 385, type: !1119)
!1355 = !DILocalVariable(name: "i", scope: !1347, file: !3, line: 387, type: !7)
!1356 = !DILocalVariable(name: "n", scope: !1347, file: !3, line: 387, type: !7)
!1357 = !DILocalVariable(name: "dstp", scope: !1347, file: !3, line: 388, type: !1358)
!1358 = !DIDerivedType(tag: DW_TAG_typedef, name: "sbitmap_ptr", file: !388, line: 48, baseType: !1359)
!1359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!1360 = !DILocalVariable(name: "ap", scope: !1347, file: !3, line: 389, type: !1361)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_sbitmap_ptr", file: !388, line: 49, baseType: !1362)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !397)
!1364 = !DILocalVariable(name: "bp", scope: !1347, file: !3, line: 390, type: !1361)
!1365 = !DILocalVariable(name: "cp", scope: !1347, file: !3, line: 391, type: !1361)
!1366 = !DILocalVariable(name: "changed", scope: !1347, file: !3, line: 392, type: !397)
!1367 = !DILocalVariable(name: "tmp", scope: !1368, file: !3, line: 398, type: !1363)
!1368 = distinct !DILexicalBlock(scope: !1369, file: !3, line: 397, column: 5)
!1369 = distinct !DILexicalBlock(scope: !1370, file: !3, line: 396, column: 3)
!1370 = distinct !DILexicalBlock(scope: !1347, file: !3, line: 396, column: 3)
!1371 = !DILocation(line: 0, scope: !1347)
!1372 = !DILocation(line: 387, column: 28, scope: !1347)
!1373 = !DILocation(line: 388, column: 22, scope: !1347)
!1374 = !DILocation(line: 389, column: 26, scope: !1347)
!1375 = !DILocation(line: 390, column: 26, scope: !1347)
!1376 = !DILocation(line: 391, column: 26, scope: !1347)
!1377 = !DILocation(line: 394, column: 3, scope: !1347)
!1378 = !DILocation(line: 396, column: 8, scope: !1370)
!1379 = !DILocation(line: 0, scope: !1370)
!1380 = !DILocation(line: 396, column: 17, scope: !1369)
!1381 = !DILocation(line: 396, column: 3, scope: !1370)
!1382 = !DILocation(line: 398, column: 39, scope: !1368)
!1383 = !DILocation(line: 398, column: 36, scope: !1368)
!1384 = !DILocation(line: 398, column: 48, scope: !1368)
!1385 = !DILocation(line: 398, column: 45, scope: !1368)
!1386 = !DILocation(line: 398, column: 57, scope: !1368)
!1387 = !DILocation(line: 398, column: 54, scope: !1368)
!1388 = !DILocation(line: 398, column: 53, scope: !1368)
!1389 = !DILocation(line: 398, column: 51, scope: !1368)
!1390 = !DILocation(line: 398, column: 42, scope: !1368)
!1391 = !DILocation(line: 0, scope: !1368)
!1392 = !DILocation(line: 399, column: 18, scope: !1368)
!1393 = !DILocation(line: 399, column: 24, scope: !1368)
!1394 = !DILocation(line: 399, column: 15, scope: !1368)
!1395 = !DILocation(line: 400, column: 12, scope: !1368)
!1396 = !DILocation(line: 400, column: 15, scope: !1368)
!1397 = !DILocation(line: 396, column: 23, scope: !1369)
!1398 = !DILocation(line: 396, column: 3, scope: !1369)
!1399 = distinct !{!1399, !1381, !1400}
!1400 = !DILocation(line: 401, column: 5, scope: !1370)
!1401 = !DILocation(line: 403, column: 18, scope: !1347)
!1402 = !DILocation(line: 403, column: 10, scope: !1347)
!1403 = !DILocation(line: 403, column: 3, scope: !1347)
!1404 = distinct !DISubprogram(name: "sbitmap_union_of_diff", scope: !3, file: !3, line: 407, type: !1405, scopeLine: 408, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1407)
!1405 = !DISubroutineType(types: !1406)
!1406 = !{null, !387, !1119, !1119, !1119}
!1407 = !{!1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417}
!1408 = !DILocalVariable(name: "dst", arg: 1, scope: !1404, file: !3, line: 407, type: !387)
!1409 = !DILocalVariable(name: "a", arg: 2, scope: !1404, file: !3, line: 407, type: !1119)
!1410 = !DILocalVariable(name: "b", arg: 3, scope: !1404, file: !3, line: 407, type: !1119)
!1411 = !DILocalVariable(name: "c", arg: 4, scope: !1404, file: !3, line: 407, type: !1119)
!1412 = !DILocalVariable(name: "i", scope: !1404, file: !3, line: 409, type: !7)
!1413 = !DILocalVariable(name: "n", scope: !1404, file: !3, line: 409, type: !7)
!1414 = !DILocalVariable(name: "dstp", scope: !1404, file: !3, line: 410, type: !1358)
!1415 = !DILocalVariable(name: "ap", scope: !1404, file: !3, line: 411, type: !1361)
!1416 = !DILocalVariable(name: "bp", scope: !1404, file: !3, line: 412, type: !1361)
!1417 = !DILocalVariable(name: "cp", scope: !1404, file: !3, line: 413, type: !1361)
!1418 = !DILocation(line: 0, scope: !1404)
!1419 = !DILocation(line: 409, column: 28, scope: !1404)
!1420 = !DILocation(line: 410, column: 22, scope: !1404)
!1421 = !DILocation(line: 411, column: 26, scope: !1404)
!1422 = !DILocation(line: 412, column: 26, scope: !1404)
!1423 = !DILocation(line: 413, column: 26, scope: !1404)
!1424 = !DILocation(line: 415, column: 3, scope: !1404)
!1425 = !DILocation(line: 418, column: 8, scope: !1426)
!1426 = distinct !DILexicalBlock(scope: !1404, file: !3, line: 418, column: 3)
!1427 = !DILocation(line: 0, scope: !1426)
!1428 = !DILocation(line: 418, column: 17, scope: !1429)
!1429 = distinct !DILexicalBlock(scope: !1426, file: !3, line: 418, column: 3)
!1430 = !DILocation(line: 418, column: 3, scope: !1426)
!1431 = !DILocation(line: 419, column: 18, scope: !1429)
!1432 = !DILocation(line: 419, column: 15, scope: !1429)
!1433 = !DILocation(line: 419, column: 27, scope: !1429)
!1434 = !DILocation(line: 419, column: 24, scope: !1429)
!1435 = !DILocation(line: 419, column: 36, scope: !1429)
!1436 = !DILocation(line: 419, column: 33, scope: !1429)
!1437 = !DILocation(line: 419, column: 32, scope: !1429)
!1438 = !DILocation(line: 419, column: 30, scope: !1429)
!1439 = !DILocation(line: 419, column: 21, scope: !1429)
!1440 = !DILocation(line: 419, column: 10, scope: !1429)
!1441 = !DILocation(line: 419, column: 13, scope: !1429)
!1442 = !DILocation(line: 418, column: 23, scope: !1429)
!1443 = !DILocation(line: 418, column: 3, scope: !1429)
!1444 = distinct !{!1444, !1430, !1445}
!1445 = !DILocation(line: 419, column: 38, scope: !1426)
!1446 = !DILocation(line: 420, column: 1, scope: !1404)
!1447 = distinct !DISubprogram(name: "sbitmap_not", scope: !3, file: !3, line: 425, type: !1117, scopeLine: 426, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1448)
!1448 = !{!1449, !1450, !1451, !1452, !1453, !1454, !1455}
!1449 = !DILocalVariable(name: "dst", arg: 1, scope: !1447, file: !3, line: 425, type: !387)
!1450 = !DILocalVariable(name: "src", arg: 2, scope: !1447, file: !3, line: 425, type: !1119)
!1451 = !DILocalVariable(name: "i", scope: !1447, file: !3, line: 427, type: !7)
!1452 = !DILocalVariable(name: "n", scope: !1447, file: !3, line: 427, type: !7)
!1453 = !DILocalVariable(name: "dstp", scope: !1447, file: !3, line: 428, type: !1358)
!1454 = !DILocalVariable(name: "srcp", scope: !1447, file: !3, line: 429, type: !1361)
!1455 = !DILocalVariable(name: "last_bit", scope: !1447, file: !3, line: 430, type: !7)
!1456 = !DILocation(line: 0, scope: !1447)
!1457 = !DILocation(line: 427, column: 28, scope: !1447)
!1458 = !DILocation(line: 428, column: 22, scope: !1447)
!1459 = !DILocation(line: 429, column: 28, scope: !1447)
!1460 = !DILocation(line: 432, column: 3, scope: !1447)
!1461 = !DILocation(line: 434, column: 8, scope: !1462)
!1462 = distinct !DILexicalBlock(scope: !1447, file: !3, line: 434, column: 3)
!1463 = !DILocation(line: 0, scope: !1462)
!1464 = !DILocation(line: 434, column: 17, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1462, file: !3, line: 434, column: 3)
!1466 = !DILocation(line: 434, column: 3, scope: !1462)
!1467 = !DILocation(line: 435, column: 21, scope: !1465)
!1468 = !DILocation(line: 435, column: 16, scope: !1465)
!1469 = !DILocation(line: 435, column: 15, scope: !1465)
!1470 = !DILocation(line: 435, column: 10, scope: !1465)
!1471 = !DILocation(line: 435, column: 13, scope: !1465)
!1472 = !DILocation(line: 434, column: 23, scope: !1465)
!1473 = !DILocation(line: 434, column: 3, scope: !1465)
!1474 = distinct !{!1474, !1466, !1475}
!1475 = !DILocation(line: 435, column: 21, scope: !1462)
!1476 = !DILocation(line: 438, column: 19, scope: !1447)
!1477 = !DILocation(line: 438, column: 26, scope: !1447)
!1478 = !DILocation(line: 439, column: 7, scope: !1479)
!1479 = distinct !DILexicalBlock(scope: !1447, file: !3, line: 439, column: 7)
!1480 = !DILocation(line: 439, column: 7, scope: !1447)
!1481 = !DILocation(line: 440, column: 33, scope: !1479)
!1482 = !DILocation(line: 440, column: 22, scope: !1479)
!1483 = !DILocation(line: 441, column: 52, scope: !1479)
!1484 = !DILocation(line: 441, column: 31, scope: !1479)
!1485 = !DILocation(line: 441, column: 7, scope: !1479)
!1486 = !DILocation(line: 440, column: 20, scope: !1479)
!1487 = !DILocation(line: 440, column: 5, scope: !1479)
!1488 = !DILocation(line: 442, column: 1, scope: !1447)
!1489 = distinct !DISubprogram(name: "sbitmap_difference", scope: !3, file: !3, line: 448, type: !1490, scopeLine: 449, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1492)
!1490 = !DISubroutineType(types: !1491)
!1491 = !{null, !387, !1119, !1119}
!1492 = !{!1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501}
!1493 = !DILocalVariable(name: "dst", arg: 1, scope: !1489, file: !3, line: 448, type: !387)
!1494 = !DILocalVariable(name: "a", arg: 2, scope: !1489, file: !3, line: 448, type: !1119)
!1495 = !DILocalVariable(name: "b", arg: 3, scope: !1489, file: !3, line: 448, type: !1119)
!1496 = !DILocalVariable(name: "i", scope: !1489, file: !3, line: 450, type: !7)
!1497 = !DILocalVariable(name: "dst_size", scope: !1489, file: !3, line: 450, type: !7)
!1498 = !DILocalVariable(name: "min_size", scope: !1489, file: !3, line: 451, type: !7)
!1499 = !DILocalVariable(name: "dstp", scope: !1489, file: !3, line: 452, type: !1358)
!1500 = !DILocalVariable(name: "ap", scope: !1489, file: !3, line: 453, type: !1361)
!1501 = !DILocalVariable(name: "bp", scope: !1489, file: !3, line: 454, type: !1361)
!1502 = !DILocation(line: 0, scope: !1489)
!1503 = !DILocation(line: 450, column: 35, scope: !1489)
!1504 = !DILocation(line: 452, column: 22, scope: !1489)
!1505 = !DILocation(line: 453, column: 26, scope: !1489)
!1506 = !DILocation(line: 454, column: 26, scope: !1489)
!1507 = !DILocation(line: 456, column: 3, scope: !1489)
!1508 = !DILocation(line: 459, column: 3, scope: !1489)
!1509 = !DILocation(line: 462, column: 10, scope: !1510)
!1510 = distinct !DILexicalBlock(scope: !1489, file: !3, line: 462, column: 7)
!1511 = !DILocation(line: 462, column: 15, scope: !1510)
!1512 = !DILocation(line: 462, column: 7, scope: !1489)
!1513 = !DILocation(line: 463, column: 5, scope: !1510)
!1514 = !DILocation(line: 464, column: 8, scope: !1515)
!1515 = distinct !DILexicalBlock(scope: !1489, file: !3, line: 464, column: 3)
!1516 = !DILocation(line: 0, scope: !1515)
!1517 = !DILocation(line: 464, column: 17, scope: !1518)
!1518 = distinct !DILexicalBlock(scope: !1515, file: !3, line: 464, column: 3)
!1519 = !DILocation(line: 464, column: 3, scope: !1515)
!1520 = !DILocation(line: 465, column: 18, scope: !1518)
!1521 = !DILocation(line: 465, column: 15, scope: !1518)
!1522 = !DILocation(line: 465, column: 28, scope: !1518)
!1523 = !DILocation(line: 465, column: 25, scope: !1518)
!1524 = !DILocation(line: 465, column: 24, scope: !1518)
!1525 = !DILocation(line: 465, column: 21, scope: !1518)
!1526 = !DILocation(line: 465, column: 10, scope: !1518)
!1527 = !DILocation(line: 465, column: 13, scope: !1518)
!1528 = !DILocation(line: 464, column: 30, scope: !1518)
!1529 = !DILocation(line: 464, column: 3, scope: !1518)
!1530 = distinct !{!1530, !1519, !1531}
!1531 = !DILocation(line: 465, column: 30, scope: !1515)
!1532 = !DILocation(line: 468, column: 11, scope: !1533)
!1533 = distinct !DILexicalBlock(scope: !1489, file: !3, line: 468, column: 7)
!1534 = !DILocation(line: 468, column: 21, scope: !1533)
!1535 = !DILocation(line: 468, column: 16, scope: !1533)
!1536 = !DILocation(line: 469, column: 5, scope: !1537)
!1537 = distinct !DILexicalBlock(scope: !1533, file: !3, line: 469, column: 5)
!1538 = !DILocation(line: 469, column: 14, scope: !1539)
!1539 = distinct !DILexicalBlock(scope: !1537, file: !3, line: 469, column: 5)
!1540 = !DILocation(line: 470, column: 20, scope: !1539)
!1541 = !DILocation(line: 470, column: 17, scope: !1539)
!1542 = !DILocation(line: 470, column: 12, scope: !1539)
!1543 = !DILocation(line: 470, column: 15, scope: !1539)
!1544 = !DILocation(line: 469, column: 27, scope: !1539)
!1545 = !DILocation(line: 469, column: 5, scope: !1539)
!1546 = distinct !{!1546, !1536, !1547}
!1547 = !DILocation(line: 470, column: 20, scope: !1537)
!1548 = !DILocation(line: 471, column: 1, scope: !1489)
!1549 = distinct !DISubprogram(name: "sbitmap_any_common_bits", scope: !3, file: !3, line: 477, type: !1550, scopeLine: 478, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1552)
!1550 = !DISubroutineType(types: !1551)
!1551 = !{!379, !1119, !1119}
!1552 = !{!1553, !1554, !1555, !1556, !1557, !1558}
!1553 = !DILocalVariable(name: "a", arg: 1, scope: !1549, file: !3, line: 477, type: !1119)
!1554 = !DILocalVariable(name: "b", arg: 2, scope: !1549, file: !3, line: 477, type: !1119)
!1555 = !DILocalVariable(name: "ap", scope: !1549, file: !3, line: 479, type: !1361)
!1556 = !DILocalVariable(name: "bp", scope: !1549, file: !3, line: 480, type: !1361)
!1557 = !DILocalVariable(name: "i", scope: !1549, file: !3, line: 481, type: !7)
!1558 = !DILocalVariable(name: "n", scope: !1549, file: !3, line: 481, type: !7)
!1559 = !DILocation(line: 0, scope: !1549)
!1560 = !DILocation(line: 479, column: 26, scope: !1549)
!1561 = !DILocation(line: 480, column: 26, scope: !1549)
!1562 = !DILocation(line: 483, column: 7, scope: !1549)
!1563 = !DILocation(line: 484, column: 8, scope: !1564)
!1564 = distinct !DILexicalBlock(scope: !1549, file: !3, line: 484, column: 3)
!1565 = !DILocation(line: 0, scope: !1564)
!1566 = !DILocation(line: 484, column: 17, scope: !1567)
!1567 = distinct !DILexicalBlock(scope: !1564, file: !3, line: 484, column: 3)
!1568 = !DILocation(line: 484, column: 3, scope: !1564)
!1569 = !DILocation(line: 485, column: 10, scope: !1570)
!1570 = distinct !DILexicalBlock(scope: !1567, file: !3, line: 485, column: 9)
!1571 = !DILocation(line: 485, column: 18, scope: !1570)
!1572 = !DILocation(line: 485, column: 16, scope: !1570)
!1573 = !DILocation(line: 485, column: 25, scope: !1570)
!1574 = !DILocation(line: 485, column: 9, scope: !1567)
!1575 = !DILocation(line: 485, column: 21, scope: !1570)
!1576 = !DILocation(line: 485, column: 13, scope: !1570)
!1577 = !DILocation(line: 484, column: 23, scope: !1567)
!1578 = !DILocation(line: 484, column: 3, scope: !1567)
!1579 = distinct !{!1579, !1568, !1580}
!1580 = !DILocation(line: 486, column: 14, scope: !1564)
!1581 = !DILocation(line: 489, column: 1, scope: !1549)
!1582 = distinct !DISubprogram(name: "sbitmap_a_and_b_cg", scope: !3, file: !3, line: 495, type: !1583, scopeLine: 496, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1585)
!1583 = !DISubroutineType(types: !1584)
!1584 = !{!379, !387, !1119, !1119}
!1585 = !{!1586, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595}
!1586 = !DILocalVariable(name: "dst", arg: 1, scope: !1582, file: !3, line: 495, type: !387)
!1587 = !DILocalVariable(name: "a", arg: 2, scope: !1582, file: !3, line: 495, type: !1119)
!1588 = !DILocalVariable(name: "b", arg: 3, scope: !1582, file: !3, line: 495, type: !1119)
!1589 = !DILocalVariable(name: "i", scope: !1582, file: !3, line: 497, type: !7)
!1590 = !DILocalVariable(name: "n", scope: !1582, file: !3, line: 497, type: !7)
!1591 = !DILocalVariable(name: "dstp", scope: !1582, file: !3, line: 498, type: !1358)
!1592 = !DILocalVariable(name: "ap", scope: !1582, file: !3, line: 499, type: !1361)
!1593 = !DILocalVariable(name: "bp", scope: !1582, file: !3, line: 500, type: !1361)
!1594 = !DILocalVariable(name: "changed", scope: !1582, file: !3, line: 501, type: !397)
!1595 = !DILocalVariable(name: "tmp", scope: !1596, file: !3, line: 507, type: !1363)
!1596 = distinct !DILexicalBlock(scope: !1597, file: !3, line: 506, column: 5)
!1597 = distinct !DILexicalBlock(scope: !1598, file: !3, line: 505, column: 3)
!1598 = distinct !DILexicalBlock(scope: !1582, file: !3, line: 505, column: 3)
!1599 = !DILocation(line: 0, scope: !1582)
!1600 = !DILocation(line: 497, column: 28, scope: !1582)
!1601 = !DILocation(line: 498, column: 22, scope: !1582)
!1602 = !DILocation(line: 499, column: 26, scope: !1582)
!1603 = !DILocation(line: 500, column: 26, scope: !1582)
!1604 = !DILocation(line: 503, column: 3, scope: !1582)
!1605 = !DILocation(line: 505, column: 8, scope: !1598)
!1606 = !DILocation(line: 0, scope: !1598)
!1607 = !DILocation(line: 505, column: 17, scope: !1597)
!1608 = !DILocation(line: 505, column: 3, scope: !1598)
!1609 = !DILocation(line: 507, column: 39, scope: !1596)
!1610 = !DILocation(line: 507, column: 36, scope: !1596)
!1611 = !DILocation(line: 507, column: 47, scope: !1596)
!1612 = !DILocation(line: 507, column: 44, scope: !1596)
!1613 = !DILocation(line: 507, column: 42, scope: !1596)
!1614 = !DILocation(line: 0, scope: !1596)
!1615 = !DILocation(line: 508, column: 18, scope: !1596)
!1616 = !DILocation(line: 508, column: 24, scope: !1596)
!1617 = !DILocation(line: 508, column: 15, scope: !1596)
!1618 = !DILocation(line: 509, column: 12, scope: !1596)
!1619 = !DILocation(line: 509, column: 15, scope: !1596)
!1620 = !DILocation(line: 505, column: 23, scope: !1597)
!1621 = !DILocation(line: 505, column: 3, scope: !1597)
!1622 = distinct !{!1622, !1608, !1623}
!1623 = !DILocation(line: 510, column: 5, scope: !1598)
!1624 = !DILocation(line: 512, column: 18, scope: !1582)
!1625 = !DILocation(line: 512, column: 10, scope: !1582)
!1626 = !DILocation(line: 512, column: 3, scope: !1582)
!1627 = distinct !DISubprogram(name: "sbitmap_a_and_b", scope: !3, file: !3, line: 516, type: !1490, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1628)
!1628 = !{!1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1643}
!1629 = !DILocalVariable(name: "dst", arg: 1, scope: !1627, file: !3, line: 516, type: !387)
!1630 = !DILocalVariable(name: "a", arg: 2, scope: !1627, file: !3, line: 516, type: !1119)
!1631 = !DILocalVariable(name: "b", arg: 3, scope: !1627, file: !3, line: 516, type: !1119)
!1632 = !DILocalVariable(name: "i", scope: !1627, file: !3, line: 518, type: !7)
!1633 = !DILocalVariable(name: "n", scope: !1627, file: !3, line: 518, type: !7)
!1634 = !DILocalVariable(name: "dstp", scope: !1627, file: !3, line: 519, type: !1358)
!1635 = !DILocalVariable(name: "ap", scope: !1627, file: !3, line: 520, type: !1361)
!1636 = !DILocalVariable(name: "bp", scope: !1627, file: !3, line: 521, type: !1361)
!1637 = !DILocalVariable(name: "has_popcount", scope: !1627, file: !3, line: 522, type: !379)
!1638 = !DILocalVariable(name: "popcountp", scope: !1627, file: !3, line: 523, type: !378)
!1639 = !DILocalVariable(name: "tmp", scope: !1640, file: !3, line: 527, type: !1363)
!1640 = distinct !DILexicalBlock(scope: !1641, file: !3, line: 526, column: 5)
!1641 = distinct !DILexicalBlock(scope: !1642, file: !3, line: 525, column: 3)
!1642 = distinct !DILexicalBlock(scope: !1627, file: !3, line: 525, column: 3)
!1643 = !DILocalVariable(name: "wordchanged", scope: !1644, file: !3, line: 530, type: !379)
!1644 = distinct !DILexicalBlock(scope: !1645, file: !3, line: 529, column: 2)
!1645 = distinct !DILexicalBlock(scope: !1640, file: !3, line: 528, column: 11)
!1646 = !DILocation(line: 0, scope: !1627)
!1647 = !DILocation(line: 518, column: 28, scope: !1627)
!1648 = !DILocation(line: 519, column: 22, scope: !1627)
!1649 = !DILocation(line: 520, column: 26, scope: !1627)
!1650 = !DILocation(line: 521, column: 26, scope: !1627)
!1651 = !DILocation(line: 522, column: 28, scope: !1627)
!1652 = !DILocation(line: 522, column: 37, scope: !1627)
!1653 = !DILocation(line: 525, column: 8, scope: !1642)
!1654 = !DILocation(line: 0, scope: !1642)
!1655 = !DILocation(line: 525, column: 17, scope: !1641)
!1656 = !DILocation(line: 525, column: 3, scope: !1642)
!1657 = !DILocation(line: 0, scope: !1640)
!1658 = !DILocation(line: 527, column: 36, scope: !1640)
!1659 = !DILocation(line: 527, column: 44, scope: !1640)
!1660 = !DILocation(line: 527, column: 42, scope: !1640)
!1661 = !DILocation(line: 527, column: 47, scope: !1640)
!1662 = !DILocation(line: 527, column: 39, scope: !1640)
!1663 = !DILocation(line: 535, column: 12, scope: !1640)
