; ModuleID = 'sched-deps.bc'
source_filename = "sched-deps.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.VEC_haifa_deps_insn_data_def_heap = type { %struct.VEC_haifa_deps_insn_data_def_base }
%struct.VEC_haifa_deps_insn_data_def_base = type { i32, i32, [1 x %struct._haifa_deps_insn_data] }
%struct._haifa_deps_insn_data = type { i32, i32, %struct._deps_list*, %struct._deps_list*, %struct._deps_list*, %struct._deps_list*, %struct._deps_list*, i8 }
%struct._deps_list = type { %struct._dep_link*, i32 }
%struct._dep_link = type { %struct._dep_node*, %struct._dep_link*, %struct._dep_link** }
%struct._dep_node = type { %struct._dep_link, %struct._dep, %struct._dep_link }
%struct._dep = type { %struct.rtx_def*, %struct.rtx_def*, i32, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }

!547 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!548 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!549 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!550 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!551 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!552 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!553 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!554 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!555 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!556 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!557 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!558 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!559 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!560 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!561 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DEPS_ADJUST_RESULT", file: !562, line: 1016, baseType: !7, size: 32, elements: !563)
!562 = !DIFile(filename: "./sched-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!563 = !{!564, !565, !566, !567}
!564 = !DIEnumerator(name: "DEP_NODEP", value: 0, isUnsigned: true)
!565 = !DIEnumerator(name: "DEP_PRESENT", value: 1, isUnsigned: true)
!566 = !DIEnumerator(name: "DEP_CHANGED", value: 2, isUnsigned: true)
!567 = !DIEnumerator(name: "DEP_CREATED", value: 3, isUnsigned: true)
!568 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "post_call_group", file: !562, line: 432, baseType: !7, size: 32, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIEnumerator(name: "not_post_call", value: 0, isUnsigned: true)
!571 = !DIEnumerator(name: "post_call", value: 1, isUnsigned: true)
!572 = !DIEnumerator(name: "post_call_initial", value: 2, isUnsigned: true)
!573 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_pending_barrier_mode", file: !562, line: 424, baseType: !7, size: 32, elements: !574)
!574 = !{!575, !576, !577}
!575 = !DIEnumerator(name: "NOT_A_BARRIER", value: 0, isUnsigned: true)
!576 = !DIEnumerator(name: "MOVE_BARRIER", value: 1, isUnsigned: true)
!577 = !DIEnumerator(name: "TRUE_BARRIER", value: 2, isUnsigned: true)
!578 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !153, line: 1188, baseType: !7, size: 32, elements: !579)
!579 = !{!580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!580 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!581 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!582 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!583 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!584 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!585 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!586 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!587 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!588 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!589 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!590 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!591 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!592 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!593 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!594 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!595 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!596 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!597 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!598 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!599 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!600 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!601 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!602 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!603 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!604 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!605 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!606 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!607 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!608 = !{!609, !610, !611, !612, !615, !616, !618, !419, !619, !1776, !644, !7, !1778, !1789, !1791, !1800, !1802, !1803, !1804, !1814, !5, !1831, !384, !1838, !1845, !1846, !1852, !190, !1853}
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!611 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!618 = !DIDerivedType(tag: DW_TAG_typedef, name: "ds_t", file: !562, line: 218, baseType: !611)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !621)
!621 = !{!622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632}
!622 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !620, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !620, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !620, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !620, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !620, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !620, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !620, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !620, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !620, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !620, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !620, file: !385, line: 321, baseType: !633, size: 320, offset: 64)
!633 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !634)
!634 = !{!635, !1743, !1745, !1774, !1775}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !633, file: !385, line: 316, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 64, elements: !654)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !639)
!639 = !{!640, !641, !642, !643, !646, !656, !657, !669, !693, !755, !1721, !1722, !1733, !1740}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !638, file: !385, line: 168, baseType: !611, size: 32)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !638, file: !385, line: 169, baseType: !7, size: 32)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !638, file: !385, line: 170, baseType: !616, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !638, file: !385, line: 171, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !645, line: 50, baseType: !619)
!645 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!646 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !638, file: !385, line: 172, baseType: !647, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !645, line: 53, baseType: !648)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !650)
!650 = !{!651, !652}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !649, file: !385, line: 360, baseType: !611, size: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !649, file: !385, line: 361, baseType: !653, size: 64, offset: 64)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !644, size: 64, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 1)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !638, file: !385, line: 173, baseType: !5, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !638, file: !385, line: 174, baseType: !658, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !660)
!660 = !{!661, !662, !663, !664, !665, !666, !667, !668}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !659, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !659, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !659, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !659, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !659, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !659, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !659, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !659, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !638, file: !385, line: 175, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !672, line: 23, size: 320, elements: !673)
!672 = !DIFile(filename: "./cselib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!673 = !{!674, !675, !676, !677, !684, !692}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !671, file: !672, line: 25, baseType: !7, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !671, file: !672, line: 28, baseType: !611, size: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !671, file: !672, line: 31, baseType: !644, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !671, file: !672, line: 35, baseType: !678, size: 64, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !672, line: 45, size: 192, elements: !680)
!680 = !{!681, !682, !683}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !679, file: !672, line: 47, baseType: !678, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !679, file: !672, line: 49, baseType: !644, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !679, file: !672, line: 51, baseType: !644, size: 64, offset: 128)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !671, file: !672, line: 39, baseType: !685, size: 64, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !672, line: 55, size: 128, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !686, file: !672, line: 56, baseType: !685, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !686, file: !672, line: 57, baseType: !690, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !672, line: 42, baseType: !671)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !671, file: !672, line: 41, baseType: !670, size: 64, offset: 256)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !638, file: !385, line: 176, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !696, line: 75, size: 256, elements: !697)
!696 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!697 = !{!698, !713, !714, !715}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !695, file: !696, line: 76, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !696, line: 68, baseType: !701)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !696, line: 63, size: 320, elements: !702)
!702 = !{!703, !705, !706, !707}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !701, file: !696, line: 64, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !701, file: !696, line: 65, baseType: !704, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !701, file: !696, line: 66, baseType: !7, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !701, file: !696, line: 67, baseType: !708, size: 128, offset: 192)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 128, elements: !711)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !696, line: 29, baseType: !710)
!710 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!711 = !{!712}
!712 = !DISubrange(count: 2)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !695, file: !696, line: 77, baseType: !699, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !695, file: !696, line: 78, baseType: !7, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !695, file: !696, line: 79, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !696, line: 49, baseType: !718)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !696, line: 45, size: 832, elements: !719)
!719 = !{!720, !721, !722}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !718, file: !696, line: 46, baseType: !704, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !718, file: !696, line: 47, baseType: !694, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !718, file: !696, line: 48, baseType: !723, size: 704, offset: 128)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !724, line: 164, size: 704, elements: !725)
!724 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!725 = !{!726, !728, !738, !739, !740, !741, !742, !743, !747, !751, !752, !753, !754}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !723, file: !724, line: 166, baseType: !727, size: 64)
!727 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !723, file: !724, line: 167, baseType: !729, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !730, size: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !724, line: 157, size: 192, elements: !731)
!731 = !{!732, !733, !734}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !730, file: !724, line: 159, baseType: !613, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !730, file: !724, line: 160, baseType: !729, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !730, file: !724, line: 161, baseType: !735, size: 32, offset: 128)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 32, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 4)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !723, file: !724, line: 168, baseType: !613, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !723, file: !724, line: 169, baseType: !613, size: 64, offset: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !723, file: !724, line: 170, baseType: !613, size: 64, offset: 256)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !723, file: !724, line: 171, baseType: !727, size: 64, offset: 320)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !723, file: !724, line: 172, baseType: !611, size: 32, offset: 384)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !723, file: !724, line: 176, baseType: !744, size: 64, offset: 448)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DISubroutineType(types: !746)
!746 = !{!729, !615, !727}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !723, file: !724, line: 177, baseType: !748, size: 64, offset: 512)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !749, size: 64)
!749 = !DISubroutineType(types: !750)
!750 = !{null, !615, !729}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !723, file: !724, line: 178, baseType: !615, size: 64, offset: 576)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !723, file: !724, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !723, file: !724, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !723, file: !724, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !638, file: !385, line: 177, baseType: !756, size: 64)
!756 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !645, line: 56, baseType: !757)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !759)
!759 = !{!760, !793, !799, !810, !829, !840, !845, !852, !858, !871, !883, !921, !926, !954, !962, !963, !968, !977, !983, !988, !992, !996, !1357, !1406, !1412, !1418, !1425, !1451, !1465, !1482, !1494, !1516, !1531, !1703}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !758, file: !158, line: 3372, baseType: !761, size: 64)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !762)
!762 = !{!763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !761, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !761, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !761, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !761, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !761, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !761, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !761, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !761, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !761, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !761, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !761, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !761, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !761, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !761, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !761, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !761, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !761, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !761, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !761, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !761, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !761, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !761, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !761, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !761, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !761, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !761, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !761, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !761, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !761, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !761, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !758, file: !158, line: 3373, baseType: !794, size: 192)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !795)
!795 = !{!796, !797, !798}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !794, file: !158, line: 403, baseType: !761, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !794, file: !158, line: 404, baseType: !756, size: 64, offset: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !794, file: !158, line: 405, baseType: !756, size: 64, offset: 128)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !758, file: !158, line: 3374, baseType: !800, size: 320)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !801)
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !800, file: !158, line: 1385, baseType: !794, size: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !800, file: !158, line: 1386, baseType: !804, size: 128, offset: 192)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !805, line: 58, baseType: !806)
!805 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !805, line: 54, size: 128, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !806, file: !805, line: 56, baseType: !710, size: 64)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !806, file: !805, line: 57, baseType: !727, size: 64, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !758, file: !158, line: 3375, baseType: !811, size: 256)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !811, file: !158, line: 1398, baseType: !794, size: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !811, file: !158, line: 1399, baseType: !815, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !817, line: 52, size: 256, elements: !818)
!817 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!818 = !{!819, !820, !821, !822, !823, !824, !825}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !816, file: !817, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !816, file: !817, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !816, file: !817, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !816, file: !817, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !816, file: !817, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !816, file: !817, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !816, file: !817, line: 62, baseType: !826, size: 192, offset: 64)
!826 = !DICompositeType(tag: DW_TAG_array_type, baseType: !710, size: 192, elements: !827)
!827 = !{!828}
!828 = !DISubrange(count: 3)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !758, file: !158, line: 3376, baseType: !830, size: 256)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !830, file: !158, line: 1409, baseType: !794, size: 192)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !830, file: !158, line: 1410, baseType: !834, size: 64, offset: 192)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !836, line: 27, size: 192, elements: !837)
!836 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !835, file: !836, line: 29, baseType: !804, size: 128)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !835, file: !836, line: 30, baseType: !5, size: 32, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !758, file: !158, line: 3377, baseType: !841, size: 256)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !841, file: !158, line: 1438, baseType: !794, size: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !841, file: !158, line: 1439, baseType: !756, size: 64, offset: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !758, file: !158, line: 3378, baseType: !846, size: 256)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !847)
!847 = !{!848, !849, !850}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !846, file: !158, line: 1419, baseType: !794, size: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !846, file: !158, line: 1420, baseType: !611, size: 32, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !846, file: !158, line: 1421, baseType: !851, size: 8, offset: 224)
!851 = !DICompositeType(tag: DW_TAG_array_type, baseType: !614, size: 8, elements: !654)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !758, file: !158, line: 3379, baseType: !853, size: 320)
!853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !854)
!854 = !{!855, !856, !857}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !853, file: !158, line: 1429, baseType: !794, size: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !853, file: !158, line: 1430, baseType: !756, size: 64, offset: 192)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !853, file: !158, line: 1431, baseType: !756, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !758, file: !158, line: 3380, baseType: !859, size: 320)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !859, file: !158, line: 1461, baseType: !794, size: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !859, file: !158, line: 1462, baseType: !863, size: 128, offset: 192)
!863 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !864, line: 31, size: 128, elements: !865)
!864 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!865 = !{!866, !869, !870}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !863, file: !864, line: 32, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !610)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !863, file: !864, line: 33, baseType: !7, size: 32, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !863, file: !864, line: 34, baseType: !7, size: 32, offset: 96)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !758, file: !158, line: 3381, baseType: !872, size: 384)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !873)
!873 = !{!874, !875, !880, !881, !882}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !872, file: !158, line: 2508, baseType: !794, size: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !872, file: !158, line: 2509, baseType: !876, size: 32, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !877, line: 58, baseType: !878)
!877 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !879, line: 44, baseType: !7)
!879 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!880 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !872, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !872, file: !158, line: 2511, baseType: !756, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !872, file: !158, line: 2512, baseType: !756, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !758, file: !158, line: 3382, baseType: !884, size: 896)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !885)
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !884, file: !158, line: 2653, baseType: !872, size: 384)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !884, file: !158, line: 2654, baseType: !756, size: 64, offset: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !884, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !884, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !884, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !884, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !884, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !884, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !884, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !884, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !884, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !884, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !884, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !884, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !884, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !884, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !884, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !884, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !884, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !884, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !884, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !884, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !884, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !884, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !884, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !884, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !884, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !884, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !884, file: !158, line: 2705, baseType: !756, size: 64, offset: 576)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !884, file: !158, line: 2706, baseType: !756, size: 64, offset: 640)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !884, file: !158, line: 2707, baseType: !756, size: 64, offset: 704)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !884, file: !158, line: 2708, baseType: !756, size: 64, offset: 768)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !884, file: !158, line: 2711, baseType: !919, size: 64, offset: 832)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !758, file: !158, line: 3383, baseType: !922, size: 960)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !923)
!923 = !{!924, !925}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !922, file: !158, line: 2757, baseType: !884, size: 896)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !922, file: !158, line: 2758, baseType: !644, size: 64, offset: 896)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !758, file: !158, line: 3384, baseType: !927, size: 1472)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !928)
!928 = !{!929, !950, !951, !952, !953}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !158, line: 3115, baseType: !930, size: 1216)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !931)
!931 = !{!932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !930, file: !158, line: 2985, baseType: !922, size: 960)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !930, file: !158, line: 2986, baseType: !756, size: 64, offset: 960)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !930, file: !158, line: 2987, baseType: !756, size: 64, offset: 1024)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !930, file: !158, line: 2988, baseType: !756, size: 64, offset: 1088)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !930, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !930, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !930, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !930, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !930, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !930, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !930, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !930, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !930, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !930, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !930, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !930, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !930, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !930, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !927, file: !158, line: 3117, baseType: !756, size: 64, offset: 1216)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !927, file: !158, line: 3119, baseType: !756, size: 64, offset: 1280)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !927, file: !158, line: 3121, baseType: !756, size: 64, offset: 1344)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !927, file: !158, line: 3123, baseType: !756, size: 64, offset: 1408)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !758, file: !158, line: 3385, baseType: !955, size: 1088)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !955, file: !158, line: 2875, baseType: !922, size: 960)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !955, file: !158, line: 2876, baseType: !644, size: 64, offset: 960)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !955, file: !158, line: 2877, baseType: !960, size: 64, offset: 1024)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !758, file: !158, line: 3386, baseType: !930, size: 1216)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !758, file: !158, line: 3387, baseType: !964, size: 1280)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !965)
!965 = !{!966, !967}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !158, line: 3094, baseType: !930, size: 1216)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !964, file: !158, line: 3095, baseType: !960, size: 64, offset: 1216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !758, file: !158, line: 3388, baseType: !969, size: 1216)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !970)
!970 = !{!971, !972, !973, !974, !975, !976}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !158, line: 2825, baseType: !884, size: 896)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !969, file: !158, line: 2827, baseType: !756, size: 64, offset: 896)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !969, file: !158, line: 2828, baseType: !756, size: 64, offset: 960)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !969, file: !158, line: 2829, baseType: !756, size: 64, offset: 1024)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !969, file: !158, line: 2830, baseType: !756, size: 64, offset: 1088)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !969, file: !158, line: 2831, baseType: !756, size: 64, offset: 1152)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !758, file: !158, line: 3389, baseType: !978, size: 1024)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !978, file: !158, line: 2851, baseType: !922, size: 960)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !978, file: !158, line: 2852, baseType: !611, size: 32, offset: 960)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !978, file: !158, line: 2853, baseType: !611, size: 32, offset: 992)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !758, file: !158, line: 3390, baseType: !984, size: 1024)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !158, line: 2858, baseType: !922, size: 960)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !984, file: !158, line: 2859, baseType: !960, size: 64, offset: 960)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !758, file: !158, line: 3391, baseType: !989, size: 960)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !989, file: !158, line: 2863, baseType: !922, size: 960)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !758, file: !158, line: 3392, baseType: !993, size: 1472)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !994)
!994 = !{!995}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !993, file: !158, line: 3305, baseType: !927, size: 1472)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !758, file: !158, line: 3393, baseType: !997, size: 1792)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !998)
!998 = !{!999, !1000, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !997, file: !158, line: 3249, baseType: !927, size: 1472)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !997, file: !158, line: 3251, baseType: !1001, size: 64, offset: 1472)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1003, line: 463, size: 1152, elements: !1004)
!1003 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1004 = !{!1005, !1169, !1273, !1274, !1277, !1280, !1281, !1282, !1283, !1284, !1285, !1309, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1002, file: !1003, line: 464, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1008)
!1008 = !{!1009, !1058, !1071, !1085, !1137, !1150}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1007, file: !135, line: 197, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1011)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1013)
!1013 = !{!1014, !1015, !1016, !1017, !1018, !1019, !1046, !1055, !1056, !1057}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1012, file: !135, line: 119, baseType: !1011, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1012, file: !135, line: 122, baseType: !1011, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1012, file: !135, line: 123, baseType: !1011, size: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1012, file: !135, line: 126, baseType: !611, size: 32, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1012, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1012, file: !135, line: 165, baseType: !1020, size: 192, offset: 256)
!1020 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1021)
!1021 = !{!1022, !1035, !1041}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1020, file: !135, line: 137, baseType: !1023, size: 128)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1024)
!1024 = !{!1025, !1034}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1023, file: !135, line: 135, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1027, file: !135, line: 96, baseType: !1026, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1027, file: !135, line: 97, baseType: !1026, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1027, file: !135, line: 101, baseType: !756, size: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1027, file: !135, line: 106, baseType: !756, size: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1027, file: !135, line: 111, baseType: !756, size: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1023, file: !135, line: 136, baseType: !1026, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1020, file: !135, line: 151, baseType: !1036, size: 192)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1036, file: !135, line: 141, baseType: !756, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1036, file: !135, line: 145, baseType: !756, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1036, file: !135, line: 150, baseType: !611, size: 32, offset: 128)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1020, file: !135, line: 164, baseType: !1042, size: 128)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1042, file: !135, line: 161, baseType: !756, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1042, file: !135, line: 163, baseType: !876, size: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1012, file: !135, line: 168, baseType: !1047, size: 64, offset: 448)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053, !1054}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1048, file: !135, line: 70, baseType: !1047, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1048, file: !135, line: 73, baseType: !1011, size: 64, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1048, file: !135, line: 78, baseType: !756, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1048, file: !135, line: 85, baseType: !644, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1048, file: !135, line: 88, baseType: !611, size: 32, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1012, file: !135, line: 173, baseType: !644, size: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1012, file: !135, line: 173, baseType: !644, size: 64, offset: 576)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1012, file: !135, line: 177, baseType: !610, size: 8, offset: 640)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1007, file: !135, line: 200, baseType: !1059, size: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1061)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1062)
!1062 = !{!1063}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1061, file: !135, line: 185, baseType: !1064, size: 128)
!1064 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1065)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1065, file: !135, line: 184, baseType: !7, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1065, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1065, file: !135, line: 184, baseType: !1070, size: 64, offset: 64)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1010, size: 64, elements: !654)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1007, file: !135, line: 203, baseType: !1072, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1074)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1075)
!1075 = !{!1076}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1074, file: !135, line: 189, baseType: !1077, size: 128)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1079)
!1079 = !{!1080, !1081, !1082}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1078, file: !135, line: 188, baseType: !7, size: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1078, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1078, file: !135, line: 188, baseType: !1083, size: 64, offset: 64)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 64, elements: !654)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1047)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1007, file: !135, line: 207, baseType: !1086, size: 64, offset: 192)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1087, line: 144, baseType: !1088)
!1087 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1087, line: 100, size: 896, elements: !1090)
!1090 = !{!1091, !1099, !1104, !1109, !1111, !1114, !1115, !1116, !1117, !1118, !1123, !1125, !1126, !1131, !1136}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1089, file: !1087, line: 102, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1087, line: 52, baseType: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1087, line: 47, baseType: !7)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1089, file: !1087, line: 105, baseType: !1100, size: 64, offset: 64)
!1100 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1087, line: 59, baseType: !1101)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DISubroutineType(types: !1103)
!1103 = !{!611, !1097, !1097}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1089, file: !1087, line: 108, baseType: !1105, size: 64, offset: 128)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1087, line: 63, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{null, !615}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1089, file: !1087, line: 111, baseType: !1110, size: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1089, file: !1087, line: 114, baseType: !1112, size: 64, offset: 256)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1113, line: 46, baseType: !710)
!1113 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1089, file: !1087, line: 117, baseType: !1112, size: 64, offset: 320)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1089, file: !1087, line: 120, baseType: !1112, size: 64, offset: 384)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1089, file: !1087, line: 124, baseType: !7, size: 32, offset: 448)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1089, file: !1087, line: 128, baseType: !7, size: 32, offset: 480)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1089, file: !1087, line: 131, baseType: !1119, size: 64, offset: 512)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1087, line: 75, baseType: !1120)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DISubroutineType(types: !1122)
!1122 = !{!615, !1112, !1112}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1089, file: !1087, line: 132, baseType: !1124, size: 64, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1087, line: 78, baseType: !1106)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1089, file: !1087, line: 135, baseType: !615, size: 64, offset: 640)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1089, file: !1087, line: 136, baseType: !1127, size: 64, offset: 704)
!1127 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1087, line: 82, baseType: !1128)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!615, !615, !1112, !1112}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1089, file: !1087, line: 137, baseType: !1132, size: 64, offset: 768)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1087, line: 83, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{null, !615, !615}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1089, file: !1087, line: 141, baseType: !7, size: 32, offset: 832)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1007, file: !135, line: 211, baseType: !1138, size: 64, offset: 256)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1141)
!1141 = !{!1142}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1140, file: !158, line: 183, baseType: !1143, size: 128)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1144)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1145)
!1145 = !{!1146, !1147, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1144, file: !158, line: 182, baseType: !7, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1144, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1144, file: !158, line: 182, baseType: !1149, size: 64, offset: 64)
!1149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !756, size: 64, elements: !654)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1007, file: !135, line: 220, baseType: !1151, size: 64, offset: 320)
!1151 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1152)
!1152 = !{!1153, !1154}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1151, file: !135, line: 218, baseType: !1138, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1151, file: !135, line: 219, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1157, line: 29, baseType: !1158)
!1157 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1157, line: 29, size: 96, elements: !1159)
!1159 = !{!1160}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1158, file: !1157, line: 29, baseType: !1161, size: 96)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1157, line: 27, baseType: !1162)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1157, line: 27, size: 96, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1162, file: !1157, line: 27, baseType: !7, size: 32)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1162, file: !1157, line: 27, baseType: !7, size: 32, offset: 32)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1162, file: !1157, line: 27, baseType: !1167, size: 8, offset: 64)
!1167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1168, size: 8, elements: !654)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1157, line: 26, baseType: !610)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1002, file: !1003, line: 467, baseType: !1170, size: 64, offset: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1172)
!1172 = !{!1173, !1248, !1249, !1262, !1263, !1264, !1265, !1266, !1267, !1269, !1271, !1272}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1171, file: !142, line: 377, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !645, line: 111, baseType: !1175)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1177)
!1177 = !{!1178, !1213, !1214, !1215, !1218, !1222, !1223, !1224, !1242, !1243, !1244, !1245, !1246, !1247}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1176, file: !142, line: 219, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1182)
!1182 = !{!1183}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1181, file: !142, line: 151, baseType: !1184, size: 128)
!1184 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1185)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1186)
!1186 = !{!1187, !1188, !1189}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1185, file: !142, line: 150, baseType: !7, size: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1185, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1185, file: !142, line: 150, baseType: !1190, size: 64, offset: 64)
!1190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1191, size: 64, elements: !654)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !645, line: 108, baseType: !1192)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1205, !1206, !1207, !1208, !1209, !1210, !1211}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1193, file: !142, line: 124, baseType: !1175, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1193, file: !142, line: 125, baseType: !1175, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1193, file: !142, line: 131, baseType: !1198, size: 64, offset: 128)
!1198 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1199)
!1199 = !{!1200, !1204}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1198, file: !142, line: 129, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !645, line: 66, baseType: !1202)
!1202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1203, size: 64)
!1203 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !645, line: 65, flags: DIFlagFwdDecl)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1198, file: !142, line: 130, baseType: !644, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1193, file: !142, line: 134, baseType: !615, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1193, file: !142, line: 137, baseType: !756, size: 64, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1193, file: !142, line: 138, baseType: !876, size: 32, offset: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1193, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1193, file: !142, line: 144, baseType: !611, size: 32, offset: 384)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1193, file: !142, line: 145, baseType: !611, size: 32, offset: 416)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1193, file: !142, line: 146, baseType: !1212, size: 64, offset: 448)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !727)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1176, file: !142, line: 220, baseType: !1179, size: 64, offset: 64)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1176, file: !142, line: 223, baseType: !615, size: 64, offset: 128)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1176, file: !142, line: 226, baseType: !1216, size: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1176, file: !142, line: 229, baseType: !1219, size: 128, offset: 256)
!1219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1220, size: 128, elements: !711)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1176, file: !142, line: 232, baseType: !1175, size: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1176, file: !142, line: 233, baseType: !1175, size: 64, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1176, file: !142, line: 238, baseType: !1225, size: 64, offset: 512)
!1225 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1226)
!1226 = !{!1227, !1233}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1225, file: !142, line: 236, baseType: !1228, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1230)
!1230 = !{!1231, !1232}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1229, file: !142, line: 275, baseType: !1201, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1229, file: !142, line: 278, baseType: !1201, size: 64, offset: 64)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1225, file: !142, line: 237, baseType: !1234, size: 64)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240, !1241}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1235, file: !142, line: 261, baseType: !644, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1235, file: !142, line: 262, baseType: !644, size: 64, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1235, file: !142, line: 266, baseType: !644, size: 64, offset: 128)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1235, file: !142, line: 267, baseType: !644, size: 64, offset: 192)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1235, file: !142, line: 270, baseType: !611, size: 32, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1176, file: !142, line: 241, baseType: !1212, size: 64, offset: 576)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1176, file: !142, line: 244, baseType: !611, size: 32, offset: 640)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1176, file: !142, line: 247, baseType: !611, size: 32, offset: 672)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1176, file: !142, line: 250, baseType: !611, size: 32, offset: 704)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1176, file: !142, line: 253, baseType: !611, size: 32, offset: 736)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1176, file: !142, line: 256, baseType: !611, size: 32, offset: 768)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1171, file: !142, line: 378, baseType: !1174, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1171, file: !142, line: 381, baseType: !1250, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1252)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1253)
!1253 = !{!1254}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1252, file: !142, line: 282, baseType: !1255, size: 128)
!1255 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1256)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1257)
!1257 = !{!1258, !1259, !1260}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1256, file: !142, line: 281, baseType: !7, size: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1256, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1256, file: !142, line: 281, baseType: !1261, size: 64, offset: 64)
!1261 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1174, size: 64, elements: !654)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1171, file: !142, line: 384, baseType: !611, size: 32, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1171, file: !142, line: 387, baseType: !611, size: 32, offset: 224)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1171, file: !142, line: 390, baseType: !611, size: 32, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1171, file: !142, line: 394, baseType: !1250, size: 64, offset: 320)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1171, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1171, file: !142, line: 399, baseType: !1268, size: 64, offset: 416)
!1268 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !711)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1171, file: !142, line: 402, baseType: !1270, size: 64, offset: 480)
!1270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !711)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1171, file: !142, line: 406, baseType: !611, size: 32, offset: 544)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1171, file: !142, line: 409, baseType: !611, size: 32, offset: 576)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1002, file: !1003, line: 470, baseType: !1202, size: 64, offset: 128)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1002, file: !1003, line: 473, baseType: !1275, size: 64, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1003, line: 166, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1002, file: !1003, line: 476, baseType: !1278, size: 64, offset: 256)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1003, line: 476, flags: DIFlagFwdDecl)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1002, file: !1003, line: 479, baseType: !1086, size: 64, offset: 320)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1002, file: !1003, line: 484, baseType: !756, size: 64, offset: 384)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1002, file: !1003, line: 488, baseType: !756, size: 64, offset: 448)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1002, file: !1003, line: 493, baseType: !756, size: 64, offset: 512)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1002, file: !1003, line: 496, baseType: !756, size: 64, offset: 576)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1002, file: !1003, line: 501, baseType: !1286, size: 64, offset: 640)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1288)
!1288 = !{!1289, !1292, !1293, !1294, !1295, !1297, !1298, !1303, !1304, !1305, !1306, !1307, !1308}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1287, file: !153, line: 2356, baseType: !1290, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1287, file: !153, line: 2357, baseType: !616, size: 64, offset: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1287, file: !153, line: 2358, baseType: !611, size: 32, offset: 128)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1287, file: !153, line: 2359, baseType: !611, size: 32, offset: 160)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1287, file: !153, line: 2360, baseType: !1296, size: 128, offset: 192)
!1296 = !DICompositeType(tag: DW_TAG_array_type, baseType: !611, size: 128, elements: !736)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1287, file: !153, line: 2364, baseType: !611, size: 32, offset: 320)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1287, file: !153, line: 2367, baseType: !1299, size: 128, offset: 384)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1300)
!1300 = !{!1301, !1302}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1299, file: !153, line: 2351, baseType: !644, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1299, file: !153, line: 2352, baseType: !727, size: 64, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1287, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1287, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1287, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1287, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1287, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1287, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1002, file: !1003, line: 504, baseType: !1310, size: 64, offset: 704)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1003, line: 504, flags: DIFlagFwdDecl)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1002, file: !1003, line: 507, baseType: !1086, size: 64, offset: 768)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1002, file: !1003, line: 510, baseType: !611, size: 32, offset: 832)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1002, file: !1003, line: 513, baseType: !611, size: 32, offset: 864)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1002, file: !1003, line: 516, baseType: !876, size: 32, offset: 896)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1002, file: !1003, line: 519, baseType: !876, size: 32, offset: 928)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1002, file: !1003, line: 522, baseType: !7, size: 32, offset: 960)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1002, file: !1003, line: 523, baseType: !7, size: 32, offset: 992)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1002, file: !1003, line: 528, baseType: !616, size: 64, offset: 1024)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1002, file: !1003, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1002, file: !1003, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1002, file: !1003, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1002, file: !1003, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1002, file: !1003, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1002, file: !1003, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1002, file: !1003, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1002, file: !1003, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1002, file: !1003, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1002, file: !1003, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1002, file: !1003, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1002, file: !1003, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1002, file: !1003, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1002, file: !1003, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1002, file: !1003, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1002, file: !1003, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !997, file: !158, line: 3254, baseType: !756, size: 64, offset: 1536)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !997, file: !158, line: 3257, baseType: !756, size: 64, offset: 1600)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !997, file: !158, line: 3258, baseType: !756, size: 64, offset: 1664)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !997, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !997, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !997, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !997, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !997, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !997, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !997, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !997, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !997, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !997, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !997, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !997, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !997, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !997, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !997, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !997, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !997, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !997, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !758, file: !158, line: 3394, baseType: !1358, size: 1344)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !1359)
!1359 = !{!1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1385, !1386, !1387, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1358, file: !158, line: 2280, baseType: !794, size: 192)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1358, file: !158, line: 2281, baseType: !756, size: 64, offset: 192)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1358, file: !158, line: 2282, baseType: !756, size: 64, offset: 256)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1358, file: !158, line: 2283, baseType: !756, size: 64, offset: 320)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1358, file: !158, line: 2284, baseType: !756, size: 64, offset: 384)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1358, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1358, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1358, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1358, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1358, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
