; ModuleID = 'sched-rgn.bc'
source_filename = "sched-rgn.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.region = type { i32, i32, i8 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }

!708 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!709 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!710 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!711 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!712 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!713 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!714 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!715 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!716 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!717 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!718 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!719 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!720 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!721 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!722 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!723 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!724 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!725 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!726 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!727 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!728 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!729 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!730 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!731 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!732 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!733 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!734 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!735 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!736 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!737 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!738 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!739 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!740 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!741 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!742 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!743 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!744 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!745 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!746 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!747 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!748 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!749 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!750 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!751 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!752 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!753 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!754 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!755 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sched_pass_id_t", file: !385, line: 37, baseType: !7, size: 32, elements: !756)
!756 = !{!757, !758, !759, !760, !761}
!757 = !DIEnumerator(name: "SCHED_PASS_UNKNOWN", value: 0, isUnsigned: true)
!758 = !DIEnumerator(name: "SCHED_RGN_PASS", value: 1, isUnsigned: true)
!759 = !DIEnumerator(name: "SCHED_EBB_PASS", value: 2, isUnsigned: true)
!760 = !DIEnumerator(name: "SCHED_SMS_PASS", value: 3, isUnsigned: true)
!761 = !DIEnumerator(name: "SCHED_SEL_PASS", value: 4, isUnsigned: true)
!762 = !{!763, !764, !765, !766, !769, !770, !772, !7, !395, !773, !1249, !1942, !1943, !847, !777, !1951, !1958, !1959, !1971, !5}
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!765 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !768)
!772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deps", file: !385, line: 451, size: 1472, elements: !775)
!775 = !{!776, !1913, !1914, !1915, !1916, !1917, !1918, !1919, !1920, !1921, !1922, !1923, !1924, !1925, !1926, !1936, !1939, !1940, !1941}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "pending_read_insns", scope: !774, file: !385, line: 463, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !778, line: 50, baseType: !779)
!778 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !396, line: 240, size: 384, elements: !781)
!781 = !{!782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !780, file: !396, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !780, file: !396, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !780, file: !396, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !780, file: !396, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !780, file: !396, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !780, file: !396, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !780, file: !396, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !780, file: !396, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !780, file: !396, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !780, file: !396, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !780, file: !396, line: 321, baseType: !793, size: 320, offset: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !396, line: 315, size: 320, elements: !794)
!794 = !{!795, !1880, !1882, !1911, !1912}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !793, file: !396, line: 316, baseType: !796, size: 64)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !797, size: 64, elements: !812)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !396, line: 183, baseType: !798)
!798 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !396, line: 166, size: 64, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !814, !815, !827, !830, !892, !1858, !1859, !1870, !1877}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !798, file: !396, line: 168, baseType: !765, size: 32)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !798, file: !396, line: 169, baseType: !7, size: 32)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !798, file: !396, line: 170, baseType: !770, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !798, file: !396, line: 171, baseType: !777, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !798, file: !396, line: 172, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !778, line: 53, baseType: !806)
!806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !807, size: 64)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !396, line: 359, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !807, file: !396, line: 360, baseType: !765, size: 32)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !807, file: !396, line: 361, baseType: !811, size: 64, offset: 64)
!811 = !DICompositeType(tag: DW_TAG_array_type, baseType: !777, size: 64, elements: !812)
!812 = !{!813}
!813 = !DISubrange(count: 1)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !798, file: !396, line: 173, baseType: !5, size: 32)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !798, file: !396, line: 174, baseType: !816, size: 32)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !396, line: 133, baseType: !817)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !396, line: 115, size: 32, elements: !818)
!818 = !{!819, !820, !821, !822, !823, !824, !825, !826}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !817, file: !396, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !817, file: !396, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !817, file: !396, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !817, file: !396, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !817, file: !396, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !817, file: !396, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !817, file: !396, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !817, file: !396, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !798, file: !396, line: 175, baseType: !828, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !396, line: 175, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !798, file: !396, line: 176, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !833, line: 75, size: 256, elements: !834)
!833 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!834 = !{!835, !850, !851, !852}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !832, file: !833, line: 76, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !833, line: 68, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !833, line: 63, size: 320, elements: !839)
!839 = !{!840, !842, !843, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !838, file: !833, line: 64, baseType: !841, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !838, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !838, file: !833, line: 65, baseType: !841, size: 64, offset: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !838, file: !833, line: 66, baseType: !7, size: 32, offset: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !838, file: !833, line: 67, baseType: !845, size: 128, offset: 192)
!845 = !DICompositeType(tag: DW_TAG_array_type, baseType: !846, size: 128, elements: !848)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !833, line: 29, baseType: !847)
!847 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!848 = !{!849}
!849 = !DISubrange(count: 2)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !832, file: !833, line: 77, baseType: !836, size: 64, offset: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !832, file: !833, line: 78, baseType: !7, size: 32, offset: 128)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !832, file: !833, line: 79, baseType: !853, size: 64, offset: 192)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !833, line: 49, baseType: !855)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !833, line: 45, size: 832, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !855, file: !833, line: 46, baseType: !841, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !855, file: !833, line: 47, baseType: !831, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !855, file: !833, line: 48, baseType: !860, size: 704, offset: 128)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !861, line: 164, size: 704, elements: !862)
!861 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!862 = !{!863, !865, !875, !876, !877, !878, !879, !880, !884, !888, !889, !890, !891}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !860, file: !861, line: 166, baseType: !864, size: 64)
!864 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !860, file: !861, line: 167, baseType: !866, size: 64, offset: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !861, line: 157, size: 192, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !867, file: !861, line: 159, baseType: !767, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !867, file: !861, line: 160, baseType: !866, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !867, file: !861, line: 161, baseType: !872, size: 32, offset: 128)
!872 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 32, elements: !873)
!873 = !{!874}
!874 = !DISubrange(count: 4)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !860, file: !861, line: 168, baseType: !767, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !860, file: !861, line: 169, baseType: !767, size: 64, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !860, file: !861, line: 170, baseType: !767, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !860, file: !861, line: 171, baseType: !864, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !860, file: !861, line: 172, baseType: !765, size: 32, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !860, file: !861, line: 176, baseType: !881, size: 64, offset: 448)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{!866, !769, !864}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !860, file: !861, line: 177, baseType: !885, size: 64, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !886, size: 64)
!886 = !DISubroutineType(types: !887)
!887 = !{null, !769, !866}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !860, file: !861, line: 178, baseType: !769, size: 64, offset: 576)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !860, file: !861, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !860, file: !861, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !860, file: !861, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !798, file: !396, line: 177, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !778, line: 56, baseType: !894)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !896)
!896 = !{!897, !930, !936, !947, !966, !977, !982, !989, !995, !1008, !1020, !1058, !1063, !1091, !1099, !1100, !1105, !1114, !1120, !1125, !1129, !1133, !1494, !1543, !1549, !1555, !1562, !1588, !1602, !1619, !1631, !1653, !1668, !1840}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !895, file: !158, line: 3372, baseType: !898, size: 64)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !899)
!899 = !{!900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923, !924, !925, !926, !927, !928, !929}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !898, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !898, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !898, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !898, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !898, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !898, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !898, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !898, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !898, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !898, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !898, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !898, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !898, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !898, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !898, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !898, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !898, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !898, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !898, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !898, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !898, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !898, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !898, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !898, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !898, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !898, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !898, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !898, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !898, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !898, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !895, file: !158, line: 3373, baseType: !931, size: 192)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !932)
!932 = !{!933, !934, !935}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !931, file: !158, line: 403, baseType: !898, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !931, file: !158, line: 404, baseType: !893, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !931, file: !158, line: 405, baseType: !893, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !895, file: !158, line: 3374, baseType: !937, size: 320)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !938)
!938 = !{!939, !940}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !158, line: 1385, baseType: !931, size: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !937, file: !158, line: 1386, baseType: !941, size: 128, offset: 192)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !942, line: 58, baseType: !943)
!942 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !942, line: 54, size: 128, elements: !944)
!944 = !{!945, !946}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !943, file: !942, line: 56, baseType: !847, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !943, file: !942, line: 57, baseType: !864, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !895, file: !158, line: 3375, baseType: !948, size: 256)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !949)
!949 = !{!950, !951}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !948, file: !158, line: 1398, baseType: !931, size: 192)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !948, file: !158, line: 1399, baseType: !952, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !954, line: 52, size: 256, elements: !955)
!954 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!955 = !{!956, !957, !958, !959, !960, !961, !962}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !953, file: !954, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !953, file: !954, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !953, file: !954, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !953, file: !954, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !953, file: !954, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !953, file: !954, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !953, file: !954, line: 62, baseType: !963, size: 192, offset: 64)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !847, size: 192, elements: !964)
!964 = !{!965}
!965 = !DISubrange(count: 3)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !895, file: !158, line: 3376, baseType: !967, size: 256)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !968)
!968 = !{!969, !970}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !967, file: !158, line: 1409, baseType: !931, size: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !967, file: !158, line: 1410, baseType: !971, size: 64, offset: 192)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !973, line: 27, size: 192, elements: !974)
!973 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!974 = !{!975, !976}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !972, file: !973, line: 29, baseType: !941, size: 128)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !972, file: !973, line: 30, baseType: !5, size: 32, offset: 128)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !895, file: !158, line: 3377, baseType: !978, size: 256)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !978, file: !158, line: 1438, baseType: !931, size: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !978, file: !158, line: 1439, baseType: !893, size: 64, offset: 192)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !895, file: !158, line: 3378, baseType: !983, size: 256)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !983, file: !158, line: 1419, baseType: !931, size: 192)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !983, file: !158, line: 1420, baseType: !765, size: 32, offset: 192)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !983, file: !158, line: 1421, baseType: !988, size: 8, offset: 224)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !768, size: 8, elements: !812)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !895, file: !158, line: 3379, baseType: !990, size: 320)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !990, file: !158, line: 1429, baseType: !931, size: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !990, file: !158, line: 1430, baseType: !893, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !990, file: !158, line: 1431, baseType: !893, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !895, file: !158, line: 3380, baseType: !996, size: 320)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !996, file: !158, line: 1461, baseType: !931, size: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !996, file: !158, line: 1462, baseType: !1000, size: 128, offset: 192)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1001, line: 31, size: 128, elements: !1002)
!1001 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1002 = !{!1003, !1006, !1007}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1000, file: !1001, line: 32, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !764)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1000, file: !1001, line: 33, baseType: !7, size: 32, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1000, file: !1001, line: 34, baseType: !7, size: 32, offset: 96)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !895, file: !158, line: 3381, baseType: !1009, size: 384)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !1010)
!1010 = !{!1011, !1012, !1017, !1018, !1019}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1009, file: !158, line: 2508, baseType: !931, size: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1009, file: !158, line: 2509, baseType: !1013, size: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1014, line: 58, baseType: !1015)
!1014 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1016, line: 44, baseType: !7)
!1016 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1009, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1009, file: !158, line: 2511, baseType: !893, size: 64, offset: 256)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1009, file: !158, line: 2512, baseType: !893, size: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !895, file: !158, line: 3382, baseType: !1021, size: 896)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !1022)
!1022 = !{!1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1021, file: !158, line: 2653, baseType: !1009, size: 384)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1021, file: !158, line: 2654, baseType: !893, size: 64, offset: 384)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1021, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1021, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1021, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1021, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1021, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1021, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1021, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1021, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1021, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1021, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1021, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1021, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1021, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1021, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1021, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1021, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1021, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1021, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1021, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1021, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1021, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1021, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1021, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1021, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1021, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1021, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1021, file: !158, line: 2705, baseType: !893, size: 64, offset: 576)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1021, file: !158, line: 2706, baseType: !893, size: 64, offset: 640)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1021, file: !158, line: 2707, baseType: !893, size: 64, offset: 704)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1021, file: !158, line: 2708, baseType: !893, size: 64, offset: 768)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1021, file: !158, line: 2711, baseType: !1056, size: 64, offset: 832)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !895, file: !158, line: 3383, baseType: !1059, size: 960)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !1060)
!1060 = !{!1061, !1062}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1059, file: !158, line: 2757, baseType: !1021, size: 896)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1059, file: !158, line: 2758, baseType: !777, size: 64, offset: 896)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !895, file: !158, line: 3384, baseType: !1064, size: 1472)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !1065)
!1065 = !{!1066, !1087, !1088, !1089, !1090}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1064, file: !158, line: 3115, baseType: !1067, size: 1216)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !1068)
!1068 = !{!1069, !1070, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !158, line: 2985, baseType: !1059, size: 960)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1067, file: !158, line: 2986, baseType: !893, size: 64, offset: 960)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1067, file: !158, line: 2987, baseType: !893, size: 64, offset: 1024)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1067, file: !158, line: 2988, baseType: !893, size: 64, offset: 1088)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1067, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1067, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1067, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1067, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1067, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1067, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1067, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1067, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1067, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1067, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1067, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1067, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1067, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1067, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1064, file: !158, line: 3117, baseType: !893, size: 64, offset: 1216)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1064, file: !158, line: 3119, baseType: !893, size: 64, offset: 1280)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1064, file: !158, line: 3121, baseType: !893, size: 64, offset: 1344)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1064, file: !158, line: 3123, baseType: !893, size: 64, offset: 1408)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !895, file: !158, line: 3385, baseType: !1092, size: 1088)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !1093)
!1093 = !{!1094, !1095, !1096}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !158, line: 2875, baseType: !1059, size: 960)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1092, file: !158, line: 2876, baseType: !777, size: 64, offset: 960)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1092, file: !158, line: 2877, baseType: !1097, size: 64, offset: 1024)
!1097 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1098, size: 64)
!1098 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !895, file: !158, line: 3386, baseType: !1067, size: 1216)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !895, file: !158, line: 3387, baseType: !1101, size: 1280)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1101, file: !158, line: 3094, baseType: !1067, size: 1216)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1101, file: !158, line: 3095, baseType: !1097, size: 64, offset: 1216)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !895, file: !158, line: 3388, baseType: !1106, size: 1216)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1106, file: !158, line: 2825, baseType: !1021, size: 896)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1106, file: !158, line: 2827, baseType: !893, size: 64, offset: 896)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1106, file: !158, line: 2828, baseType: !893, size: 64, offset: 960)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1106, file: !158, line: 2829, baseType: !893, size: 64, offset: 1024)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1106, file: !158, line: 2830, baseType: !893, size: 64, offset: 1088)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1106, file: !158, line: 2831, baseType: !893, size: 64, offset: 1152)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !895, file: !158, line: 3389, baseType: !1115, size: 1024)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !1116)
!1116 = !{!1117, !1118, !1119}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !158, line: 2851, baseType: !1059, size: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1115, file: !158, line: 2852, baseType: !765, size: 32, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1115, file: !158, line: 2853, baseType: !765, size: 32, offset: 992)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !895, file: !158, line: 3390, baseType: !1121, size: 1024)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !1122)
!1122 = !{!1123, !1124}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1121, file: !158, line: 2858, baseType: !1059, size: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1121, file: !158, line: 2859, baseType: !1097, size: 64, offset: 960)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !895, file: !158, line: 3391, baseType: !1126, size: 960)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !1127)
!1127 = !{!1128}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1126, file: !158, line: 2863, baseType: !1059, size: 960)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !895, file: !158, line: 3392, baseType: !1130, size: 1472)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !1131)
!1131 = !{!1132}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1130, file: !158, line: 3305, baseType: !1064, size: 1472)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !895, file: !158, line: 3393, baseType: !1134, size: 1792)
!1134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !1135)
!1135 = !{!1136, !1137, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1134, file: !158, line: 3249, baseType: !1064, size: 1472)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1134, file: !158, line: 3251, baseType: !1138, size: 64, offset: 1472)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1140, line: 463, size: 1152, elements: !1141)
!1140 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1141 = !{!1142, !1306, !1410, !1411, !1414, !1417, !1418, !1419, !1420, !1421, !1422, !1446, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1139, file: !1140, line: 464, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1145)
!1145 = !{!1146, !1195, !1208, !1222, !1274, !1287}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1144, file: !135, line: 197, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1148)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154, !1155, !1156, !1183, !1192, !1193, !1194}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1149, file: !135, line: 119, baseType: !1148, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1149, file: !135, line: 122, baseType: !1148, size: 64, offset: 64)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1149, file: !135, line: 123, baseType: !1148, size: 64, offset: 128)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1149, file: !135, line: 126, baseType: !765, size: 32, offset: 192)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1149, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1149, file: !135, line: 165, baseType: !1157, size: 192, offset: 256)
!1157 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1158)
!1158 = !{!1159, !1172, !1178}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1157, file: !135, line: 137, baseType: !1160, size: 128)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1161)
!1161 = !{!1162, !1171}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1160, file: !135, line: 135, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1165)
!1165 = !{!1166, !1167, !1168, !1169, !1170}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1164, file: !135, line: 96, baseType: !1163, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1164, file: !135, line: 97, baseType: !1163, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1164, file: !135, line: 101, baseType: !893, size: 64, offset: 128)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1164, file: !135, line: 106, baseType: !893, size: 64, offset: 192)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1164, file: !135, line: 111, baseType: !893, size: 64, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1160, file: !135, line: 136, baseType: !1163, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1157, file: !135, line: 151, baseType: !1173, size: 192)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1174)
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1173, file: !135, line: 141, baseType: !893, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1173, file: !135, line: 145, baseType: !893, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1173, file: !135, line: 150, baseType: !765, size: 32, offset: 128)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1157, file: !135, line: 164, baseType: !1179, size: 128)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1180)
!1180 = !{!1181, !1182}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1179, file: !135, line: 161, baseType: !893, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1179, file: !135, line: 163, baseType: !1013, size: 32, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1149, file: !135, line: 168, baseType: !1184, size: 64, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190, !1191}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1185, file: !135, line: 70, baseType: !1184, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1185, file: !135, line: 73, baseType: !1148, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1185, file: !135, line: 78, baseType: !893, size: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1185, file: !135, line: 85, baseType: !777, size: 64, offset: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1185, file: !135, line: 88, baseType: !765, size: 32, offset: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1149, file: !135, line: 173, baseType: !777, size: 64, offset: 512)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1149, file: !135, line: 173, baseType: !777, size: 64, offset: 576)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1149, file: !135, line: 177, baseType: !764, size: 8, offset: 640)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1144, file: !135, line: 200, baseType: !1196, size: 64, offset: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1199)
!1199 = !{!1200}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1198, file: !135, line: 185, baseType: !1201, size: 128)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1202, file: !135, line: 184, baseType: !7, size: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1202, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1202, file: !135, line: 184, baseType: !1207, size: 64, offset: 64)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1147, size: 64, elements: !812)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1144, file: !135, line: 203, baseType: !1209, size: 64, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1212)
!1212 = !{!1213}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1211, file: !135, line: 189, baseType: !1214, size: 128)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1215, file: !135, line: 188, baseType: !7, size: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1215, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1215, file: !135, line: 188, baseType: !1220, size: 64, offset: 64)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 64, elements: !812)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1184)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1144, file: !135, line: 207, baseType: !1223, size: 64, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1224, line: 144, baseType: !1225)
!1224 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1224, line: 100, size: 896, elements: !1227)
!1227 = !{!1228, !1236, !1241, !1246, !1248, !1251, !1252, !1253, !1254, !1255, !1260, !1262, !1263, !1268, !1273}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1226, file: !1224, line: 102, baseType: !1229, size: 64)
!1229 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1224, line: 52, baseType: !1230)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DISubroutineType(types: !1232)
!1232 = !{!1233, !1234}
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1224, line: 47, baseType: !7)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1226, file: !1224, line: 105, baseType: !1237, size: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1224, line: 59, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{!765, !1234, !1234}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1226, file: !1224, line: 108, baseType: !1242, size: 64, offset: 128)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1224, line: 63, baseType: !1243)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DISubroutineType(types: !1245)
!1245 = !{null, !769}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1226, file: !1224, line: 111, baseType: !1247, size: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1226, file: !1224, line: 114, baseType: !1249, size: 64, offset: 256)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1250, line: 46, baseType: !847)
!1250 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1226, file: !1224, line: 117, baseType: !1249, size: 64, offset: 320)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1226, file: !1224, line: 120, baseType: !1249, size: 64, offset: 384)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1226, file: !1224, line: 124, baseType: !7, size: 32, offset: 448)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1226, file: !1224, line: 128, baseType: !7, size: 32, offset: 480)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1226, file: !1224, line: 131, baseType: !1256, size: 64, offset: 512)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1224, line: 75, baseType: !1257)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = !DISubroutineType(types: !1259)
!1259 = !{!769, !1249, !1249}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1226, file: !1224, line: 132, baseType: !1261, size: 64, offset: 576)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1224, line: 78, baseType: !1243)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1226, file: !1224, line: 135, baseType: !769, size: 64, offset: 640)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1226, file: !1224, line: 136, baseType: !1264, size: 64, offset: 704)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1224, line: 82, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{!769, !769, !1249, !1249}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1226, file: !1224, line: 137, baseType: !1269, size: 64, offset: 768)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1224, line: 83, baseType: !1270)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DISubroutineType(types: !1272)
!1272 = !{null, !769, !769}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1226, file: !1224, line: 141, baseType: !7, size: 32, offset: 832)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1144, file: !135, line: 211, baseType: !1275, size: 64, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1278)
!1278 = !{!1279}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1277, file: !158, line: 183, baseType: !1280, size: 128)
!1280 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1281)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1282)
!1282 = !{!1283, !1284, !1285}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1281, file: !158, line: 182, baseType: !7, size: 32)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1281, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1281, file: !158, line: 182, baseType: !1286, size: 64, offset: 64)
!1286 = !DICompositeType(tag: DW_TAG_array_type, baseType: !893, size: 64, elements: !812)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1144, file: !135, line: 220, baseType: !1288, size: 64, offset: 320)
!1288 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1289)
!1289 = !{!1290, !1291}
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1288, file: !135, line: 218, baseType: !1275, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1288, file: !135, line: 219, baseType: !1292, size: 64)
!1292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1294, line: 29, baseType: !1295)
!1294 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1294, line: 29, size: 96, elements: !1296)
!1296 = !{!1297}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1295, file: !1294, line: 29, baseType: !1298, size: 96)
!1298 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1294, line: 27, baseType: !1299)
!1299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1294, line: 27, size: 96, elements: !1300)
!1300 = !{!1301, !1302, !1303}
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1299, file: !1294, line: 27, baseType: !7, size: 32)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1299, file: !1294, line: 27, baseType: !7, size: 32, offset: 32)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1299, file: !1294, line: 27, baseType: !1304, size: 8, offset: 64)
!1304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1305, size: 8, elements: !812)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1294, line: 26, baseType: !764)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1139, file: !1140, line: 467, baseType: !1307, size: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1308, size: 64)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1309)
!1309 = !{!1310, !1385, !1386, !1399, !1400, !1401, !1402, !1403, !1404, !1406, !1408, !1409}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1308, file: !142, line: 377, baseType: !1311, size: 64)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !778, line: 111, baseType: !1312)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1314)
!1314 = !{!1315, !1350, !1351, !1352, !1355, !1359, !1360, !1361, !1379, !1380, !1381, !1382, !1383, !1384}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1313, file: !142, line: 219, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1319)
!1319 = !{!1320}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1318, file: !142, line: 151, baseType: !1321, size: 128)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1323)
!1323 = !{!1324, !1325, !1326}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1322, file: !142, line: 150, baseType: !7, size: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1322, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1322, file: !142, line: 150, baseType: !1327, size: 64, offset: 64)
!1327 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1328, size: 64, elements: !812)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !778, line: 108, baseType: !1329)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1331)
!1331 = !{!1332, !1333, !1334, !1342, !1343, !1344, !1345, !1346, !1347, !1348}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1330, file: !142, line: 124, baseType: !1312, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1330, file: !142, line: 125, baseType: !1312, size: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1330, file: !142, line: 131, baseType: !1335, size: 64, offset: 128)
!1335 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1336)
!1336 = !{!1337, !1341}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1335, file: !142, line: 129, baseType: !1338, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !778, line: 66, baseType: !1339)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !778, line: 65, flags: DIFlagFwdDecl)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1335, file: !142, line: 130, baseType: !777, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1330, file: !142, line: 134, baseType: !769, size: 64, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1330, file: !142, line: 137, baseType: !893, size: 64, offset: 256)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1330, file: !142, line: 138, baseType: !1013, size: 32, offset: 320)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1330, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1330, file: !142, line: 144, baseType: !765, size: 32, offset: 384)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1330, file: !142, line: 145, baseType: !765, size: 32, offset: 416)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1330, file: !142, line: 146, baseType: !1349, size: 64, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !864)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1313, file: !142, line: 220, baseType: !1316, size: 64, offset: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1313, file: !142, line: 223, baseType: !769, size: 64, offset: 128)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1313, file: !142, line: 226, baseType: !1353, size: 64, offset: 192)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1313, file: !142, line: 229, baseType: !1356, size: 128, offset: 256)
!1356 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1357, size: 128, elements: !848)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1313, file: !142, line: 232, baseType: !1312, size: 64, offset: 384)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1313, file: !142, line: 233, baseType: !1312, size: 64, offset: 448)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1313, file: !142, line: 238, baseType: !1362, size: 64, offset: 512)
!1362 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1363)
!1363 = !{!1364, !1370}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1362, file: !142, line: 236, baseType: !1365, size: 64)
!1365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1366, size: 64)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1367)
!1367 = !{!1368, !1369}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1366, file: !142, line: 275, baseType: !1338, size: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1366, file: !142, line: 278, baseType: !1338, size: 64, offset: 64)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1362, file: !142, line: 237, baseType: !1371, size: 64)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1373)
!1373 = !{!1374, !1375, !1376, !1377, !1378}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1372, file: !142, line: 261, baseType: !777, size: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1372, file: !142, line: 262, baseType: !777, size: 64, offset: 64)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1372, file: !142, line: 266, baseType: !777, size: 64, offset: 128)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1372, file: !142, line: 267, baseType: !777, size: 64, offset: 192)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1372, file: !142, line: 270, baseType: !765, size: 32, offset: 256)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1313, file: !142, line: 241, baseType: !1349, size: 64, offset: 576)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1313, file: !142, line: 244, baseType: !765, size: 32, offset: 640)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1313, file: !142, line: 247, baseType: !765, size: 32, offset: 672)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1313, file: !142, line: 250, baseType: !765, size: 32, offset: 704)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1313, file: !142, line: 253, baseType: !765, size: 32, offset: 736)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1313, file: !142, line: 256, baseType: !765, size: 32, offset: 768)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1308, file: !142, line: 378, baseType: !1311, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1308, file: !142, line: 381, baseType: !1387, size: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1388, size: 64)
!1388 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1389)
!1389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1390)
!1390 = !{!1391}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1389, file: !142, line: 282, baseType: !1392, size: 128)
!1392 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1393)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1394)
!1394 = !{!1395, !1396, !1397}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1393, file: !142, line: 281, baseType: !7, size: 32)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1393, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1393, file: !142, line: 281, baseType: !1398, size: 64, offset: 64)
!1398 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1311, size: 64, elements: !812)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1308, file: !142, line: 384, baseType: !765, size: 32, offset: 192)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1308, file: !142, line: 387, baseType: !765, size: 32, offset: 224)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1308, file: !142, line: 390, baseType: !765, size: 32, offset: 256)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1308, file: !142, line: 394, baseType: !1387, size: 64, offset: 320)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1308, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1308, file: !142, line: 399, baseType: !1405, size: 64, offset: 416)
!1405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !848)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1308, file: !142, line: 402, baseType: !1407, size: 64, offset: 480)
!1407 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !848)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1308, file: !142, line: 406, baseType: !765, size: 32, offset: 544)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1308, file: !142, line: 409, baseType: !765, size: 32, offset: 576)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1139, file: !1140, line: 470, baseType: !1339, size: 64, offset: 128)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1139, file: !1140, line: 473, baseType: !1412, size: 64, offset: 192)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1140, line: 166, flags: DIFlagFwdDecl)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1139, file: !1140, line: 476, baseType: !1415, size: 64, offset: 256)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1140, line: 476, flags: DIFlagFwdDecl)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1139, file: !1140, line: 479, baseType: !1223, size: 64, offset: 320)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1139, file: !1140, line: 484, baseType: !893, size: 64, offset: 384)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1139, file: !1140, line: 488, baseType: !893, size: 64, offset: 448)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1139, file: !1140, line: 493, baseType: !893, size: 64, offset: 512)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1139, file: !1140, line: 496, baseType: !893, size: 64, offset: 576)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1139, file: !1140, line: 501, baseType: !1423, size: 64, offset: 640)
!1423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1424, size: 64)
!1424 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1425)
!1425 = !{!1426, !1429, !1430, !1431, !1432, !1434, !1435, !1440, !1441, !1442, !1443, !1444, !1445}
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1424, file: !153, line: 2356, baseType: !1427, size: 64)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1424, file: !153, line: 2357, baseType: !770, size: 64, offset: 64)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1424, file: !153, line: 2358, baseType: !765, size: 32, offset: 128)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1424, file: !153, line: 2359, baseType: !765, size: 32, offset: 160)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1424, file: !153, line: 2360, baseType: !1433, size: 128, offset: 192)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !765, size: 128, elements: !873)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1424, file: !153, line: 2364, baseType: !765, size: 32, offset: 320)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1424, file: !153, line: 2367, baseType: !1436, size: 128, offset: 384)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1437)
!1437 = !{!1438, !1439}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1436, file: !153, line: 2351, baseType: !777, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1436, file: !153, line: 2352, baseType: !864, size: 64, offset: 64)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1424, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1424, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1424, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1424, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1424, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1424, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1139, file: !1140, line: 504, baseType: !1447, size: 64, offset: 704)
!1447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1448, size: 64)
!1448 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1140, line: 504, flags: DIFlagFwdDecl)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1139, file: !1140, line: 507, baseType: !1223, size: 64, offset: 768)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1139, file: !1140, line: 510, baseType: !765, size: 32, offset: 832)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1139, file: !1140, line: 513, baseType: !765, size: 32, offset: 864)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1139, file: !1140, line: 516, baseType: !1013, size: 32, offset: 896)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1139, file: !1140, line: 519, baseType: !1013, size: 32, offset: 928)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1139, file: !1140, line: 522, baseType: !7, size: 32, offset: 960)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1139, file: !1140, line: 523, baseType: !7, size: 32, offset: 992)
!1456 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1139, file: !1140, line: 528, baseType: !770, size: 64, offset: 1024)
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1139, file: !1140, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1139, file: !1140, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1139, file: !1140, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1139, file: !1140, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1461 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1139, file: !1140, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1139, file: !1140, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1139, file: !1140, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1139, file: !1140, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1139, file: !1140, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1139, file: !1140, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1139, file: !1140, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1139, file: !1140, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1139, file: !1140, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1139, file: !1140, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1139, file: !1140, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1139, file: !1140, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1134, file: !158, line: 3254, baseType: !893, size: 64, offset: 1536)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1134, file: !158, line: 3257, baseType: !893, size: 64, offset: 1600)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1134, file: !158, line: 3258, baseType: !893, size: 64, offset: 1664)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1134, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1134, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1134, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1134, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1134, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1134, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1134, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1134, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1134, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1134, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1134, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1134, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1134, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1134, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1134, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1134, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1134, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1134, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !895, file: !158, line: 3394, baseType: !1495, size: 1344)
!1495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !1496)
!1496 = !{!1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515, !1516, !1517, !1518, !1519, !1522, !1523, !1524, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540}
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1495, file: !158, line: 2280, baseType: !931, size: 192)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1495, file: !158, line: 2281, baseType: !893, size: 64, offset: 192)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1495, file: !158, line: 2282, baseType: !893, size: 64, offset: 256)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1495, file: !158, line: 2283, baseType: !893, size: 64, offset: 320)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1495, file: !158, line: 2284, baseType: !893, size: 64, offset: 384)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1495, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1495, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1495, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1495, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1495, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1495, file: !158, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1495, file: !158, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1495, file: !158, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1495, file: !158, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1495, file: !158, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1495, file: !158, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1495, file: !158, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1495, file: !158, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1495, file: !158, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1495, file: !158, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1495, file: !158, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1495, file: !158, line: 2305, baseType: !7, size: 32, offset: 512)
