; ModuleID = 'sched-vis.bc'
source_filename = "sched-vis.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.haifa_sched_info = type { void ()*, i32 (%struct.rtx_def*)*, i32 ()*, i32 (%struct.rtx_def*, i32)*, i32 (%struct.rtx_def*, %struct.rtx_def*)*, i8* (%struct.rtx_def*, i32)*, i32 (%struct.rtx_def*, %struct.rtx_def*)*, i8 (%struct.rtx_def*)*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, i8, i32, void (%struct.rtx_def*, i32)*, void (%struct.rtx_def*, %struct.rtx_def*)*, %struct.basic_block_def* (%struct.basic_block_def*, %struct.rtx_def*)*, i32 }
%struct.rtx_def = type { i32, %union.u }
%union.u = type { %struct.block_symbol }
%struct.block_symbol = type { [3 x %union.rtunion_def], %struct.object_block*, i64 }
%union.rtunion_def = type { i8* }
%struct.object_block = type { %union.section*, i32, i64, %struct.VEC_rtx_gc*, %struct.VEC_rtx_gc* }
%union.section = type opaque
%struct.VEC_rtx_gc = type { %struct.VEC_rtx_base }
%struct.VEC_rtx_base = type { i32, i32, [1 x %struct.rtx_def*] }

!517 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!518 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !519, line: 36, baseType: !5, size: 32, elements: !520)
!519 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!520 = !{!521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539}
!521 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!522 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!523 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!524 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!525 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!526 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!527 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!528 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!529 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!530 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!531 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!532 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!533 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!534 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!535 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!536 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!537 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!538 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!539 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!540 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !376, line: 836, baseType: !5, size: 32, elements: !541)
!541 = !{!542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573}
!542 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!543 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!544 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!545 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!546 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!547 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!548 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!549 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!550 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!551 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!552 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!553 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!554 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!555 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!556 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!557 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!558 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!559 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!560 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!561 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!562 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!563 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!564 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!565 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!566 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!567 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!568 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!569 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!570 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!571 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!572 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!573 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!574 = !{!575, !576, !577, !578, !581, !582, !375, !584, !518, !3, !585, !600, !614, !181, !540, !615, !579}
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!577 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !580, size: 64)
!580 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!584 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !588, line: 52, size: 256, elements: !589)
!588 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!589 = !{!590, !591, !592, !593, !594, !595, !596}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !587, file: !588, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !587, file: !588, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !587, file: !588, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !587, file: !588, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !587, file: !588, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !587, file: !588, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !587, file: !588, line: 62, baseType: !597, size: 192, offset: 64)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 192, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 3)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !602)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !603, line: 27, size: 192, elements: !604)
!603 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !{!605, !613}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !602, file: !603, line: 29, baseType: !606, size: 128)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !607, line: 58, baseType: !608)
!607 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !607, line: 54, size: 128, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !608, file: !607, line: 56, baseType: !584, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !608, file: !607, line: 57, baseType: !612, size: 64, offset: 64)
!612 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !602, file: !603, line: 30, baseType: !3, size: 32, offset: 128)
!614 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !616, line: 50, baseType: !617)
!616 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !376, line: 240, size: 384, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !618, file: !376, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !618, file: !376, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !618, file: !376, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !618, file: !376, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !618, file: !376, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !618, file: !376, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !618, file: !376, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !618, file: !376, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !618, file: !376, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !618, file: !376, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !618, file: !376, line: 321, baseType: !631, size: 320, offset: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !376, line: 315, size: 320, elements: !632)
!632 = !{!633, !1594, !1596, !1625, !1626}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !631, file: !376, line: 316, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 64, elements: !650)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !376, line: 183, baseType: !636)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !376, line: 166, size: 64, elements: !637)
!637 = !{!638, !639, !640, !641, !642, !652, !653, !665, !668, !728, !1572, !1573, !1584, !1591}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !636, file: !376, line: 168, baseType: !577, size: 32)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !636, file: !376, line: 169, baseType: !5, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !636, file: !376, line: 170, baseType: !582, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !636, file: !376, line: 171, baseType: !615, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !636, file: !376, line: 172, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !616, line: 53, baseType: !644)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !376, line: 359, size: 128, elements: !646)
!646 = !{!647, !648}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !645, file: !376, line: 360, baseType: !577, size: 32)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !645, file: !376, line: 361, baseType: !649, size: 64, offset: 64)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 64, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 1)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !636, file: !376, line: 173, baseType: !3, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !636, file: !376, line: 174, baseType: !654, size: 32)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !376, line: 133, baseType: !655)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !376, line: 115, size: 32, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !655, file: !376, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !655, file: !376, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !655, file: !376, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !655, file: !376, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !655, file: !376, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !655, file: !376, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !655, file: !376, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !655, file: !376, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !636, file: !376, line: 175, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !376, line: 175, flags: DIFlagFwdDecl)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !636, file: !376, line: 176, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !671, line: 75, size: 256, elements: !672)
!671 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!672 = !{!673, !687, !688, !689}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !670, file: !671, line: 76, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !671, line: 68, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !671, line: 63, size: 320, elements: !677)
!677 = !{!678, !680, !681, !682}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !671, line: 64, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !676, file: !671, line: 65, baseType: !679, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !676, file: !671, line: 66, baseType: !5, size: 32, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !676, file: !671, line: 67, baseType: !683, size: 128, offset: 192)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !684, size: 128, elements: !685)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !671, line: 29, baseType: !584)
!685 = !{!686}
!686 = !DISubrange(count: 2)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !670, file: !671, line: 77, baseType: !674, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !670, file: !671, line: 78, baseType: !5, size: 32, offset: 128)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !670, file: !671, line: 79, baseType: !690, size: 64, offset: 192)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !671, line: 49, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !671, line: 45, size: 832, elements: !693)
!693 = !{!694, !695, !696}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !692, file: !671, line: 46, baseType: !679, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !692, file: !671, line: 47, baseType: !669, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !692, file: !671, line: 48, baseType: !697, size: 704, offset: 128)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !698, line: 164, size: 704, elements: !699)
!698 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!699 = !{!700, !701, !711, !712, !713, !714, !715, !716, !720, !724, !725, !726, !727}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !697, file: !698, line: 166, baseType: !612, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !697, file: !698, line: 167, baseType: !702, size: 64, offset: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !698, line: 157, size: 192, elements: !704)
!704 = !{!705, !706, !707}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !703, file: !698, line: 159, baseType: !579, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !703, file: !698, line: 160, baseType: !702, size: 64, offset: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !703, file: !698, line: 161, baseType: !708, size: 32, offset: 128)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 32, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 4)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !697, file: !698, line: 168, baseType: !579, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !697, file: !698, line: 169, baseType: !579, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !697, file: !698, line: 170, baseType: !579, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !697, file: !698, line: 171, baseType: !612, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !697, file: !698, line: 172, baseType: !577, size: 32, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !697, file: !698, line: 176, baseType: !717, size: 64, offset: 448)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = !DISubroutineType(types: !719)
!719 = !{!702, !581, !612}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !697, file: !698, line: 177, baseType: !721, size: 64, offset: 512)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DISubroutineType(types: !723)
!723 = !{null, !581, !702}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !697, file: !698, line: 178, baseType: !581, size: 64, offset: 576)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !697, file: !698, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !697, file: !698, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !697, file: !698, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !636, file: !376, line: 177, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !616, line: 56, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !732)
!732 = !{!733, !766, !772, !777, !783, !789, !794, !801, !807, !820, !832, !870, !875, !903, !911, !912, !917, !926, !932, !937, !941, !945, !1196, !1245, !1251, !1258, !1265, !1291, !1316, !1333, !1345, !1367, !1382, !1554}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !731, file: !149, line: 3372, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !734, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !734, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !734, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !734, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !734, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !734, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !734, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !734, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !734, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !734, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !734, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !734, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !734, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !734, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !734, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !734, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !734, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !734, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !734, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !734, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !734, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !734, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !734, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !734, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !734, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !734, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !734, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !734, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !734, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !734, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !731, file: !149, line: 3373, baseType: !767, size: 192)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !767, file: !149, line: 403, baseType: !734, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !767, file: !149, line: 404, baseType: !729, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !149, line: 405, baseType: !729, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !731, file: !149, line: 3374, baseType: !773, size: 320)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !149, line: 1385, baseType: !767, size: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !773, file: !149, line: 1386, baseType: !606, size: 128, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !731, file: !149, line: 3375, baseType: !778, size: 256)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !149, line: 1398, baseType: !767, size: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !778, file: !149, line: 1399, baseType: !782, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !731, file: !149, line: 3376, baseType: !784, size: 256)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !149, line: 1409, baseType: !767, size: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !784, file: !149, line: 1410, baseType: !788, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !602, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !731, file: !149, line: 3377, baseType: !790, size: 256)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !791)
!791 = !{!792, !793}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !149, line: 1438, baseType: !767, size: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !790, file: !149, line: 1439, baseType: !729, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !731, file: !149, line: 3378, baseType: !795, size: 256)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !795, file: !149, line: 1419, baseType: !767, size: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !795, file: !149, line: 1420, baseType: !577, size: 32, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !795, file: !149, line: 1421, baseType: !800, size: 8, offset: 224)
!800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !580, size: 8, elements: !650)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !731, file: !149, line: 3379, baseType: !802, size: 320)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !803)
!803 = !{!804, !805, !806}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !802, file: !149, line: 1429, baseType: !767, size: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !802, file: !149, line: 1430, baseType: !729, size: 64, offset: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !802, file: !149, line: 1431, baseType: !729, size: 64, offset: 256)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !731, file: !149, line: 3380, baseType: !808, size: 320)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !149, line: 1461, baseType: !767, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !808, file: !149, line: 1462, baseType: !812, size: 128, offset: 192)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !813, line: 31, size: 128, elements: !814)
!813 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!814 = !{!815, !818, !819}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !812, file: !813, line: 32, baseType: !816, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !576)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !812, file: !813, line: 33, baseType: !5, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !812, file: !813, line: 34, baseType: !5, size: 32, offset: 96)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !731, file: !149, line: 3381, baseType: !821, size: 384)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !822)
!822 = !{!823, !824, !829, !830, !831}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !149, line: 2508, baseType: !767, size: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !821, file: !149, line: 2509, baseType: !825, size: 32, offset: 192)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !826, line: 58, baseType: !827)
!826 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!827 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !828, line: 44, baseType: !5)
!828 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!829 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !821, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !821, file: !149, line: 2511, baseType: !729, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !821, file: !149, line: 2512, baseType: !729, size: 64, offset: 320)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !731, file: !149, line: 3382, baseType: !833, size: 896)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !834)
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !833, file: !149, line: 2653, baseType: !821, size: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !833, file: !149, line: 2654, baseType: !729, size: 64, offset: 384)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !833, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !833, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !833, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !833, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !833, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !833, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !833, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !833, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !833, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !833, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !833, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !833, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !833, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !833, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !833, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !833, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !833, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !833, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !833, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !833, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !833, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !833, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !833, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !833, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !833, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !833, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !833, file: !149, line: 2705, baseType: !729, size: 64, offset: 576)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !833, file: !149, line: 2706, baseType: !729, size: 64, offset: 640)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !833, file: !149, line: 2707, baseType: !729, size: 64, offset: 704)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !833, file: !149, line: 2708, baseType: !729, size: 64, offset: 768)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !833, file: !149, line: 2711, baseType: !868, size: 64, offset: 832)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !731, file: !149, line: 3383, baseType: !871, size: 960)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !872)
!872 = !{!873, !874}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !871, file: !149, line: 2757, baseType: !833, size: 896)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !871, file: !149, line: 2758, baseType: !615, size: 64, offset: 896)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !731, file: !149, line: 3384, baseType: !876, size: 1472)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !877)
!877 = !{!878, !899, !900, !901, !902}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !876, file: !149, line: 3115, baseType: !879, size: 1216)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !880)
!880 = !{!881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !879, file: !149, line: 2985, baseType: !871, size: 960)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !879, file: !149, line: 2986, baseType: !729, size: 64, offset: 960)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !879, file: !149, line: 2987, baseType: !729, size: 64, offset: 1024)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !879, file: !149, line: 2988, baseType: !729, size: 64, offset: 1088)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !879, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !879, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !879, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !879, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !879, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !879, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !879, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !879, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !879, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !879, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !879, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !879, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !879, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !879, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !876, file: !149, line: 3117, baseType: !729, size: 64, offset: 1216)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !876, file: !149, line: 3119, baseType: !729, size: 64, offset: 1280)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !876, file: !149, line: 3121, baseType: !729, size: 64, offset: 1344)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !876, file: !149, line: 3123, baseType: !729, size: 64, offset: 1408)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !731, file: !149, line: 3385, baseType: !904, size: 1088)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !904, file: !149, line: 2875, baseType: !871, size: 960)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !904, file: !149, line: 2876, baseType: !615, size: 64, offset: 960)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !904, file: !149, line: 2877, baseType: !909, size: 64, offset: 1024)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !149, line: 2856, flags: DIFlagFwdDecl)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !731, file: !149, line: 3386, baseType: !879, size: 1216)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !731, file: !149, line: 3387, baseType: !913, size: 1280)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !913, file: !149, line: 3094, baseType: !879, size: 1216)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !913, file: !149, line: 3095, baseType: !909, size: 64, offset: 1216)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !731, file: !149, line: 3388, baseType: !918, size: 1216)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !925}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !149, line: 2825, baseType: !833, size: 896)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !918, file: !149, line: 2827, baseType: !729, size: 64, offset: 896)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !918, file: !149, line: 2828, baseType: !729, size: 64, offset: 960)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !918, file: !149, line: 2829, baseType: !729, size: 64, offset: 1024)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !918, file: !149, line: 2830, baseType: !729, size: 64, offset: 1088)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !918, file: !149, line: 2831, baseType: !729, size: 64, offset: 1152)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !731, file: !149, line: 3389, baseType: !927, size: 1024)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !928)
!928 = !{!929, !930, !931}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !149, line: 2851, baseType: !871, size: 960)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !927, file: !149, line: 2852, baseType: !577, size: 32, offset: 960)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !927, file: !149, line: 2853, baseType: !577, size: 32, offset: 992)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !731, file: !149, line: 3390, baseType: !933, size: 1024)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !934)
!934 = !{!935, !936}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !149, line: 2858, baseType: !871, size: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !933, file: !149, line: 2859, baseType: !909, size: 64, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !731, file: !149, line: 3391, baseType: !938, size: 960)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !939)
!939 = !{!940}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !938, file: !149, line: 2863, baseType: !871, size: 960)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !731, file: !149, line: 3392, baseType: !942, size: 1472)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !943)
!943 = !{!944}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !942, file: !149, line: 3305, baseType: !876, size: 1472)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !731, file: !149, line: 3393, baseType: !946, size: 1792)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !947)
!947 = !{!948, !949, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193, !1194, !1195}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !946, file: !149, line: 3249, baseType: !876, size: 1472)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !946, file: !149, line: 3251, baseType: !950, size: 64, offset: 1472)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !952, line: 463, size: 1152, elements: !953)
!952 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!953 = !{!954, !957, !1061, !1062, !1065, !1068, !1120, !1121, !1122, !1123, !1124, !1148, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !951, file: !952, line: 464, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !952, line: 464, flags: DIFlagFwdDecl)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !951, file: !952, line: 467, baseType: !958, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !960)
!960 = !{!961, !1036, !1037, !1050, !1051, !1052, !1053, !1054, !1055, !1057, !1059, !1060}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !959, file: !133, line: 377, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !616, line: 111, baseType: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !965)
!965 = !{!966, !1001, !1002, !1003, !1006, !1010, !1011, !1012, !1030, !1031, !1032, !1033, !1034, !1035}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !964, file: !133, line: 219, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !969)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !970)
!970 = !{!971}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !969, file: !133, line: 151, baseType: !972, size: 128)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !973)
!973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !974)
!974 = !{!975, !976, !977}
!975 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !973, file: !133, line: 150, baseType: !5, size: 32)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !973, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !973, file: !133, line: 150, baseType: !978, size: 64, offset: 64)
!978 = !DICompositeType(tag: DW_TAG_array_type, baseType: !979, size: 64, elements: !650)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !616, line: 108, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !982)
!982 = !{!983, !984, !985, !993, !994, !995, !996, !997, !998, !999}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !981, file: !133, line: 124, baseType: !963, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !981, file: !133, line: 125, baseType: !963, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !981, file: !133, line: 131, baseType: !986, size: 64, offset: 128)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !987)
!987 = !{!988, !992}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !986, file: !133, line: 129, baseType: !989, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !616, line: 66, baseType: !990)
!990 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !991, size: 64)
!991 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !616, line: 65, flags: DIFlagFwdDecl)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !986, file: !133, line: 130, baseType: !615, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !981, file: !133, line: 134, baseType: !581, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !981, file: !133, line: 137, baseType: !729, size: 64, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !981, file: !133, line: 138, baseType: !825, size: 32, offset: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !981, file: !133, line: 142, baseType: !5, size: 32, offset: 352)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !981, file: !133, line: 144, baseType: !577, size: 32, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !981, file: !133, line: 145, baseType: !577, size: 32, offset: 416)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !981, file: !133, line: 146, baseType: !1000, size: 64, offset: 448)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !133, line: 119, baseType: !612)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !964, file: !133, line: 220, baseType: !967, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !964, file: !133, line: 223, baseType: !581, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !964, file: !133, line: 226, baseType: !1004, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !133, line: 185, flags: DIFlagFwdDecl)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !964, file: !133, line: 229, baseType: !1007, size: 128, offset: 256)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 128, elements: !685)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !133, line: 229, flags: DIFlagFwdDecl)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !964, file: !133, line: 232, baseType: !963, size: 64, offset: 384)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !964, file: !133, line: 233, baseType: !963, size: 64, offset: 448)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !964, file: !133, line: 238, baseType: !1013, size: 64, offset: 512)
!1013 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !133, line: 235, size: 64, elements: !1014)
!1014 = !{!1015, !1021}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1013, file: !133, line: 236, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !133, line: 273, size: 128, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1017, file: !133, line: 275, baseType: !989, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1017, file: !133, line: 278, baseType: !989, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1013, file: !133, line: 237, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !133, line: 259, size: 320, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1023, file: !133, line: 261, baseType: !615, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1023, file: !133, line: 262, baseType: !615, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1023, file: !133, line: 266, baseType: !615, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1023, file: !133, line: 267, baseType: !615, size: 64, offset: 192)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1023, file: !133, line: 270, baseType: !577, size: 32, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !964, file: !133, line: 241, baseType: !1000, size: 64, offset: 576)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !964, file: !133, line: 244, baseType: !577, size: 32, offset: 640)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !964, file: !133, line: 247, baseType: !577, size: 32, offset: 672)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !964, file: !133, line: 250, baseType: !577, size: 32, offset: 704)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !964, file: !133, line: 253, baseType: !577, size: 32, offset: 736)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !964, file: !133, line: 256, baseType: !577, size: 32, offset: 768)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !959, file: !133, line: 378, baseType: !962, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !959, file: !133, line: 381, baseType: !1038, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !1040)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !1041)
!1041 = !{!1042}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1040, file: !133, line: 282, baseType: !1043, size: 128)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !1044)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !1045)
!1045 = !{!1046, !1047, !1048}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1044, file: !133, line: 281, baseType: !5, size: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1044, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1044, file: !133, line: 281, baseType: !1049, size: 64, offset: 64)
!1049 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 64, elements: !650)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !959, file: !133, line: 384, baseType: !577, size: 32, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !959, file: !133, line: 387, baseType: !577, size: 32, offset: 224)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !959, file: !133, line: 390, baseType: !577, size: 32, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !959, file: !133, line: 394, baseType: !1038, size: 64, offset: 320)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !959, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !959, file: !133, line: 399, baseType: !1056, size: 64, offset: 416)
!1056 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !685)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !959, file: !133, line: 402, baseType: !1058, size: 64, offset: 480)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !685)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !959, file: !133, line: 406, baseType: !577, size: 32, offset: 544)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !959, file: !133, line: 409, baseType: !577, size: 32, offset: 576)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !951, file: !952, line: 470, baseType: !990, size: 64, offset: 128)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !951, file: !952, line: 473, baseType: !1063, size: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !952, line: 166, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !951, file: !952, line: 476, baseType: !1066, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !952, line: 476, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !951, file: !952, line: 479, baseType: !1069, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1070, line: 144, baseType: !1071)
!1070 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1070, line: 100, size: 896, elements: !1073)
!1073 = !{!1074, !1082, !1087, !1092, !1094, !1097, !1098, !1099, !1100, !1101, !1106, !1108, !1109, !1114, !1119}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1072, file: !1070, line: 102, baseType: !1075, size: 64)
!1075 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1070, line: 52, baseType: !1076)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DISubroutineType(types: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1070, line: 47, baseType: !5)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1072, file: !1070, line: 105, baseType: !1083, size: 64, offset: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1070, line: 59, baseType: !1084)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{!577, !1080, !1080}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1072, file: !1070, line: 108, baseType: !1088, size: 64, offset: 128)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1070, line: 63, baseType: !1089)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = !DISubroutineType(types: !1091)
!1091 = !{null, !581}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1072, file: !1070, line: 111, baseType: !1093, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1072, file: !1070, line: 114, baseType: !1095, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1096, line: 46, baseType: !584)
!1096 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1072, file: !1070, line: 117, baseType: !1095, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1072, file: !1070, line: 120, baseType: !1095, size: 64, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1072, file: !1070, line: 124, baseType: !5, size: 32, offset: 448)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1072, file: !1070, line: 128, baseType: !5, size: 32, offset: 480)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1072, file: !1070, line: 131, baseType: !1102, size: 64, offset: 512)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1070, line: 75, baseType: !1103)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DISubroutineType(types: !1105)
!1105 = !{!581, !1095, !1095}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1072, file: !1070, line: 132, baseType: !1107, size: 64, offset: 576)
!1107 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1070, line: 78, baseType: !1089)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1072, file: !1070, line: 135, baseType: !581, size: 64, offset: 640)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1072, file: !1070, line: 136, baseType: !1110, size: 64, offset: 704)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1070, line: 82, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{!581, !581, !1095, !1095}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1072, file: !1070, line: 137, baseType: !1115, size: 64, offset: 768)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1070, line: 83, baseType: !1116)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DISubroutineType(types: !1118)
!1118 = !{null, !581, !581}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1072, file: !1070, line: 141, baseType: !5, size: 32, offset: 832)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !951, file: !952, line: 484, baseType: !729, size: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !951, file: !952, line: 488, baseType: !729, size: 64, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !951, file: !952, line: 493, baseType: !729, size: 64, offset: 512)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !951, file: !952, line: 496, baseType: !729, size: 64, offset: 576)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !951, file: !952, line: 501, baseType: !1125, size: 64, offset: 640)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1127)
!1127 = !{!1128, !1131, !1132, !1133, !1134, !1136, !1137, !1142, !1143, !1144, !1145, !1146, !1147}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1126, file: !144, line: 2356, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1126, file: !144, line: 2357, baseType: !582, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1126, file: !144, line: 2358, baseType: !577, size: 32, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1126, file: !144, line: 2359, baseType: !577, size: 32, offset: 160)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1126, file: !144, line: 2360, baseType: !1135, size: 128, offset: 192)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 128, elements: !709)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1126, file: !144, line: 2364, baseType: !577, size: 32, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1126, file: !144, line: 2367, baseType: !1138, size: 128, offset: 384)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1138, file: !144, line: 2351, baseType: !615, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1138, file: !144, line: 2352, baseType: !612, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1126, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1126, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1126, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1126, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1126, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1126, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !951, file: !952, line: 504, baseType: !1149, size: 64, offset: 704)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !952, line: 504, flags: DIFlagFwdDecl)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !951, file: !952, line: 507, baseType: !1069, size: 64, offset: 768)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !951, file: !952, line: 510, baseType: !577, size: 32, offset: 832)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !951, file: !952, line: 513, baseType: !577, size: 32, offset: 864)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !951, file: !952, line: 516, baseType: !825, size: 32, offset: 896)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !951, file: !952, line: 519, baseType: !825, size: 32, offset: 928)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !951, file: !952, line: 522, baseType: !5, size: 32, offset: 960)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !951, file: !952, line: 523, baseType: !5, size: 32, offset: 992)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !951, file: !952, line: 528, baseType: !582, size: 64, offset: 1024)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !951, file: !952, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !951, file: !952, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !951, file: !952, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !951, file: !952, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !951, file: !952, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !951, file: !952, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !951, file: !952, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !951, file: !952, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !951, file: !952, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !951, file: !952, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !951, file: !952, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !951, file: !952, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !951, file: !952, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !951, file: !952, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !951, file: !952, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !951, file: !952, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !946, file: !149, line: 3254, baseType: !729, size: 64, offset: 1536)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !946, file: !149, line: 3257, baseType: !729, size: 64, offset: 1600)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !946, file: !149, line: 3258, baseType: !729, size: 64, offset: 1664)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !946, file: !149, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !946, file: !149, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !946, file: !149, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !946, file: !149, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !946, file: !149, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !946, file: !149, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !946, file: !149, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !946, file: !149, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !946, file: !149, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !946, file: !149, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !946, file: !149, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !946, file: !149, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !946, file: !149, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !946, file: !149, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !946, file: !149, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !946, file: !149, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !946, file: !149, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !946, file: !149, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !731, file: !149, line: 3394, baseType: !1197, size: 1344)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !149, line: 2279, size: 1344, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1224, !1225, !1226, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1197, file: !149, line: 2280, baseType: !767, size: 192)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1197, file: !149, line: 2281, baseType: !729, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1197, file: !149, line: 2282, baseType: !729, size: 64, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1197, file: !149, line: 2283, baseType: !729, size: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1197, file: !149, line: 2284, baseType: !729, size: 64, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1197, file: !149, line: 2285, baseType: !5, size: 32, offset: 448)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1197, file: !149, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1197, file: !149, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1197, file: !149, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1197, file: !149, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1197, file: !149, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1197, file: !149, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1197, file: !149, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1197, file: !149, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1197, file: !149, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1197, file: !149, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1197, file: !149, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1197, file: !149, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1197, file: !149, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1197, file: !149, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1197, file: !149, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1197, file: !149, line: 2305, baseType: !5, size: 32, offset: 512)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1197, file: !149, line: 2306, baseType: !1222, size: 32, offset: 544)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1223, line: 31, baseType: !577)
!1223 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1197, file: !149, line: 2307, baseType: !729, size: 64, offset: 576)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1197, file: !149, line: 2308, baseType: !729, size: 64, offset: 640)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1197, file: !149, line: 2314, baseType: !1227, size: 64, offset: 704)
!1227 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !149, line: 2309, size: 64, elements: !1228)
!1228 = !{!1229, !1230, !1231}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1227, file: !149, line: 2310, baseType: !577, size: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1227, file: !149, line: 2311, baseType: !582, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1227, file: !149, line: 2312, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !149, line: 2277, flags: DIFlagFwdDecl)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1197, file: !149, line: 2315, baseType: !729, size: 64, offset: 768)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1197, file: !149, line: 2316, baseType: !729, size: 64, offset: 832)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1197, file: !149, line: 2317, baseType: !729, size: 64, offset: 896)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1197, file: !149, line: 2318, baseType: !729, size: 64, offset: 960)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1197, file: !149, line: 2319, baseType: !729, size: 64, offset: 1024)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1197, file: !149, line: 2320, baseType: !729, size: 64, offset: 1088)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1197, file: !149, line: 2321, baseType: !729, size: 64, offset: 1152)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1197, file: !149, line: 2322, baseType: !729, size: 64, offset: 1216)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1197, file: !149, line: 2324, baseType: !1243, size: 64, offset: 1280)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !149, line: 2324, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !731, file: !149, line: 3395, baseType: !1246, size: 320)
!1246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !149, line: 1469, size: 320, elements: !1247)
!1247 = !{!1248, !1249, !1250}
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1246, file: !149, line: 1470, baseType: !767, size: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1246, file: !149, line: 1471, baseType: !729, size: 64, offset: 192)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1246, file: !149, line: 1472, baseType: !729, size: 64, offset: 256)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !731, file: !149, line: 3396, baseType: !1252, size: 320)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !149, line: 1482, size: 320, elements: !1253)
!1253 = !{!1254, !1255, !1256}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1252, file: !149, line: 1483, baseType: !767, size: 192)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1252, file: !149, line: 1484, baseType: !577, size: 32, offset: 192)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1252, file: !149, line: 1485, baseType: !1257, size: 64, offset: 256)
!1257 = !DICompositeType(tag: DW_TAG_array_type, baseType: !729, size: 64, elements: !650)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !731, file: !149, line: 3397, baseType: !1259, size: 384)
!1259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !149, line: 1829, size: 384, elements: !1260)
!1260 = !{!1261, !1262, !1263, !1264}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1259, file: !149, line: 1830, baseType: !767, size: 192)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1259, file: !149, line: 1831, baseType: !825, size: 32, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1259, file: !149, line: 1832, baseType: !729, size: 64, offset: 256)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1259, file: !149, line: 1835, baseType: !1257, size: 64, offset: 320)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !731, file: !149, line: 3398, baseType: !1266, size: 704)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !149, line: 1898, size: 704, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1274, !1275, !1278}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1266, file: !149, line: 1899, baseType: !767, size: 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1266, file: !149, line: 1902, baseType: !729, size: 64, offset: 192)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1266, file: !149, line: 1905, baseType: !1271, size: 64, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !616, line: 58, baseType: !1272)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !616, line: 57, flags: DIFlagFwdDecl)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1266, file: !149, line: 1908, baseType: !5, size: 32, offset: 320)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1266, file: !149, line: 1911, baseType: !1276, size: 64, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1277, size: 64)
!1277 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !149, line: 1876, flags: DIFlagFwdDecl)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1266, file: !149, line: 1914, baseType: !1279, size: 256, offset: 448)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1280)
!1280 = !{!1281, !1283, !1284, !1289}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1279, file: !149, line: 1884, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1279, file: !149, line: 1885, baseType: !1282, size: 64, offset: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1279, file: !149, line: 1891, baseType: !1285, size: 64, offset: 128)
!1285 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1279, file: !149, line: 1891, size: 64, elements: !1286)
!1286 = !{!1287, !1288}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1285, file: !149, line: 1891, baseType: !1271, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1285, file: !149, line: 1891, baseType: !729, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1279, file: !149, line: 1892, baseType: !1290, size: 64, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !731, file: !149, line: 3399, baseType: !1292, size: 704)
!1292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !149, line: 2008, size: 704, elements: !1293)
!1293 = !{!1294, !1295, !1296, !1297, !1298, !1299, !1311, !1312, !1313, !1314, !1315}
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1292, file: !149, line: 2009, baseType: !767, size: 192)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1292, file: !149, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1292, file: !149, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1292, file: !149, line: 2014, baseType: !825, size: 32, offset: 224)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1292, file: !149, line: 2016, baseType: !729, size: 64, offset: 256)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1292, file: !149, line: 2017, baseType: !1300, size: 64, offset: 320)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1302)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1303)
!1303 = !{!1304}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1302, file: !149, line: 183, baseType: !1305, size: 128)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1306)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1307)
!1307 = !{!1308, !1309, !1310}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1306, file: !149, line: 182, baseType: !5, size: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1306, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1306, file: !149, line: 182, baseType: !1257, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1292, file: !149, line: 2019, baseType: !729, size: 64, offset: 384)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1292, file: !149, line: 2020, baseType: !729, size: 64, offset: 448)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1292, file: !149, line: 2021, baseType: !729, size: 64, offset: 512)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1292, file: !149, line: 2022, baseType: !729, size: 64, offset: 576)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1292, file: !149, line: 2023, baseType: !729, size: 64, offset: 640)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !731, file: !149, line: 3400, baseType: !1317, size: 832)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !149, line: 2430, size: 832, elements: !1318)
!1318 = !{!1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1317, file: !149, line: 2431, baseType: !767, size: 192)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1317, file: !149, line: 2433, baseType: !729, size: 64, offset: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1317, file: !149, line: 2434, baseType: !729, size: 64, offset: 256)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1317, file: !149, line: 2435, baseType: !729, size: 64, offset: 320)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1317, file: !149, line: 2436, baseType: !729, size: 64, offset: 384)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1317, file: !149, line: 2437, baseType: !1300, size: 64, offset: 448)
