; ModuleID = 'sched-ebb.bc'
source_filename = "sched-ebb.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gcov_ctr_summary = type opaque
%struct.param_info = type { i8*, i32, i8, i32, i32, i8* }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }

!527 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "sched_pass_id_t", file: !528, line: 37, baseType: !7, size: 32, elements: !529)
!528 = !DIFile(filename: "./sched-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!529 = !{!530, !531, !532, !533, !534}
!530 = !DIEnumerator(name: "SCHED_PASS_UNKNOWN", value: 0, isUnsigned: true)
!531 = !DIEnumerator(name: "SCHED_RGN_PASS", value: 1, isUnsigned: true)
!532 = !DIEnumerator(name: "SCHED_EBB_PASS", value: 2, isUnsigned: true)
!533 = !DIEnumerator(name: "SCHED_SMS_PASS", value: 3, isUnsigned: true)
!534 = !DIEnumerator(name: "SCHED_SEL_PASS", value: 4, isUnsigned: true)
!535 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "post_call_group", file: !528, line: 432, baseType: !7, size: 32, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIEnumerator(name: "not_post_call", value: 0, isUnsigned: true)
!538 = !DIEnumerator(name: "post_call", value: 1, isUnsigned: true)
!539 = !DIEnumerator(name: "post_call_initial", value: 2, isUnsigned: true)
!540 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_pending_barrier_mode", file: !528, line: 424, baseType: !7, size: 32, elements: !541)
!541 = !{!542, !543, !544}
!542 = !DIEnumerator(name: "NOT_A_BARRIER", value: 0, isUnsigned: true)
!543 = !DIEnumerator(name: "MOVE_BARRIER", value: 1, isUnsigned: true)
!544 = !DIEnumerator(name: "TRUE_BARRIER", value: 2, isUnsigned: true)
!545 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !385, line: 836, baseType: !7, size: 32, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578}
!547 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!548 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!549 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!550 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!551 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!552 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!553 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!554 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!555 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!556 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!557 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!558 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!559 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!560 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!561 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!562 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!563 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!564 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!565 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!566 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!567 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!568 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!569 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!570 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!571 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!572 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!573 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!574 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!575 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!576 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!577 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!578 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!579 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "DEPS_ADJUST_RESULT", file: !528, line: 1016, baseType: !7, size: 32, elements: !580)
!580 = !{!581, !582, !583, !584}
!581 = !DIEnumerator(name: "DEP_NODEP", value: 0, isUnsigned: true)
!582 = !DIEnumerator(name: "DEP_PRESENT", value: 1, isUnsigned: true)
!583 = !DIEnumerator(name: "DEP_CHANGED", value: 2, isUnsigned: true)
!584 = !DIEnumerator(name: "DEP_CREATED", value: 3, isUnsigned: true)
!585 = !{!586, !587, !588, !589, !592, !593, !384, !5, !595, !1129, !1763}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!588 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !591)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !596, line: 50, baseType: !597)
!596 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !598, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !598, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !598, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !598, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !598, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !598, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !598, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !598, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !598, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !598, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !598, file: !385, line: 321, baseType: !611, size: 320, offset: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !612)
!612 = !{!613, !1698, !1700, !1761, !1762}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !611, file: !385, line: 316, baseType: !614, size: 64)
!614 = !DICompositeType(tag: DW_TAG_array_type, baseType: !615, size: 64, elements: !630)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !616)
!616 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !632, !633, !645, !648, !710, !1676, !1677, !1688, !1695}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !616, file: !385, line: 168, baseType: !588, size: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !616, file: !385, line: 169, baseType: !7, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !616, file: !385, line: 170, baseType: !593, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !616, file: !385, line: 171, baseType: !595, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !616, file: !385, line: 172, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !596, line: 53, baseType: !624)
!624 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !625, size: 64)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !626)
!626 = !{!627, !628}
!627 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !625, file: !385, line: 360, baseType: !588, size: 32)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !625, file: !385, line: 361, baseType: !629, size: 64, offset: 64)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 64, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 1)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !616, file: !385, line: 173, baseType: !5, size: 32)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !616, file: !385, line: 174, baseType: !634, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !635)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !636)
!636 = !{!637, !638, !639, !640, !641, !642, !643, !644}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !635, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !635, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !635, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !635, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !635, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !635, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !635, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !635, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !616, file: !385, line: 175, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !616, file: !385, line: 176, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !651, line: 75, size: 256, elements: !652)
!651 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!652 = !{!653, !668, !669, !670}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !650, file: !651, line: 76, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !651, line: 68, baseType: !656)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !651, line: 63, size: 320, elements: !657)
!657 = !{!658, !660, !661, !662}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !656, file: !651, line: 64, baseType: !659, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !656, file: !651, line: 65, baseType: !659, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !656, file: !651, line: 66, baseType: !7, size: 32, offset: 128)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !656, file: !651, line: 67, baseType: !663, size: 128, offset: 192)
!663 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 128, elements: !666)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !651, line: 29, baseType: !665)
!665 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!666 = !{!667}
!667 = !DISubrange(count: 2)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !650, file: !651, line: 77, baseType: !654, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !650, file: !651, line: 78, baseType: !7, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !650, file: !651, line: 79, baseType: !671, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !651, line: 49, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !651, line: 45, size: 832, elements: !674)
!674 = !{!675, !676, !677}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !673, file: !651, line: 46, baseType: !659, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !673, file: !651, line: 47, baseType: !649, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !673, file: !651, line: 48, baseType: !678, size: 704, offset: 128)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !679, line: 164, size: 704, elements: !680)
!679 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!680 = !{!681, !683, !693, !694, !695, !696, !697, !698, !702, !706, !707, !708, !709}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !678, file: !679, line: 166, baseType: !682, size: 64)
!682 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !678, file: !679, line: 167, baseType: !684, size: 64, offset: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !679, line: 157, size: 192, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !685, file: !679, line: 159, baseType: !590, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !685, file: !679, line: 160, baseType: !684, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !685, file: !679, line: 161, baseType: !690, size: 32, offset: 128)
!690 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 32, elements: !691)
!691 = !{!692}
!692 = !DISubrange(count: 4)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !678, file: !679, line: 168, baseType: !590, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !678, file: !679, line: 169, baseType: !590, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !678, file: !679, line: 170, baseType: !590, size: 64, offset: 256)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !678, file: !679, line: 171, baseType: !682, size: 64, offset: 320)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !678, file: !679, line: 172, baseType: !588, size: 32, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !678, file: !679, line: 176, baseType: !699, size: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DISubroutineType(types: !701)
!701 = !{!684, !592, !682}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !678, file: !679, line: 177, baseType: !703, size: 64, offset: 512)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DISubroutineType(types: !705)
!705 = !{null, !592, !684}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !678, file: !679, line: 178, baseType: !592, size: 64, offset: 576)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !678, file: !679, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !678, file: !679, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !678, file: !679, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !616, file: !385, line: 177, baseType: !711, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !596, line: 56, baseType: !712)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!713 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !158, line: 3371, size: 1792, elements: !714)
!714 = !{!715, !748, !754, !765, !784, !795, !800, !807, !813, !826, !838, !876, !881, !909, !917, !918, !923, !932, !938, !943, !947, !951, !1312, !1361, !1367, !1373, !1380, !1406, !1420, !1437, !1449, !1471, !1486, !1658}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !713, file: !158, line: 3372, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !158, line: 360, size: 64, elements: !717)
!717 = !{!718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !716, file: !158, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !716, file: !158, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !716, file: !158, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !716, file: !158, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !716, file: !158, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !716, file: !158, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !716, file: !158, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !716, file: !158, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !716, file: !158, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !716, file: !158, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !716, file: !158, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !716, file: !158, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !716, file: !158, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !716, file: !158, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !716, file: !158, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !716, file: !158, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !716, file: !158, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !716, file: !158, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !716, file: !158, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !716, file: !158, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !716, file: !158, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !716, file: !158, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !716, file: !158, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !716, file: !158, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !716, file: !158, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !716, file: !158, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !716, file: !158, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !716, file: !158, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !716, file: !158, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !716, file: !158, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !158, line: 3373, baseType: !749, size: 192)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !158, line: 402, size: 192, elements: !750)
!750 = !{!751, !752, !753}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !749, file: !158, line: 403, baseType: !716, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !749, file: !158, line: 404, baseType: !711, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !749, file: !158, line: 405, baseType: !711, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !713, file: !158, line: 3374, baseType: !755, size: 320)
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !158, line: 1384, size: 320, elements: !756)
!756 = !{!757, !758}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !755, file: !158, line: 1385, baseType: !749, size: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !755, file: !158, line: 1386, baseType: !759, size: 128, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !760, line: 58, baseType: !761)
!760 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !760, line: 54, size: 128, elements: !762)
!762 = !{!763, !764}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !761, file: !760, line: 56, baseType: !665, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !761, file: !760, line: 57, baseType: !682, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !713, file: !158, line: 3375, baseType: !766, size: 256)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !158, line: 1397, size: 256, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !766, file: !158, line: 1398, baseType: !749, size: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !766, file: !158, line: 1399, baseType: !770, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !772, line: 52, size: 256, elements: !773)
!772 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!773 = !{!774, !775, !776, !777, !778, !779, !780}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !771, file: !772, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !771, file: !772, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !771, file: !772, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !771, file: !772, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !771, file: !772, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !771, file: !772, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !771, file: !772, line: 62, baseType: !781, size: 192, offset: 64)
!781 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 192, elements: !782)
!782 = !{!783}
!783 = !DISubrange(count: 3)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !713, file: !158, line: 3376, baseType: !785, size: 256)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !158, line: 1408, size: 256, elements: !786)
!786 = !{!787, !788}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !785, file: !158, line: 1409, baseType: !749, size: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !785, file: !158, line: 1410, baseType: !789, size: 64, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !790, size: 64)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !791, line: 27, size: 192, elements: !792)
!791 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !790, file: !791, line: 29, baseType: !759, size: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !790, file: !791, line: 30, baseType: !5, size: 32, offset: 128)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !713, file: !158, line: 3377, baseType: !796, size: 256)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !158, line: 1437, size: 256, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !796, file: !158, line: 1438, baseType: !749, size: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !796, file: !158, line: 1439, baseType: !711, size: 64, offset: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !713, file: !158, line: 3378, baseType: !801, size: 256)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !158, line: 1418, size: 256, elements: !802)
!802 = !{!803, !804, !805}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !801, file: !158, line: 1419, baseType: !749, size: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !801, file: !158, line: 1420, baseType: !588, size: 32, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !801, file: !158, line: 1421, baseType: !806, size: 8, offset: 224)
!806 = !DICompositeType(tag: DW_TAG_array_type, baseType: !591, size: 8, elements: !630)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !713, file: !158, line: 3379, baseType: !808, size: 320)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !158, line: 1428, size: 320, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !158, line: 1429, baseType: !749, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !808, file: !158, line: 1430, baseType: !711, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !808, file: !158, line: 1431, baseType: !711, size: 64, offset: 256)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !713, file: !158, line: 3380, baseType: !814, size: 320)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !158, line: 1460, size: 320, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !158, line: 1461, baseType: !749, size: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !814, file: !158, line: 1462, baseType: !818, size: 128, offset: 192)
!818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !819, line: 31, size: 128, elements: !820)
!819 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!820 = !{!821, !824, !825}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !818, file: !819, line: 32, baseType: !822, size: 64)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !587)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !818, file: !819, line: 33, baseType: !7, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !818, file: !819, line: 34, baseType: !7, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !713, file: !158, line: 3381, baseType: !827, size: 384)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !158, line: 2507, size: 384, elements: !828)
!828 = !{!829, !830, !835, !836, !837}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !827, file: !158, line: 2508, baseType: !749, size: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !827, file: !158, line: 2509, baseType: !831, size: 32, offset: 192)
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !832, line: 58, baseType: !833)
!832 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!833 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !834, line: 44, baseType: !7)
!834 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!835 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !827, file: !158, line: 2510, baseType: !7, size: 32, offset: 224)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !827, file: !158, line: 2511, baseType: !711, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !827, file: !158, line: 2512, baseType: !711, size: 64, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !713, file: !158, line: 3382, baseType: !839, size: 896)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !158, line: 2652, size: 896, elements: !840)
!840 = !{!841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !158, line: 2653, baseType: !827, size: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !839, file: !158, line: 2654, baseType: !711, size: 64, offset: 384)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !839, file: !158, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !839, file: !158, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !839, file: !158, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !839, file: !158, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !839, file: !158, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !839, file: !158, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !839, file: !158, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !839, file: !158, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !839, file: !158, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !839, file: !158, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !839, file: !158, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !839, file: !158, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !839, file: !158, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !839, file: !158, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !839, file: !158, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !839, file: !158, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !839, file: !158, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !839, file: !158, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !839, file: !158, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !839, file: !158, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !839, file: !158, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !839, file: !158, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !839, file: !158, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !839, file: !158, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !839, file: !158, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !839, file: !158, line: 2703, baseType: !7, size: 32, offset: 512)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !839, file: !158, line: 2705, baseType: !711, size: 64, offset: 576)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !839, file: !158, line: 2706, baseType: !711, size: 64, offset: 640)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !839, file: !158, line: 2707, baseType: !711, size: 64, offset: 704)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !839, file: !158, line: 2708, baseType: !711, size: 64, offset: 768)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !839, file: !158, line: 2711, baseType: !874, size: 64, offset: 832)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !158, line: 2711, flags: DIFlagFwdDecl)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !713, file: !158, line: 3383, baseType: !877, size: 960)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !158, line: 2756, size: 960, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !158, line: 2757, baseType: !839, size: 896)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !877, file: !158, line: 2758, baseType: !595, size: 64, offset: 896)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !713, file: !158, line: 3384, baseType: !882, size: 1472)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !158, line: 3114, size: 1472, elements: !883)
!883 = !{!884, !905, !906, !907, !908}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !882, file: !158, line: 3115, baseType: !885, size: 1216)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !158, line: 2984, size: 1216, elements: !886)
!886 = !{!887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !885, file: !158, line: 2985, baseType: !877, size: 960)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !885, file: !158, line: 2986, baseType: !711, size: 64, offset: 960)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !885, file: !158, line: 2987, baseType: !711, size: 64, offset: 1024)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !885, file: !158, line: 2988, baseType: !711, size: 64, offset: 1088)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !885, file: !158, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !885, file: !158, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !885, file: !158, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !885, file: !158, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !885, file: !158, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !885, file: !158, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !885, file: !158, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !885, file: !158, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !885, file: !158, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !885, file: !158, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !885, file: !158, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !885, file: !158, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !885, file: !158, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !885, file: !158, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !882, file: !158, line: 3117, baseType: !711, size: 64, offset: 1216)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !882, file: !158, line: 3119, baseType: !711, size: 64, offset: 1280)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !882, file: !158, line: 3121, baseType: !711, size: 64, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !882, file: !158, line: 3123, baseType: !711, size: 64, offset: 1408)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !713, file: !158, line: 3385, baseType: !910, size: 1088)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !158, line: 2874, size: 1088, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !910, file: !158, line: 2875, baseType: !877, size: 960)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !910, file: !158, line: 2876, baseType: !595, size: 64, offset: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !910, file: !158, line: 2877, baseType: !915, size: 64, offset: 1024)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !158, line: 2856, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !713, file: !158, line: 3386, baseType: !885, size: 1216)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !713, file: !158, line: 3387, baseType: !919, size: 1280)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !158, line: 3093, size: 1280, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !919, file: !158, line: 3094, baseType: !885, size: 1216)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !919, file: !158, line: 3095, baseType: !915, size: 64, offset: 1216)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !713, file: !158, line: 3388, baseType: !924, size: 1216)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !158, line: 2824, size: 1216, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !931}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !158, line: 2825, baseType: !839, size: 896)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !924, file: !158, line: 2827, baseType: !711, size: 64, offset: 896)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !924, file: !158, line: 2828, baseType: !711, size: 64, offset: 960)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !924, file: !158, line: 2829, baseType: !711, size: 64, offset: 1024)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !924, file: !158, line: 2830, baseType: !711, size: 64, offset: 1088)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !924, file: !158, line: 2831, baseType: !711, size: 64, offset: 1152)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !713, file: !158, line: 3389, baseType: !933, size: 1024)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !158, line: 2850, size: 1024, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !158, line: 2851, baseType: !877, size: 960)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !933, file: !158, line: 2852, baseType: !588, size: 32, offset: 960)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !933, file: !158, line: 2853, baseType: !588, size: 32, offset: 992)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !713, file: !158, line: 3390, baseType: !939, size: 1024)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !158, line: 2857, size: 1024, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !939, file: !158, line: 2858, baseType: !877, size: 960)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !939, file: !158, line: 2859, baseType: !915, size: 64, offset: 960)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !713, file: !158, line: 3391, baseType: !944, size: 960)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !158, line: 2862, size: 960, elements: !945)
!945 = !{!946}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !944, file: !158, line: 2863, baseType: !877, size: 960)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !713, file: !158, line: 3392, baseType: !948, size: 1472)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !158, line: 3304, size: 1472, elements: !949)
!949 = !{!950}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !948, file: !158, line: 3305, baseType: !882, size: 1472)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !713, file: !158, line: 3393, baseType: !952, size: 1792)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !158, line: 3248, size: 1792, elements: !953)
!953 = !{!954, !955, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !952, file: !158, line: 3249, baseType: !882, size: 1472)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !952, file: !158, line: 3251, baseType: !956, size: 64, offset: 1472)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !958, line: 463, size: 1152, elements: !959)
!958 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!959 = !{!960, !1124, !1228, !1229, !1232, !1235, !1236, !1237, !1238, !1239, !1240, !1264, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !957, file: !958, line: 464, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !963)
!963 = !{!964, !1013, !1026, !1040, !1092, !1105}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !962, file: !135, line: 197, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !966)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !1001, !1010, !1011, !1012}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !967, file: !135, line: 119, baseType: !966, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !967, file: !135, line: 122, baseType: !966, size: 64, offset: 64)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !967, file: !135, line: 123, baseType: !966, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !967, file: !135, line: 126, baseType: !588, size: 32, offset: 192)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !967, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !967, file: !135, line: 165, baseType: !975, size: 192, offset: 256)
!975 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !976)
!976 = !{!977, !990, !996}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !975, file: !135, line: 137, baseType: !978, size: 128)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !979)
!979 = !{!980, !989}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !978, file: !135, line: 135, baseType: !981, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !983)
!983 = !{!984, !985, !986, !987, !988}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !982, file: !135, line: 96, baseType: !981, size: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !982, file: !135, line: 97, baseType: !981, size: 64, offset: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !982, file: !135, line: 101, baseType: !711, size: 64, offset: 128)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !982, file: !135, line: 106, baseType: !711, size: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !982, file: !135, line: 111, baseType: !711, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !978, file: !135, line: 136, baseType: !981, size: 64, offset: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !975, file: !135, line: 151, baseType: !991, size: 192)
!991 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !992)
!992 = !{!993, !994, !995}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !991, file: !135, line: 141, baseType: !711, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !991, file: !135, line: 145, baseType: !711, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !991, file: !135, line: 150, baseType: !588, size: 32, offset: 128)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !975, file: !135, line: 164, baseType: !997, size: 128)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !997, file: !135, line: 161, baseType: !711, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !997, file: !135, line: 163, baseType: !831, size: 32, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !967, file: !135, line: 168, baseType: !1002, size: 64, offset: 448)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1004)
!1004 = !{!1005, !1006, !1007, !1008, !1009}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1003, file: !135, line: 70, baseType: !1002, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1003, file: !135, line: 73, baseType: !966, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1003, file: !135, line: 78, baseType: !711, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1003, file: !135, line: 85, baseType: !595, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1003, file: !135, line: 88, baseType: !588, size: 32, offset: 256)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !967, file: !135, line: 173, baseType: !595, size: 64, offset: 512)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !967, file: !135, line: 173, baseType: !595, size: 64, offset: 576)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !967, file: !135, line: 177, baseType: !587, size: 8, offset: 640)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !962, file: !135, line: 200, baseType: !1014, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1017)
!1017 = !{!1018}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1016, file: !135, line: 185, baseType: !1019, size: 128)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1020)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1021)
!1021 = !{!1022, !1023, !1024}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1020, file: !135, line: 184, baseType: !7, size: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1020, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1020, file: !135, line: 184, baseType: !1025, size: 64, offset: 64)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !965, size: 64, elements: !630)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !962, file: !135, line: 203, baseType: !1027, size: 64, offset: 128)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1029)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1030)
!1030 = !{!1031}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1029, file: !135, line: 189, baseType: !1032, size: 128)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1034)
!1034 = !{!1035, !1036, !1037}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1033, file: !135, line: 188, baseType: !7, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1033, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1033, file: !135, line: 188, baseType: !1038, size: 64, offset: 64)
!1038 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1039, size: 64, elements: !630)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1002)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !962, file: !135, line: 207, baseType: !1041, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1042, line: 144, baseType: !1043)
!1042 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1042, line: 100, size: 896, elements: !1045)
!1045 = !{!1046, !1054, !1059, !1064, !1066, !1069, !1070, !1071, !1072, !1073, !1078, !1080, !1081, !1086, !1091}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1044, file: !1042, line: 102, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1042, line: 52, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1042, line: 47, baseType: !7)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1044, file: !1042, line: 105, baseType: !1055, size: 64, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1042, line: 59, baseType: !1056)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{!588, !1052, !1052}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1044, file: !1042, line: 108, baseType: !1060, size: 64, offset: 128)
!1060 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1042, line: 63, baseType: !1061)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = !DISubroutineType(types: !1063)
!1063 = !{null, !592}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1044, file: !1042, line: 111, baseType: !1065, size: 64, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1044, file: !1042, line: 114, baseType: !1067, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1068, line: 46, baseType: !665)
!1068 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1044, file: !1042, line: 117, baseType: !1067, size: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1044, file: !1042, line: 120, baseType: !1067, size: 64, offset: 384)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1044, file: !1042, line: 124, baseType: !7, size: 32, offset: 448)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1044, file: !1042, line: 128, baseType: !7, size: 32, offset: 480)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1044, file: !1042, line: 131, baseType: !1074, size: 64, offset: 512)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1042, line: 75, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!592, !1067, !1067}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1044, file: !1042, line: 132, baseType: !1079, size: 64, offset: 576)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1042, line: 78, baseType: !1061)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1044, file: !1042, line: 135, baseType: !592, size: 64, offset: 640)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1044, file: !1042, line: 136, baseType: !1082, size: 64, offset: 704)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1042, line: 82, baseType: !1083)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DISubroutineType(types: !1085)
!1085 = !{!592, !592, !1067, !1067}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1044, file: !1042, line: 137, baseType: !1087, size: 64, offset: 768)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1042, line: 83, baseType: !1088)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DISubroutineType(types: !1090)
!1090 = !{null, !592, !592}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1044, file: !1042, line: 141, baseType: !7, size: 32, offset: 832)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !962, file: !135, line: 211, baseType: !1093, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !158, line: 183, baseType: !1095)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !158, line: 183, size: 128, elements: !1096)
!1096 = !{!1097}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1095, file: !158, line: 183, baseType: !1098, size: 128)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !158, line: 182, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !158, line: 182, size: 128, elements: !1100)
!1100 = !{!1101, !1102, !1103}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1099, file: !158, line: 182, baseType: !7, size: 32)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1099, file: !158, line: 182, baseType: !7, size: 32, offset: 32)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1099, file: !158, line: 182, baseType: !1104, size: 64, offset: 64)
!1104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 64, elements: !630)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !962, file: !135, line: 220, baseType: !1106, size: 64, offset: 320)
!1106 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1107)
!1107 = !{!1108, !1109}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1106, file: !135, line: 218, baseType: !1093, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1106, file: !135, line: 219, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1112, line: 29, baseType: !1113)
!1112 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1112, line: 29, size: 96, elements: !1114)
!1114 = !{!1115}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1113, file: !1112, line: 29, baseType: !1116, size: 96)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1112, line: 27, baseType: !1117)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1112, line: 27, size: 96, elements: !1118)
!1118 = !{!1119, !1120, !1121}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1117, file: !1112, line: 27, baseType: !7, size: 32)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1117, file: !1112, line: 27, baseType: !7, size: 32, offset: 32)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1117, file: !1112, line: 27, baseType: !1122, size: 8, offset: 64)
!1122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1123, size: 8, elements: !630)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1112, line: 26, baseType: !587)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !957, file: !958, line: 467, baseType: !1125, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !142, line: 374, size: 640, elements: !1127)
!1127 = !{!1128, !1203, !1204, !1217, !1218, !1219, !1220, !1221, !1222, !1224, !1226, !1227}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1126, file: !142, line: 377, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !596, line: 111, baseType: !1130)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !142, line: 217, size: 832, elements: !1132)
!1132 = !{!1133, !1168, !1169, !1170, !1173, !1177, !1178, !1179, !1197, !1198, !1199, !1200, !1201, !1202}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1131, file: !142, line: 219, baseType: !1134, size: 64)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !142, line: 151, baseType: !1136)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !142, line: 151, size: 128, elements: !1137)
!1137 = !{!1138}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1136, file: !142, line: 151, baseType: !1139, size: 128)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !142, line: 150, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !142, line: 150, size: 128, elements: !1141)
!1141 = !{!1142, !1143, !1144}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1140, file: !142, line: 150, baseType: !7, size: 32)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1140, file: !142, line: 150, baseType: !7, size: 32, offset: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1140, file: !142, line: 150, baseType: !1145, size: 64, offset: 64)
!1145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1146, size: 64, elements: !630)
!1146 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !596, line: 108, baseType: !1147)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !142, line: 122, size: 512, elements: !1149)
!1149 = !{!1150, !1151, !1152, !1160, !1161, !1162, !1163, !1164, !1165, !1166}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1148, file: !142, line: 124, baseType: !1130, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1148, file: !142, line: 125, baseType: !1130, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1148, file: !142, line: 131, baseType: !1153, size: 64, offset: 128)
!1153 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !142, line: 128, size: 64, elements: !1154)
!1154 = !{!1155, !1159}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1153, file: !142, line: 129, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !596, line: 66, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !596, line: 65, flags: DIFlagFwdDecl)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1153, file: !142, line: 130, baseType: !595, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1148, file: !142, line: 134, baseType: !592, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1148, file: !142, line: 137, baseType: !711, size: 64, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1148, file: !142, line: 138, baseType: !831, size: 32, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1148, file: !142, line: 142, baseType: !7, size: 32, offset: 352)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1148, file: !142, line: 144, baseType: !588, size: 32, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1148, file: !142, line: 145, baseType: !588, size: 32, offset: 416)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1148, file: !142, line: 146, baseType: !1167, size: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !142, line: 119, baseType: !682)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1131, file: !142, line: 220, baseType: !1134, size: 64, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1131, file: !142, line: 223, baseType: !592, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1131, file: !142, line: 226, baseType: !1171, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 185, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1131, file: !142, line: 229, baseType: !1174, size: 128, offset: 256)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1175, size: 128, elements: !666)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !142, line: 229, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1131, file: !142, line: 232, baseType: !1130, size: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1131, file: !142, line: 233, baseType: !1130, size: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1131, file: !142, line: 238, baseType: !1180, size: 64, offset: 512)
!1180 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !142, line: 235, size: 64, elements: !1181)
!1181 = !{!1182, !1188}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1180, file: !142, line: 236, baseType: !1183, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !142, line: 273, size: 128, elements: !1185)
!1185 = !{!1186, !1187}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1184, file: !142, line: 275, baseType: !1156, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1184, file: !142, line: 278, baseType: !1156, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1180, file: !142, line: 237, baseType: !1189, size: 64)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !142, line: 259, size: 320, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1190, file: !142, line: 261, baseType: !595, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1190, file: !142, line: 262, baseType: !595, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1190, file: !142, line: 266, baseType: !595, size: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1190, file: !142, line: 267, baseType: !595, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1190, file: !142, line: 270, baseType: !588, size: 32, offset: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1131, file: !142, line: 241, baseType: !1167, size: 64, offset: 576)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1131, file: !142, line: 244, baseType: !588, size: 32, offset: 640)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1131, file: !142, line: 247, baseType: !588, size: 32, offset: 672)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1131, file: !142, line: 250, baseType: !588, size: 32, offset: 704)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1131, file: !142, line: 253, baseType: !588, size: 32, offset: 736)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1131, file: !142, line: 256, baseType: !588, size: 32, offset: 768)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1126, file: !142, line: 378, baseType: !1129, size: 64, offset: 64)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1126, file: !142, line: 381, baseType: !1205, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !142, line: 282, baseType: !1207)
!1207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !142, line: 282, size: 128, elements: !1208)
!1208 = !{!1209}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1207, file: !142, line: 282, baseType: !1210, size: 128)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !142, line: 281, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !142, line: 281, size: 128, elements: !1212)
!1212 = !{!1213, !1214, !1215}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1211, file: !142, line: 281, baseType: !7, size: 32)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1211, file: !142, line: 281, baseType: !7, size: 32, offset: 32)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1211, file: !142, line: 281, baseType: !1216, size: 64, offset: 64)
!1216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1129, size: 64, elements: !630)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1126, file: !142, line: 384, baseType: !588, size: 32, offset: 192)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1126, file: !142, line: 387, baseType: !588, size: 32, offset: 224)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1126, file: !142, line: 390, baseType: !588, size: 32, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1126, file: !142, line: 394, baseType: !1205, size: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1126, file: !142, line: 396, baseType: !141, size: 32, offset: 384)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1126, file: !142, line: 399, baseType: !1223, size: 64, offset: 416)
!1223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !147, size: 64, elements: !666)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1126, file: !142, line: 402, baseType: !1225, size: 64, offset: 480)
!1225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !666)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1126, file: !142, line: 406, baseType: !588, size: 32, offset: 544)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1126, file: !142, line: 409, baseType: !588, size: 32, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !957, file: !958, line: 470, baseType: !1157, size: 64, offset: 128)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !957, file: !958, line: 473, baseType: !1230, size: 64, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !958, line: 166, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !957, file: !958, line: 476, baseType: !1233, size: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !958, line: 476, flags: DIFlagFwdDecl)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !957, file: !958, line: 479, baseType: !1041, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !957, file: !958, line: 484, baseType: !711, size: 64, offset: 384)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !957, file: !958, line: 488, baseType: !711, size: 64, offset: 448)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !957, file: !958, line: 493, baseType: !711, size: 64, offset: 512)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !957, file: !958, line: 496, baseType: !711, size: 64, offset: 576)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !957, file: !958, line: 501, baseType: !1241, size: 64, offset: 640)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !153, line: 2355, size: 576, elements: !1243)
!1243 = !{!1244, !1247, !1248, !1249, !1250, !1252, !1253, !1258, !1259, !1260, !1261, !1262, !1263}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1242, file: !153, line: 2356, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !153, line: 2356, flags: DIFlagFwdDecl)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1242, file: !153, line: 2357, baseType: !593, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1242, file: !153, line: 2358, baseType: !588, size: 32, offset: 128)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1242, file: !153, line: 2359, baseType: !588, size: 32, offset: 160)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1242, file: !153, line: 2360, baseType: !1251, size: 128, offset: 192)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !588, size: 128, elements: !691)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1242, file: !153, line: 2364, baseType: !588, size: 32, offset: 320)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1242, file: !153, line: 2367, baseType: !1254, size: 128, offset: 384)
!1254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !153, line: 2349, size: 128, elements: !1255)
!1255 = !{!1256, !1257}
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1254, file: !153, line: 2351, baseType: !595, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1254, file: !153, line: 2352, baseType: !682, size: 64, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1242, file: !153, line: 2371, baseType: !152, size: 32, offset: 512)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1242, file: !153, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1242, file: !153, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1242, file: !153, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1242, file: !153, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1242, file: !153, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !957, file: !958, line: 504, baseType: !1265, size: 64, offset: 704)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !958, line: 504, flags: DIFlagFwdDecl)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !957, file: !958, line: 507, baseType: !1041, size: 64, offset: 768)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !957, file: !958, line: 510, baseType: !588, size: 32, offset: 832)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !957, file: !958, line: 513, baseType: !588, size: 32, offset: 864)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !957, file: !958, line: 516, baseType: !831, size: 32, offset: 896)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !957, file: !958, line: 519, baseType: !831, size: 32, offset: 928)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !957, file: !958, line: 522, baseType: !7, size: 32, offset: 960)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !957, file: !958, line: 523, baseType: !7, size: 32, offset: 992)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !957, file: !958, line: 528, baseType: !593, size: 64, offset: 1024)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !957, file: !958, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !957, file: !958, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !957, file: !958, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !957, file: !958, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !957, file: !958, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !957, file: !958, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !957, file: !958, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !957, file: !958, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !957, file: !958, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !957, file: !958, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !957, file: !958, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !957, file: !958, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !957, file: !958, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !957, file: !958, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !957, file: !958, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !957, file: !958, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !952, file: !158, line: 3254, baseType: !711, size: 64, offset: 1536)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !952, file: !158, line: 3257, baseType: !711, size: 64, offset: 1600)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !952, file: !158, line: 3258, baseType: !711, size: 64, offset: 1664)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !952, file: !158, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !952, file: !158, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !952, file: !158, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !952, file: !158, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !952, file: !158, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !952, file: !158, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !952, file: !158, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !952, file: !158, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !952, file: !158, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !952, file: !158, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !952, file: !158, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !952, file: !158, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !952, file: !158, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !952, file: !158, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !952, file: !158, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !952, file: !158, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !952, file: !158, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !952, file: !158, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !713, file: !158, line: 3394, baseType: !1313, size: 1344)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !158, line: 2279, size: 1344, elements: !1314)
!1314 = !{!1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1340, !1341, !1342, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1313, file: !158, line: 2280, baseType: !749, size: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1313, file: !158, line: 2281, baseType: !711, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1313, file: !158, line: 2282, baseType: !711, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1313, file: !158, line: 2283, baseType: !711, size: 64, offset: 320)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1313, file: !158, line: 2284, baseType: !711, size: 64, offset: 384)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1313, file: !158, line: 2285, baseType: !7, size: 32, offset: 448)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1313, file: !158, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1313, file: !158, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1313, file: !158, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1313, file: !158, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1313, file: !158, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1313, file: !158, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1313, file: !158, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1313, file: !158, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1313, file: !158, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1313, file: !158, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1313, file: !158, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1313, file: !158, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1313, file: !158, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1313, file: !158, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1313, file: !158, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1313, file: !158, line: 2305, baseType: !7, size: 32, offset: 512)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1313, file: !158, line: 2306, baseType: !1338, size: 32, offset: 544)
!1338 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1339, line: 31, baseType: !588)
!1339 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1313, file: !158, line: 2307, baseType: !711, size: 64, offset: 576)
