; ModuleID = 'sdbout.bc'
source_filename = "sdbout.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gcc_debug_hooks = type { void (i8*)*, void (i8*)*, void ()*, void (i32, i8*)*, void (i32, i8*)*, void (i32, i8*)*, void (i32)*, void (i32, i32)*, void (i32, i32)*, i8 (%union.tree_node*)*, void (i32, i8*, i32, i8)*, void (i32, i8*)*, void (i32, i8*)*, void (i32, i8*)*, void (%union.tree_node*)*, void (i32)*, void (%union.tree_node*)*, void (%union.tree_node*)*, void (%union.tree_node*, i32)*, void (%union.tree_node*, %union.tree_node*, %union.tree_node*, i8)*, void (%union.tree_node*)*, void (%union.tree_node*)*, void (%struct.rtx_def*)*, void (i32)*, void (%struct.rtx_def*)*, void ()*, void (%union.tree_node*)*, void (%union.tree_node*, i32)*, void (%struct.rtx_def*, %struct.rtx_def*)*, void (i32)*, void (%union.tree_node*, %union.tree_node*)*, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }

!206 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!207 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!208 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!209 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!210 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!211 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!212 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!213 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!214 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!215 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!216 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!217 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!218 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!219 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!224 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!226 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!227 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!228 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!229 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!230 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!231 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!232 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!233 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "varray_data_enum", file: !234, line: 38, baseType: !7, size: 32, elements: !235)
!234 = !DIFile(filename: "./varray.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!235 = !{!236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258}
!236 = !DIEnumerator(name: "VARRAY_DATA_C", value: 0, isUnsigned: true)
!237 = !DIEnumerator(name: "VARRAY_DATA_UC", value: 1, isUnsigned: true)
!238 = !DIEnumerator(name: "VARRAY_DATA_S", value: 2, isUnsigned: true)
!239 = !DIEnumerator(name: "VARRAY_DATA_US", value: 3, isUnsigned: true)
!240 = !DIEnumerator(name: "VARRAY_DATA_I", value: 4, isUnsigned: true)
!241 = !DIEnumerator(name: "VARRAY_DATA_U", value: 5, isUnsigned: true)
!242 = !DIEnumerator(name: "VARRAY_DATA_L", value: 6, isUnsigned: true)
!243 = !DIEnumerator(name: "VARRAY_DATA_UL", value: 7, isUnsigned: true)
!244 = !DIEnumerator(name: "VARRAY_DATA_HINT", value: 8, isUnsigned: true)
!245 = !DIEnumerator(name: "VARRAY_DATA_UHINT", value: 9, isUnsigned: true)
!246 = !DIEnumerator(name: "VARRAY_DATA_GENERIC", value: 10, isUnsigned: true)
!247 = !DIEnumerator(name: "VARRAY_DATA_GENERIC_NOGC", value: 11, isUnsigned: true)
!248 = !DIEnumerator(name: "VARRAY_DATA_CPTR", value: 12, isUnsigned: true)
!249 = !DIEnumerator(name: "VARRAY_DATA_RTX", value: 13, isUnsigned: true)
!250 = !DIEnumerator(name: "VARRAY_DATA_RTVEC", value: 14, isUnsigned: true)
!251 = !DIEnumerator(name: "VARRAY_DATA_TREE", value: 15, isUnsigned: true)
!252 = !DIEnumerator(name: "VARRAY_DATA_BITMAP", value: 16, isUnsigned: true)
!253 = !DIEnumerator(name: "VARRAY_DATA_REG", value: 17, isUnsigned: true)
!254 = !DIEnumerator(name: "VARRAY_DATA_BB", value: 18, isUnsigned: true)
!255 = !DIEnumerator(name: "VARRAY_DATA_TE", value: 19, isUnsigned: true)
!256 = !DIEnumerator(name: "VARRAY_DATA_EDGE", value: 20, isUnsigned: true)
!257 = !DIEnumerator(name: "VARRAY_DATA_TREE_PTR", value: 21, isUnsigned: true)
!258 = !DIEnumerator(name: "NUM_VARRAY_DATA", value: 22, isUnsigned: true)
!259 = !{!260, !261, !262, !263, !266, !267}
!260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!261 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!262 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !265)
!269 = !{!0, !270, !292, !297, !938, !940, !1008, !1010}
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "gt_ggc_r_gt_sdbout_h", scope: !2, file: !272, line: 24, type: !273, isLocal: false, isDefinition: true)
!272 = !DIFile(filename: "./gt-sdbout.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!273 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 1280, elements: !290)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !275)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_root_tab", file: !276, line: 69, size: 320, elements: !277)
!276 = !DIFile(filename: "./ggc.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!277 = !{!278, !279, !283, !284, !289}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !275, file: !276, line: 70, baseType: !266, size: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "nelt", scope: !275, file: !276, line: 71, baseType: !280, size: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !281, line: 46, baseType: !282)
!281 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!282 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !275, file: !276, line: 72, baseType: !280, size: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !275, file: !276, line: 73, baseType: !285, size: 64, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_typedef, name: "gt_pointer_walker", file: !276, line: 65, baseType: !286)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !266}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "pchw", scope: !275, file: !276, line: 74, baseType: !285, size: 64, offset: 256)
!290 = !{!291}
!291 = !DISubrange(count: 4)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "gt_pch_rs_gt_sdbout_h", scope: !2, file: !272, line: 49, type: !294, isLocal: false, isDefinition: true)
!294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !274, size: 960, elements: !295)
!295 = !{!296}
!296 = !DISubrange(count: 3)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "anonymous_types", scope: !2, file: !3, line: 53, type: !299, isLocal: true, isDefinition: true)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !300, line: 56, baseType: !301)
!300 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !302, size: 64)
!302 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !303)
!303 = !{!304, !337, !343, !355, !362, !369, !374, !383, !389, !402, !414, !452, !460, !488, !496, !497, !502, !511, !517, !522, !526, !530, !559, !608, !614, !621, !628, !654, !679, !696, !708, !730, !748, !920}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !302, file: !6, line: 3372, baseType: !305, size: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !306)
!306 = !{!307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !305, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !305, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !305, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !305, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !305, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !305, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !305, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !305, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !305, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !305, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !305, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !305, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !305, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !305, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !305, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !305, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !305, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !305, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !305, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !305, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !305, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !305, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !305, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !305, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !305, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !305, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !305, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !305, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !305, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !305, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !302, file: !6, line: 3373, baseType: !338, size: 192)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !339)
!339 = !{!340, !341, !342}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !338, file: !6, line: 403, baseType: !305, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !338, file: !6, line: 404, baseType: !299, size: 64, offset: 64)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !338, file: !6, line: 405, baseType: !299, size: 64, offset: 128)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !302, file: !6, line: 3374, baseType: !344, size: 320)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !345)
!345 = !{!346, !347}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !344, file: !6, line: 1385, baseType: !338, size: 192)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !344, file: !6, line: 1386, baseType: !348, size: 128, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !349, line: 58, baseType: !350)
!349 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !349, line: 54, size: 128, elements: !351)
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !350, file: !349, line: 56, baseType: !282, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !350, file: !349, line: 57, baseType: !354, size: 64, offset: 64)
!354 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !302, file: !6, line: 3375, baseType: !356, size: 256)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !357)
!357 = !{!358, !359}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !356, file: !6, line: 1398, baseType: !338, size: 192)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !356, file: !6, line: 1399, baseType: !360, size: 64, offset: 192)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !302, file: !6, line: 3376, baseType: !363, size: 256)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !364)
!364 = !{!365, !366}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !363, file: !6, line: 1409, baseType: !338, size: 192)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !363, file: !6, line: 1410, baseType: !367, size: 64, offset: 192)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !302, file: !6, line: 3377, baseType: !370, size: 256)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !371)
!371 = !{!372, !373}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !370, file: !6, line: 1438, baseType: !338, size: 192)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !370, file: !6, line: 1439, baseType: !299, size: 64, offset: 192)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !302, file: !6, line: 3378, baseType: !375, size: 256)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !376)
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !375, file: !6, line: 1419, baseType: !338, size: 192)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !375, file: !6, line: 1420, baseType: !262, size: 32, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !375, file: !6, line: 1421, baseType: !380, size: 8, offset: 224)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 8, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 1)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !302, file: !6, line: 3379, baseType: !384, size: 320)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !385)
!385 = !{!386, !387, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !384, file: !6, line: 1429, baseType: !338, size: 192)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !384, file: !6, line: 1430, baseType: !299, size: 64, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !384, file: !6, line: 1431, baseType: !299, size: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !302, file: !6, line: 3380, baseType: !390, size: 320)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !391)
!391 = !{!392, !393}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !390, file: !6, line: 1461, baseType: !338, size: 192)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !390, file: !6, line: 1462, baseType: !394, size: 128, offset: 192)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !395, line: 31, size: 128, elements: !396)
!395 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!396 = !{!397, !400, !401}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !394, file: !395, line: 32, baseType: !398, size: 64)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !261)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !394, file: !395, line: 33, baseType: !7, size: 32, offset: 64)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !394, file: !395, line: 34, baseType: !7, size: 32, offset: 96)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !302, file: !6, line: 3381, baseType: !403, size: 384)
!403 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !404)
!404 = !{!405, !406, !411, !412, !413}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !403, file: !6, line: 2508, baseType: !338, size: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !403, file: !6, line: 2509, baseType: !407, size: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !408, line: 58, baseType: !409)
!408 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !410, line: 44, baseType: !7)
!410 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!411 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !403, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !403, file: !6, line: 2511, baseType: !299, size: 64, offset: 256)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !403, file: !6, line: 2512, baseType: !299, size: 64, offset: 320)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !302, file: !6, line: 3382, baseType: !415, size: 896)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !415, file: !6, line: 2653, baseType: !403, size: 384)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !415, file: !6, line: 2654, baseType: !299, size: 64, offset: 384)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !415, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !415, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !415, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !415, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !415, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !415, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !415, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !415, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !415, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !415, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !415, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !415, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !415, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !415, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !415, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !415, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !415, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !415, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !415, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !415, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !415, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !415, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !415, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !415, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !415, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !415, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !415, file: !6, line: 2705, baseType: !299, size: 64, offset: 576)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !415, file: !6, line: 2706, baseType: !299, size: 64, offset: 640)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !415, file: !6, line: 2707, baseType: !299, size: 64, offset: 704)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !415, file: !6, line: 2708, baseType: !299, size: 64, offset: 768)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !415, file: !6, line: 2711, baseType: !450, size: 64, offset: 832)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !302, file: !6, line: 3383, baseType: !453, size: 960)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !453, file: !6, line: 2757, baseType: !415, size: 896)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !453, file: !6, line: 2758, baseType: !457, size: 64, offset: 896)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !300, line: 50, baseType: !458)
!458 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !459, size: 64)
!459 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !300, line: 49, flags: DIFlagFwdDecl)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !302, file: !6, line: 3384, baseType: !461, size: 1472)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !462)
!462 = !{!463, !484, !485, !486, !487}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !461, file: !6, line: 3115, baseType: !464, size: 1216)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !464, file: !6, line: 2985, baseType: !453, size: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !464, file: !6, line: 2986, baseType: !299, size: 64, offset: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !464, file: !6, line: 2987, baseType: !299, size: 64, offset: 1024)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !464, file: !6, line: 2988, baseType: !299, size: 64, offset: 1088)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !464, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !464, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !464, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !464, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !464, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !464, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !464, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !464, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !464, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !464, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !464, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !464, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !464, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !464, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !461, file: !6, line: 3117, baseType: !299, size: 64, offset: 1216)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !461, file: !6, line: 3119, baseType: !299, size: 64, offset: 1280)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !461, file: !6, line: 3121, baseType: !299, size: 64, offset: 1344)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !461, file: !6, line: 3123, baseType: !299, size: 64, offset: 1408)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !302, file: !6, line: 3385, baseType: !489, size: 1088)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !490)
!490 = !{!491, !492, !493}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !489, file: !6, line: 2875, baseType: !453, size: 960)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !489, file: !6, line: 2876, baseType: !457, size: 64, offset: 960)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !489, file: !6, line: 2877, baseType: !494, size: 64, offset: 1024)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !6, line: 2856, flags: DIFlagFwdDecl)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !302, file: !6, line: 3386, baseType: !464, size: 1216)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !302, file: !6, line: 3387, baseType: !498, size: 1280)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !499)
!499 = !{!500, !501}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !498, file: !6, line: 3094, baseType: !464, size: 1216)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !498, file: !6, line: 3095, baseType: !494, size: 64, offset: 1216)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !302, file: !6, line: 3388, baseType: !503, size: 1216)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !504)
!504 = !{!505, !506, !507, !508, !509, !510}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !503, file: !6, line: 2825, baseType: !415, size: 896)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !503, file: !6, line: 2827, baseType: !299, size: 64, offset: 896)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !503, file: !6, line: 2828, baseType: !299, size: 64, offset: 960)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !503, file: !6, line: 2829, baseType: !299, size: 64, offset: 1024)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !503, file: !6, line: 2830, baseType: !299, size: 64, offset: 1088)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !503, file: !6, line: 2831, baseType: !299, size: 64, offset: 1152)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !302, file: !6, line: 3389, baseType: !512, size: 1024)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !513)
!513 = !{!514, !515, !516}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !512, file: !6, line: 2851, baseType: !453, size: 960)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !512, file: !6, line: 2852, baseType: !262, size: 32, offset: 960)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !512, file: !6, line: 2853, baseType: !262, size: 32, offset: 992)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !302, file: !6, line: 3390, baseType: !518, size: 1024)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !519)
!519 = !{!520, !521}
!520 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !518, file: !6, line: 2858, baseType: !453, size: 960)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !518, file: !6, line: 2859, baseType: !494, size: 64, offset: 960)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !302, file: !6, line: 3391, baseType: !523, size: 960)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !524)
!524 = !{!525}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !523, file: !6, line: 2863, baseType: !453, size: 960)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !302, file: !6, line: 3392, baseType: !527, size: 1472)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !528)
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !527, file: !6, line: 3305, baseType: !461, size: 1472)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !302, file: !6, line: 3393, baseType: !531, size: 1792)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !532)
!532 = !{!533, !534, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !531, file: !6, line: 3249, baseType: !461, size: 1472)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !531, file: !6, line: 3251, baseType: !535, size: 64, offset: 1472)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !537, line: 41, flags: DIFlagFwdDecl)
!537 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !531, file: !6, line: 3254, baseType: !299, size: 64, offset: 1536)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !531, file: !6, line: 3257, baseType: !299, size: 64, offset: 1600)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !531, file: !6, line: 3258, baseType: !299, size: 64, offset: 1664)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !531, file: !6, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !531, file: !6, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !531, file: !6, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !531, file: !6, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !531, file: !6, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !531, file: !6, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !531, file: !6, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !531, file: !6, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !531, file: !6, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !531, file: !6, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !531, file: !6, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !531, file: !6, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !531, file: !6, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !531, file: !6, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !531, file: !6, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !531, file: !6, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !531, file: !6, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !531, file: !6, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !302, file: !6, line: 3394, baseType: !560, size: 1344)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !6, line: 2279, size: 1344, elements: !561)
!561 = !{!562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !587, !588, !589, !597, !598, !599, !600, !601, !602, !603, !604, !605}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !6, line: 2280, baseType: !338, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !560, file: !6, line: 2281, baseType: !299, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !560, file: !6, line: 2282, baseType: !299, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !560, file: !6, line: 2283, baseType: !299, size: 64, offset: 320)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !560, file: !6, line: 2284, baseType: !299, size: 64, offset: 384)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !560, file: !6, line: 2285, baseType: !7, size: 32, offset: 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !560, file: !6, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !560, file: !6, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !560, file: !6, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !560, file: !6, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !560, file: !6, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !560, file: !6, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !560, file: !6, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !560, file: !6, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !560, file: !6, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !560, file: !6, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !560, file: !6, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !560, file: !6, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !560, file: !6, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !560, file: !6, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !560, file: !6, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !560, file: !6, line: 2305, baseType: !7, size: 32, offset: 512)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !560, file: !6, line: 2306, baseType: !585, size: 32, offset: 544)
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !586, line: 31, baseType: !262)
!586 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !560, file: !6, line: 2307, baseType: !299, size: 64, offset: 576)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !560, file: !6, line: 2308, baseType: !299, size: 64, offset: 640)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !560, file: !6, line: 2314, baseType: !590, size: 64, offset: 704)
!590 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !6, line: 2309, size: 64, elements: !591)
!591 = !{!592, !593, !594}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !590, file: !6, line: 2310, baseType: !262, size: 32)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !590, file: !6, line: 2311, baseType: !267, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !590, file: !6, line: 2312, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !6, line: 2277, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !560, file: !6, line: 2315, baseType: !299, size: 64, offset: 768)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !560, file: !6, line: 2316, baseType: !299, size: 64, offset: 832)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !560, file: !6, line: 2317, baseType: !299, size: 64, offset: 896)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !560, file: !6, line: 2318, baseType: !299, size: 64, offset: 960)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !560, file: !6, line: 2319, baseType: !299, size: 64, offset: 1024)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !560, file: !6, line: 2320, baseType: !299, size: 64, offset: 1088)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !560, file: !6, line: 2321, baseType: !299, size: 64, offset: 1152)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !560, file: !6, line: 2322, baseType: !299, size: 64, offset: 1216)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !560, file: !6, line: 2324, baseType: !606, size: 64, offset: 1280)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !6, line: 2324, flags: DIFlagFwdDecl)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !302, file: !6, line: 3395, baseType: !609, size: 320)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !6, line: 1469, size: 320, elements: !610)
!610 = !{!611, !612, !613}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !609, file: !6, line: 1470, baseType: !338, size: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !609, file: !6, line: 1471, baseType: !299, size: 64, offset: 192)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !609, file: !6, line: 1472, baseType: !299, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !302, file: !6, line: 3396, baseType: !615, size: 320)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !6, line: 1482, size: 320, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !615, file: !6, line: 1483, baseType: !338, size: 192)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !615, file: !6, line: 1484, baseType: !262, size: 32, offset: 192)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !615, file: !6, line: 1485, baseType: !620, size: 64, offset: 256)
!620 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 64, elements: !381)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !302, file: !6, line: 3397, baseType: !622, size: 384)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !6, line: 1829, size: 384, elements: !623)
!623 = !{!624, !625, !626, !627}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !622, file: !6, line: 1830, baseType: !338, size: 192)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !622, file: !6, line: 1831, baseType: !407, size: 32, offset: 192)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !622, file: !6, line: 1832, baseType: !299, size: 64, offset: 256)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !622, file: !6, line: 1835, baseType: !620, size: 64, offset: 320)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !302, file: !6, line: 3398, baseType: !629, size: 704)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !6, line: 1898, size: 704, elements: !630)
!630 = !{!631, !632, !633, !637, !638, !641}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !629, file: !6, line: 1899, baseType: !338, size: 192)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !629, file: !6, line: 1902, baseType: !299, size: 64, offset: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !629, file: !6, line: 1905, baseType: !634, size: 64, offset: 256)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !300, line: 58, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !300, line: 57, flags: DIFlagFwdDecl)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !629, file: !6, line: 1908, baseType: !7, size: 32, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !629, file: !6, line: 1911, baseType: !639, size: 64, offset: 384)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !6, line: 1876, flags: DIFlagFwdDecl)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !629, file: !6, line: 1914, baseType: !642, size: 256, offset: 448)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !643)
!643 = !{!644, !646, !647, !652}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !642, file: !6, line: 1884, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !642, file: !6, line: 1885, baseType: !645, size: 64, offset: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !642, file: !6, line: 1891, baseType: !648, size: 64, offset: 128)
!648 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !642, file: !6, line: 1891, size: 64, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !648, file: !6, line: 1891, baseType: !634, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !648, file: !6, line: 1891, baseType: !299, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !642, file: !6, line: 1892, baseType: !653, size: 64, offset: 192)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !302, file: !6, line: 3399, baseType: !655, size: 704)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !6, line: 2008, size: 704, elements: !656)
!656 = !{!657, !658, !659, !660, !661, !662, !674, !675, !676, !677, !678}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !655, file: !6, line: 2009, baseType: !338, size: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !655, file: !6, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !655, file: !6, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !655, file: !6, line: 2014, baseType: !407, size: 32, offset: 224)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !655, file: !6, line: 2016, baseType: !299, size: 64, offset: 256)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !655, file: !6, line: 2017, baseType: !663, size: 64, offset: 320)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !666)
!666 = !{!667}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !665, file: !6, line: 183, baseType: !668, size: 128)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !669)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !670)
!670 = !{!671, !672, !673}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !669, file: !6, line: 182, baseType: !7, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !669, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !669, file: !6, line: 182, baseType: !620, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !655, file: !6, line: 2019, baseType: !299, size: 64, offset: 384)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !655, file: !6, line: 2020, baseType: !299, size: 64, offset: 448)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !655, file: !6, line: 2021, baseType: !299, size: 64, offset: 512)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !655, file: !6, line: 2022, baseType: !299, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !655, file: !6, line: 2023, baseType: !299, size: 64, offset: 640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !302, file: !6, line: 3400, baseType: !680, size: 832)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !6, line: 2430, size: 832, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !680, file: !6, line: 2431, baseType: !338, size: 192)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !680, file: !6, line: 2433, baseType: !299, size: 64, offset: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !680, file: !6, line: 2434, baseType: !299, size: 64, offset: 256)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !680, file: !6, line: 2435, baseType: !299, size: 64, offset: 320)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !680, file: !6, line: 2436, baseType: !299, size: 64, offset: 384)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !680, file: !6, line: 2437, baseType: !663, size: 64, offset: 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !680, file: !6, line: 2438, baseType: !299, size: 64, offset: 512)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !680, file: !6, line: 2440, baseType: !299, size: 64, offset: 576)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !680, file: !6, line: 2441, baseType: !299, size: 64, offset: 640)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !680, file: !6, line: 2443, baseType: !692, size: 128, offset: 704)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !6, line: 182, baseType: !693)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !6, line: 182, size: 128, elements: !694)
!694 = !{!695}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !693, file: !6, line: 182, baseType: !668, size: 128)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !302, file: !6, line: 3401, baseType: !697, size: 320)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !6, line: 3327, size: 320, elements: !698)
!698 = !{!699, !700, !707}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !697, file: !6, line: 3329, baseType: !338, size: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !697, file: !6, line: 3330, baseType: !701, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !6, line: 3320, size: 192, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !702, file: !6, line: 3322, baseType: !701, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !702, file: !6, line: 3323, baseType: !701, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !702, file: !6, line: 3324, baseType: !299, size: 64, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !697, file: !6, line: 3331, baseType: !701, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !302, file: !6, line: 3402, baseType: !709, size: 256)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !6, line: 1540, size: 256, elements: !710)
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !709, file: !6, line: 1541, baseType: !338, size: 192)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !709, file: !6, line: 1542, baseType: !713, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !6, line: 1538, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !6, line: 1538, size: 192, elements: !716)
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !715, file: !6, line: 1538, baseType: !718, size: 192)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !6, line: 1537, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !6, line: 1537, size: 192, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !719, file: !6, line: 1537, baseType: !7, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !719, file: !6, line: 1537, baseType: !7, size: 32, offset: 32)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !719, file: !6, line: 1537, baseType: !724, size: 128, offset: 64)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 128, elements: !381)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !6, line: 1535, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !6, line: 1532, size: 128, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !726, file: !6, line: 1533, baseType: !299, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !726, file: !6, line: 1534, baseType: !299, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !302, file: !6, line: 3403, baseType: !731, size: 512)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !6, line: 1938, size: 512, elements: !732)
!732 = !{!733, !734, !735, !736, !742, !746, !747}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !731, file: !6, line: 1939, baseType: !338, size: 192)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !731, file: !6, line: 1940, baseType: !407, size: 32, offset: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !731, file: !6, line: 1941, baseType: !5, size: 32, offset: 224)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !731, file: !6, line: 1946, baseType: !737, size: 32, offset: 256)
!737 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !6, line: 1942, size: 32, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !737, file: !6, line: 1943, baseType: !25, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !737, file: !6, line: 1944, baseType: !32, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !737, file: !6, line: 1945, baseType: !39, size: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !731, file: !6, line: 1950, baseType: !743, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !300, line: 66, baseType: !744)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !300, line: 65, flags: DIFlagFwdDecl)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !731, file: !6, line: 1951, baseType: !743, size: 64, offset: 384)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !731, file: !6, line: 1953, baseType: !620, size: 64, offset: 448)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !302, file: !6, line: 3404, baseType: !749, size: 1664)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !6, line: 3337, size: 1664, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !749, file: !6, line: 3338, baseType: !338, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !749, file: !6, line: 3341, baseType: !753, size: 1472, offset: 192)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !754, line: 410, size: 1472, elements: !755)
!754 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!755 = !{!756, !757, !758, !759, !760, !761, !762, !763, !764, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !753, file: !754, line: 412, baseType: !262, size: 32)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !753, file: !754, line: 413, baseType: !262, size: 32, offset: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !753, file: !754, line: 414, baseType: !262, size: 32, offset: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !753, file: !754, line: 415, baseType: !262, size: 32, offset: 96)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !753, file: !754, line: 416, baseType: !262, size: 32, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !753, file: !754, line: 417, baseType: !262, size: 32, offset: 160)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !753, file: !754, line: 418, baseType: !261, size: 8, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !753, file: !754, line: 419, baseType: !261, size: 8, offset: 200)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !753, file: !754, line: 420, baseType: !765, size: 8, offset: 208)
!765 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !753, file: !754, line: 421, baseType: !765, size: 8, offset: 216)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !753, file: !754, line: 422, baseType: !765, size: 8, offset: 224)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !753, file: !754, line: 423, baseType: !765, size: 8, offset: 232)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !753, file: !754, line: 424, baseType: !765, size: 8, offset: 240)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !753, file: !754, line: 425, baseType: !765, size: 8, offset: 248)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !753, file: !754, line: 426, baseType: !765, size: 8, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !753, file: !754, line: 427, baseType: !765, size: 8, offset: 264)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !753, file: !754, line: 428, baseType: !765, size: 8, offset: 272)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !753, file: !754, line: 429, baseType: !765, size: 8, offset: 280)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !753, file: !754, line: 430, baseType: !765, size: 8, offset: 288)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !753, file: !754, line: 431, baseType: !765, size: 8, offset: 296)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !753, file: !754, line: 432, baseType: !765, size: 8, offset: 304)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !753, file: !754, line: 433, baseType: !765, size: 8, offset: 312)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !753, file: !754, line: 434, baseType: !765, size: 8, offset: 320)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !753, file: !754, line: 435, baseType: !765, size: 8, offset: 328)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !753, file: !754, line: 436, baseType: !765, size: 8, offset: 336)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !753, file: !754, line: 437, baseType: !765, size: 8, offset: 344)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !753, file: !754, line: 438, baseType: !765, size: 8, offset: 352)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !753, file: !754, line: 439, baseType: !765, size: 8, offset: 360)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !753, file: !754, line: 440, baseType: !765, size: 8, offset: 368)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !753, file: !754, line: 441, baseType: !765, size: 8, offset: 376)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !753, file: !754, line: 442, baseType: !765, size: 8, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !753, file: !754, line: 443, baseType: !765, size: 8, offset: 392)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !753, file: !754, line: 444, baseType: !765, size: 8, offset: 400)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !753, file: !754, line: 445, baseType: !765, size: 8, offset: 408)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !753, file: !754, line: 446, baseType: !765, size: 8, offset: 416)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !753, file: !754, line: 447, baseType: !765, size: 8, offset: 424)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !753, file: !754, line: 448, baseType: !765, size: 8, offset: 432)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !753, file: !754, line: 449, baseType: !765, size: 8, offset: 440)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !753, file: !754, line: 450, baseType: !765, size: 8, offset: 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !753, file: !754, line: 451, baseType: !765, size: 8, offset: 456)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !753, file: !754, line: 452, baseType: !765, size: 8, offset: 464)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !753, file: !754, line: 453, baseType: !765, size: 8, offset: 472)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !753, file: !754, line: 454, baseType: !765, size: 8, offset: 480)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !753, file: !754, line: 455, baseType: !765, size: 8, offset: 488)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !753, file: !754, line: 456, baseType: !765, size: 8, offset: 496)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !753, file: !754, line: 457, baseType: !765, size: 8, offset: 504)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !753, file: !754, line: 458, baseType: !765, size: 8, offset: 512)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !753, file: !754, line: 459, baseType: !765, size: 8, offset: 520)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !753, file: !754, line: 460, baseType: !765, size: 8, offset: 528)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !753, file: !754, line: 461, baseType: !765, size: 8, offset: 536)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !753, file: !754, line: 462, baseType: !765, size: 8, offset: 544)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !753, file: !754, line: 463, baseType: !765, size: 8, offset: 552)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !753, file: !754, line: 464, baseType: !765, size: 8, offset: 560)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !753, file: !754, line: 465, baseType: !765, size: 8, offset: 568)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !753, file: !754, line: 466, baseType: !765, size: 8, offset: 576)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !753, file: !754, line: 467, baseType: !765, size: 8, offset: 584)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !753, file: !754, line: 468, baseType: !765, size: 8, offset: 592)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !753, file: !754, line: 469, baseType: !765, size: 8, offset: 600)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !753, file: !754, line: 470, baseType: !765, size: 8, offset: 608)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !753, file: !754, line: 471, baseType: !765, size: 8, offset: 616)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !753, file: !754, line: 472, baseType: !765, size: 8, offset: 624)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !753, file: !754, line: 473, baseType: !765, size: 8, offset: 632)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !753, file: !754, line: 474, baseType: !765, size: 8, offset: 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !753, file: !754, line: 475, baseType: !765, size: 8, offset: 648)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !753, file: !754, line: 476, baseType: !765, size: 8, offset: 656)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !753, file: !754, line: 477, baseType: !765, size: 8, offset: 664)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !753, file: !754, line: 478, baseType: !765, size: 8, offset: 672)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !753, file: !754, line: 479, baseType: !765, size: 8, offset: 680)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !753, file: !754, line: 480, baseType: !765, size: 8, offset: 688)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !753, file: !754, line: 481, baseType: !765, size: 8, offset: 696)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !753, file: !754, line: 482, baseType: !765, size: 8, offset: 704)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !753, file: !754, line: 483, baseType: !765, size: 8, offset: 712)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !753, file: !754, line: 484, baseType: !765, size: 8, offset: 720)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !753, file: !754, line: 485, baseType: !765, size: 8, offset: 728)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !753, file: !754, line: 486, baseType: !765, size: 8, offset: 736)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !753, file: !754, line: 487, baseType: !765, size: 8, offset: 744)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !753, file: !754, line: 488, baseType: !765, size: 8, offset: 752)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !753, file: !754, line: 489, baseType: !765, size: 8, offset: 760)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !753, file: !754, line: 490, baseType: !765, size: 8, offset: 768)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !753, file: !754, line: 491, baseType: !765, size: 8, offset: 776)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !753, file: !754, line: 492, baseType: !765, size: 8, offset: 784)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !753, file: !754, line: 493, baseType: !765, size: 8, offset: 792)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !753, file: !754, line: 494, baseType: !765, size: 8, offset: 800)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !753, file: !754, line: 495, baseType: !765, size: 8, offset: 808)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !753, file: !754, line: 496, baseType: !765, size: 8, offset: 816)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !753, file: !754, line: 497, baseType: !765, size: 8, offset: 824)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !753, file: !754, line: 498, baseType: !765, size: 8, offset: 832)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !753, file: !754, line: 499, baseType: !765, size: 8, offset: 840)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !753, file: !754, line: 500, baseType: !765, size: 8, offset: 848)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !753, file: !754, line: 501, baseType: !765, size: 8, offset: 856)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !753, file: !754, line: 502, baseType: !765, size: 8, offset: 864)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !753, file: !754, line: 503, baseType: !765, size: 8, offset: 872)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !753, file: !754, line: 504, baseType: !765, size: 8, offset: 880)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !753, file: !754, line: 505, baseType: !765, size: 8, offset: 888)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !753, file: !754, line: 506, baseType: !765, size: 8, offset: 896)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !753, file: !754, line: 507, baseType: !765, size: 8, offset: 904)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !753, file: !754, line: 508, baseType: !765, size: 8, offset: 912)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !753, file: !754, line: 509, baseType: !765, size: 8, offset: 920)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !753, file: !754, line: 510, baseType: !765, size: 8, offset: 928)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !753, file: !754, line: 511, baseType: !765, size: 8, offset: 936)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !753, file: !754, line: 512, baseType: !765, size: 8, offset: 944)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !753, file: !754, line: 513, baseType: !765, size: 8, offset: 952)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !753, file: !754, line: 514, baseType: !765, size: 8, offset: 960)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !753, file: !754, line: 515, baseType: !765, size: 8, offset: 968)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !753, file: !754, line: 516, baseType: !765, size: 8, offset: 976)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !753, file: !754, line: 517, baseType: !765, size: 8, offset: 984)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !753, file: !754, line: 518, baseType: !765, size: 8, offset: 992)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !753, file: !754, line: 519, baseType: !765, size: 8, offset: 1000)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !753, file: !754, line: 520, baseType: !765, size: 8, offset: 1008)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !753, file: !754, line: 521, baseType: !765, size: 8, offset: 1016)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !753, file: !754, line: 522, baseType: !765, size: 8, offset: 1024)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !753, file: !754, line: 523, baseType: !765, size: 8, offset: 1032)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !753, file: !754, line: 524, baseType: !765, size: 8, offset: 1040)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !753, file: !754, line: 525, baseType: !765, size: 8, offset: 1048)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !753, file: !754, line: 526, baseType: !765, size: 8, offset: 1056)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !753, file: !754, line: 527, baseType: !765, size: 8, offset: 1064)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !753, file: !754, line: 528, baseType: !765, size: 8, offset: 1072)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !753, file: !754, line: 529, baseType: !765, size: 8, offset: 1080)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !753, file: !754, line: 530, baseType: !765, size: 8, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !753, file: !754, line: 531, baseType: !765, size: 8, offset: 1096)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !753, file: !754, line: 532, baseType: !765, size: 8, offset: 1104)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !753, file: !754, line: 533, baseType: !765, size: 8, offset: 1112)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dom", scope: !753, file: !754, line: 534, baseType: !765, size: 8, offset: 1120)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dse", scope: !753, file: !754, line: 535, baseType: !765, size: 8, offset: 1128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_forwprop", scope: !753, file: !754, line: 536, baseType: !765, size: 8, offset: 1136)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_fre", scope: !753, file: !754, line: 537, baseType: !765, size: 8, offset: 1144)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_distribution", scope: !753, file: !754, line: 538, baseType: !765, size: 8, offset: 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_im", scope: !753, file: !754, line: 539, baseType: !765, size: 8, offset: 1160)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_ivcanon", scope: !753, file: !754, line: 540, baseType: !765, size: 8, offset: 1168)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_linear", scope: !753, file: !754, line: 541, baseType: !765, size: 8, offset: 1176)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_optimize", scope: !753, file: !754, line: 542, baseType: !765, size: 8, offset: 1184)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_live_range_split", scope: !753, file: !754, line: 543, baseType: !765, size: 8, offset: 1192)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_phiprop", scope: !753, file: !754, line: 544, baseType: !765, size: 8, offset: 1200)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pre", scope: !753, file: !754, line: 545, baseType: !765, size: 8, offset: 1208)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pta", scope: !753, file: !754, line: 546, baseType: !765, size: 8, offset: 1216)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_reassoc", scope: !753, file: !754, line: 547, baseType: !765, size: 8, offset: 1224)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_scev_cprop", scope: !753, file: !754, line: 548, baseType: !765, size: 8, offset: 1232)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sink", scope: !753, file: !754, line: 549, baseType: !765, size: 8, offset: 1240)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_slp_vectorize", scope: !753, file: !754, line: 550, baseType: !765, size: 8, offset: 1248)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sra", scope: !753, file: !754, line: 551, baseType: !765, size: 8, offset: 1256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_switch_conversion", scope: !753, file: !754, line: 552, baseType: !765, size: 8, offset: 1264)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ter", scope: !753, file: !754, line: 553, baseType: !765, size: 8, offset: 1272)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vect_loop_version", scope: !753, file: !754, line: 554, baseType: !765, size: 8, offset: 1280)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vectorize", scope: !753, file: !754, line: 555, baseType: !765, size: 8, offset: 1288)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vrp", scope: !753, file: !754, line: 556, baseType: !765, size: 8, offset: 1296)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unit_at_a_time", scope: !753, file: !754, line: 557, baseType: !765, size: 8, offset: 1304)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_all_loops", scope: !753, file: !754, line: 558, baseType: !765, size: 8, offset: 1312)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_loops", scope: !753, file: !754, line: 559, baseType: !765, size: 8, offset: 1320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_loop_optimizations", scope: !753, file: !754, line: 560, baseType: !765, size: 8, offset: 1328)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_math_optimizations", scope: !753, file: !754, line: 561, baseType: !765, size: 8, offset: 1336)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unswitch_loops", scope: !753, file: !754, line: 562, baseType: !765, size: 8, offset: 1344)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unwind_tables", scope: !753, file: !754, line: 563, baseType: !765, size: 8, offset: 1352)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking", scope: !753, file: !754, line: 564, baseType: !765, size: 8, offset: 1360)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments", scope: !753, file: !754, line: 565, baseType: !765, size: 8, offset: 1368)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments_toggle", scope: !753, file: !754, line: 566, baseType: !765, size: 8, offset: 1376)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_uninit", scope: !753, file: !754, line: 567, baseType: !765, size: 8, offset: 1384)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "flag_variable_expansion_in_unroller", scope: !753, file: !754, line: 568, baseType: !765, size: 8, offset: 1392)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "flag_vect_cost_model", scope: !753, file: !754, line: 569, baseType: !765, size: 8, offset: 1400)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "flag_value_profile_transformations", scope: !753, file: !754, line: 570, baseType: !765, size: 8, offset: 1408)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "flag_web", scope: !753, file: !754, line: 571, baseType: !765, size: 8, offset: 1416)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "flag_whole_program", scope: !753, file: !754, line: 572, baseType: !765, size: 8, offset: 1424)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wpa", scope: !753, file: !754, line: 573, baseType: !765, size: 8, offset: 1432)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wrapv", scope: !753, file: !754, line: 574, baseType: !765, size: 8, offset: 1440)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "target_option", scope: !302, file: !6, line: 3405, baseType: !921, size: 384)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_target_option", file: !6, line: 3352, size: 384, elements: !922)
!922 = !{!923, !924}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !921, file: !6, line: 3353, baseType: !338, size: 192)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !921, file: !6, line: 3356, baseType: !925, size: 192, offset: 192)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_target_option", file: !754, line: 578, size: 192, elements: !926)
!926 = !{!927, !928, !929, !930, !931, !932, !933, !934, !935, !936, !937}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags_explicit", scope: !925, file: !754, line: 580, baseType: !262, size: 32)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags_explicit", scope: !925, file: !754, line: 581, baseType: !262, size: 32, offset: 32)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags", scope: !925, file: !754, line: 582, baseType: !262, size: 32, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags", scope: !925, file: !754, line: 583, baseType: !262, size: 32, offset: 96)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !925, file: !754, line: 584, baseType: !261, size: 8, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "arch_specified", scope: !925, file: !754, line: 585, baseType: !261, size: 8, offset: 136)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "branch_cost", scope: !925, file: !754, line: 586, baseType: !261, size: 8, offset: 144)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "fpmath", scope: !925, file: !754, line: 587, baseType: !261, size: 8, offset: 152)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !925, file: !754, line: 588, baseType: !261, size: 8, offset: 160)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !925, file: !754, line: 589, baseType: !261, size: 8, offset: 168)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "tune_defaulted", scope: !925, file: !754, line: 590, baseType: !261, size: 8, offset: 176)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(name: "unnamed_struct_number", scope: !2, file: !3, line: 57, type: !262, isLocal: true, isDefinition: true)
!940 = !DIGlobalVariableExpression(var: !941, expr: !DIExpression())
!941 = distinct !DIGlobalVariable(name: "deferred_global_decls", scope: !2, file: !3, line: 61, type: !942, isLocal: true, isDefinition: true)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "varray_type", file: !234, line: 122, baseType: !943)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varray_head_tag", file: !234, line: 113, size: 320, elements: !945)
!945 = !{!946, !947, !948, !949, !950}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "num_elements", scope: !944, file: !234, line: 114, baseType: !280, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "elements_used", scope: !944, file: !234, line: 115, baseType: !280, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !944, file: !234, line: 117, baseType: !233, size: 32, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !944, file: !234, line: 118, baseType: !267, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !944, file: !234, line: 119, baseType: !951, size: 64, offset: 256)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "varray_data", file: !234, line: 110, baseType: !952)
!952 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "varray_data_tag", file: !234, line: 65, size: 64, elements: !953)
!953 = !{!954, !955, !957, !960, !963, !965, !967, !969, !971, !972, !973, !975, !976, !978, !980, !985, !986, !990, !994, !998, !1002, !1006}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_c", scope: !952, file: !234, line: 67, baseType: !380, size: 8)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_uc", scope: !952, file: !234, line: 69, baseType: !956, size: 8)
!956 = !DICompositeType(tag: DW_TAG_array_type, baseType: !261, size: 8, elements: !381)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_s", scope: !952, file: !234, line: 71, baseType: !958, size: 16)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 16, elements: !381)
!959 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_us", scope: !952, file: !234, line: 73, baseType: !961, size: 16)
!961 = !DICompositeType(tag: DW_TAG_array_type, baseType: !962, size: 16, elements: !381)
!962 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_i", scope: !952, file: !234, line: 75, baseType: !964, size: 32)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !262, size: 32, elements: !381)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_u", scope: !952, file: !234, line: 77, baseType: !966, size: 32)
!966 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 32, elements: !381)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_l", scope: !952, file: !234, line: 79, baseType: !968, size: 64)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !354, size: 64, elements: !381)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_ul", scope: !952, file: !234, line: 81, baseType: !970, size: 64)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !282, size: 64, elements: !381)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_hint", scope: !952, file: !234, line: 83, baseType: !968, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_uhint", scope: !952, file: !234, line: 85, baseType: !970, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_generic", scope: !952, file: !234, line: 87, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !266, size: 64, elements: !381)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_generic_nogc", scope: !952, file: !234, line: 89, baseType: !974, size: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_cptr", scope: !952, file: !234, line: 91, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 64, elements: !381)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_rtx", scope: !952, file: !234, line: 93, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !457, size: 64, elements: !381)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_rtvec", scope: !952, file: !234, line: 95, baseType: !981, size: 64)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !982, size: 64, elements: !381)
!982 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !300, line: 53, baseType: !983)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !300, line: 52, flags: DIFlagFwdDecl)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "vdt_tree", scope: !952, file: !234, line: 97, baseType: !620, size: 64)
