; ModuleID = 'sel-sched.bc'
source_filename = "sel-sched.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.VEC_sel_global_bb_info_def_heap = type { %struct.VEC_sel_global_bb_info_def_base }
%struct.VEC_sel_global_bb_info_def_base = type { i32, i32, [1 x %struct.sel_global_bb_info_def] }
%struct.sel_global_bb_info_def = type { %struct.bitmap_head_def*, i8 }
%struct.VEC_sel_insn_data_def_heap = type { %struct.VEC_sel_insn_data_def_base }

!539 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!540 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!541 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!542 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!543 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!544 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!545 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!546 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!547 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!548 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!549 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!550 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!551 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!552 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!553 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!554 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!555 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!556 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MOVEUP_EXPR_CODE", file: !3, line: 267, baseType: !7, size: 32, elements: !557)
!557 = !{!558, !559, !560, !561}
!558 = !DIEnumerator(name: "MOVEUP_EXPR_SAME", value: 0, isUnsigned: true)
!559 = !DIEnumerator(name: "MOVEUP_EXPR_AS_RHS", value: 1, isUnsigned: true)
!560 = !DIEnumerator(name: "MOVEUP_EXPR_NULL", value: 2, isUnsigned: true)
!561 = !DIEnumerator(name: "MOVEUP_EXPR_CHANGED", value: 3, isUnsigned: true)
!562 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_class", file: !166, line: 1188, baseType: !7, size: 32, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590, !591}
!564 = !DIEnumerator(name: "NO_REGS", value: 0, isUnsigned: true)
!565 = !DIEnumerator(name: "AREG", value: 1, isUnsigned: true)
!566 = !DIEnumerator(name: "DREG", value: 2, isUnsigned: true)
!567 = !DIEnumerator(name: "CREG", value: 3, isUnsigned: true)
!568 = !DIEnumerator(name: "BREG", value: 4, isUnsigned: true)
!569 = !DIEnumerator(name: "SIREG", value: 5, isUnsigned: true)
!570 = !DIEnumerator(name: "DIREG", value: 6, isUnsigned: true)
!571 = !DIEnumerator(name: "AD_REGS", value: 7, isUnsigned: true)
!572 = !DIEnumerator(name: "CLOBBERED_REGS", value: 8, isUnsigned: true)
!573 = !DIEnumerator(name: "Q_REGS", value: 9, isUnsigned: true)
!574 = !DIEnumerator(name: "NON_Q_REGS", value: 10, isUnsigned: true)
!575 = !DIEnumerator(name: "INDEX_REGS", value: 11, isUnsigned: true)
!576 = !DIEnumerator(name: "LEGACY_REGS", value: 12, isUnsigned: true)
!577 = !DIEnumerator(name: "GENERAL_REGS", value: 13, isUnsigned: true)
!578 = !DIEnumerator(name: "FP_TOP_REG", value: 14, isUnsigned: true)
!579 = !DIEnumerator(name: "FP_SECOND_REG", value: 15, isUnsigned: true)
!580 = !DIEnumerator(name: "FLOAT_REGS", value: 16, isUnsigned: true)
!581 = !DIEnumerator(name: "SSE_FIRST_REG", value: 17, isUnsigned: true)
!582 = !DIEnumerator(name: "SSE_REGS", value: 18, isUnsigned: true)
!583 = !DIEnumerator(name: "MMX_REGS", value: 19, isUnsigned: true)
!584 = !DIEnumerator(name: "FP_TOP_SSE_REGS", value: 20, isUnsigned: true)
!585 = !DIEnumerator(name: "FP_SECOND_SSE_REGS", value: 21, isUnsigned: true)
!586 = !DIEnumerator(name: "FLOAT_SSE_REGS", value: 22, isUnsigned: true)
!587 = !DIEnumerator(name: "FLOAT_INT_REGS", value: 23, isUnsigned: true)
!588 = !DIEnumerator(name: "INT_SSE_REGS", value: 24, isUnsigned: true)
!589 = !DIEnumerator(name: "FLOAT_INT_SSE_REGS", value: 25, isUnsigned: true)
!590 = !DIEnumerator(name: "ALL_REGS", value: 26, isUnsigned: true)
!591 = !DIEnumerator(name: "LIM_REG_CLASSES", value: 27, isUnsigned: true)
!592 = !{!593, !594, !595, !596, !599, !600, !597, !413, !602, !607, !1868, !1899, !7, !1912, !1921, !5, !1927, !1928, !2013, !2025, !1158, !2034, !1079, !2039, !677, !1998, !2044, !2056, !1840, !2058, !1834, !1835, !1911, !1818, !1853}
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!595 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!601 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !598)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "moveop_static_params_p", file: !3, line: 406, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "moveop_static_params", file: !3, line: 370, size: 192, elements: !605)
!605 = !{!606, !1833, !1897, !1898}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !604, file: !3, line: 373, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !608, line: 50, baseType: !609)
!608 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !414, line: 240, size: 384, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !610, file: !414, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !610, file: !414, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !610, file: !414, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !610, file: !414, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !610, file: !414, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !610, file: !414, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !610, file: !414, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !610, file: !414, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !610, file: !414, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !610, file: !414, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !610, file: !414, line: 321, baseType: !623, size: 320, offset: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !414, line: 315, size: 320, elements: !624)
!624 = !{!625, !1768, !1770, !1831, !1832}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !623, file: !414, line: 316, baseType: !626, size: 64)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !627, size: 64, elements: !642)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !414, line: 183, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !414, line: 166, size: 64, elements: !629)
!629 = !{!630, !631, !632, !633, !634, !644, !645, !657, !660, !722, !1746, !1747, !1758, !1765}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !628, file: !414, line: 168, baseType: !595, size: 32)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !628, file: !414, line: 169, baseType: !7, size: 32)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !628, file: !414, line: 170, baseType: !600, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !628, file: !414, line: 171, baseType: !607, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !628, file: !414, line: 172, baseType: !635, size: 64)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !608, line: 53, baseType: !636)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !414, line: 359, size: 128, elements: !638)
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !637, file: !414, line: 360, baseType: !595, size: 32)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !637, file: !414, line: 361, baseType: !641, size: 64, offset: 64)
!641 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 64, elements: !642)
!642 = !{!643}
!643 = !DISubrange(count: 1)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !628, file: !414, line: 173, baseType: !5, size: 32)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !628, file: !414, line: 174, baseType: !646, size: 32)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !414, line: 133, baseType: !647)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 115, size: 32, elements: !648)
!648 = !{!649, !650, !651, !652, !653, !654, !655, !656}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !647, file: !414, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !647, file: !414, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !647, file: !414, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !647, file: !414, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !647, file: !414, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !647, file: !414, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !647, file: !414, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !647, file: !414, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !628, file: !414, line: 175, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !414, line: 175, flags: DIFlagFwdDecl)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !628, file: !414, line: 176, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !663, line: 75, size: 256, elements: !664)
!663 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!664 = !{!665, !680, !681, !682}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !662, file: !663, line: 76, baseType: !666, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !663, line: 68, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !663, line: 63, size: 320, elements: !669)
!669 = !{!670, !672, !673, !674}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !668, file: !663, line: 64, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !668, file: !663, line: 65, baseType: !671, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !668, file: !663, line: 66, baseType: !7, size: 32, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !668, file: !663, line: 67, baseType: !675, size: 128, offset: 192)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !676, size: 128, elements: !678)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !663, line: 29, baseType: !677)
!677 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!678 = !{!679}
!679 = !DISubrange(count: 2)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !662, file: !663, line: 77, baseType: !666, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !662, file: !663, line: 78, baseType: !7, size: 32, offset: 128)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !662, file: !663, line: 79, baseType: !683, size: 64, offset: 192)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !663, line: 49, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !663, line: 45, size: 832, elements: !686)
!686 = !{!687, !688, !689}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !685, file: !663, line: 46, baseType: !671, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !685, file: !663, line: 47, baseType: !661, size: 64, offset: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !685, file: !663, line: 48, baseType: !690, size: 704, offset: 128)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !691, line: 164, size: 704, elements: !692)
!691 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!692 = !{!693, !695, !705, !706, !707, !708, !709, !710, !714, !718, !719, !720, !721}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !690, file: !691, line: 166, baseType: !694, size: 64)
!694 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !690, file: !691, line: 167, baseType: !696, size: 64, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !691, line: 157, size: 192, elements: !698)
!698 = !{!699, !700, !701}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !697, file: !691, line: 159, baseType: !597, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !697, file: !691, line: 160, baseType: !696, size: 64, offset: 64)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !697, file: !691, line: 161, baseType: !702, size: 32, offset: 128)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 32, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 4)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !690, file: !691, line: 168, baseType: !597, size: 64, offset: 128)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !690, file: !691, line: 169, baseType: !597, size: 64, offset: 192)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !690, file: !691, line: 170, baseType: !597, size: 64, offset: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !690, file: !691, line: 171, baseType: !694, size: 64, offset: 320)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !690, file: !691, line: 172, baseType: !595, size: 32, offset: 384)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !690, file: !691, line: 176, baseType: !711, size: 64, offset: 448)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{!696, !599, !694}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !690, file: !691, line: 177, baseType: !715, size: 64, offset: 512)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DISubroutineType(types: !717)
!717 = !{null, !599, !696}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !690, file: !691, line: 178, baseType: !599, size: 64, offset: 576)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !690, file: !691, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !690, file: !691, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !690, file: !691, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !628, file: !414, line: 177, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !608, line: 56, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !171, line: 3371, size: 1792, elements: !726)
!726 = !{!727, !760, !766, !777, !796, !807, !812, !819, !825, !838, !850, !888, !893, !921, !929, !930, !935, !944, !950, !955, !959, !963, !1385, !1434, !1440, !1446, !1453, !1476, !1490, !1507, !1519, !1541, !1556, !1728}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !725, file: !171, line: 3372, baseType: !728, size: 64)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !171, line: 360, size: 64, elements: !729)
!729 = !{!730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !728, file: !171, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !728, file: !171, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !728, file: !171, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !728, file: !171, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !728, file: !171, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !728, file: !171, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !728, file: !171, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !728, file: !171, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !728, file: !171, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !728, file: !171, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !728, file: !171, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !728, file: !171, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !728, file: !171, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !728, file: !171, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !728, file: !171, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !728, file: !171, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !728, file: !171, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !728, file: !171, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !728, file: !171, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !728, file: !171, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !728, file: !171, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !728, file: !171, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !728, file: !171, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !728, file: !171, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !728, file: !171, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !728, file: !171, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !728, file: !171, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !728, file: !171, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !728, file: !171, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !728, file: !171, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !725, file: !171, line: 3373, baseType: !761, size: 192)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !171, line: 402, size: 192, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !761, file: !171, line: 403, baseType: !728, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !761, file: !171, line: 404, baseType: !723, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !761, file: !171, line: 405, baseType: !723, size: 64, offset: 128)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !725, file: !171, line: 3374, baseType: !767, size: 320)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !171, line: 1384, size: 320, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !767, file: !171, line: 1385, baseType: !761, size: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !767, file: !171, line: 1386, baseType: !771, size: 128, offset: 192)
!771 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !772, line: 58, baseType: !773)
!772 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !772, line: 54, size: 128, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !773, file: !772, line: 56, baseType: !677, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !773, file: !772, line: 57, baseType: !694, size: 64, offset: 64)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !725, file: !171, line: 3375, baseType: !778, size: 256)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !171, line: 1397, size: 256, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !171, line: 1398, baseType: !761, size: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !778, file: !171, line: 1399, baseType: !782, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !784, line: 52, size: 256, elements: !785)
!784 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!785 = !{!786, !787, !788, !789, !790, !791, !792}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !783, file: !784, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !783, file: !784, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !783, file: !784, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !783, file: !784, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !783, file: !784, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !783, file: !784, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !783, file: !784, line: 62, baseType: !793, size: 192, offset: 64)
!793 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 192, elements: !794)
!794 = !{!795}
!795 = !DISubrange(count: 3)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !725, file: !171, line: 3376, baseType: !797, size: 256)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !171, line: 1408, size: 256, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !171, line: 1409, baseType: !761, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !797, file: !171, line: 1410, baseType: !801, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !803, line: 27, size: 192, elements: !804)
!803 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !802, file: !803, line: 29, baseType: !771, size: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !802, file: !803, line: 30, baseType: !5, size: 32, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !725, file: !171, line: 3377, baseType: !808, size: 256)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !171, line: 1437, size: 256, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !171, line: 1438, baseType: !761, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !808, file: !171, line: 1439, baseType: !723, size: 64, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !725, file: !171, line: 3378, baseType: !813, size: 256)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !171, line: 1418, size: 256, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !813, file: !171, line: 1419, baseType: !761, size: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !813, file: !171, line: 1420, baseType: !595, size: 32, offset: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !813, file: !171, line: 1421, baseType: !818, size: 8, offset: 224)
!818 = !DICompositeType(tag: DW_TAG_array_type, baseType: !598, size: 8, elements: !642)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !725, file: !171, line: 3379, baseType: !820, size: 320)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !171, line: 1428, size: 320, elements: !821)
!821 = !{!822, !823, !824}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !820, file: !171, line: 1429, baseType: !761, size: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !820, file: !171, line: 1430, baseType: !723, size: 64, offset: 192)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !820, file: !171, line: 1431, baseType: !723, size: 64, offset: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !725, file: !171, line: 3380, baseType: !826, size: 320)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !171, line: 1460, size: 320, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !826, file: !171, line: 1461, baseType: !761, size: 192)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !826, file: !171, line: 1462, baseType: !830, size: 128, offset: 192)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !831, line: 31, size: 128, elements: !832)
!831 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!832 = !{!833, !836, !837}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !830, file: !831, line: 32, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !594)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !830, file: !831, line: 33, baseType: !7, size: 32, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !830, file: !831, line: 34, baseType: !7, size: 32, offset: 96)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !725, file: !171, line: 3381, baseType: !839, size: 384)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !171, line: 2507, size: 384, elements: !840)
!840 = !{!841, !842, !847, !848, !849}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !839, file: !171, line: 2508, baseType: !761, size: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !839, file: !171, line: 2509, baseType: !843, size: 32, offset: 192)
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !844, line: 58, baseType: !845)
!844 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !846, line: 44, baseType: !7)
!846 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!847 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !839, file: !171, line: 2510, baseType: !7, size: 32, offset: 224)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !839, file: !171, line: 2511, baseType: !723, size: 64, offset: 256)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !839, file: !171, line: 2512, baseType: !723, size: 64, offset: 320)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !725, file: !171, line: 3382, baseType: !851, size: 896)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !171, line: 2652, size: 896, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !851, file: !171, line: 2653, baseType: !839, size: 384)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !851, file: !171, line: 2654, baseType: !723, size: 64, offset: 384)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !851, file: !171, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !851, file: !171, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !851, file: !171, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !851, file: !171, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !851, file: !171, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !851, file: !171, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !851, file: !171, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !851, file: !171, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !851, file: !171, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !851, file: !171, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !851, file: !171, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !851, file: !171, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !851, file: !171, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !851, file: !171, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !851, file: !171, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !851, file: !171, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !851, file: !171, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !851, file: !171, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !851, file: !171, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !851, file: !171, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !851, file: !171, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !851, file: !171, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !851, file: !171, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !851, file: !171, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !851, file: !171, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !851, file: !171, line: 2703, baseType: !7, size: 32, offset: 512)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !851, file: !171, line: 2705, baseType: !723, size: 64, offset: 576)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !851, file: !171, line: 2706, baseType: !723, size: 64, offset: 640)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !851, file: !171, line: 2707, baseType: !723, size: 64, offset: 704)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !851, file: !171, line: 2708, baseType: !723, size: 64, offset: 768)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !851, file: !171, line: 2711, baseType: !886, size: 64, offset: 832)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !171, line: 2711, flags: DIFlagFwdDecl)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !725, file: !171, line: 3383, baseType: !889, size: 960)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !171, line: 2756, size: 960, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !889, file: !171, line: 2757, baseType: !851, size: 896)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !889, file: !171, line: 2758, baseType: !607, size: 64, offset: 896)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !725, file: !171, line: 3384, baseType: !894, size: 1472)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !171, line: 3114, size: 1472, elements: !895)
!895 = !{!896, !917, !918, !919, !920}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !894, file: !171, line: 3115, baseType: !897, size: 1216)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !171, line: 2984, size: 1216, elements: !898)
!898 = !{!899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !171, line: 2985, baseType: !889, size: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !897, file: !171, line: 2986, baseType: !723, size: 64, offset: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !897, file: !171, line: 2987, baseType: !723, size: 64, offset: 1024)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !897, file: !171, line: 2988, baseType: !723, size: 64, offset: 1088)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !897, file: !171, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !897, file: !171, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !897, file: !171, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !897, file: !171, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !897, file: !171, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !897, file: !171, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !897, file: !171, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !897, file: !171, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !897, file: !171, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !897, file: !171, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !897, file: !171, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !897, file: !171, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !897, file: !171, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !897, file: !171, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !894, file: !171, line: 3117, baseType: !723, size: 64, offset: 1216)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !894, file: !171, line: 3119, baseType: !723, size: 64, offset: 1280)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !894, file: !171, line: 3121, baseType: !723, size: 64, offset: 1344)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !894, file: !171, line: 3123, baseType: !723, size: 64, offset: 1408)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !725, file: !171, line: 3385, baseType: !922, size: 1088)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !171, line: 2874, size: 1088, elements: !923)
!923 = !{!924, !925, !926}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !922, file: !171, line: 2875, baseType: !889, size: 960)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !922, file: !171, line: 2876, baseType: !607, size: 64, offset: 960)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !922, file: !171, line: 2877, baseType: !927, size: 64, offset: 1024)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !171, line: 2856, flags: DIFlagFwdDecl)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !725, file: !171, line: 3386, baseType: !897, size: 1216)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !725, file: !171, line: 3387, baseType: !931, size: 1280)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !171, line: 3093, size: 1280, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !931, file: !171, line: 3094, baseType: !897, size: 1216)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !931, file: !171, line: 3095, baseType: !927, size: 64, offset: 1216)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !725, file: !171, line: 3388, baseType: !936, size: 1216)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !171, line: 2824, size: 1216, elements: !937)
!937 = !{!938, !939, !940, !941, !942, !943}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !936, file: !171, line: 2825, baseType: !851, size: 896)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !936, file: !171, line: 2827, baseType: !723, size: 64, offset: 896)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !936, file: !171, line: 2828, baseType: !723, size: 64, offset: 960)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !936, file: !171, line: 2829, baseType: !723, size: 64, offset: 1024)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !936, file: !171, line: 2830, baseType: !723, size: 64, offset: 1088)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !936, file: !171, line: 2831, baseType: !723, size: 64, offset: 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !725, file: !171, line: 3389, baseType: !945, size: 1024)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !171, line: 2850, size: 1024, elements: !946)
!946 = !{!947, !948, !949}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !945, file: !171, line: 2851, baseType: !889, size: 960)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !945, file: !171, line: 2852, baseType: !595, size: 32, offset: 960)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !945, file: !171, line: 2853, baseType: !595, size: 32, offset: 992)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !725, file: !171, line: 3390, baseType: !951, size: 1024)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !171, line: 2857, size: 1024, elements: !952)
!952 = !{!953, !954}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !951, file: !171, line: 2858, baseType: !889, size: 960)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !951, file: !171, line: 2859, baseType: !927, size: 64, offset: 960)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !725, file: !171, line: 3391, baseType: !956, size: 960)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !171, line: 2862, size: 960, elements: !957)
!957 = !{!958}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !956, file: !171, line: 2863, baseType: !889, size: 960)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !725, file: !171, line: 3392, baseType: !960, size: 1472)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !171, line: 3304, size: 1472, elements: !961)
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !960, file: !171, line: 3305, baseType: !894, size: 1472)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !725, file: !171, line: 3393, baseType: !964, size: 1792)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !171, line: 3248, size: 1792, elements: !965)
!965 = !{!966, !967, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !964, file: !171, line: 3249, baseType: !894, size: 1472)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !964, file: !171, line: 3251, baseType: !968, size: 64, offset: 1472)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !970, line: 463, size: 1152, elements: !971)
!970 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!971 = !{!972, !1136, !1296, !1297, !1300, !1308, !1309, !1310, !1311, !1312, !1313, !1337, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !969, file: !970, line: 464, baseType: !973, size: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !975)
!975 = !{!976, !1025, !1038, !1052, !1104, !1117}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !974, file: !135, line: 197, baseType: !977, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !978)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !980)
!980 = !{!981, !982, !983, !984, !985, !986, !1013, !1022, !1023, !1024}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !979, file: !135, line: 119, baseType: !978, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !979, file: !135, line: 122, baseType: !978, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !979, file: !135, line: 123, baseType: !978, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !979, file: !135, line: 126, baseType: !595, size: 32, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !979, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !979, file: !135, line: 165, baseType: !987, size: 192, offset: 256)
!987 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !988)
!988 = !{!989, !1002, !1008}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !987, file: !135, line: 137, baseType: !990, size: 128)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !991)
!991 = !{!992, !1001}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !990, file: !135, line: 135, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !995)
!995 = !{!996, !997, !998, !999, !1000}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !994, file: !135, line: 96, baseType: !993, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !994, file: !135, line: 97, baseType: !993, size: 64, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !994, file: !135, line: 101, baseType: !723, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !994, file: !135, line: 106, baseType: !723, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !994, file: !135, line: 111, baseType: !723, size: 64, offset: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !990, file: !135, line: 136, baseType: !993, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !987, file: !135, line: 151, baseType: !1003, size: 192)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1004)
!1004 = !{!1005, !1006, !1007}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1003, file: !135, line: 141, baseType: !723, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1003, file: !135, line: 145, baseType: !723, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1003, file: !135, line: 150, baseType: !595, size: 32, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !987, file: !135, line: 164, baseType: !1009, size: 128)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1009, file: !135, line: 161, baseType: !723, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1009, file: !135, line: 163, baseType: !843, size: 32, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !979, file: !135, line: 168, baseType: !1014, size: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1016)
!1016 = !{!1017, !1018, !1019, !1020, !1021}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1015, file: !135, line: 70, baseType: !1014, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1015, file: !135, line: 73, baseType: !978, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1015, file: !135, line: 78, baseType: !723, size: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1015, file: !135, line: 85, baseType: !607, size: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1015, file: !135, line: 88, baseType: !595, size: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !979, file: !135, line: 173, baseType: !607, size: 64, offset: 512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !979, file: !135, line: 173, baseType: !607, size: 64, offset: 576)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !979, file: !135, line: 177, baseType: !594, size: 8, offset: 640)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !974, file: !135, line: 200, baseType: !1026, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1028)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1029)
!1029 = !{!1030}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1028, file: !135, line: 185, baseType: !1031, size: 128)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1033)
!1033 = !{!1034, !1035, !1036}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1032, file: !135, line: 184, baseType: !7, size: 32)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1032, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1032, file: !135, line: 184, baseType: !1037, size: 64, offset: 64)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 64, elements: !642)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !974, file: !135, line: 203, baseType: !1039, size: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1042)
!1042 = !{!1043}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1041, file: !135, line: 189, baseType: !1044, size: 128)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1046)
!1046 = !{!1047, !1048, !1049}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1045, file: !135, line: 188, baseType: !7, size: 32)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1045, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1045, file: !135, line: 188, baseType: !1050, size: 64, offset: 64)
!1050 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1051, size: 64, elements: !642)
!1051 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1014)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !974, file: !135, line: 207, baseType: !1053, size: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1054, line: 144, baseType: !1055)
!1054 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1054, line: 100, size: 896, elements: !1057)
!1057 = !{!1058, !1066, !1071, !1076, !1078, !1081, !1082, !1083, !1084, !1085, !1090, !1092, !1093, !1098, !1103}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1056, file: !1054, line: 102, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1054, line: 52, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1063, !1064}
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1054, line: 47, baseType: !7)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1056, file: !1054, line: 105, baseType: !1067, size: 64, offset: 64)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1054, line: 59, baseType: !1068)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = !DISubroutineType(types: !1070)
!1070 = !{!595, !1064, !1064}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1056, file: !1054, line: 108, baseType: !1072, size: 64, offset: 128)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1054, line: 63, baseType: !1073)
!1073 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1074, size: 64)
!1074 = !DISubroutineType(types: !1075)
!1075 = !{null, !599}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1056, file: !1054, line: 111, baseType: !1077, size: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1056, file: !1054, line: 114, baseType: !1079, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1080, line: 46, baseType: !677)
!1080 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1056, file: !1054, line: 117, baseType: !1079, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1056, file: !1054, line: 120, baseType: !1079, size: 64, offset: 384)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1056, file: !1054, line: 124, baseType: !7, size: 32, offset: 448)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1056, file: !1054, line: 128, baseType: !7, size: 32, offset: 480)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1056, file: !1054, line: 131, baseType: !1086, size: 64, offset: 512)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1054, line: 75, baseType: !1087)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DISubroutineType(types: !1089)
!1089 = !{!599, !1079, !1079}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1056, file: !1054, line: 132, baseType: !1091, size: 64, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1054, line: 78, baseType: !1073)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1056, file: !1054, line: 135, baseType: !599, size: 64, offset: 640)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1056, file: !1054, line: 136, baseType: !1094, size: 64, offset: 704)
!1094 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1054, line: 82, baseType: !1095)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DISubroutineType(types: !1097)
!1097 = !{!599, !599, !1079, !1079}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1056, file: !1054, line: 137, baseType: !1099, size: 64, offset: 768)
!1099 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1054, line: 83, baseType: !1100)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = !DISubroutineType(types: !1102)
!1102 = !{null, !599, !599}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1056, file: !1054, line: 141, baseType: !7, size: 32, offset: 832)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !974, file: !135, line: 211, baseType: !1105, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !171, line: 183, baseType: !1107)
!1107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !171, line: 183, size: 128, elements: !1108)
!1108 = !{!1109}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1107, file: !171, line: 183, baseType: !1110, size: 128)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !171, line: 182, baseType: !1111)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !171, line: 182, size: 128, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1111, file: !171, line: 182, baseType: !7, size: 32)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1111, file: !171, line: 182, baseType: !7, size: 32, offset: 32)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1111, file: !171, line: 182, baseType: !1116, size: 64, offset: 64)
!1116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !723, size: 64, elements: !642)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !974, file: !135, line: 220, baseType: !1118, size: 64, offset: 320)
!1118 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1119)
!1119 = !{!1120, !1121}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1118, file: !135, line: 218, baseType: !1105, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1118, file: !135, line: 219, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1124, line: 29, baseType: !1125)
!1124 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1124, line: 29, size: 96, elements: !1126)
!1126 = !{!1127}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1125, file: !1124, line: 29, baseType: !1128, size: 96)
!1128 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1124, line: 27, baseType: !1129)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1124, line: 27, size: 96, elements: !1130)
!1130 = !{!1131, !1132, !1133}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1129, file: !1124, line: 27, baseType: !7, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1129, file: !1124, line: 27, baseType: !7, size: 32, offset: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1129, file: !1124, line: 27, baseType: !1134, size: 8, offset: 64)
!1134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1135, size: 8, elements: !642)
!1135 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1124, line: 26, baseType: !594)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !969, file: !970, line: 467, baseType: !1137, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !155, line: 374, size: 640, elements: !1139)
!1139 = !{!1140, !1271, !1272, !1285, !1286, !1287, !1288, !1289, !1290, !1292, !1294, !1295}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1138, file: !155, line: 377, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !608, line: 111, baseType: !1142)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !155, line: 217, size: 832, elements: !1144)
!1144 = !{!1145, !1180, !1181, !1182, !1241, !1245, !1246, !1247, !1265, !1266, !1267, !1268, !1269, !1270}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1143, file: !155, line: 219, baseType: !1146, size: 64)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !155, line: 151, baseType: !1148)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !155, line: 151, size: 128, elements: !1149)
!1149 = !{!1150}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1148, file: !155, line: 151, baseType: !1151, size: 128)
!1151 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !155, line: 150, baseType: !1152)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !155, line: 150, size: 128, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1152, file: !155, line: 150, baseType: !7, size: 32)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1152, file: !155, line: 150, baseType: !7, size: 32, offset: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1152, file: !155, line: 150, baseType: !1157, size: 64, offset: 64)
!1157 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1158, size: 64, elements: !642)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !608, line: 108, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !155, line: 122, size: 512, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1172, !1173, !1174, !1175, !1176, !1177, !1178}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1160, file: !155, line: 124, baseType: !1142, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1160, file: !155, line: 125, baseType: !1142, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1160, file: !155, line: 131, baseType: !1165, size: 64, offset: 128)
!1165 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !155, line: 128, size: 64, elements: !1166)
!1166 = !{!1167, !1171}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1165, file: !155, line: 129, baseType: !1168, size: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !608, line: 66, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !608, line: 65, flags: DIFlagFwdDecl)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1165, file: !155, line: 130, baseType: !607, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1160, file: !155, line: 134, baseType: !599, size: 64, offset: 192)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1160, file: !155, line: 137, baseType: !723, size: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1160, file: !155, line: 138, baseType: !843, size: 32, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1160, file: !155, line: 142, baseType: !7, size: 32, offset: 352)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1160, file: !155, line: 144, baseType: !595, size: 32, offset: 384)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1160, file: !155, line: 145, baseType: !595, size: 32, offset: 416)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1160, file: !155, line: 146, baseType: !1179, size: 64, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !155, line: 119, baseType: !694)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1143, file: !155, line: 220, baseType: !1146, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1143, file: !155, line: 223, baseType: !599, size: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1143, file: !155, line: 226, baseType: !1183, size: 64, offset: 192)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 100, size: 1216, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189, !1190, !1195, !1196, !1197, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1231, !1239, !1240}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1184, file: !142, line: 102, baseType: !595, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1184, file: !142, line: 105, baseType: !7, size: 32, offset: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1184, file: !142, line: 108, baseType: !1142, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1184, file: !142, line: 111, baseType: !1142, size: 64, offset: 128)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1184, file: !142, line: 114, baseType: !1191, size: 64, offset: 192)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !142, line: 41, size: 64, elements: !1192)
!1192 = !{!1193, !1194}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1191, file: !142, line: 42, baseType: !141, size: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1191, file: !142, line: 43, baseType: !7, size: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1184, file: !142, line: 117, baseType: !7, size: 32, offset: 256)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1184, file: !142, line: 120, baseType: !7, size: 32, offset: 288)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1184, file: !142, line: 123, baseType: !1198, size: 64, offset: 320)
!1198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !142, line: 87, baseType: !1200)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !142, line: 87, size: 128, elements: !1201)
!1201 = !{!1202}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1200, file: !142, line: 87, baseType: !1203, size: 128)
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !142, line: 85, baseType: !1204)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !142, line: 85, size: 128, elements: !1205)
!1205 = !{!1206, !1207, !1208}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1204, file: !142, line: 85, baseType: !7, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1204, file: !142, line: 85, baseType: !7, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1204, file: !142, line: 85, baseType: !1209, size: 64, offset: 64)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1210, size: 64, elements: !642)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !142, line: 84, baseType: !1183)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1184, file: !142, line: 126, baseType: !1183, size: 64, offset: 384)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1184, file: !142, line: 129, baseType: !1183, size: 64, offset: 448)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1184, file: !142, line: 132, baseType: !599, size: 64, offset: 512)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1184, file: !142, line: 139, baseType: !723, size: 64, offset: 576)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1184, file: !142, line: 143, baseType: !771, size: 128, offset: 640)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1184, file: !142, line: 146, baseType: !771, size: 128, offset: 768)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1184, file: !142, line: 148, baseType: !594, size: 8, offset: 896)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1184, file: !142, line: 149, baseType: !594, size: 8, offset: 904)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1184, file: !142, line: 153, baseType: !150, size: 32, offset: 928)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1184, file: !142, line: 156, baseType: !1221, size: 64, offset: 960)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !142, line: 48, size: 320, elements: !1223)
!1223 = !{!1224, !1228, !1229, !1230}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1222, file: !142, line: 50, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !608, line: 58, baseType: !1226)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !608, line: 57, flags: DIFlagFwdDecl)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1222, file: !142, line: 59, baseType: !771, size: 128, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1222, file: !142, line: 64, baseType: !594, size: 8, offset: 192)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1222, file: !142, line: 67, baseType: !1221, size: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1184, file: !142, line: 159, baseType: !1232, size: 64, offset: 1024)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !142, line: 72, size: 256, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1233, file: !142, line: 74, baseType: !1159, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1233, file: !142, line: 77, baseType: !1232, size: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1233, file: !142, line: 78, baseType: !1232, size: 64, offset: 128)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1233, file: !142, line: 81, baseType: !1232, size: 64, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1184, file: !142, line: 162, baseType: !594, size: 8, offset: 1088)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1184, file: !142, line: 166, baseType: !723, size: 64, offset: 1152)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1143, file: !155, line: 229, baseType: !1242, size: 128, offset: 256)
!1242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1243, size: 128, elements: !678)
!1243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1244, size: 64)
!1244 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !155, line: 229, flags: DIFlagFwdDecl)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1143, file: !155, line: 232, baseType: !1142, size: 64, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1143, file: !155, line: 233, baseType: !1142, size: 64, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1143, file: !155, line: 238, baseType: !1248, size: 64, offset: 512)
!1248 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !155, line: 235, size: 64, elements: !1249)
!1249 = !{!1250, !1256}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1248, file: !155, line: 236, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !155, line: 273, size: 128, elements: !1253)
!1253 = !{!1254, !1255}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1252, file: !155, line: 275, baseType: !1168, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1252, file: !155, line: 278, baseType: !1168, size: 64, offset: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1248, file: !155, line: 237, baseType: !1257, size: 64)
!1257 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1258, size: 64)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !155, line: 259, size: 320, elements: !1259)
!1259 = !{!1260, !1261, !1262, !1263, !1264}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1258, file: !155, line: 261, baseType: !607, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1258, file: !155, line: 262, baseType: !607, size: 64, offset: 64)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1258, file: !155, line: 266, baseType: !607, size: 64, offset: 128)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1258, file: !155, line: 267, baseType: !607, size: 64, offset: 192)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1258, file: !155, line: 270, baseType: !595, size: 32, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1143, file: !155, line: 241, baseType: !1179, size: 64, offset: 576)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1143, file: !155, line: 244, baseType: !595, size: 32, offset: 640)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1143, file: !155, line: 247, baseType: !595, size: 32, offset: 672)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1143, file: !155, line: 250, baseType: !595, size: 32, offset: 704)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1143, file: !155, line: 253, baseType: !595, size: 32, offset: 736)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1143, file: !155, line: 256, baseType: !595, size: 32, offset: 768)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1138, file: !155, line: 378, baseType: !1141, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1138, file: !155, line: 381, baseType: !1273, size: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !155, line: 282, baseType: !1275)
!1275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !155, line: 282, size: 128, elements: !1276)
!1276 = !{!1277}
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1275, file: !155, line: 282, baseType: !1278, size: 128)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !155, line: 281, baseType: !1279)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !155, line: 281, size: 128, elements: !1280)
!1280 = !{!1281, !1282, !1283}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1279, file: !155, line: 281, baseType: !7, size: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1279, file: !155, line: 281, baseType: !7, size: 32, offset: 32)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1279, file: !155, line: 281, baseType: !1284, size: 64, offset: 64)
!1284 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1141, size: 64, elements: !642)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1138, file: !155, line: 384, baseType: !595, size: 32, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1138, file: !155, line: 387, baseType: !595, size: 32, offset: 224)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1138, file: !155, line: 390, baseType: !595, size: 32, offset: 256)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1138, file: !155, line: 394, baseType: !1273, size: 64, offset: 320)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1138, file: !155, line: 396, baseType: !154, size: 32, offset: 384)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1138, file: !155, line: 399, baseType: !1291, size: 64, offset: 416)
!1291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !678)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1138, file: !155, line: 402, baseType: !1293, size: 64, offset: 480)
!1293 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !678)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1138, file: !155, line: 406, baseType: !595, size: 32, offset: 544)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1138, file: !155, line: 409, baseType: !595, size: 32, offset: 576)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !969, file: !970, line: 470, baseType: !1169, size: 64, offset: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !969, file: !970, line: 473, baseType: !1298, size: 64, offset: 192)
!1298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1299, size: 64)
!1299 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !970, line: 166, flags: DIFlagFwdDecl)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !969, file: !970, line: 476, baseType: !1301, size: 64, offset: 256)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !142, line: 187, size: 256, elements: !1303)
!1303 = !{!1304, !1305, !1306, !1307}
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1302, file: !142, line: 189, baseType: !595, size: 32)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1302, file: !142, line: 192, baseType: !1198, size: 64, offset: 64)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1302, file: !142, line: 197, baseType: !1053, size: 64, offset: 128)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1302, file: !142, line: 200, baseType: !1183, size: 64, offset: 192)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !969, file: !970, line: 479, baseType: !1053, size: 64, offset: 320)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !969, file: !970, line: 484, baseType: !723, size: 64, offset: 384)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !969, file: !970, line: 488, baseType: !723, size: 64, offset: 448)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !969, file: !970, line: 493, baseType: !723, size: 64, offset: 512)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !969, file: !970, line: 496, baseType: !723, size: 64, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !969, file: !970, line: 501, baseType: !1314, size: 64, offset: 640)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !166, line: 2355, size: 576, elements: !1316)
!1316 = !{!1317, !1320, !1321, !1322, !1323, !1325, !1326, !1331, !1332, !1333, !1334, !1335, !1336}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1315, file: !166, line: 2356, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1319, size: 64)
!1319 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !166, line: 2356, flags: DIFlagFwdDecl)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1315, file: !166, line: 2357, baseType: !600, size: 64, offset: 64)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1315, file: !166, line: 2358, baseType: !595, size: 32, offset: 128)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1315, file: !166, line: 2359, baseType: !595, size: 32, offset: 160)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1315, file: !166, line: 2360, baseType: !1324, size: 128, offset: 192)
!1324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !595, size: 128, elements: !703)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1315, file: !166, line: 2364, baseType: !595, size: 32, offset: 320)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1315, file: !166, line: 2367, baseType: !1327, size: 128, offset: 384)
!1327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !166, line: 2349, size: 128, elements: !1328)
!1328 = !{!1329, !1330}
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1327, file: !166, line: 2351, baseType: !607, size: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1327, file: !166, line: 2352, baseType: !694, size: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1315, file: !166, line: 2371, baseType: !165, size: 32, offset: 512)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1315, file: !166, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1315, file: !166, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1315, file: !166, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1315, file: !166, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1315, file: !166, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !969, file: !970, line: 504, baseType: !1338, size: 64, offset: 704)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !970, line: 504, flags: DIFlagFwdDecl)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !969, file: !970, line: 507, baseType: !1053, size: 64, offset: 768)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !969, file: !970, line: 510, baseType: !595, size: 32, offset: 832)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !969, file: !970, line: 513, baseType: !595, size: 32, offset: 864)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !969, file: !970, line: 516, baseType: !843, size: 32, offset: 896)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !969, file: !970, line: 519, baseType: !843, size: 32, offset: 928)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !969, file: !970, line: 522, baseType: !7, size: 32, offset: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !969, file: !970, line: 523, baseType: !7, size: 32, offset: 992)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !969, file: !970, line: 528, baseType: !600, size: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !969, file: !970, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !969, file: !970, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !969, file: !970, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !969, file: !970, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !969, file: !970, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !969, file: !970, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !969, file: !970, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !969, file: !970, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !969, file: !970, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !969, file: !970, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !969, file: !970, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !969, file: !970, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !969, file: !970, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !969, file: !970, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !969, file: !970, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !969, file: !970, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !964, file: !171, line: 3254, baseType: !723, size: 64, offset: 1536)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !964, file: !171, line: 3257, baseType: !723, size: 64, offset: 1600)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !964, file: !171, line: 3258, baseType: !723, size: 64, offset: 1664)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !964, file: !171, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !964, file: !171, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !964, file: !171, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !964, file: !171, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !964, file: !171, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
