; ModuleID = 'sel-sched-ir.bc'
source_filename = "sel-sched-ir.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.VEC_sel_global_bb_info_def_heap = type { %struct.VEC_sel_global_bb_info_def_base }
%struct.VEC_sel_global_bb_info_def_base = type { i32, i32, [1 x %struct.sel_global_bb_info_def] }
%struct.sel_global_bb_info_def = type { %struct.bitmap_head_def*, i8 }
%struct.bitmap_head_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, %struct.bitmap_obstack* }
%struct.bitmap_element_def = type { %struct.bitmap_element_def*, %struct.bitmap_element_def*, i32, [2 x i64] }
%struct.bitmap_obstack = type { %struct.bitmap_element_def*, %struct.bitmap_head_def*, %struct.obstack }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.VEC_sel_region_bb_info_def_heap = type { %struct.VEC_sel_region_bb_info_def_base }

!578 = !DIEnumerator(name: "PRED_LOOP_EXIT", value: 12, isUnsigned: true)
!579 = !DIEnumerator(name: "PRED_POINTER", value: 13, isUnsigned: true)
!580 = !DIEnumerator(name: "PRED_TREE_POINTER", value: 14, isUnsigned: true)
!581 = !DIEnumerator(name: "PRED_OPCODE_POSITIVE", value: 15, isUnsigned: true)
!582 = !DIEnumerator(name: "PRED_OPCODE_NONEQUAL", value: 16, isUnsigned: true)
!583 = !DIEnumerator(name: "PRED_FPOPCODE", value: 17, isUnsigned: true)
!584 = !DIEnumerator(name: "PRED_TREE_OPCODE_POSITIVE", value: 18, isUnsigned: true)
!585 = !DIEnumerator(name: "PRED_TREE_OPCODE_NONEQUAL", value: 19, isUnsigned: true)
!586 = !DIEnumerator(name: "PRED_TREE_FPOPCODE", value: 20, isUnsigned: true)
!587 = !DIEnumerator(name: "PRED_CALL", value: 21, isUnsigned: true)
!588 = !DIEnumerator(name: "PRED_TREE_EARLY_RETURN", value: 22, isUnsigned: true)
!589 = !DIEnumerator(name: "PRED_GOTO", value: 23, isUnsigned: true)
!590 = !DIEnumerator(name: "PRED_CONST_RETURN", value: 24, isUnsigned: true)
!591 = !DIEnumerator(name: "PRED_NEGATIVE_RETURN", value: 25, isUnsigned: true)
!592 = !DIEnumerator(name: "PRED_NULL_RETURN", value: 26, isUnsigned: true)
!593 = !DIEnumerator(name: "PRED_MUDFLAP", value: 27, isUnsigned: true)
!594 = !DIEnumerator(name: "END_PREDICTORS", value: 28, isUnsigned: true)
!595 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "deps_where_def", file: !409, line: 861, baseType: !7, size: 32, elements: !596)
!596 = !{!597, !598, !599, !600}
!597 = !DIEnumerator(name: "DEPS_IN_INSN", value: 0, isUnsigned: true)
!598 = !DIEnumerator(name: "DEPS_IN_LHS", value: 1, isUnsigned: true)
!599 = !DIEnumerator(name: "DEPS_IN_RHS", value: 2, isUnsigned: true)
!600 = !DIEnumerator(name: "DEPS_IN_NOWHERE", value: 3, isUnsigned: true)
!601 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "reg_note", file: !414, line: 836, baseType: !7, size: 32, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634}
!603 = !DIEnumerator(name: "REG_DEP_TRUE", value: 0, isUnsigned: true)
!604 = !DIEnumerator(name: "REG_DEAD", value: 1, isUnsigned: true)
!605 = !DIEnumerator(name: "REG_INC", value: 2, isUnsigned: true)
!606 = !DIEnumerator(name: "REG_EQUIV", value: 3, isUnsigned: true)
!607 = !DIEnumerator(name: "REG_EQUAL", value: 4, isUnsigned: true)
!608 = !DIEnumerator(name: "REG_NONNEG", value: 5, isUnsigned: true)
!609 = !DIEnumerator(name: "REG_UNUSED", value: 6, isUnsigned: true)
!610 = !DIEnumerator(name: "REG_CC_SETTER", value: 7, isUnsigned: true)
!611 = !DIEnumerator(name: "REG_CC_USER", value: 8, isUnsigned: true)
!612 = !DIEnumerator(name: "REG_LABEL_TARGET", value: 9, isUnsigned: true)
!613 = !DIEnumerator(name: "REG_LABEL_OPERAND", value: 10, isUnsigned: true)
!614 = !DIEnumerator(name: "REG_DEP_OUTPUT", value: 11, isUnsigned: true)
!615 = !DIEnumerator(name: "REG_DEP_ANTI", value: 12, isUnsigned: true)
!616 = !DIEnumerator(name: "REG_BR_PROB", value: 13, isUnsigned: true)
!617 = !DIEnumerator(name: "REG_VALUE_PROFILE", value: 14, isUnsigned: true)
!618 = !DIEnumerator(name: "REG_NOALIAS", value: 15, isUnsigned: true)
!619 = !DIEnumerator(name: "REG_BR_PRED", value: 16, isUnsigned: true)
!620 = !DIEnumerator(name: "REG_FRAME_RELATED_EXPR", value: 17, isUnsigned: true)
!621 = !DIEnumerator(name: "REG_CFA_DEF_CFA", value: 18, isUnsigned: true)
!622 = !DIEnumerator(name: "REG_CFA_ADJUST_CFA", value: 19, isUnsigned: true)
!623 = !DIEnumerator(name: "REG_CFA_OFFSET", value: 20, isUnsigned: true)
!624 = !DIEnumerator(name: "REG_CFA_REGISTER", value: 21, isUnsigned: true)
!625 = !DIEnumerator(name: "REG_CFA_RESTORE", value: 22, isUnsigned: true)
!626 = !DIEnumerator(name: "REG_CFA_SET_VDRAP", value: 23, isUnsigned: true)
!627 = !DIEnumerator(name: "REG_EH_CONTEXT", value: 24, isUnsigned: true)
!628 = !DIEnumerator(name: "REG_EH_REGION", value: 25, isUnsigned: true)
!629 = !DIEnumerator(name: "REG_SAVE_NOTE", value: 26, isUnsigned: true)
!630 = !DIEnumerator(name: "REG_NORETURN", value: 27, isUnsigned: true)
!631 = !DIEnumerator(name: "REG_NON_LOCAL_GOTO", value: 28, isUnsigned: true)
!632 = !DIEnumerator(name: "REG_CROSSING_JUMP", value: 29, isUnsigned: true)
!633 = !DIEnumerator(name: "REG_SETJMP", value: 30, isUnsigned: true)
!634 = !DIEnumerator(name: "REG_NOTE_MAX", value: 31, isUnsigned: true)
!635 = !{!636, !637, !638, !639, !642, !643, !645, !1839, !1840, !1842, !1843, !1844, !413, !5, !1845, !1117, !7, !1874, !1879, !1196, !2022, !1901, !1824, !1968, !647, !2027, !2029, !2039, !2040, !2057, !2088, !2096, !1852, !1858, !2114, !1179, !1940, !715, !1248, !2115, !2117}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!638 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !641)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !646, line: 50, baseType: !647)
!646 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !414, line: 240, size: 384, elements: !649)
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !648, file: !414, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !648, file: !414, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !648, file: !414, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !648, file: !414, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !648, file: !414, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !648, file: !414, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !648, file: !414, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !648, file: !414, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !648, file: !414, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !648, file: !414, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !648, file: !414, line: 321, baseType: !661, size: 320, offset: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !414, line: 315, size: 320, elements: !662)
!662 = !{!663, !1806, !1808, !1837, !1838}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !661, file: !414, line: 316, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 64, elements: !680)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !414, line: 183, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !414, line: 166, size: 64, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !682, !683, !695, !698, !760, !1784, !1785, !1796, !1803}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !666, file: !414, line: 168, baseType: !638, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !666, file: !414, line: 169, baseType: !7, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !666, file: !414, line: 170, baseType: !643, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !666, file: !414, line: 171, baseType: !645, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !666, file: !414, line: 172, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !646, line: 53, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !414, line: 359, size: 128, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !675, file: !414, line: 360, baseType: !638, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !675, file: !414, line: 361, baseType: !679, size: 64, offset: 64)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 64, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 1)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !666, file: !414, line: 173, baseType: !5, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !666, file: !414, line: 174, baseType: !684, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !414, line: 133, baseType: !685)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !414, line: 115, size: 32, elements: !686)
!686 = !{!687, !688, !689, !690, !691, !692, !693, !694}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !685, file: !414, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !685, file: !414, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !685, file: !414, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !685, file: !414, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !685, file: !414, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !685, file: !414, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !685, file: !414, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !685, file: !414, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !666, file: !414, line: 175, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !414, line: 175, flags: DIFlagFwdDecl)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !666, file: !414, line: 176, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !701, line: 75, size: 256, elements: !702)
!701 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!702 = !{!703, !718, !719, !720}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !700, file: !701, line: 76, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !701, line: 68, baseType: !706)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !701, line: 63, size: 320, elements: !707)
!707 = !{!708, !710, !711, !712}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !706, file: !701, line: 64, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !706, file: !701, line: 65, baseType: !709, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !706, file: !701, line: 66, baseType: !7, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !706, file: !701, line: 67, baseType: !713, size: 128, offset: 192)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 128, elements: !716)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !701, line: 29, baseType: !715)
!715 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!716 = !{!717}
!717 = !DISubrange(count: 2)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !700, file: !701, line: 77, baseType: !704, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !700, file: !701, line: 78, baseType: !7, size: 32, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !700, file: !701, line: 79, baseType: !721, size: 64, offset: 192)
!721 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !722, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !701, line: 49, baseType: !723)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !701, line: 45, size: 832, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !723, file: !701, line: 46, baseType: !709, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !723, file: !701, line: 47, baseType: !699, size: 64, offset: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !723, file: !701, line: 48, baseType: !728, size: 704, offset: 128)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !729, line: 164, size: 704, elements: !730)
!729 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!730 = !{!731, !733, !743, !744, !745, !746, !747, !748, !752, !756, !757, !758, !759}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !728, file: !729, line: 166, baseType: !732, size: 64)
!732 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !728, file: !729, line: 167, baseType: !734, size: 64, offset: 64)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !729, line: 157, size: 192, elements: !736)
!736 = !{!737, !738, !739}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !735, file: !729, line: 159, baseType: !640, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !735, file: !729, line: 160, baseType: !734, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !735, file: !729, line: 161, baseType: !740, size: 32, offset: 128)
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 32, elements: !741)
!741 = !{!742}
!742 = !DISubrange(count: 4)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !728, file: !729, line: 168, baseType: !640, size: 64, offset: 128)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !728, file: !729, line: 169, baseType: !640, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !728, file: !729, line: 170, baseType: !640, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !728, file: !729, line: 171, baseType: !732, size: 64, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !728, file: !729, line: 172, baseType: !638, size: 32, offset: 384)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !728, file: !729, line: 176, baseType: !749, size: 64, offset: 448)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{!734, !642, !732}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !728, file: !729, line: 177, baseType: !753, size: 64, offset: 512)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = !DISubroutineType(types: !755)
!755 = !{null, !642, !734}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !728, file: !729, line: 178, baseType: !642, size: 64, offset: 576)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !728, file: !729, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !728, file: !729, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !728, file: !729, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !666, file: !414, line: 177, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !646, line: 56, baseType: !762)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !171, line: 3371, size: 1792, elements: !764)
!764 = !{!765, !798, !804, !815, !834, !845, !850, !857, !863, !876, !888, !926, !931, !959, !967, !968, !973, !982, !988, !993, !997, !1001, !1423, !1472, !1478, !1484, !1491, !1514, !1528, !1545, !1557, !1579, !1594, !1766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !763, file: !171, line: 3372, baseType: !766, size: 64)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !171, line: 360, size: 64, elements: !767)
!767 = !{!768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !766, file: !171, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !766, file: !171, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !766, file: !171, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !766, file: !171, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !766, file: !171, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !766, file: !171, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !766, file: !171, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !766, file: !171, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !766, file: !171, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !766, file: !171, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !766, file: !171, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !766, file: !171, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !766, file: !171, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !766, file: !171, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !766, file: !171, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !766, file: !171, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !766, file: !171, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !766, file: !171, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !766, file: !171, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !766, file: !171, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !766, file: !171, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !766, file: !171, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !766, file: !171, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !766, file: !171, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !766, file: !171, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !766, file: !171, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !766, file: !171, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !766, file: !171, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !766, file: !171, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !766, file: !171, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !171, line: 3373, baseType: !799, size: 192)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !171, line: 402, size: 192, elements: !800)
!800 = !{!801, !802, !803}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !799, file: !171, line: 403, baseType: !766, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !799, file: !171, line: 404, baseType: !761, size: 64, offset: 64)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !799, file: !171, line: 405, baseType: !761, size: 64, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !763, file: !171, line: 3374, baseType: !805, size: 320)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !171, line: 1384, size: 320, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !805, file: !171, line: 1385, baseType: !799, size: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !805, file: !171, line: 1386, baseType: !809, size: 128, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !810, line: 58, baseType: !811)
!810 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !810, line: 54, size: 128, elements: !812)
!812 = !{!813, !814}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !811, file: !810, line: 56, baseType: !715, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !811, file: !810, line: 57, baseType: !732, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !763, file: !171, line: 3375, baseType: !816, size: 256)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !171, line: 1397, size: 256, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !171, line: 1398, baseType: !799, size: 192)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !816, file: !171, line: 1399, baseType: !820, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !822, line: 52, size: 256, elements: !823)
!822 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!823 = !{!824, !825, !826, !827, !828, !829, !830}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !821, file: !822, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !821, file: !822, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !821, file: !822, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !821, file: !822, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !821, file: !822, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !821, file: !822, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !821, file: !822, line: 62, baseType: !831, size: 192, offset: 64)
!831 = !DICompositeType(tag: DW_TAG_array_type, baseType: !715, size: 192, elements: !832)
!832 = !{!833}
!833 = !DISubrange(count: 3)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !763, file: !171, line: 3376, baseType: !835, size: 256)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !171, line: 1408, size: 256, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !835, file: !171, line: 1409, baseType: !799, size: 192)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !835, file: !171, line: 1410, baseType: !839, size: 64, offset: 192)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !841, line: 27, size: 192, elements: !842)
!841 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !840, file: !841, line: 29, baseType: !809, size: 128)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !840, file: !841, line: 30, baseType: !5, size: 32, offset: 128)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !763, file: !171, line: 3377, baseType: !846, size: 256)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !171, line: 1437, size: 256, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !846, file: !171, line: 1438, baseType: !799, size: 192)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !846, file: !171, line: 1439, baseType: !761, size: 64, offset: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !763, file: !171, line: 3378, baseType: !851, size: 256)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !171, line: 1418, size: 256, elements: !852)
!852 = !{!853, !854, !855}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !851, file: !171, line: 1419, baseType: !799, size: 192)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !851, file: !171, line: 1420, baseType: !638, size: 32, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !851, file: !171, line: 1421, baseType: !856, size: 8, offset: 224)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !641, size: 8, elements: !680)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !763, file: !171, line: 3379, baseType: !858, size: 320)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !171, line: 1428, size: 320, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !858, file: !171, line: 1429, baseType: !799, size: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !858, file: !171, line: 1430, baseType: !761, size: 64, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !858, file: !171, line: 1431, baseType: !761, size: 64, offset: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !763, file: !171, line: 3380, baseType: !864, size: 320)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !171, line: 1460, size: 320, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !864, file: !171, line: 1461, baseType: !799, size: 192)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !864, file: !171, line: 1462, baseType: !868, size: 128, offset: 192)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !869, line: 31, size: 128, elements: !870)
!869 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!870 = !{!871, !874, !875}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !868, file: !869, line: 32, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !637)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !868, file: !869, line: 33, baseType: !7, size: 32, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !868, file: !869, line: 34, baseType: !7, size: 32, offset: 96)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !763, file: !171, line: 3381, baseType: !877, size: 384)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !171, line: 2507, size: 384, elements: !878)
!878 = !{!879, !880, !885, !886, !887}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !171, line: 2508, baseType: !799, size: 192)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !877, file: !171, line: 2509, baseType: !881, size: 32, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !882, line: 58, baseType: !883)
!882 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !884, line: 44, baseType: !7)
!884 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!885 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !877, file: !171, line: 2510, baseType: !7, size: 32, offset: 224)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !877, file: !171, line: 2511, baseType: !761, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !877, file: !171, line: 2512, baseType: !761, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !763, file: !171, line: 3382, baseType: !889, size: 896)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !171, line: 2652, size: 896, elements: !890)
!890 = !{!891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921, !922, !923}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !889, file: !171, line: 2653, baseType: !877, size: 384)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !889, file: !171, line: 2654, baseType: !761, size: 64, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !889, file: !171, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !889, file: !171, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !889, file: !171, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !889, file: !171, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !889, file: !171, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !889, file: !171, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !889, file: !171, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !889, file: !171, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !889, file: !171, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !889, file: !171, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !889, file: !171, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !889, file: !171, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !889, file: !171, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !889, file: !171, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !889, file: !171, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !889, file: !171, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !889, file: !171, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !889, file: !171, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !889, file: !171, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !889, file: !171, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !889, file: !171, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !889, file: !171, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !889, file: !171, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !889, file: !171, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !889, file: !171, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !889, file: !171, line: 2703, baseType: !7, size: 32, offset: 512)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !889, file: !171, line: 2705, baseType: !761, size: 64, offset: 576)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !889, file: !171, line: 2706, baseType: !761, size: 64, offset: 640)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !889, file: !171, line: 2707, baseType: !761, size: 64, offset: 704)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !889, file: !171, line: 2708, baseType: !761, size: 64, offset: 768)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !889, file: !171, line: 2711, baseType: !924, size: 64, offset: 832)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !171, line: 2711, flags: DIFlagFwdDecl)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !763, file: !171, line: 3383, baseType: !927, size: 960)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !171, line: 2756, size: 960, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !927, file: !171, line: 2757, baseType: !889, size: 896)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !927, file: !171, line: 2758, baseType: !645, size: 64, offset: 896)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !763, file: !171, line: 3384, baseType: !932, size: 1472)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !171, line: 3114, size: 1472, elements: !933)
!933 = !{!934, !955, !956, !957, !958}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !932, file: !171, line: 3115, baseType: !935, size: 1216)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !171, line: 2984, size: 1216, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !935, file: !171, line: 2985, baseType: !927, size: 960)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !935, file: !171, line: 2986, baseType: !761, size: 64, offset: 960)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !935, file: !171, line: 2987, baseType: !761, size: 64, offset: 1024)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !935, file: !171, line: 2988, baseType: !761, size: 64, offset: 1088)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !935, file: !171, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !935, file: !171, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !935, file: !171, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !935, file: !171, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !935, file: !171, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !935, file: !171, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !935, file: !171, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !935, file: !171, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !935, file: !171, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !935, file: !171, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !935, file: !171, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !935, file: !171, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !935, file: !171, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !935, file: !171, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !932, file: !171, line: 3117, baseType: !761, size: 64, offset: 1216)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !932, file: !171, line: 3119, baseType: !761, size: 64, offset: 1280)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !932, file: !171, line: 3121, baseType: !761, size: 64, offset: 1344)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !932, file: !171, line: 3123, baseType: !761, size: 64, offset: 1408)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !763, file: !171, line: 3385, baseType: !960, size: 1088)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !171, line: 2874, size: 1088, elements: !961)
!961 = !{!962, !963, !964}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !960, file: !171, line: 2875, baseType: !927, size: 960)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !960, file: !171, line: 2876, baseType: !645, size: 64, offset: 960)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !960, file: !171, line: 2877, baseType: !965, size: 64, offset: 1024)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !171, line: 2856, flags: DIFlagFwdDecl)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !763, file: !171, line: 3386, baseType: !935, size: 1216)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !763, file: !171, line: 3387, baseType: !969, size: 1280)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !171, line: 3093, size: 1280, elements: !970)
!970 = !{!971, !972}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !969, file: !171, line: 3094, baseType: !935, size: 1216)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !969, file: !171, line: 3095, baseType: !965, size: 64, offset: 1216)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !763, file: !171, line: 3388, baseType: !974, size: 1216)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !171, line: 2824, size: 1216, elements: !975)
!975 = !{!976, !977, !978, !979, !980, !981}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !974, file: !171, line: 2825, baseType: !889, size: 896)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !974, file: !171, line: 2827, baseType: !761, size: 64, offset: 896)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !974, file: !171, line: 2828, baseType: !761, size: 64, offset: 960)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !974, file: !171, line: 2829, baseType: !761, size: 64, offset: 1024)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !974, file: !171, line: 2830, baseType: !761, size: 64, offset: 1088)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !974, file: !171, line: 2831, baseType: !761, size: 64, offset: 1152)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !763, file: !171, line: 3389, baseType: !983, size: 1024)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !171, line: 2850, size: 1024, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !983, file: !171, line: 2851, baseType: !927, size: 960)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !983, file: !171, line: 2852, baseType: !638, size: 32, offset: 960)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !983, file: !171, line: 2853, baseType: !638, size: 32, offset: 992)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !763, file: !171, line: 3390, baseType: !989, size: 1024)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !171, line: 2857, size: 1024, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !989, file: !171, line: 2858, baseType: !927, size: 960)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !989, file: !171, line: 2859, baseType: !965, size: 64, offset: 960)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !763, file: !171, line: 3391, baseType: !994, size: 960)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !171, line: 2862, size: 960, elements: !995)
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !994, file: !171, line: 2863, baseType: !927, size: 960)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !763, file: !171, line: 3392, baseType: !998, size: 1472)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !171, line: 3304, size: 1472, elements: !999)
!999 = !{!1000}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !998, file: !171, line: 3305, baseType: !932, size: 1472)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !763, file: !171, line: 3393, baseType: !1002, size: 1792)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !171, line: 3248, size: 1792, elements: !1003)
!1003 = !{!1004, !1005, !1402, !1403, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1002, file: !171, line: 3249, baseType: !932, size: 1472)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1002, file: !171, line: 3251, baseType: !1006, size: 64, offset: 1472)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1008, line: 463, size: 1152, elements: !1009)
!1008 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1009 = !{!1010, !1174, !1334, !1335, !1338, !1346, !1347, !1348, !1349, !1350, !1351, !1375, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1007, file: !1008, line: 464, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1013)
!1013 = !{!1014, !1063, !1076, !1090, !1142, !1155}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1012, file: !135, line: 197, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1016)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023, !1024, !1051, !1060, !1061, !1062}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1017, file: !135, line: 119, baseType: !1016, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1017, file: !135, line: 122, baseType: !1016, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1017, file: !135, line: 123, baseType: !1016, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1017, file: !135, line: 126, baseType: !638, size: 32, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1017, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1017, file: !135, line: 165, baseType: !1025, size: 192, offset: 256)
!1025 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1026)
!1026 = !{!1027, !1040, !1046}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1025, file: !135, line: 137, baseType: !1028, size: 128)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1029)
!1029 = !{!1030, !1039}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1028, file: !135, line: 135, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037, !1038}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1032, file: !135, line: 96, baseType: !1031, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1032, file: !135, line: 97, baseType: !1031, size: 64, offset: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1032, file: !135, line: 101, baseType: !761, size: 64, offset: 128)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1032, file: !135, line: 106, baseType: !761, size: 64, offset: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1032, file: !135, line: 111, baseType: !761, size: 64, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1028, file: !135, line: 136, baseType: !1031, size: 64, offset: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1025, file: !135, line: 151, baseType: !1041, size: 192)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1042)
!1042 = !{!1043, !1044, !1045}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1041, file: !135, line: 141, baseType: !761, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1041, file: !135, line: 145, baseType: !761, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1041, file: !135, line: 150, baseType: !638, size: 32, offset: 128)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1025, file: !135, line: 164, baseType: !1047, size: 128)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1047, file: !135, line: 161, baseType: !761, size: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1047, file: !135, line: 163, baseType: !881, size: 32, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1017, file: !135, line: 168, baseType: !1052, size: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1054)
!1054 = !{!1055, !1056, !1057, !1058, !1059}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1053, file: !135, line: 70, baseType: !1052, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1053, file: !135, line: 73, baseType: !1016, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1053, file: !135, line: 78, baseType: !761, size: 64, offset: 128)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1053, file: !135, line: 85, baseType: !645, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1053, file: !135, line: 88, baseType: !638, size: 32, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1017, file: !135, line: 173, baseType: !645, size: 64, offset: 512)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1017, file: !135, line: 173, baseType: !645, size: 64, offset: 576)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1017, file: !135, line: 177, baseType: !637, size: 8, offset: 640)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1012, file: !135, line: 200, baseType: !1064, size: 64, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !135, line: 185, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !135, line: 185, size: 128, elements: !1067)
!1067 = !{!1068}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1066, file: !135, line: 185, baseType: !1069, size: 128)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !135, line: 184, baseType: !1070)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !135, line: 184, size: 128, elements: !1071)
!1071 = !{!1072, !1073, !1074}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1070, file: !135, line: 184, baseType: !7, size: 32)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1070, file: !135, line: 184, baseType: !7, size: 32, offset: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1070, file: !135, line: 184, baseType: !1075, size: 64, offset: 64)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1015, size: 64, elements: !680)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1012, file: !135, line: 203, baseType: !1077, size: 64, offset: 128)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, baseType: !1079)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !135, line: 189, size: 128, elements: !1080)
!1080 = !{!1081}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1079, file: !135, line: 189, baseType: !1082, size: 128)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !135, line: 188, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !135, line: 188, size: 128, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1083, file: !135, line: 188, baseType: !7, size: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1083, file: !135, line: 188, baseType: !7, size: 32, offset: 32)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1083, file: !135, line: 188, baseType: !1088, size: 64, offset: 64)
!1088 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1089, size: 64, elements: !680)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !135, line: 180, baseType: !1052)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1012, file: !135, line: 207, baseType: !1091, size: 64, offset: 192)
!1091 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1092, line: 144, baseType: !1093)
!1092 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1092, line: 100, size: 896, elements: !1095)
!1095 = !{!1096, !1104, !1109, !1114, !1116, !1119, !1120, !1121, !1122, !1123, !1128, !1130, !1131, !1136, !1141}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1094, file: !1092, line: 102, baseType: !1097, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1092, line: 52, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1092, line: 47, baseType: !7)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1094, file: !1092, line: 105, baseType: !1105, size: 64, offset: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1092, line: 59, baseType: !1106)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DISubroutineType(types: !1108)
!1108 = !{!638, !1102, !1102}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1094, file: !1092, line: 108, baseType: !1110, size: 64, offset: 128)
!1110 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1092, line: 63, baseType: !1111)
!1111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1112, size: 64)
!1112 = !DISubroutineType(types: !1113)
!1113 = !{null, !642}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1094, file: !1092, line: 111, baseType: !1115, size: 64, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1094, file: !1092, line: 114, baseType: !1117, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1118, line: 46, baseType: !715)
!1118 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1094, file: !1092, line: 117, baseType: !1117, size: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1094, file: !1092, line: 120, baseType: !1117, size: 64, offset: 384)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1094, file: !1092, line: 124, baseType: !7, size: 32, offset: 448)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1094, file: !1092, line: 128, baseType: !7, size: 32, offset: 480)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1094, file: !1092, line: 131, baseType: !1124, size: 64, offset: 512)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1092, line: 75, baseType: !1125)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = !DISubroutineType(types: !1127)
!1127 = !{!642, !1117, !1117}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1094, file: !1092, line: 132, baseType: !1129, size: 64, offset: 576)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1092, line: 78, baseType: !1111)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1094, file: !1092, line: 135, baseType: !642, size: 64, offset: 640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1094, file: !1092, line: 136, baseType: !1132, size: 64, offset: 704)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1092, line: 82, baseType: !1133)
!1133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1134, size: 64)
!1134 = !DISubroutineType(types: !1135)
!1135 = !{!642, !642, !1117, !1117}
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1094, file: !1092, line: 137, baseType: !1137, size: 64, offset: 768)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1092, line: 83, baseType: !1138)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{null, !642, !642}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1094, file: !1092, line: 141, baseType: !7, size: 32, offset: 832)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1012, file: !135, line: 211, baseType: !1143, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !171, line: 183, baseType: !1145)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !171, line: 183, size: 128, elements: !1146)
!1146 = !{!1147}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1145, file: !171, line: 183, baseType: !1148, size: 128)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !171, line: 182, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !171, line: 182, size: 128, elements: !1150)
!1150 = !{!1151, !1152, !1153}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1149, file: !171, line: 182, baseType: !7, size: 32)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1149, file: !171, line: 182, baseType: !7, size: 32, offset: 32)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1149, file: !171, line: 182, baseType: !1154, size: 64, offset: 64)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !761, size: 64, elements: !680)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1012, file: !135, line: 220, baseType: !1156, size: 64, offset: 320)
!1156 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !135, line: 217, size: 64, elements: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1156, file: !135, line: 218, baseType: !1143, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1156, file: !135, line: 219, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1161, size: 64)
!1161 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1162, line: 29, baseType: !1163)
!1162 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1162, line: 29, size: 96, elements: !1164)
!1164 = !{!1165}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1163, file: !1162, line: 29, baseType: !1166, size: 96)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1162, line: 27, baseType: !1167)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1162, line: 27, size: 96, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1167, file: !1162, line: 27, baseType: !7, size: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1167, file: !1162, line: 27, baseType: !7, size: 32, offset: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1167, file: !1162, line: 27, baseType: !1172, size: 8, offset: 64)
!1172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1173, size: 8, elements: !680)
!1173 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1162, line: 26, baseType: !637)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1007, file: !1008, line: 467, baseType: !1175, size: 64, offset: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !155, line: 374, size: 640, elements: !1177)
!1177 = !{!1178, !1309, !1310, !1323, !1324, !1325, !1326, !1327, !1328, !1330, !1332, !1333}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1176, file: !155, line: 377, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !646, line: 111, baseType: !1180)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !155, line: 217, size: 832, elements: !1182)
!1182 = !{!1183, !1218, !1219, !1220, !1279, !1283, !1284, !1285, !1303, !1304, !1305, !1306, !1307, !1308}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1181, file: !155, line: 219, baseType: !1184, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1185, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !155, line: 151, baseType: !1186)
!1186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !155, line: 151, size: 128, elements: !1187)
!1187 = !{!1188}
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1186, file: !155, line: 151, baseType: !1189, size: 128)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !155, line: 150, baseType: !1190)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !155, line: 150, size: 128, elements: !1191)
!1191 = !{!1192, !1193, !1194}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1190, file: !155, line: 150, baseType: !7, size: 32)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1190, file: !155, line: 150, baseType: !7, size: 32, offset: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1190, file: !155, line: 150, baseType: !1195, size: 64, offset: 64)
!1195 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1196, size: 64, elements: !680)
!1196 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !646, line: 108, baseType: !1197)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !155, line: 122, size: 512, elements: !1199)
!1199 = !{!1200, !1201, !1202, !1210, !1211, !1212, !1213, !1214, !1215, !1216}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1198, file: !155, line: 124, baseType: !1180, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1198, file: !155, line: 125, baseType: !1180, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1198, file: !155, line: 131, baseType: !1203, size: 64, offset: 128)
!1203 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !155, line: 128, size: 64, elements: !1204)
!1204 = !{!1205, !1209}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1203, file: !155, line: 129, baseType: !1206, size: 64)
!1206 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !646, line: 66, baseType: !1207)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !646, line: 65, flags: DIFlagFwdDecl)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1203, file: !155, line: 130, baseType: !645, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1198, file: !155, line: 134, baseType: !642, size: 64, offset: 192)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1198, file: !155, line: 137, baseType: !761, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1198, file: !155, line: 138, baseType: !881, size: 32, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1198, file: !155, line: 142, baseType: !7, size: 32, offset: 352)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1198, file: !155, line: 144, baseType: !638, size: 32, offset: 384)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1198, file: !155, line: 145, baseType: !638, size: 32, offset: 416)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1198, file: !155, line: 146, baseType: !1217, size: 64, offset: 448)
!1217 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !155, line: 119, baseType: !732)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1181, file: !155, line: 220, baseType: !1184, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1181, file: !155, line: 223, baseType: !642, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1181, file: !155, line: 226, baseType: !1221, size: 64, offset: 192)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !142, line: 100, size: 1216, elements: !1223)
!1223 = !{!1224, !1225, !1226, !1227, !1228, !1233, !1234, !1235, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1269, !1277, !1278}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1222, file: !142, line: 102, baseType: !638, size: 32)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1222, file: !142, line: 105, baseType: !7, size: 32, offset: 32)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1222, file: !142, line: 108, baseType: !1180, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1222, file: !142, line: 111, baseType: !1180, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1222, file: !142, line: 114, baseType: !1229, size: 64, offset: 192)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !142, line: 41, size: 64, elements: !1230)
!1230 = !{!1231, !1232}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1229, file: !142, line: 42, baseType: !141, size: 32)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1229, file: !142, line: 43, baseType: !7, size: 32, offset: 32)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1222, file: !142, line: 117, baseType: !7, size: 32, offset: 256)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1222, file: !142, line: 120, baseType: !7, size: 32, offset: 288)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1222, file: !142, line: 123, baseType: !1236, size: 64, offset: 320)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !142, line: 87, baseType: !1238)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !142, line: 87, size: 128, elements: !1239)
!1239 = !{!1240}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1238, file: !142, line: 87, baseType: !1241, size: 128)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !142, line: 85, baseType: !1242)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !142, line: 85, size: 128, elements: !1243)
!1243 = !{!1244, !1245, !1246}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1242, file: !142, line: 85, baseType: !7, size: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1242, file: !142, line: 85, baseType: !7, size: 32, offset: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1242, file: !142, line: 85, baseType: !1247, size: 64, offset: 64)
!1247 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1248, size: 64, elements: !680)
!1248 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !142, line: 84, baseType: !1221)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1222, file: !142, line: 126, baseType: !1221, size: 64, offset: 384)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1222, file: !142, line: 129, baseType: !1221, size: 64, offset: 448)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1222, file: !142, line: 132, baseType: !642, size: 64, offset: 512)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1222, file: !142, line: 139, baseType: !761, size: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1222, file: !142, line: 143, baseType: !809, size: 128, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1222, file: !142, line: 146, baseType: !809, size: 128, offset: 768)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1222, file: !142, line: 148, baseType: !637, size: 8, offset: 896)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1222, file: !142, line: 149, baseType: !637, size: 8, offset: 904)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1222, file: !142, line: 153, baseType: !150, size: 32, offset: 928)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1222, file: !142, line: 156, baseType: !1259, size: 64, offset: 960)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !142, line: 48, size: 320, elements: !1261)
!1261 = !{!1262, !1266, !1267, !1268}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1260, file: !142, line: 50, baseType: !1263, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !646, line: 58, baseType: !1264)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !646, line: 57, flags: DIFlagFwdDecl)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1260, file: !142, line: 59, baseType: !809, size: 128, offset: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1260, file: !142, line: 64, baseType: !637, size: 8, offset: 192)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1260, file: !142, line: 67, baseType: !1259, size: 64, offset: 256)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1222, file: !142, line: 159, baseType: !1270, size: 64, offset: 1024)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !142, line: 72, size: 256, elements: !1272)
!1272 = !{!1273, !1274, !1275, !1276}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1271, file: !142, line: 74, baseType: !1197, size: 64)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1271, file: !142, line: 77, baseType: !1270, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1271, file: !142, line: 78, baseType: !1270, size: 64, offset: 128)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1271, file: !142, line: 81, baseType: !1270, size: 64, offset: 192)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1222, file: !142, line: 162, baseType: !637, size: 8, offset: 1088)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1222, file: !142, line: 166, baseType: !761, size: 64, offset: 1152)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1181, file: !155, line: 229, baseType: !1280, size: 128, offset: 256)
!1280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1281, size: 128, elements: !716)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !155, line: 229, flags: DIFlagFwdDecl)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1181, file: !155, line: 232, baseType: !1180, size: 64, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1181, file: !155, line: 233, baseType: !1180, size: 64, offset: 448)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1181, file: !155, line: 238, baseType: !1286, size: 64, offset: 512)
!1286 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !155, line: 235, size: 64, elements: !1287)
!1287 = !{!1288, !1294}
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1286, file: !155, line: 236, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !155, line: 273, size: 128, elements: !1291)
!1291 = !{!1292, !1293}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1290, file: !155, line: 275, baseType: !1206, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1290, file: !155, line: 278, baseType: !1206, size: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1286, file: !155, line: 237, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !155, line: 259, size: 320, elements: !1297)
!1297 = !{!1298, !1299, !1300, !1301, !1302}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1296, file: !155, line: 261, baseType: !645, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1296, file: !155, line: 262, baseType: !645, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1296, file: !155, line: 266, baseType: !645, size: 64, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1296, file: !155, line: 267, baseType: !645, size: 64, offset: 192)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1296, file: !155, line: 270, baseType: !638, size: 32, offset: 256)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1181, file: !155, line: 241, baseType: !1217, size: 64, offset: 576)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1181, file: !155, line: 244, baseType: !638, size: 32, offset: 640)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1181, file: !155, line: 247, baseType: !638, size: 32, offset: 672)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1181, file: !155, line: 250, baseType: !638, size: 32, offset: 704)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1181, file: !155, line: 253, baseType: !638, size: 32, offset: 736)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1181, file: !155, line: 256, baseType: !638, size: 32, offset: 768)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1176, file: !155, line: 378, baseType: !1179, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1176, file: !155, line: 381, baseType: !1311, size: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !155, line: 282, baseType: !1313)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !155, line: 282, size: 128, elements: !1314)
!1314 = !{!1315}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1313, file: !155, line: 282, baseType: !1316, size: 128)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !155, line: 281, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !155, line: 281, size: 128, elements: !1318)
!1318 = !{!1319, !1320, !1321}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1317, file: !155, line: 281, baseType: !7, size: 32)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1317, file: !155, line: 281, baseType: !7, size: 32, offset: 32)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1317, file: !155, line: 281, baseType: !1322, size: 64, offset: 64)
!1322 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1179, size: 64, elements: !680)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1176, file: !155, line: 384, baseType: !638, size: 32, offset: 192)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1176, file: !155, line: 387, baseType: !638, size: 32, offset: 224)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1176, file: !155, line: 390, baseType: !638, size: 32, offset: 256)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1176, file: !155, line: 394, baseType: !1311, size: 64, offset: 320)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1176, file: !155, line: 396, baseType: !154, size: 32, offset: 384)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1176, file: !155, line: 399, baseType: !1329, size: 64, offset: 416)
!1329 = !DICompositeType(tag: DW_TAG_array_type, baseType: !160, size: 64, elements: !716)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1176, file: !155, line: 402, baseType: !1331, size: 64, offset: 480)
!1331 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !716)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1176, file: !155, line: 406, baseType: !638, size: 32, offset: 544)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1176, file: !155, line: 409, baseType: !638, size: 32, offset: 576)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1007, file: !1008, line: 470, baseType: !1207, size: 64, offset: 128)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1007, file: !1008, line: 473, baseType: !1336, size: 64, offset: 192)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1008, line: 166, flags: DIFlagFwdDecl)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1007, file: !1008, line: 476, baseType: !1339, size: 64, offset: 256)
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !142, line: 187, size: 256, elements: !1341)
!1341 = !{!1342, !1343, !1344, !1345}
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1340, file: !142, line: 189, baseType: !638, size: 32)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1340, file: !142, line: 192, baseType: !1236, size: 64, offset: 64)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1340, file: !142, line: 197, baseType: !1091, size: 64, offset: 128)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1340, file: !142, line: 200, baseType: !1221, size: 64, offset: 192)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1007, file: !1008, line: 479, baseType: !1091, size: 64, offset: 320)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1007, file: !1008, line: 484, baseType: !761, size: 64, offset: 384)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1007, file: !1008, line: 488, baseType: !761, size: 64, offset: 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1007, file: !1008, line: 493, baseType: !761, size: 64, offset: 512)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1007, file: !1008, line: 496, baseType: !761, size: 64, offset: 576)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1007, file: !1008, line: 501, baseType: !1352, size: 64, offset: 640)
!1352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1353, size: 64)
!1353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !166, line: 2355, size: 576, elements: !1354)
!1354 = !{!1355, !1358, !1359, !1360, !1361, !1363, !1364, !1369, !1370, !1371, !1372, !1373, !1374}
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1353, file: !166, line: 2356, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !166, line: 2356, flags: DIFlagFwdDecl)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1353, file: !166, line: 2357, baseType: !643, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1353, file: !166, line: 2358, baseType: !638, size: 32, offset: 128)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1353, file: !166, line: 2359, baseType: !638, size: 32, offset: 160)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1353, file: !166, line: 2360, baseType: !1362, size: 128, offset: 192)
!1362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 128, elements: !741)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1353, file: !166, line: 2364, baseType: !638, size: 32, offset: 320)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1353, file: !166, line: 2367, baseType: !1365, size: 128, offset: 384)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !166, line: 2349, size: 128, elements: !1366)
!1366 = !{!1367, !1368}
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1365, file: !166, line: 2351, baseType: !645, size: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1365, file: !166, line: 2352, baseType: !732, size: 64, offset: 64)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1353, file: !166, line: 2371, baseType: !165, size: 32, offset: 512)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1353, file: !166, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1353, file: !166, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1353, file: !166, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1353, file: !166, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1353, file: !166, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1007, file: !1008, line: 504, baseType: !1376, size: 64, offset: 704)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1008, line: 504, flags: DIFlagFwdDecl)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1007, file: !1008, line: 507, baseType: !1091, size: 64, offset: 768)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1007, file: !1008, line: 510, baseType: !638, size: 32, offset: 832)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1007, file: !1008, line: 513, baseType: !638, size: 32, offset: 864)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1007, file: !1008, line: 516, baseType: !881, size: 32, offset: 896)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1007, file: !1008, line: 519, baseType: !881, size: 32, offset: 928)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1007, file: !1008, line: 522, baseType: !7, size: 32, offset: 960)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1007, file: !1008, line: 523, baseType: !7, size: 32, offset: 992)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1007, file: !1008, line: 528, baseType: !643, size: 64, offset: 1024)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1007, file: !1008, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1007, file: !1008, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1007, file: !1008, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1007, file: !1008, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1007, file: !1008, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1007, file: !1008, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1007, file: !1008, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1007, file: !1008, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1007, file: !1008, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1007, file: !1008, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1007, file: !1008, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1007, file: !1008, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1007, file: !1008, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1007, file: !1008, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1007, file: !1008, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1007, file: !1008, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1002, file: !171, line: 3254, baseType: !761, size: 64, offset: 1536)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1002, file: !171, line: 3257, baseType: !761, size: 64, offset: 1600)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1002, file: !171, line: 3258, baseType: !761, size: 64, offset: 1664)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1002, file: !171, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1002, file: !171, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1002, file: !171, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1002, file: !171, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
