; ModuleID = 'sel-sched-dump.bc'
source_filename = "sel-sched-dump.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.VEC_sel_insn_data_def_heap = type { %struct.VEC_sel_insn_data_def_base }
%struct.VEC_sel_insn_data_def_base = type { i32, i32, [1 x %struct._sel_insn_data] }
%struct._sel_insn_data = type { %struct._expr, i32, i32, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.htab*, %struct.deps, %struct.rtx_def*, i32, i32, i32, i8 }
%struct._expr = type { %struct.vinsn_def*, i32, i32, i32, i32, i32, i32, i32, i32, i32, %struct.VEC_expr_history_def_heap*, i8, i8 }
%struct.vinsn_def = type { %struct.rtx_def*, %struct.idata_def, i32, i32, i32, i32, i8 }
%struct.idata_def = type { i32, %struct.rtx_def*, %struct.rtx_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def*, %struct.bitmap_head_def* }
%struct.VEC_expr_history_def_heap = type { %struct.VEC_expr_history_def_base }
%struct.VEC_expr_history_def_base = type { i32, i32, [1 x %struct.expr_history_def_1] }

!481 = !DIEnumerator(name: "UMIN", value: 72, isUnsigned: true)
!482 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!483 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!484 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!485 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!486 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!487 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!488 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!489 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!490 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!491 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!492 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!493 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!494 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!495 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!496 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!497 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!498 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!499 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!500 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!501 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!502 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!503 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!504 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!505 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!506 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!507 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!508 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!509 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!510 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!511 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!512 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!513 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!514 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!515 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!516 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!517 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!518 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!519 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!520 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!521 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!522 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!523 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!524 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!525 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!526 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!527 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!528 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!529 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!530 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!531 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!532 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!533 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!534 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!535 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!536 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!537 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!538 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!539 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!540 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!541 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!542 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!543 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!544 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!545 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!546 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!547 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!548 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!549 = !{!550, !551, !552, !553, !556, !557, !554, !5, !406, !559, !1708}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!552 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !555, size: 64)
!555 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !555)
!559 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !560, line: 50, baseType: !561)
!560 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !407, line: 240, size: 384, elements: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !562, file: !407, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !562, file: !407, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !562, file: !407, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !562, file: !407, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !562, file: !407, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !562, file: !407, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !562, file: !407, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !562, file: !407, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !562, file: !407, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !562, file: !407, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !562, file: !407, line: 321, baseType: !575, size: 320, offset: 64)
!575 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !407, line: 315, size: 320, elements: !576)
!576 = !{!577, !1643, !1645, !1706, !1707}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !575, file: !407, line: 316, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 64, elements: !594)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !407, line: 183, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !407, line: 166, size: 64, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !596, !597, !609, !633, !695, !1621, !1622, !1633, !1640}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !580, file: !407, line: 168, baseType: !552, size: 32)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !580, file: !407, line: 169, baseType: !7, size: 32)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !580, file: !407, line: 170, baseType: !557, size: 64)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !580, file: !407, line: 171, baseType: !559, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !580, file: !407, line: 172, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !560, line: 53, baseType: !588)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !407, line: 359, size: 128, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !589, file: !407, line: 360, baseType: !552, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !589, file: !407, line: 361, baseType: !593, size: 64, offset: 64)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 64, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 1)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !580, file: !407, line: 173, baseType: !5, size: 32)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !580, file: !407, line: 174, baseType: !598, size: 32)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !407, line: 133, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !407, line: 115, size: 32, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !599, file: !407, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !599, file: !407, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !599, file: !407, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !599, file: !407, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !599, file: !407, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !599, file: !407, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !599, file: !407, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !599, file: !407, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !580, file: !407, line: 175, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !611, size: 64)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !612, line: 23, size: 320, elements: !613)
!612 = !DIFile(filename: "./cselib.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!613 = !{!614, !615, !616, !617, !624, !632}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !611, file: !612, line: 25, baseType: !7, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !611, file: !612, line: 28, baseType: !552, size: 32, offset: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "val_rtx", scope: !611, file: !612, line: 31, baseType: !559, size: 64, offset: 64)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "locs", scope: !611, file: !612, line: 35, baseType: !618, size: 64, offset: 128)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_loc_list", file: !612, line: 45, size: 192, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !612, line: 47, baseType: !618, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !619, file: !612, line: 49, baseType: !559, size: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "setting_insn", scope: !619, file: !612, line: 51, baseType: !559, size: 64, offset: 128)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "addr_list", scope: !611, file: !612, line: 39, baseType: !625, size: 64, offset: 192)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "elt_list", file: !612, line: 55, size: 128, elements: !627)
!627 = !{!628, !629}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !626, file: !612, line: 56, baseType: !625, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "elt", scope: !626, file: !612, line: 57, baseType: !630, size: 64, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "cselib_val", file: !612, line: 42, baseType: !611)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "next_containing_mem", scope: !611, file: !612, line: 41, baseType: !610, size: 64, offset: 256)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !580, file: !407, line: 176, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !636, line: 75, size: 256, elements: !637)
!636 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!637 = !{!638, !653, !654, !655}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !635, file: !636, line: 76, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !636, line: 68, baseType: !641)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !636, line: 63, size: 320, elements: !642)
!642 = !{!643, !645, !646, !647}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !641, file: !636, line: 64, baseType: !644, size: 64)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !641, file: !636, line: 65, baseType: !644, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !641, file: !636, line: 66, baseType: !7, size: 32, offset: 128)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !641, file: !636, line: 67, baseType: !648, size: 128, offset: 192)
!648 = !DICompositeType(tag: DW_TAG_array_type, baseType: !649, size: 128, elements: !651)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !636, line: 29, baseType: !650)
!650 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!651 = !{!652}
!652 = !DISubrange(count: 2)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !635, file: !636, line: 77, baseType: !639, size: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !635, file: !636, line: 78, baseType: !7, size: 32, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !635, file: !636, line: 79, baseType: !656, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !636, line: 49, baseType: !658)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !636, line: 45, size: 832, elements: !659)
!659 = !{!660, !661, !662}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !658, file: !636, line: 46, baseType: !644, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !658, file: !636, line: 47, baseType: !634, size: 64, offset: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !658, file: !636, line: 48, baseType: !663, size: 704, offset: 128)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !664, line: 164, size: 704, elements: !665)
!664 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!665 = !{!666, !668, !678, !679, !680, !681, !682, !683, !687, !691, !692, !693, !694}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !663, file: !664, line: 166, baseType: !667, size: 64)
!667 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !663, file: !664, line: 167, baseType: !669, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !664, line: 157, size: 192, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !670, file: !664, line: 159, baseType: !554, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !670, file: !664, line: 160, baseType: !669, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !670, file: !664, line: 161, baseType: !675, size: 32, offset: 128)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 32, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 4)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !663, file: !664, line: 168, baseType: !554, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !663, file: !664, line: 169, baseType: !554, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !663, file: !664, line: 170, baseType: !554, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !663, file: !664, line: 171, baseType: !667, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !663, file: !664, line: 172, baseType: !552, size: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !663, file: !664, line: 176, baseType: !684, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!669, !556, !667}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !663, file: !664, line: 177, baseType: !688, size: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !556, !669}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !663, file: !664, line: 178, baseType: !556, size: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !663, file: !664, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !663, file: !664, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !663, file: !664, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !580, file: !407, line: 177, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !560, line: 56, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !699)
!699 = !{!700, !733, !739, !750, !769, !780, !785, !792, !798, !811, !823, !861, !866, !894, !902, !903, !908, !917, !923, !928, !932, !936, !1248, !1297, !1303, !1310, !1317, !1340, !1365, !1382, !1394, !1416, !1431, !1603}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !698, file: !164, line: 3372, baseType: !701, size: 64)
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !702)
!702 = !{!703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !701, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !701, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !701, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !701, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !701, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !701, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !701, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !701, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !701, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !701, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !701, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !701, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !701, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !701, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !701, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !701, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !701, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !701, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !701, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !701, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !701, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !701, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !701, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !701, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !701, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !701, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !701, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !701, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !701, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !701, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !698, file: !164, line: 3373, baseType: !734, size: 192)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !735)
!735 = !{!736, !737, !738}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !734, file: !164, line: 403, baseType: !701, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !734, file: !164, line: 404, baseType: !696, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !734, file: !164, line: 405, baseType: !696, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !698, file: !164, line: 3374, baseType: !740, size: 320)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !741)
!741 = !{!742, !743}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !740, file: !164, line: 1385, baseType: !734, size: 192)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !740, file: !164, line: 1386, baseType: !744, size: 128, offset: 192)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !745, line: 58, baseType: !746)
!745 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !745, line: 54, size: 128, elements: !747)
!747 = !{!748, !749}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !746, file: !745, line: 56, baseType: !650, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !746, file: !745, line: 57, baseType: !667, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !698, file: !164, line: 3375, baseType: !751, size: 256)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !752)
!752 = !{!753, !754}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !751, file: !164, line: 1398, baseType: !734, size: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !751, file: !164, line: 1399, baseType: !755, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !757, line: 52, size: 256, elements: !758)
!757 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!758 = !{!759, !760, !761, !762, !763, !764, !765}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !756, file: !757, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !756, file: !757, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !756, file: !757, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !756, file: !757, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !756, file: !757, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !756, file: !757, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !756, file: !757, line: 62, baseType: !766, size: 192, offset: 64)
!766 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 192, elements: !767)
!767 = !{!768}
!768 = !DISubrange(count: 3)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !698, file: !164, line: 3376, baseType: !770, size: 256)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !771)
!771 = !{!772, !773}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !770, file: !164, line: 1409, baseType: !734, size: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !770, file: !164, line: 1410, baseType: !774, size: 64, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !776, line: 27, size: 192, elements: !777)
!776 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!777 = !{!778, !779}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !775, file: !776, line: 29, baseType: !744, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !775, file: !776, line: 30, baseType: !5, size: 32, offset: 128)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !698, file: !164, line: 3377, baseType: !781, size: 256)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !164, line: 1438, baseType: !734, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !781, file: !164, line: 1439, baseType: !696, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !698, file: !164, line: 3378, baseType: !786, size: 256)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !787)
!787 = !{!788, !789, !790}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !786, file: !164, line: 1419, baseType: !734, size: 192)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !786, file: !164, line: 1420, baseType: !552, size: 32, offset: 192)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !786, file: !164, line: 1421, baseType: !791, size: 8, offset: 224)
!791 = !DICompositeType(tag: DW_TAG_array_type, baseType: !555, size: 8, elements: !594)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !698, file: !164, line: 3379, baseType: !793, size: 320)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !794)
!794 = !{!795, !796, !797}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !793, file: !164, line: 1429, baseType: !734, size: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !793, file: !164, line: 1430, baseType: !696, size: 64, offset: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !793, file: !164, line: 1431, baseType: !696, size: 64, offset: 256)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !698, file: !164, line: 3380, baseType: !799, size: 320)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !800)
!800 = !{!801, !802}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !799, file: !164, line: 1461, baseType: !734, size: 192)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !799, file: !164, line: 1462, baseType: !803, size: 128, offset: 192)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !804, line: 31, size: 128, elements: !805)
!804 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!805 = !{!806, !809, !810}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !803, file: !804, line: 32, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !803, file: !804, line: 33, baseType: !7, size: 32, offset: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !803, file: !804, line: 34, baseType: !7, size: 32, offset: 96)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !698, file: !164, line: 3381, baseType: !812, size: 384)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !813)
!813 = !{!814, !815, !820, !821, !822}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !812, file: !164, line: 2508, baseType: !734, size: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !812, file: !164, line: 2509, baseType: !816, size: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !817, line: 58, baseType: !818)
!817 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !819, line: 44, baseType: !7)
!819 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!820 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !812, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !812, file: !164, line: 2511, baseType: !696, size: 64, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !812, file: !164, line: 2512, baseType: !696, size: 64, offset: 320)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !698, file: !164, line: 3382, baseType: !824, size: 896)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !825)
!825 = !{!826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !824, file: !164, line: 2653, baseType: !812, size: 384)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !824, file: !164, line: 2654, baseType: !696, size: 64, offset: 384)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !824, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !824, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !824, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !824, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !824, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !824, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !824, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !824, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !824, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !824, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !824, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !824, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !824, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !824, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !824, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !824, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !824, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !824, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !824, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !824, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !824, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !824, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !824, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !824, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !824, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !824, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !824, file: !164, line: 2705, baseType: !696, size: 64, offset: 576)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !824, file: !164, line: 2706, baseType: !696, size: 64, offset: 640)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !824, file: !164, line: 2707, baseType: !696, size: 64, offset: 704)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !824, file: !164, line: 2708, baseType: !696, size: 64, offset: 768)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !824, file: !164, line: 2711, baseType: !859, size: 64, offset: 832)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !698, file: !164, line: 3383, baseType: !862, size: 960)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !862, file: !164, line: 2757, baseType: !824, size: 896)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !862, file: !164, line: 2758, baseType: !559, size: 64, offset: 896)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !698, file: !164, line: 3384, baseType: !867, size: 1472)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !868)
!868 = !{!869, !890, !891, !892, !893}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !164, line: 3115, baseType: !870, size: 1216)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !164, line: 2985, baseType: !862, size: 960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !870, file: !164, line: 2986, baseType: !696, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !870, file: !164, line: 2987, baseType: !696, size: 64, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !870, file: !164, line: 2988, baseType: !696, size: 64, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !870, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !870, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !870, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !870, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !870, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !870, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !870, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !870, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !870, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !870, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !870, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !870, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !870, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !870, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !867, file: !164, line: 3117, baseType: !696, size: 64, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !867, file: !164, line: 3119, baseType: !696, size: 64, offset: 1280)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !867, file: !164, line: 3121, baseType: !696, size: 64, offset: 1344)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !867, file: !164, line: 3123, baseType: !696, size: 64, offset: 1408)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !698, file: !164, line: 3385, baseType: !895, size: 1088)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !895, file: !164, line: 2875, baseType: !862, size: 960)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !895, file: !164, line: 2876, baseType: !559, size: 64, offset: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !895, file: !164, line: 2877, baseType: !900, size: 64, offset: 1024)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !164, line: 2856, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !698, file: !164, line: 3386, baseType: !870, size: 1216)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !698, file: !164, line: 3387, baseType: !904, size: 1280)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !904, file: !164, line: 3094, baseType: !870, size: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !904, file: !164, line: 3095, baseType: !900, size: 64, offset: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !698, file: !164, line: 3388, baseType: !909, size: 1216)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !164, line: 2825, baseType: !824, size: 896)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !909, file: !164, line: 2827, baseType: !696, size: 64, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !909, file: !164, line: 2828, baseType: !696, size: 64, offset: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !909, file: !164, line: 2829, baseType: !696, size: 64, offset: 1024)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !909, file: !164, line: 2830, baseType: !696, size: 64, offset: 1088)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !909, file: !164, line: 2831, baseType: !696, size: 64, offset: 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !698, file: !164, line: 3389, baseType: !918, size: 1024)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !164, line: 2851, baseType: !862, size: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !918, file: !164, line: 2852, baseType: !552, size: 32, offset: 960)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !918, file: !164, line: 2853, baseType: !552, size: 32, offset: 992)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !698, file: !164, line: 3390, baseType: !924, size: 1024)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !164, line: 2858, baseType: !862, size: 960)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !924, file: !164, line: 2859, baseType: !900, size: 64, offset: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !698, file: !164, line: 3391, baseType: !929, size: 960)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !164, line: 2863, baseType: !862, size: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !698, file: !164, line: 3392, baseType: !933, size: 1472)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !934)
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !164, line: 3305, baseType: !867, size: 1472)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !698, file: !164, line: 3393, baseType: !937, size: 1792)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !938)
!938 = !{!939, !940, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !164, line: 3249, baseType: !867, size: 1472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !937, file: !164, line: 3251, baseType: !941, size: 64, offset: 1472)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !943, line: 463, size: 1152, elements: !944)
!943 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!944 = !{!945, !948, !1108, !1109, !1112, !1171, !1172, !1173, !1174, !1175, !1176, !1200, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216, !1217, !1218, !1219, !1220, !1221, !1222, !1223, !1224, !1225, !1226}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !942, file: !943, line: 464, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !943, line: 464, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !942, file: !943, line: 467, baseType: !949, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !148, line: 374, size: 640, elements: !951)
!951 = !{!952, !1083, !1084, !1097, !1098, !1099, !1100, !1101, !1102, !1104, !1106, !1107}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !950, file: !148, line: 377, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !560, line: 111, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !148, line: 217, size: 832, elements: !956)
!956 = !{!957, !992, !993, !994, !1053, !1057, !1058, !1059, !1077, !1078, !1079, !1080, !1081, !1082}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !955, file: !148, line: 219, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !148, line: 151, baseType: !960)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !148, line: 151, size: 128, elements: !961)
!961 = !{!962}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !960, file: !148, line: 151, baseType: !963, size: 128)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !148, line: 150, baseType: !964)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !148, line: 150, size: 128, elements: !965)
!965 = !{!966, !967, !968}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !964, file: !148, line: 150, baseType: !7, size: 32)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !964, file: !148, line: 150, baseType: !7, size: 32, offset: 32)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !964, file: !148, line: 150, baseType: !969, size: 64, offset: 64)
!969 = !DICompositeType(tag: DW_TAG_array_type, baseType: !970, size: 64, elements: !594)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !560, line: 108, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !148, line: 122, size: 512, elements: !973)
!973 = !{!974, !975, !976, !984, !985, !986, !987, !988, !989, !990}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !972, file: !148, line: 124, baseType: !954, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !972, file: !148, line: 125, baseType: !954, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !972, file: !148, line: 131, baseType: !977, size: 64, offset: 128)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !148, line: 128, size: 64, elements: !978)
!978 = !{!979, !983}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !977, file: !148, line: 129, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !560, line: 66, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !560, line: 65, flags: DIFlagFwdDecl)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !977, file: !148, line: 130, baseType: !559, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !972, file: !148, line: 134, baseType: !556, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !972, file: !148, line: 137, baseType: !696, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !972, file: !148, line: 138, baseType: !816, size: 32, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !972, file: !148, line: 142, baseType: !7, size: 32, offset: 352)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !972, file: !148, line: 144, baseType: !552, size: 32, offset: 384)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !972, file: !148, line: 145, baseType: !552, size: 32, offset: 416)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !972, file: !148, line: 146, baseType: !991, size: 64, offset: 448)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !148, line: 119, baseType: !667)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !955, file: !148, line: 220, baseType: !958, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !955, file: !148, line: 223, baseType: !556, size: 64, offset: 128)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !955, file: !148, line: 226, baseType: !995, size: 64, offset: 192)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 100, size: 1216, elements: !997)
!997 = !{!998, !999, !1000, !1001, !1002, !1007, !1008, !1009, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031, !1032, !1043, !1051, !1052}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !996, file: !135, line: 102, baseType: !552, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !996, file: !135, line: 105, baseType: !7, size: 32, offset: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !996, file: !135, line: 108, baseType: !954, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !996, file: !135, line: 111, baseType: !954, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !996, file: !135, line: 114, baseType: !1003, size: 64, offset: 192)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !135, line: 41, size: 64, elements: !1004)
!1004 = !{!1005, !1006}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1003, file: !135, line: 42, baseType: !134, size: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1003, file: !135, line: 43, baseType: !7, size: 32, offset: 32)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !996, file: !135, line: 117, baseType: !7, size: 32, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !996, file: !135, line: 120, baseType: !7, size: 32, offset: 288)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !996, file: !135, line: 123, baseType: !1010, size: 64, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !135, line: 87, baseType: !1012)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !135, line: 87, size: 128, elements: !1013)
!1013 = !{!1014}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1012, file: !135, line: 87, baseType: !1015, size: 128)
!1015 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !135, line: 85, baseType: !1016)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !135, line: 85, size: 128, elements: !1017)
!1017 = !{!1018, !1019, !1020}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1016, file: !135, line: 85, baseType: !7, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1016, file: !135, line: 85, baseType: !7, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1016, file: !135, line: 85, baseType: !1021, size: 64, offset: 64)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1022, size: 64, elements: !594)
!1022 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !135, line: 84, baseType: !995)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !996, file: !135, line: 126, baseType: !995, size: 64, offset: 384)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !996, file: !135, line: 129, baseType: !995, size: 64, offset: 448)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !996, file: !135, line: 132, baseType: !556, size: 64, offset: 512)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !996, file: !135, line: 139, baseType: !696, size: 64, offset: 576)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !996, file: !135, line: 143, baseType: !744, size: 128, offset: 640)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !996, file: !135, line: 146, baseType: !744, size: 128, offset: 768)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !996, file: !135, line: 148, baseType: !551, size: 8, offset: 896)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !996, file: !135, line: 149, baseType: !551, size: 8, offset: 904)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !996, file: !135, line: 153, baseType: !143, size: 32, offset: 928)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !996, file: !135, line: 156, baseType: !1033, size: 64, offset: 960)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !135, line: 48, size: 320, elements: !1035)
!1035 = !{!1036, !1040, !1041, !1042}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1034, file: !135, line: 50, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !560, line: 58, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !560, line: 57, flags: DIFlagFwdDecl)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1034, file: !135, line: 59, baseType: !744, size: 128, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1034, file: !135, line: 64, baseType: !551, size: 8, offset: 192)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1034, file: !135, line: 67, baseType: !1033, size: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !996, file: !135, line: 159, baseType: !1044, size: 64, offset: 1024)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !135, line: 72, size: 256, elements: !1046)
!1046 = !{!1047, !1048, !1049, !1050}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1045, file: !135, line: 74, baseType: !971, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1045, file: !135, line: 77, baseType: !1044, size: 64, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1045, file: !135, line: 78, baseType: !1044, size: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1045, file: !135, line: 81, baseType: !1044, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !996, file: !135, line: 162, baseType: !551, size: 8, offset: 1088)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !996, file: !135, line: 166, baseType: !696, size: 64, offset: 1152)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !955, file: !148, line: 229, baseType: !1054, size: 128, offset: 256)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1055, size: 128, elements: !651)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !148, line: 229, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !955, file: !148, line: 232, baseType: !954, size: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !955, file: !148, line: 233, baseType: !954, size: 64, offset: 448)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !955, file: !148, line: 238, baseType: !1060, size: 64, offset: 512)
!1060 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !148, line: 235, size: 64, elements: !1061)
!1061 = !{!1062, !1068}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1060, file: !148, line: 236, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !148, line: 273, size: 128, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1064, file: !148, line: 275, baseType: !980, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1064, file: !148, line: 278, baseType: !980, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1060, file: !148, line: 237, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !148, line: 259, size: 320, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1070, file: !148, line: 261, baseType: !559, size: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1070, file: !148, line: 262, baseType: !559, size: 64, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1070, file: !148, line: 266, baseType: !559, size: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1070, file: !148, line: 267, baseType: !559, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1070, file: !148, line: 270, baseType: !552, size: 32, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !955, file: !148, line: 241, baseType: !991, size: 64, offset: 576)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !955, file: !148, line: 244, baseType: !552, size: 32, offset: 640)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !955, file: !148, line: 247, baseType: !552, size: 32, offset: 672)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !955, file: !148, line: 250, baseType: !552, size: 32, offset: 704)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !955, file: !148, line: 253, baseType: !552, size: 32, offset: 736)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !955, file: !148, line: 256, baseType: !552, size: 32, offset: 768)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !950, file: !148, line: 378, baseType: !953, size: 64, offset: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !950, file: !148, line: 381, baseType: !1085, size: 64, offset: 128)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !148, line: 282, baseType: !1087)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !148, line: 282, size: 128, elements: !1088)
!1088 = !{!1089}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1087, file: !148, line: 282, baseType: !1090, size: 128)
!1090 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !148, line: 281, baseType: !1091)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !148, line: 281, size: 128, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1091, file: !148, line: 281, baseType: !7, size: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1091, file: !148, line: 281, baseType: !7, size: 32, offset: 32)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1091, file: !148, line: 281, baseType: !1096, size: 64, offset: 64)
!1096 = !DICompositeType(tag: DW_TAG_array_type, baseType: !953, size: 64, elements: !594)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !950, file: !148, line: 384, baseType: !552, size: 32, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !950, file: !148, line: 387, baseType: !552, size: 32, offset: 224)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !950, file: !148, line: 390, baseType: !552, size: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !950, file: !148, line: 394, baseType: !1085, size: 64, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !950, file: !148, line: 396, baseType: !147, size: 32, offset: 384)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !950, file: !148, line: 399, baseType: !1103, size: 64, offset: 416)
!1103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !153, size: 64, elements: !651)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !950, file: !148, line: 402, baseType: !1105, size: 64, offset: 480)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !651)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !950, file: !148, line: 406, baseType: !552, size: 32, offset: 544)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !950, file: !148, line: 409, baseType: !552, size: 32, offset: 576)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !942, file: !943, line: 470, baseType: !981, size: 64, offset: 128)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !942, file: !943, line: 473, baseType: !1110, size: 64, offset: 192)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !943, line: 166, flags: DIFlagFwdDecl)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !942, file: !943, line: 476, baseType: !1113, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !135, line: 187, size: 256, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1170}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1114, file: !135, line: 189, baseType: !552, size: 32)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1114, file: !135, line: 192, baseType: !1010, size: 64, offset: 64)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1114, file: !135, line: 197, baseType: !1119, size: 64, offset: 128)
!1119 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1120, line: 144, baseType: !1121)
!1120 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1120, line: 100, size: 896, elements: !1123)
!1123 = !{!1124, !1132, !1137, !1142, !1144, !1147, !1148, !1149, !1150, !1151, !1156, !1158, !1159, !1164, !1169}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1122, file: !1120, line: 102, baseType: !1125, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1120, line: 52, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!1129, !1130}
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1120, line: 47, baseType: !7)
!1130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1122, file: !1120, line: 105, baseType: !1133, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1120, line: 59, baseType: !1134)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = !DISubroutineType(types: !1136)
!1136 = !{!552, !1130, !1130}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1122, file: !1120, line: 108, baseType: !1138, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1120, line: 63, baseType: !1139)
!1139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1140, size: 64)
!1140 = !DISubroutineType(types: !1141)
!1141 = !{null, !556}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1122, file: !1120, line: 111, baseType: !1143, size: 64, offset: 192)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1122, file: !1120, line: 114, baseType: !1145, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1146, line: 46, baseType: !650)
!1146 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1122, file: !1120, line: 117, baseType: !1145, size: 64, offset: 320)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1122, file: !1120, line: 120, baseType: !1145, size: 64, offset: 384)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1122, file: !1120, line: 124, baseType: !7, size: 32, offset: 448)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1122, file: !1120, line: 128, baseType: !7, size: 32, offset: 480)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1122, file: !1120, line: 131, baseType: !1152, size: 64, offset: 512)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1120, line: 75, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!556, !1145, !1145}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1122, file: !1120, line: 132, baseType: !1157, size: 64, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1120, line: 78, baseType: !1139)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1122, file: !1120, line: 135, baseType: !556, size: 64, offset: 640)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1122, file: !1120, line: 136, baseType: !1160, size: 64, offset: 704)
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1120, line: 82, baseType: !1161)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = !DISubroutineType(types: !1163)
!1163 = !{!556, !556, !1145, !1145}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1122, file: !1120, line: 137, baseType: !1165, size: 64, offset: 768)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1120, line: 83, baseType: !1166)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = !DISubroutineType(types: !1168)
!1168 = !{null, !556, !556}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1122, file: !1120, line: 141, baseType: !7, size: 32, offset: 832)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1114, file: !135, line: 200, baseType: !995, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !942, file: !943, line: 479, baseType: !1119, size: 64, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !942, file: !943, line: 484, baseType: !696, size: 64, offset: 384)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !942, file: !943, line: 488, baseType: !696, size: 64, offset: 448)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !942, file: !943, line: 493, baseType: !696, size: 64, offset: 512)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !942, file: !943, line: 496, baseType: !696, size: 64, offset: 576)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !942, file: !943, line: 501, baseType: !1177, size: 64, offset: 640)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !159, line: 2355, size: 576, elements: !1179)
!1179 = !{!1180, !1183, !1184, !1185, !1186, !1188, !1189, !1194, !1195, !1196, !1197, !1198, !1199}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1178, file: !159, line: 2356, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1182, size: 64)
!1182 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !159, line: 2356, flags: DIFlagFwdDecl)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1178, file: !159, line: 2357, baseType: !557, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1178, file: !159, line: 2358, baseType: !552, size: 32, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1178, file: !159, line: 2359, baseType: !552, size: 32, offset: 160)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1178, file: !159, line: 2360, baseType: !1187, size: 128, offset: 192)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !552, size: 128, elements: !676)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1178, file: !159, line: 2364, baseType: !552, size: 32, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1178, file: !159, line: 2367, baseType: !1190, size: 128, offset: 384)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !159, line: 2349, size: 128, elements: !1191)
!1191 = !{!1192, !1193}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1190, file: !159, line: 2351, baseType: !559, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1190, file: !159, line: 2352, baseType: !667, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1178, file: !159, line: 2371, baseType: !158, size: 32, offset: 512)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1178, file: !159, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1178, file: !159, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1178, file: !159, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1178, file: !159, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1178, file: !159, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !942, file: !943, line: 504, baseType: !1201, size: 64, offset: 704)
!1201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1202, size: 64)
!1202 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !943, line: 504, flags: DIFlagFwdDecl)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !942, file: !943, line: 507, baseType: !1119, size: 64, offset: 768)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !942, file: !943, line: 510, baseType: !552, size: 32, offset: 832)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !942, file: !943, line: 513, baseType: !552, size: 32, offset: 864)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !942, file: !943, line: 516, baseType: !816, size: 32, offset: 896)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !942, file: !943, line: 519, baseType: !816, size: 32, offset: 928)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !942, file: !943, line: 522, baseType: !7, size: 32, offset: 960)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !942, file: !943, line: 523, baseType: !7, size: 32, offset: 992)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !942, file: !943, line: 528, baseType: !557, size: 64, offset: 1024)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !942, file: !943, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !942, file: !943, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !942, file: !943, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !942, file: !943, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !942, file: !943, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !942, file: !943, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !942, file: !943, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !942, file: !943, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !942, file: !943, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !942, file: !943, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !942, file: !943, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !942, file: !943, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !942, file: !943, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !942, file: !943, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !942, file: !943, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !942, file: !943, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !937, file: !164, line: 3254, baseType: !696, size: 64, offset: 1536)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !937, file: !164, line: 3257, baseType: !696, size: 64, offset: 1600)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !937, file: !164, line: 3258, baseType: !696, size: 64, offset: 1664)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !937, file: !164, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !937, file: !164, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !937, file: !164, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !937, file: !164, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !937, file: !164, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !937, file: !164, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !937, file: !164, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !937, file: !164, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !937, file: !164, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !937, file: !164, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !937, file: !164, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !937, file: !164, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !937, file: !164, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !937, file: !164, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !937, file: !164, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !937, file: !164, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !937, file: !164, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !937, file: !164, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !698, file: !164, line: 3394, baseType: !1249, size: 1344)
!1249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !164, line: 2279, size: 1344, elements: !1250)
!1250 = !{!1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1276, !1277, !1278, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1249, file: !164, line: 2280, baseType: !734, size: 192)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1249, file: !164, line: 2281, baseType: !696, size: 64, offset: 192)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1249, file: !164, line: 2282, baseType: !696, size: 64, offset: 256)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1249, file: !164, line: 2283, baseType: !696, size: 64, offset: 320)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1249, file: !164, line: 2284, baseType: !696, size: 64, offset: 384)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1249, file: !164, line: 2285, baseType: !7, size: 32, offset: 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1249, file: !164, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1249, file: !164, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1249, file: !164, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1249, file: !164, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1249, file: !164, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1249, file: !164, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1249, file: !164, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1249, file: !164, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1249, file: !164, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1249, file: !164, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1249, file: !164, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1249, file: !164, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1249, file: !164, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1249, file: !164, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1249, file: !164, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1249, file: !164, line: 2305, baseType: !7, size: 32, offset: 512)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1249, file: !164, line: 2306, baseType: !1274, size: 32, offset: 544)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1275, line: 31, baseType: !552)
!1275 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1249, file: !164, line: 2307, baseType: !696, size: 64, offset: 576)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1249, file: !164, line: 2308, baseType: !696, size: 64, offset: 640)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1249, file: !164, line: 2314, baseType: !1279, size: 64, offset: 704)
!1279 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !164, line: 2309, size: 64, elements: !1280)
!1280 = !{!1281, !1282, !1283}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1279, file: !164, line: 2310, baseType: !552, size: 32)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1279, file: !164, line: 2311, baseType: !557, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1279, file: !164, line: 2312, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !164, line: 2277, flags: DIFlagFwdDecl)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1249, file: !164, line: 2315, baseType: !696, size: 64, offset: 768)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1249, file: !164, line: 2316, baseType: !696, size: 64, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1249, file: !164, line: 2317, baseType: !696, size: 64, offset: 896)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1249, file: !164, line: 2318, baseType: !696, size: 64, offset: 960)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1249, file: !164, line: 2319, baseType: !696, size: 64, offset: 1024)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1249, file: !164, line: 2320, baseType: !696, size: 64, offset: 1088)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1249, file: !164, line: 2321, baseType: !696, size: 64, offset: 1152)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1249, file: !164, line: 2322, baseType: !696, size: 64, offset: 1216)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1249, file: !164, line: 2324, baseType: !1295, size: 64, offset: 1280)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !164, line: 2324, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !698, file: !164, line: 3395, baseType: !1298, size: 320)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !164, line: 1469, size: 320, elements: !1299)
!1299 = !{!1300, !1301, !1302}
