; ModuleID = 'sese.bc'
source_filename = "sese.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!424 = !DIEnumerator(name: "GIMPLE_ERROR_MARK", value: 0, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_COND", value: 1, isUnsigned: true)
!426 = !DIEnumerator(name: "GIMPLE_DEBUG", value: 2, isUnsigned: true)
!427 = !DIEnumerator(name: "GIMPLE_GOTO", value: 3, isUnsigned: true)
!428 = !DIEnumerator(name: "GIMPLE_LABEL", value: 4, isUnsigned: true)
!429 = !DIEnumerator(name: "GIMPLE_SWITCH", value: 5, isUnsigned: true)
!430 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!431 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!433 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!434 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!435 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!436 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!437 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!438 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!439 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!440 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!441 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!442 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!443 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!444 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!445 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!446 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!447 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!448 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!449 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!450 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!451 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!452 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!453 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!454 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!455 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!456 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!457 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!458 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!459 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!460 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !396, line: 80, baseType: !5, size: 32, elements: !461)
!461 = !{!462, !463, !464, !465}
!462 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!465 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!466 = !{!467, !468, !469, !470, !473, !474, !476, !1835, !1841, !1376, !132, !1067, !1860, !1861, !482, !1868, !1869, !1854, !5, !1048, !1847, !1870, !840, !471, !609, !1873, !536, !1886, !1887, !1899, !1905, !1912, !807, !1913, !460, !1353}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!469 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !478)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rename_map_elt_s", file: !479, line: 255, size: 128, elements: !480)
!479 = !DIFile(filename: "./sese.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!480 = !{!481, !1834}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "old_name", scope: !478, file: !479, line: 257, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !483, line: 56, baseType: !484)
!483 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !486)
!486 = !{!487, !520, !526, !539, !558, !569, !574, !583, !589, !602, !614, !652, !1162, !1190, !1207, !1208, !1213, !1222, !1228, !1233, !1237, !1241, !1485, !1532, !1538, !1544, !1551, !1564, !1578, !1595, !1607, !1629, !1644, !1816}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !485, file: !133, line: 3372, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !489)
!489 = !{!490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !488, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !488, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !488, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !488, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !488, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !488, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !488, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !488, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !488, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !488, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !488, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !488, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !488, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !488, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !488, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !488, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !488, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !488, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !488, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !488, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !488, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !488, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !488, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !488, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !488, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !488, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !488, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !488, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !488, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !488, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !485, file: !133, line: 3373, baseType: !521, size: 192)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !522)
!522 = !{!523, !524, !525}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !521, file: !133, line: 403, baseType: !488, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !521, file: !133, line: 404, baseType: !482, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !521, file: !133, line: 405, baseType: !482, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !485, file: !133, line: 3374, baseType: !527, size: 320)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !528)
!528 = !{!529, !530}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !527, file: !133, line: 1385, baseType: !521, size: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !527, file: !133, line: 1386, baseType: !531, size: 128, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !532, line: 58, baseType: !533)
!532 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !532, line: 54, size: 128, elements: !534)
!534 = !{!535, !537}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !533, file: !532, line: 56, baseType: !536, size: 64)
!536 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !533, file: !532, line: 57, baseType: !538, size: 64, offset: 64)
!538 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !485, file: !133, line: 3375, baseType: !540, size: 256)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !541)
!541 = !{!542, !543}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !540, file: !133, line: 1398, baseType: !521, size: 192)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !540, file: !133, line: 1399, baseType: !544, size: 64, offset: 192)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !546, line: 52, size: 256, elements: !547)
!546 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!547 = !{!548, !549, !550, !551, !552, !553, !554}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !545, file: !546, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !545, file: !546, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !545, file: !546, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !545, file: !546, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !545, file: !546, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !545, file: !546, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !545, file: !546, line: 62, baseType: !555, size: 192, offset: 64)
!555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 192, elements: !556)
!556 = !{!557}
!557 = !DISubrange(count: 3)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !485, file: !133, line: 3376, baseType: !559, size: 256)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !560)
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !559, file: !133, line: 1409, baseType: !521, size: 192)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !559, file: !133, line: 1410, baseType: !563, size: 64, offset: 192)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !564, size: 64)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !565, line: 27, size: 192, elements: !566)
!565 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !564, file: !565, line: 29, baseType: !531, size: 128)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !564, file: !565, line: 30, baseType: !3, size: 32, offset: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !485, file: !133, line: 3377, baseType: !570, size: 256)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !570, file: !133, line: 1438, baseType: !521, size: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !570, file: !133, line: 1439, baseType: !482, size: 64, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !485, file: !133, line: 3378, baseType: !575, size: 256)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !576)
!576 = !{!577, !578, !579}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !575, file: !133, line: 1419, baseType: !521, size: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !575, file: !133, line: 1420, baseType: !469, size: 32, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !575, file: !133, line: 1421, baseType: !580, size: 8, offset: 224)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 8, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 1)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !485, file: !133, line: 3379, baseType: !584, size: 320)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !585)
!585 = !{!586, !587, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !584, file: !133, line: 1429, baseType: !521, size: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !584, file: !133, line: 1430, baseType: !482, size: 64, offset: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !584, file: !133, line: 1431, baseType: !482, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !485, file: !133, line: 3380, baseType: !590, size: 320)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !591)
!591 = !{!592, !593}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !590, file: !133, line: 1461, baseType: !521, size: 192)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !590, file: !133, line: 1462, baseType: !594, size: 128, offset: 192)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !595, line: 31, size: 128, elements: !596)
!595 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!596 = !{!597, !600, !601}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !594, file: !595, line: 32, baseType: !598, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !594, file: !595, line: 33, baseType: !5, size: 32, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !594, file: !595, line: 34, baseType: !5, size: 32, offset: 96)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !485, file: !133, line: 3381, baseType: !603, size: 384)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !604)
!604 = !{!605, !606, !611, !612, !613}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !603, file: !133, line: 2508, baseType: !521, size: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !603, file: !133, line: 2509, baseType: !607, size: 32, offset: 192)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !608, line: 58, baseType: !609)
!608 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !610, line: 44, baseType: !5)
!610 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!611 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !603, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !603, file: !133, line: 2511, baseType: !482, size: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !603, file: !133, line: 2512, baseType: !482, size: 64, offset: 320)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !485, file: !133, line: 3382, baseType: !615, size: 896)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !616)
!616 = !{!617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !615, file: !133, line: 2653, baseType: !603, size: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !615, file: !133, line: 2654, baseType: !482, size: 64, offset: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !615, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !615, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !615, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !615, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !615, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !615, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !615, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !615, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !615, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !615, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !615, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !615, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !615, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !615, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !615, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !615, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !615, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !615, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !615, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !615, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !615, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !615, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !615, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !615, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !615, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !615, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !615, file: !133, line: 2705, baseType: !482, size: 64, offset: 576)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !615, file: !133, line: 2706, baseType: !482, size: 64, offset: 640)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !615, file: !133, line: 2707, baseType: !482, size: 64, offset: 704)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !615, file: !133, line: 2708, baseType: !482, size: 64, offset: 768)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !615, file: !133, line: 2711, baseType: !650, size: 64, offset: 832)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !485, file: !133, line: 3383, baseType: !653, size: 960)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !654)
!654 = !{!655, !656}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !653, file: !133, line: 2757, baseType: !615, size: 896)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !653, file: !133, line: 2758, baseType: !657, size: 64, offset: 896)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !483, line: 50, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !660, line: 240, size: 384, elements: !661)
!660 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!661 = !{!662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !659, file: !660, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !659, file: !660, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !659, file: !660, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !659, file: !660, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !659, file: !660, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !659, file: !660, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !659, file: !660, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !659, file: !660, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !659, file: !660, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !659, file: !660, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !659, file: !660, line: 321, baseType: !673, size: 320, offset: 64)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !660, line: 315, size: 320, elements: !674)
!674 = !{!675, !1129, !1131, !1160, !1161}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !673, file: !660, line: 316, baseType: !676, size: 64)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 64, elements: !581)
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !660, line: 183, baseType: !678)
!678 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !660, line: 166, size: 64, elements: !679)
!679 = !{!680, !681, !682, !683, !684, !692, !693, !705, !708, !768, !769, !1106, !1119, !1126}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !678, file: !660, line: 168, baseType: !469, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !678, file: !660, line: 169, baseType: !5, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !678, file: !660, line: 170, baseType: !474, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !678, file: !660, line: 171, baseType: !657, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !678, file: !660, line: 172, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !483, line: 53, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !660, line: 359, size: 128, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !687, file: !660, line: 360, baseType: !469, size: 32)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !687, file: !660, line: 361, baseType: !691, size: 64, offset: 64)
!691 = !DICompositeType(tag: DW_TAG_array_type, baseType: !657, size: 64, elements: !581)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !678, file: !660, line: 173, baseType: !3, size: 32)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !678, file: !660, line: 174, baseType: !694, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !660, line: 133, baseType: !695)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !660, line: 115, size: 32, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !695, file: !660, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !695, file: !660, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !695, file: !660, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !695, file: !660, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !695, file: !660, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !695, file: !660, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !695, file: !660, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !695, file: !660, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !678, file: !660, line: 175, baseType: !706, size: 64)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !660, line: 175, flags: DIFlagFwdDecl)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !678, file: !660, line: 176, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !711, line: 75, size: 256, elements: !712)
!711 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!712 = !{!713, !727, !728, !729}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !710, file: !711, line: 76, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !711, line: 68, baseType: !716)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !711, line: 63, size: 320, elements: !717)
!717 = !{!718, !720, !721, !722}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !716, file: !711, line: 64, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !716, file: !711, line: 65, baseType: !719, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !716, file: !711, line: 66, baseType: !5, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !716, file: !711, line: 67, baseType: !723, size: 128, offset: 192)
!723 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 128, elements: !725)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !711, line: 29, baseType: !536)
!725 = !{!726}
!726 = !DISubrange(count: 2)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !710, file: !711, line: 77, baseType: !714, size: 64, offset: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !710, file: !711, line: 78, baseType: !5, size: 32, offset: 128)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !710, file: !711, line: 79, baseType: !730, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !711, line: 49, baseType: !732)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !711, line: 45, size: 832, elements: !733)
!733 = !{!734, !735, !736}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !732, file: !711, line: 46, baseType: !719, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !732, file: !711, line: 47, baseType: !709, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !732, file: !711, line: 48, baseType: !737, size: 704, offset: 128)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !738, line: 164, size: 704, elements: !739)
!738 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!739 = !{!740, !741, !751, !752, !753, !754, !755, !756, !760, !764, !765, !766, !767}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !737, file: !738, line: 166, baseType: !538, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !737, file: !738, line: 167, baseType: !742, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !738, line: 157, size: 192, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !743, file: !738, line: 159, baseType: !471, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !743, file: !738, line: 160, baseType: !742, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !743, file: !738, line: 161, baseType: !748, size: 32, offset: 128)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 32, elements: !749)
!749 = !{!750}
!750 = !DISubrange(count: 4)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !737, file: !738, line: 168, baseType: !471, size: 64, offset: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !737, file: !738, line: 169, baseType: !471, size: 64, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !737, file: !738, line: 170, baseType: !471, size: 64, offset: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !737, file: !738, line: 171, baseType: !538, size: 64, offset: 320)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !737, file: !738, line: 172, baseType: !469, size: 32, offset: 384)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !737, file: !738, line: 176, baseType: !757, size: 64, offset: 448)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DISubroutineType(types: !759)
!759 = !{!742, !473, !538}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !737, file: !738, line: 177, baseType: !761, size: 64, offset: 512)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DISubroutineType(types: !763)
!763 = !{null, !473, !742}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !737, file: !738, line: 178, baseType: !473, size: 64, offset: 576)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !737, file: !738, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !737, file: !738, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !737, file: !738, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !678, file: !660, line: 177, baseType: !482, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !678, file: !660, line: 178, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !341, line: 217, size: 832, elements: !772)
!772 = !{!773, !1018, !1019, !1020, !1076, !1080, !1081, !1082, !1100, !1101, !1102, !1103, !1104, !1105}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !771, file: !341, line: 219, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !341, line: 151, baseType: !776)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !341, line: 151, size: 128, elements: !777)
!777 = !{!778}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !776, file: !341, line: 151, baseType: !779, size: 128)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !341, line: 150, baseType: !780)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !341, line: 150, size: 128, elements: !781)
!781 = !{!782, !783, !784}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !780, file: !341, line: 150, baseType: !5, size: 32)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !780, file: !341, line: 150, baseType: !5, size: 32, offset: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !780, file: !341, line: 150, baseType: !785, size: 64, offset: 64)
!785 = !DICompositeType(tag: DW_TAG_array_type, baseType: !786, size: 64, elements: !581)
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !483, line: 108, baseType: !787)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !341, line: 122, size: 512, elements: !789)
!789 = !{!790, !791, !792, !1010, !1011, !1012, !1013, !1014, !1015, !1016}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !788, file: !341, line: 124, baseType: !770, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !788, file: !341, line: 125, baseType: !770, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !788, file: !341, line: 131, baseType: !793, size: 64, offset: 128)
!793 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !341, line: 128, size: 64, elements: !794)
!794 = !{!795, !1009}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !793, file: !341, line: 129, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !483, line: 66, baseType: !797)
!797 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !798, size: 64)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !396, line: 143, size: 192, elements: !799)
!799 = !{!800, !1007, !1008}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !798, file: !396, line: 145, baseType: !801, size: 64)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !483, line: 69, baseType: !802)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !396, line: 136, size: 192, elements: !804)
!804 = !{!805, !1005, !1006}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !803, file: !396, line: 137, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !483, line: 58, baseType: !807)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !396, line: 737, size: 768, elements: !809)
!809 = !{!810, !827, !860, !866, !871, !876, !883, !889, !895, !900, !914, !919, !925, !930, !940, !945, !963, !970, !977, !983, !988, !994, !1000}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !808, file: !396, line: 738, baseType: !811, size: 256)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !396, line: 271, size: 256, elements: !812)
!812 = !{!813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !811, file: !396, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !811, file: !396, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !811, file: !396, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !811, file: !396, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !811, file: !396, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !811, file: !396, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !811, file: !396, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !811, file: !396, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !811, file: !396, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !811, file: !396, line: 312, baseType: !5, size: 32, offset: 32)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !811, file: !396, line: 316, baseType: !607, size: 32, offset: 64)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !811, file: !396, line: 319, baseType: !5, size: 32, offset: 96)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !811, file: !396, line: 323, baseType: !770, size: 64, offset: 128)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !811, file: !396, line: 327, baseType: !482, size: 64, offset: 192)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !808, file: !396, line: 739, baseType: !828, size: 448)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !396, line: 350, size: 448, elements: !829)
!829 = !{!830, !858}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !828, file: !396, line: 353, baseType: !831, size: 384)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !396, line: 333, size: 384, elements: !832)
!832 = !{!833, !834, !841}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !831, file: !396, line: 336, baseType: !811, size: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !831, file: !396, line: 343, baseType: !835, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !389, line: 37, size: 128, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !836, file: !389, line: 39, baseType: !835, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !836, file: !389, line: 40, baseType: !840, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !831, file: !396, line: 344, baseType: !842, size: 64, offset: 320)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !389, line: 45, size: 320, elements: !844)
!844 = !{!845, !846}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !843, file: !389, line: 47, baseType: !842, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !843, file: !389, line: 48, baseType: !847, size: 256, offset: 64)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !848)
!848 = !{!849, !851, !852, !857}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !847, file: !133, line: 1884, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !847, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !847, file: !133, line: 1885, baseType: !850, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !847, file: !133, line: 1891, baseType: !853, size: 64, offset: 128)
!853 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !847, file: !133, line: 1891, size: 64, elements: !854)
!854 = !{!855, !856}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !853, file: !133, line: 1891, baseType: !806, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !853, file: !133, line: 1891, baseType: !482, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !847, file: !133, line: 1892, baseType: !840, size: 64, offset: 192)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !828, file: !396, line: 359, baseType: !859, size: 64, offset: 384)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !482, size: 64, elements: !581)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !808, file: !396, line: 740, baseType: !861, size: 512)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !396, line: 365, size: 512, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !861, file: !396, line: 368, baseType: !831, size: 384)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !861, file: !396, line: 373, baseType: !482, size: 64, offset: 384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !861, file: !396, line: 374, baseType: !482, size: 64, offset: 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !808, file: !396, line: 741, baseType: !867, size: 576)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !396, line: 380, size: 576, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !867, file: !396, line: 383, baseType: !861, size: 512)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !867, file: !396, line: 389, baseType: !859, size: 64, offset: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !808, file: !396, line: 742, baseType: !872, size: 320)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !396, line: 395, size: 320, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !872, file: !396, line: 397, baseType: !811, size: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !872, file: !396, line: 400, baseType: !796, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !808, file: !396, line: 743, baseType: !877, size: 448)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !396, line: 406, size: 448, elements: !878)
!878 = !{!879, !880, !881, !882}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !877, file: !396, line: 408, baseType: !811, size: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !877, file: !396, line: 412, baseType: !482, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !877, file: !396, line: 420, baseType: !482, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !877, file: !396, line: 423, baseType: !796, size: 64, offset: 384)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !808, file: !396, line: 744, baseType: !884, size: 384)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !396, line: 429, size: 384, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !884, file: !396, line: 431, baseType: !811, size: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !884, file: !396, line: 434, baseType: !482, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !884, file: !396, line: 437, baseType: !796, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !808, file: !396, line: 745, baseType: !890, size: 384)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !396, line: 443, size: 384, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !890, file: !396, line: 445, baseType: !811, size: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !890, file: !396, line: 449, baseType: !482, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !890, file: !396, line: 453, baseType: !796, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !808, file: !396, line: 746, baseType: !896, size: 320)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !396, line: 459, size: 320, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !896, file: !396, line: 461, baseType: !811, size: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !896, file: !396, line: 464, baseType: !482, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !808, file: !396, line: 747, baseType: !901, size: 768)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !396, line: 469, size: 768, elements: !902)
!902 = !{!903, !904, !905, !906, !907}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !901, file: !396, line: 471, baseType: !811, size: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !901, file: !396, line: 474, baseType: !5, size: 32, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !901, file: !396, line: 475, baseType: !5, size: 32, offset: 288)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !901, file: !396, line: 478, baseType: !482, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !901, file: !396, line: 481, baseType: !908, size: 384, offset: 384)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !909, size: 384, elements: !581)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !910)
!910 = !{!911, !912, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !909, file: !133, line: 1920, baseType: !847, size: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !909, file: !133, line: 1921, baseType: !482, size: 64, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !909, file: !133, line: 1922, baseType: !607, size: 32, offset: 320)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !808, file: !396, line: 748, baseType: !915, size: 320)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !396, line: 487, size: 320, elements: !916)
!916 = !{!917, !918}
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !915, file: !396, line: 490, baseType: !811, size: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !915, file: !396, line: 494, baseType: !469, size: 32, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !808, file: !396, line: 749, baseType: !920, size: 384)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !396, line: 500, size: 384, elements: !921)
!921 = !{!922, !923, !924}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !920, file: !396, line: 502, baseType: !811, size: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !920, file: !396, line: 506, baseType: !796, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !920, file: !396, line: 510, baseType: !796, size: 64, offset: 320)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !808, file: !396, line: 750, baseType: !926, size: 320)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !396, line: 529, size: 320, elements: !927)
!927 = !{!928, !929}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !926, file: !396, line: 531, baseType: !811, size: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !926, file: !396, line: 540, baseType: !796, size: 64, offset: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !808, file: !396, line: 751, baseType: !931, size: 704)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !396, line: 546, size: 704, elements: !932)
!932 = !{!933, !934, !935, !936, !937, !938, !939}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !931, file: !396, line: 549, baseType: !861, size: 512)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !931, file: !396, line: 553, baseType: !474, size: 64, offset: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !931, file: !396, line: 557, baseType: !468, size: 8, offset: 576)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !931, file: !396, line: 558, baseType: !468, size: 8, offset: 584)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !931, file: !396, line: 559, baseType: !468, size: 8, offset: 592)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !931, file: !396, line: 560, baseType: !468, size: 8, offset: 600)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !931, file: !396, line: 566, baseType: !859, size: 64, offset: 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !808, file: !396, line: 752, baseType: !941, size: 384)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !396, line: 571, size: 384, elements: !942)
!942 = !{!943, !944}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !941, file: !396, line: 573, baseType: !872, size: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !941, file: !396, line: 577, baseType: !482, size: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !808, file: !396, line: 753, baseType: !946, size: 576)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !396, line: 600, size: 576, elements: !947)
!947 = !{!948, !949, !950, !953, !962}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !946, file: !396, line: 602, baseType: !872, size: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !946, file: !396, line: 605, baseType: !482, size: 64, offset: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !946, file: !396, line: 609, baseType: !951, size: 64, offset: 384)
!951 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !952, line: 46, baseType: !536)
!952 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!953 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !946, file: !396, line: 612, baseType: !954, size: 64, offset: 448)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !396, line: 581, size: 320, elements: !956)
!956 = !{!957, !958, !959, !960, !961}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !955, file: !396, line: 583, baseType: !132, size: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !955, file: !396, line: 586, baseType: !482, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !955, file: !396, line: 589, baseType: !482, size: 64, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !955, file: !396, line: 592, baseType: !482, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !955, file: !396, line: 595, baseType: !482, size: 64, offset: 256)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !946, file: !396, line: 616, baseType: !796, size: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !808, file: !396, line: 754, baseType: !964, size: 512)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !396, line: 622, size: 512, elements: !965)
!965 = !{!966, !967, !968, !969}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !964, file: !396, line: 624, baseType: !872, size: 320)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !964, file: !396, line: 628, baseType: !482, size: 64, offset: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !964, file: !396, line: 632, baseType: !482, size: 64, offset: 384)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !964, file: !396, line: 636, baseType: !482, size: 64, offset: 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !808, file: !396, line: 755, baseType: !971, size: 704)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !396, line: 642, size: 704, elements: !972)
!972 = !{!973, !974, !975, !976}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !971, file: !396, line: 644, baseType: !964, size: 512)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !971, file: !396, line: 648, baseType: !482, size: 64, offset: 512)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !971, file: !396, line: 652, baseType: !482, size: 64, offset: 576)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !971, file: !396, line: 653, baseType: !482, size: 64, offset: 640)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !808, file: !396, line: 756, baseType: !978, size: 448)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !396, line: 663, size: 448, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !978, file: !396, line: 665, baseType: !872, size: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !978, file: !396, line: 668, baseType: !482, size: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !978, file: !396, line: 673, baseType: !482, size: 64, offset: 384)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !808, file: !396, line: 757, baseType: !984, size: 384)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !396, line: 694, size: 384, elements: !985)
!985 = !{!986, !987}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !984, file: !396, line: 696, baseType: !872, size: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !984, file: !396, line: 699, baseType: !482, size: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !808, file: !396, line: 758, baseType: !989, size: 384)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !396, line: 681, size: 384, elements: !990)
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !989, file: !396, line: 683, baseType: !811, size: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !989, file: !396, line: 686, baseType: !482, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !989, file: !396, line: 689, baseType: !482, size: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !808, file: !396, line: 759, baseType: !995, size: 384)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !396, line: 707, size: 384, elements: !996)
!996 = !{!997, !998, !999}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !995, file: !396, line: 709, baseType: !811, size: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !995, file: !396, line: 712, baseType: !482, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !995, file: !396, line: 712, baseType: !482, size: 64, offset: 320)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !808, file: !396, line: 760, baseType: !1001, size: 320)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !396, line: 718, size: 320, elements: !1002)
!1002 = !{!1003, !1004}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1001, file: !396, line: 720, baseType: !811, size: 256)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1001, file: !396, line: 723, baseType: !482, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !803, file: !396, line: 138, baseType: !802, size: 64, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !803, file: !396, line: 139, baseType: !802, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !798, file: !396, line: 146, baseType: !801, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !798, file: !396, line: 152, baseType: !796, size: 64, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !793, file: !341, line: 130, baseType: !657, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !788, file: !341, line: 134, baseType: !473, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !788, file: !341, line: 137, baseType: !482, size: 64, offset: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !788, file: !341, line: 138, baseType: !607, size: 32, offset: 320)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !788, file: !341, line: 142, baseType: !5, size: 32, offset: 352)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !788, file: !341, line: 144, baseType: !469, size: 32, offset: 384)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !788, file: !341, line: 145, baseType: !469, size: 32, offset: 416)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !788, file: !341, line: 146, baseType: !1017, size: 64, offset: 448)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !341, line: 119, baseType: !538)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !771, file: !341, line: 220, baseType: !774, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !771, file: !341, line: 223, baseType: !473, size: 64, offset: 128)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !771, file: !341, line: 226, baseType: !1021, size: 64, offset: 192)
!1021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 100, size: 1216, elements: !1023)
!1023 = !{!1024, !1025, !1026, !1027, !1028, !1033, !1034, !1035, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1066, !1074, !1075}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1022, file: !328, line: 102, baseType: !469, size: 32)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1022, file: !328, line: 105, baseType: !5, size: 32, offset: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1022, file: !328, line: 108, baseType: !770, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1022, file: !328, line: 111, baseType: !770, size: 64, offset: 128)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1022, file: !328, line: 114, baseType: !1029, size: 64, offset: 192)
!1029 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !328, line: 41, size: 64, elements: !1030)
!1030 = !{!1031, !1032}
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1029, file: !328, line: 42, baseType: !327, size: 32)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1029, file: !328, line: 43, baseType: !5, size: 32, offset: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1022, file: !328, line: 117, baseType: !5, size: 32, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1022, file: !328, line: 120, baseType: !5, size: 32, offset: 288)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1022, file: !328, line: 123, baseType: !1036, size: 64, offset: 320)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !328, line: 87, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !328, line: 87, size: 128, elements: !1039)
!1039 = !{!1040}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1038, file: !328, line: 87, baseType: !1041, size: 128)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !328, line: 85, baseType: !1042)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !328, line: 85, size: 128, elements: !1043)
!1043 = !{!1044, !1045, !1046}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1042, file: !328, line: 85, baseType: !5, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1042, file: !328, line: 85, baseType: !5, size: 32, offset: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1042, file: !328, line: 85, baseType: !1047, size: 64, offset: 64)
!1047 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1048, size: 64, elements: !581)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !328, line: 84, baseType: !1021)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1022, file: !328, line: 126, baseType: !1021, size: 64, offset: 384)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !328, line: 129, baseType: !1021, size: 64, offset: 448)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1022, file: !328, line: 132, baseType: !473, size: 64, offset: 512)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1022, file: !328, line: 139, baseType: !482, size: 64, offset: 576)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1022, file: !328, line: 143, baseType: !531, size: 128, offset: 640)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1022, file: !328, line: 146, baseType: !531, size: 128, offset: 768)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1022, file: !328, line: 148, baseType: !468, size: 8, offset: 896)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1022, file: !328, line: 149, baseType: !468, size: 8, offset: 904)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1022, file: !328, line: 153, baseType: !336, size: 32, offset: 928)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1022, file: !328, line: 156, baseType: !1059, size: 64, offset: 960)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !328, line: 48, size: 320, elements: !1061)
!1061 = !{!1062, !1063, !1064, !1065}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1060, file: !328, line: 50, baseType: !806, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1060, file: !328, line: 59, baseType: !531, size: 128, offset: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1060, file: !328, line: 64, baseType: !468, size: 8, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1060, file: !328, line: 67, baseType: !1059, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1022, file: !328, line: 159, baseType: !1067, size: 64, offset: 1024)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !328, line: 72, size: 256, elements: !1069)
!1069 = !{!1070, !1071, !1072, !1073}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1068, file: !328, line: 74, baseType: !787, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1068, file: !328, line: 77, baseType: !1067, size: 64, offset: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1068, file: !328, line: 78, baseType: !1067, size: 64, offset: 128)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1068, file: !328, line: 81, baseType: !1067, size: 64, offset: 192)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1022, file: !328, line: 162, baseType: !468, size: 8, offset: 1088)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1022, file: !328, line: 166, baseType: !482, size: 64, offset: 1152)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !771, file: !341, line: 229, baseType: !1077, size: 128, offset: 256)
!1077 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1078, size: 128, elements: !725)
!1078 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1079, size: 64)
!1079 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !341, line: 229, flags: DIFlagFwdDecl)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !771, file: !341, line: 232, baseType: !770, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !771, file: !341, line: 233, baseType: !770, size: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !771, file: !341, line: 238, baseType: !1083, size: 64, offset: 512)
!1083 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !341, line: 235, size: 64, elements: !1084)
!1084 = !{!1085, !1091}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1083, file: !341, line: 236, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !341, line: 273, size: 128, elements: !1088)
!1088 = !{!1089, !1090}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1087, file: !341, line: 275, baseType: !796, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1087, file: !341, line: 278, baseType: !796, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1083, file: !341, line: 237, baseType: !1092, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1093, size: 64)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !341, line: 259, size: 320, elements: !1094)
!1094 = !{!1095, !1096, !1097, !1098, !1099}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1093, file: !341, line: 261, baseType: !657, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1093, file: !341, line: 262, baseType: !657, size: 64, offset: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1093, file: !341, line: 266, baseType: !657, size: 64, offset: 128)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1093, file: !341, line: 267, baseType: !657, size: 64, offset: 192)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1093, file: !341, line: 270, baseType: !469, size: 32, offset: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !771, file: !341, line: 241, baseType: !1017, size: 64, offset: 576)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !771, file: !341, line: 244, baseType: !469, size: 32, offset: 640)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !771, file: !341, line: 247, baseType: !469, size: 32, offset: 672)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !771, file: !341, line: 250, baseType: !469, size: 32, offset: 704)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !771, file: !341, line: 253, baseType: !469, size: 32, offset: 736)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !771, file: !341, line: 256, baseType: !469, size: 32, offset: 768)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !678, file: !660, line: 179, baseType: !1107, size: 64)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !660, line: 150, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !660, line: 142, size: 320, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1117, !1118}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1109, file: !660, line: 144, baseType: !482, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1109, file: !660, line: 145, baseType: !657, size: 64, offset: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1109, file: !660, line: 146, baseType: !657, size: 64, offset: 128)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1109, file: !660, line: 147, baseType: !1115, size: 32, offset: 192)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1116, line: 31, baseType: !469)
!1116 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1109, file: !660, line: 148, baseType: !5, size: 32, offset: 224)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1109, file: !660, line: 149, baseType: !468, size: 8, offset: 256)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !678, file: !660, line: 180, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !660, line: 162, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !660, line: 159, size: 128, elements: !1123)
!1123 = !{!1124, !1125}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1122, file: !660, line: 160, baseType: !482, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1122, file: !660, line: 161, baseType: !538, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !678, file: !660, line: 181, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !660, line: 181, flags: DIFlagFwdDecl)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !673, file: !660, line: 317, baseType: !1130, size: 64)
!1130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !538, size: 64, elements: !581)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !673, file: !660, line: 318, baseType: !1132, size: 320)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !660, line: 188, size: 320, elements: !1133)
!1133 = !{!1134, !1136, !1159}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1132, file: !660, line: 190, baseType: !1135, size: 192)
!1135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !677, size: 192, elements: !556)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1132, file: !660, line: 193, baseType: !1137, size: 64, offset: 192)
!1137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1138, size: 64)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !660, line: 206, size: 320, elements: !1139)
!1139 = !{!1140, !1144, !1145, !1146, !1158}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1138, file: !660, line: 208, baseType: !1141, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !483, line: 62, baseType: !1143)
!1143 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !483, line: 61, flags: DIFlagFwdDecl)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1138, file: !660, line: 211, baseType: !5, size: 32, offset: 64)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !660, line: 214, baseType: !538, size: 64, offset: 128)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1138, file: !660, line: 224, baseType: !1147, size: 64, offset: 192)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !660, line: 202, baseType: !1149)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !660, line: 202, size: 128, elements: !1150)
!1150 = !{!1151}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1149, file: !660, line: 202, baseType: !1152, size: 128)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !660, line: 200, baseType: !1153)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !660, line: 200, size: 128, elements: !1154)
!1154 = !{!1155, !1156, !1157}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1153, file: !660, line: 200, baseType: !5, size: 32)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1153, file: !660, line: 200, baseType: !5, size: 32, offset: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1153, file: !660, line: 200, baseType: !691, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1138, file: !660, line: 234, baseType: !1147, size: 64, offset: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1132, file: !660, line: 197, baseType: !538, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !673, file: !660, line: 319, baseType: !545, size: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !673, file: !660, line: 320, baseType: !564, size: 192)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !485, file: !133, line: 3384, baseType: !1163, size: 1472)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1164)
!1164 = !{!1165, !1186, !1187, !1188, !1189}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1163, file: !133, line: 3115, baseType: !1166, size: 1216)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1167)
!1167 = !{!1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1166, file: !133, line: 2985, baseType: !653, size: 960)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1166, file: !133, line: 2986, baseType: !482, size: 64, offset: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1166, file: !133, line: 2987, baseType: !482, size: 64, offset: 1024)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1166, file: !133, line: 2988, baseType: !482, size: 64, offset: 1088)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1166, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1166, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1166, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1166, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1166, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1166, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1166, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1166, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1166, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1166, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1166, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1166, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1166, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1166, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1163, file: !133, line: 3117, baseType: !482, size: 64, offset: 1216)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1163, file: !133, line: 3119, baseType: !482, size: 64, offset: 1280)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1163, file: !133, line: 3121, baseType: !482, size: 64, offset: 1344)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1163, file: !133, line: 3123, baseType: !482, size: 64, offset: 1408)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !485, file: !133, line: 3385, baseType: !1191, size: 1088)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1191, file: !133, line: 2875, baseType: !653, size: 960)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1191, file: !133, line: 2876, baseType: !657, size: 64, offset: 960)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1191, file: !133, line: 2877, baseType: !1196, size: 64, offset: 1024)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1198, line: 172, size: 128, elements: !1199)
!1198 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1199 = !{!1200, !1201, !1202, !1203, !1204, !1205, !1206}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1197, file: !1198, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1197, file: !1198, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1197, file: !1198, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1197, file: !1198, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1197, file: !1198, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1197, file: !1198, line: 195, baseType: !5, size: 32, offset: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1197, file: !1198, line: 199, baseType: !482, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !485, file: !133, line: 3386, baseType: !1166, size: 1216)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !485, file: !133, line: 3387, baseType: !1209, size: 1280)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1210)
!1210 = !{!1211, !1212}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1209, file: !133, line: 3094, baseType: !1166, size: 1216)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1209, file: !133, line: 3095, baseType: !1196, size: 64, offset: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !485, file: !133, line: 3388, baseType: !1214, size: 1216)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !1215)
!1215 = !{!1216, !1217, !1218, !1219, !1220, !1221}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1214, file: !133, line: 2825, baseType: !615, size: 896)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1214, file: !133, line: 2827, baseType: !482, size: 64, offset: 896)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1214, file: !133, line: 2828, baseType: !482, size: 64, offset: 960)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1214, file: !133, line: 2829, baseType: !482, size: 64, offset: 1024)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1214, file: !133, line: 2830, baseType: !482, size: 64, offset: 1088)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1214, file: !133, line: 2831, baseType: !482, size: 64, offset: 1152)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !485, file: !133, line: 3389, baseType: !1223, size: 1024)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !1224)
!1224 = !{!1225, !1226, !1227}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1223, file: !133, line: 2851, baseType: !653, size: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1223, file: !133, line: 2852, baseType: !469, size: 32, offset: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1223, file: !133, line: 2853, baseType: !469, size: 32, offset: 992)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !485, file: !133, line: 3390, baseType: !1229, size: 1024)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !1230)
!1230 = !{!1231, !1232}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1229, file: !133, line: 2858, baseType: !653, size: 960)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1229, file: !133, line: 2859, baseType: !1196, size: 64, offset: 960)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !485, file: !133, line: 3391, baseType: !1234, size: 960)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !133, line: 2862, size: 960, elements: !1235)
!1235 = !{!1236}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1234, file: !133, line: 2863, baseType: !653, size: 960)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !485, file: !133, line: 3392, baseType: !1238, size: 1472)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !133, line: 3304, size: 1472, elements: !1239)
!1239 = !{!1240}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1238, file: !133, line: 3305, baseType: !1163, size: 1472)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !485, file: !133, line: 3393, baseType: !1242, size: 1792)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !133, line: 3248, size: 1792, elements: !1243)
!1243 = !{!1244, !1245, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1242, file: !133, line: 3249, baseType: !1163, size: 1472)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1242, file: !133, line: 3251, baseType: !1246, size: 64, offset: 1472)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1248, line: 463, size: 1152, elements: !1249)
!1248 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1249 = !{!1250, !1253, !1284, !1285, !1400, !1408, !1409, !1410, !1411, !1412, !1413, !1437, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463}
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1247, file: !1248, line: 464, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1248, line: 464, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1247, file: !1248, line: 467, baseType: !1254, size: 64, offset: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !341, line: 374, size: 640, elements: !1256)
!1256 = !{!1257, !1259, !1260, !1273, !1274, !1275, !1276, !1277, !1278, !1280, !1282, !1283}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1255, file: !341, line: 377, baseType: !1258, size: 64)
