; ModuleID = 'sha1.bc'
source_filename = "sha1.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.sha1_ctx = type { i32, i32, i32, i32, i32, [2 x i32], i32, [32 x i32] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@fillbuf = internal constant <{ i8, [63 x i8] }> <{ i8 -128, [63 x i8] zeroinitializer }>, align 16, !dbg !0

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !30 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !45, metadata !DIExpression()), !dbg !47
  call void @llvm.dbg.value(metadata %struct.__va_list_tag* %__arg, metadata !46, metadata !DIExpression()), !dbg !47
  %0 = load %struct._IO_FILE*, %struct._IO_FILE** @stdout, align 8, !dbg !48
  %call = tail call i32 @vfprintf(%struct._IO_FILE* %0, i8* %__fmt, %struct.__va_list_tag* %__arg) #6, !dbg !49

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "fillbuf", scope: !2, file: !3, line: 51, type: !22, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !21, nameTableKind: None)
!3 = !DIFile(filename: "sha1.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{}
!5 = !{!6, !7, !8, !12, !14, !16, !19, !9}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "sha1_uint32", file: !10, line: 55, baseType: !11)
!10 = !DIFile(filename: "./include/sha1.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!11 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !17, line: 46, baseType: !18)
!17 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!18 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!21 = !{!0}
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 512, elements: !24)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!24 = !{!25}
!25 = !DISubrange(count: 64)
!26 = !{i32 2, !"Dwarf Version", i32 4}
!27 = !{i32 2, !"Debug Info Version", i32 3}
!28 = !{i32 1, !"wchar_size", i32 4}
!29 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!30 = distinct !DISubprogram(name: "vprintf", scope: !31, file: !31, line: 39, type: !32, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !44)
!31 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!32 = !DISubroutineType(types: !33)
!33 = !{!34, !35, !36}
!34 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!35 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !14)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !38)
!38 = !{!39, !40, !41, !43}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !37, file: !3, baseType: !11, size: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !37, file: !3, baseType: !11, size: 32, offset: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !37, file: !3, baseType: !42, size: 64, offset: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !37, file: !3, baseType: !42, size: 64, offset: 128)
!44 = !{!45, !46}
!45 = !DILocalVariable(name: "__fmt", arg: 1, scope: !30, file: !31, line: 39, type: !35)
!46 = !DILocalVariable(name: "__arg", arg: 2, scope: !30, file: !31, line: 39, type: !36)
!47 = !DILocation(line: 0, scope: !30)
!48 = !DILocation(line: 41, column: 20, scope: !30)
!49 = !DILocation(line: 41, column: 10, scope: !30)
!50 = !DILocation(line: 41, column: 3, scope: !30)
!51 = distinct !DISubprogram(name: "getchar", scope: !31, file: !31, line: 47, type: !52, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!52 = !DISubroutineType(types: !53)
!53 = !{!34}
!54 = !DILocation(line: 49, column: 16, scope: !51)
!55 = !DILocation(line: 49, column: 10, scope: !51)
!56 = !DILocation(line: 49, column: 3, scope: !51)
!57 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !31, file: !31, line: 56, type: !58, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !116)
!58 = !DISubroutineType(types: !59)
!59 = !{!34, !60}
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !62, line: 7, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !64, line: 49, size: 1728, elements: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !81, !83, !84, !85, !89, !91, !93, !97, !100, !102, !105, !108, !109, !110, !111, !112}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !63, file: !64, line: 51, baseType: !34, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !63, file: !64, line: 54, baseType: !12, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !63, file: !64, line: 55, baseType: !12, size: 64, offset: 128)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !63, file: !64, line: 56, baseType: !12, size: 64, offset: 192)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !63, file: !64, line: 57, baseType: !12, size: 64, offset: 256)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !63, file: !64, line: 58, baseType: !12, size: 64, offset: 320)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !63, file: !64, line: 59, baseType: !12, size: 64, offset: 384)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !63, file: !64, line: 60, baseType: !12, size: 64, offset: 448)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !63, file: !64, line: 61, baseType: !12, size: 64, offset: 512)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !63, file: !64, line: 64, baseType: !12, size: 64, offset: 576)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !63, file: !64, line: 65, baseType: !12, size: 64, offset: 640)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !63, file: !64, line: 66, baseType: !12, size: 64, offset: 704)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !63, file: !64, line: 68, baseType: !79, size: 64, offset: 768)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !64, line: 36, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !63, file: !64, line: 70, baseType: !82, size: 64, offset: 832)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !63, file: !64, line: 72, baseType: !34, size: 32, offset: 896)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !63, file: !64, line: 73, baseType: !34, size: 32, offset: 928)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !63, file: !64, line: 74, baseType: !86, size: 64, offset: 960)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !87, line: 152, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!88 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !63, file: !64, line: 77, baseType: !90, size: 16, offset: 1024)
!90 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !63, file: !64, line: 78, baseType: !92, size: 8, offset: 1040)
!92 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !63, file: !64, line: 79, baseType: !94, size: 8, offset: 1048)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 1)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !63, file: !64, line: 81, baseType: !98, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !64, line: 43, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !63, file: !64, line: 89, baseType: !101, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !87, line: 153, baseType: !88)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !63, file: !64, line: 91, baseType: !103, size: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !64, line: 37, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !63, file: !64, line: 92, baseType: !106, size: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !64, line: 38, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !63, file: !64, line: 93, baseType: !82, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !63, file: !64, line: 94, baseType: !42, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !63, file: !64, line: 95, baseType: !16, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !63, file: !64, line: 96, baseType: !34, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !63, file: !64, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !{!117}
!117 = !DILocalVariable(name: "__fp", arg: 1, scope: !57, file: !31, line: 56, type: !60)
!118 = !DILocation(line: 0, scope: !57)
!119 = !DILocation(line: 58, column: 10, scope: !57)
!120 = !DILocation(line: 58, column: 3, scope: !57)
!121 = distinct !DISubprogram(name: "getc_unlocked", scope: !31, file: !31, line: 66, type: !58, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !122)
!122 = !{!123}
!123 = !DILocalVariable(name: "__fp", arg: 1, scope: !121, file: !31, line: 66, type: !60)
!124 = !DILocation(line: 0, scope: !121)
!125 = !DILocation(line: 68, column: 10, scope: !121)
!126 = !DILocation(line: 68, column: 3, scope: !121)
!127 = distinct !DISubprogram(name: "getchar_unlocked", scope: !31, file: !31, line: 73, type: !52, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!128 = !DILocation(line: 75, column: 10, scope: !127)
!129 = !DILocation(line: 75, column: 3, scope: !127)
!130 = distinct !DISubprogram(name: "putchar", scope: !31, file: !31, line: 82, type: !131, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !133)
!131 = !DISubroutineType(types: !132)
!132 = !{!34, !34}
!133 = !{!134}
!134 = !DILocalVariable(name: "__c", arg: 1, scope: !130, file: !31, line: 82, type: !34)
!135 = !DILocation(line: 0, scope: !130)
!136 = !DILocation(line: 84, column: 21, scope: !130)
!137 = !DILocation(line: 84, column: 10, scope: !130)
!138 = !DILocation(line: 84, column: 3, scope: !130)
!139 = distinct !DISubprogram(name: "fputc_unlocked", scope: !31, file: !31, line: 91, type: !140, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !142)
!140 = !DISubroutineType(types: !141)
!141 = !{!34, !34, !60}
!142 = !{!143, !144}
!143 = !DILocalVariable(name: "__c", arg: 1, scope: !139, file: !31, line: 91, type: !34)
!144 = !DILocalVariable(name: "__stream", arg: 2, scope: !139, file: !31, line: 91, type: !60)
!145 = !DILocation(line: 0, scope: !139)
!146 = !DILocation(line: 93, column: 10, scope: !139)
!147 = !DILocation(line: 93, column: 3, scope: !139)
!148 = distinct !DISubprogram(name: "putc_unlocked", scope: !31, file: !31, line: 101, type: !140, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !149)
!149 = !{!150, !151}
!150 = !DILocalVariable(name: "__c", arg: 1, scope: !148, file: !31, line: 101, type: !34)
!151 = !DILocalVariable(name: "__stream", arg: 2, scope: !148, file: !31, line: 101, type: !60)
!152 = !DILocation(line: 0, scope: !148)
!153 = !DILocation(line: 103, column: 10, scope: !148)
!154 = !DILocation(line: 103, column: 3, scope: !148)
!155 = distinct !DISubprogram(name: "putchar_unlocked", scope: !31, file: !31, line: 108, type: !131, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !156)
!156 = !{!157}
!157 = !DILocalVariable(name: "__c", arg: 1, scope: !155, file: !31, line: 108, type: !34)
!158 = !DILocation(line: 0, scope: !155)
!159 = !DILocation(line: 110, column: 10, scope: !155)
!160 = !DILocation(line: 110, column: 3, scope: !155)
!161 = distinct !DISubprogram(name: "getline", scope: !31, file: !31, line: 118, type: !162, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !167)
!162 = !DISubroutineType(types: !163)
!163 = !{!164, !165, !166, !60}
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !87, line: 193, baseType: !88)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!167 = !{!168, !169, !170}
!168 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !161, file: !31, line: 118, type: !165)
!169 = !DILocalVariable(name: "__n", arg: 2, scope: !161, file: !31, line: 118, type: !166)
!170 = !DILocalVariable(name: "__stream", arg: 3, scope: !161, file: !31, line: 118, type: !60)
!171 = !DILocation(line: 0, scope: !161)
!172 = !DILocation(line: 120, column: 10, scope: !161)
!173 = !DILocation(line: 120, column: 3, scope: !161)
!174 = distinct !DISubprogram(name: "feof_unlocked", scope: !31, file: !31, line: 128, type: !58, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !175)
!175 = !{!176}
!176 = !DILocalVariable(name: "__stream", arg: 1, scope: !174, file: !31, line: 128, type: !60)
!177 = !DILocation(line: 0, scope: !174)
!178 = !DILocation(line: 130, column: 10, scope: !174)
!179 = !DILocation(line: 130, column: 3, scope: !174)
!180 = distinct !DISubprogram(name: "ferror_unlocked", scope: !31, file: !31, line: 135, type: !58, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !181)
!181 = !{!182}
!182 = !DILocalVariable(name: "__stream", arg: 1, scope: !180, file: !31, line: 135, type: !60)
!183 = !DILocation(line: 0, scope: !180)
!184 = !DILocation(line: 137, column: 10, scope: !180)
!185 = !DILocation(line: 137, column: 3, scope: !180)
!186 = distinct !DISubprogram(name: "sha1_init_ctx", scope: !3, file: !3, line: 58, type: !187, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !206)
!187 = !DISubroutineType(types: !188)
!188 = !{null, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sha1_ctx", file: !10, line: 76, size: 1280, elements: !191)
!191 = !{!192, !193, !194, !195, !196, !197, !201, !202}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !190, file: !10, line: 78, baseType: !9, size: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "B", scope: !190, file: !10, line: 79, baseType: !9, size: 32, offset: 32)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "C", scope: !190, file: !10, line: 80, baseType: !9, size: 32, offset: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "D", scope: !190, file: !10, line: 81, baseType: !9, size: 32, offset: 96)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "E", scope: !190, file: !10, line: 82, baseType: !9, size: 32, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "total", scope: !190, file: !10, line: 84, baseType: !198, size: 64, offset: 160)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 64, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 2)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "buflen", scope: !190, file: !10, line: 85, baseType: !9, size: 32, offset: 224)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "buffer", scope: !190, file: !10, line: 86, baseType: !203, size: 1024, offset: 256)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 1024, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 32)
!206 = !{!207}
!207 = !DILocalVariable(name: "ctx", arg: 1, scope: !186, file: !3, line: 58, type: !189)
!208 = !DILocation(line: 0, scope: !186)
!209 = !DILocation(line: 60, column: 8, scope: !186)
!210 = !DILocation(line: 60, column: 10, scope: !186)
!211 = !DILocation(line: 61, column: 8, scope: !186)
!212 = !DILocation(line: 61, column: 10, scope: !186)
!213 = !DILocation(line: 62, column: 8, scope: !186)
!214 = !DILocation(line: 62, column: 10, scope: !186)
!215 = !DILocation(line: 63, column: 8, scope: !186)
!216 = !DILocation(line: 63, column: 10, scope: !186)
!217 = !DILocation(line: 64, column: 8, scope: !186)
!218 = !DILocation(line: 64, column: 10, scope: !186)
!219 = !DILocation(line: 66, column: 19, scope: !186)
!220 = !DILocation(line: 66, column: 33, scope: !186)
!221 = !DILocation(line: 66, column: 3, scope: !186)
!222 = !DILocation(line: 66, column: 17, scope: !186)
!223 = !DILocation(line: 67, column: 8, scope: !186)
!224 = !DILocation(line: 67, column: 15, scope: !186)
!225 = !DILocation(line: 68, column: 1, scope: !186)
!226 = distinct !DISubprogram(name: "sha1_read_ctx", scope: !3, file: !3, line: 76, type: !227, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !231)
!227 = !DISubroutineType(types: !228)
!228 = !{!42, !229, !42}
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !190)
!231 = !{!232, !233}
!232 = !DILocalVariable(name: "ctx", arg: 1, scope: !226, file: !3, line: 76, type: !229)
!233 = !DILocalVariable(name: "resbuf", arg: 2, scope: !226, file: !3, line: 76, type: !42)
!234 = !DILocation(line: 0, scope: !226)
!235 = !DILocation(line: 78, column: 33, scope: !226)
!236 = !DILocation(line: 78, column: 4, scope: !226)
!237 = !DILocation(line: 78, column: 31, scope: !226)
!238 = !DILocation(line: 79, column: 33, scope: !226)
!239 = !DILocation(line: 79, column: 3, scope: !226)
!240 = !DILocation(line: 79, column: 31, scope: !226)
!241 = !DILocation(line: 80, column: 33, scope: !226)
!242 = !DILocation(line: 80, column: 3, scope: !226)
!243 = !DILocation(line: 80, column: 31, scope: !226)
!244 = !DILocation(line: 81, column: 33, scope: !226)
!245 = !DILocation(line: 81, column: 3, scope: !226)
!246 = !DILocation(line: 81, column: 31, scope: !226)
!247 = !DILocation(line: 82, column: 33, scope: !226)
!248 = !DILocation(line: 82, column: 3, scope: !226)
!249 = !DILocation(line: 82, column: 31, scope: !226)
!250 = !DILocation(line: 84, column: 3, scope: !226)
!251 = distinct !DISubprogram(name: "sha1_finish_ctx", scope: !3, file: !3, line: 93, type: !252, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !254)
!252 = !DISubroutineType(types: !253)
!253 = !{!42, !189, !42}
!254 = !{!255, !256, !257, !258}
!255 = !DILocalVariable(name: "ctx", arg: 1, scope: !251, file: !3, line: 93, type: !189)
!256 = !DILocalVariable(name: "resbuf", arg: 2, scope: !251, file: !3, line: 93, type: !42)
!257 = !DILocalVariable(name: "bytes", scope: !251, file: !3, line: 96, type: !9)
!258 = !DILocalVariable(name: "size", scope: !251, file: !3, line: 97, type: !16)
!259 = !DILocation(line: 0, scope: !251)
!260 = !DILocation(line: 96, column: 28, scope: !251)
!261 = !DILocation(line: 97, column: 24, scope: !251)
!262 = !DILocation(line: 97, column: 17, scope: !251)
!263 = !DILocation(line: 100, column: 3, scope: !251)
!264 = !DILocation(line: 100, column: 17, scope: !251)
!265 = !DILocation(line: 101, column: 21, scope: !266)
!266 = distinct !DILexicalBlock(scope: !251, file: !3, line: 101, column: 7)
!267 = !DILocation(line: 101, column: 7, scope: !251)
