; ModuleID = 'simplify-rtx.bc'
source_filename = "simplify-rtx.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!474 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!475 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!476 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!477 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!478 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!479 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!480 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!481 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!482 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!483 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!484 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!485 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!486 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!487 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!488 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!489 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!490 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!491 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!492 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!493 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!494 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!495 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!496 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!497 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!498 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!499 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!500 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!501 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!502 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!503 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!504 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!505 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!506 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!507 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!508 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!509 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!510 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!511 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!512 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!513 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!514 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!515 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!516 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!517 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!518 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!519 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!520 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!521 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!522 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!523 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!524 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!525 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!526 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!527 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!528 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!529 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!530 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!531 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!532 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!533 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!534 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!535 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!536 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!537 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!538 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!539 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!540 = !{!541, !542, !543, !544, !547, !548, !375, !550, !397, !551, !552, !3, !181, !567, !653, !5, !1623}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!543 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!544 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !545, size: 64)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !546)
!550 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!551 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !554)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !555, line: 52, size: 256, elements: !556)
!555 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!556 = !{!557, !558, !559, !560, !561, !562, !563}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !554, file: !555, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !554, file: !555, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !554, file: !555, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !554, file: !555, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !554, file: !555, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !554, file: !555, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !554, file: !555, line: 62, baseType: !564, size: 192, offset: 64)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 192, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 3)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !568, line: 50, baseType: !569)
!568 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !398, line: 240, size: 384, elements: !571)
!571 = !{!572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !570, file: !398, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !570, file: !398, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !570, file: !398, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !570, file: !398, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !570, file: !398, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !570, file: !398, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !570, file: !398, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !570, file: !398, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !570, file: !398, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !570, file: !398, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !570, file: !398, line: 321, baseType: !583, size: 320, offset: 64)
!583 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !398, line: 315, size: 320, elements: !584)
!584 = !{!585, !1558, !1560, !1621, !1622}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !583, file: !398, line: 316, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 64, elements: !602)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !398, line: 183, baseType: !588)
!588 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !398, line: 166, size: 64, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !604, !605, !617, !620, !681, !1536, !1537, !1548, !1555}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !588, file: !398, line: 168, baseType: !543, size: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !588, file: !398, line: 169, baseType: !5, size: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !588, file: !398, line: 170, baseType: !548, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !588, file: !398, line: 171, baseType: !567, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !588, file: !398, line: 172, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !568, line: 53, baseType: !596)
!596 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !597, size: 64)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !398, line: 359, size: 128, elements: !598)
!598 = !{!599, !600}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !597, file: !398, line: 360, baseType: !543, size: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !597, file: !398, line: 361, baseType: !601, size: 64, offset: 64)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 64, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 1)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !588, file: !398, line: 173, baseType: !3, size: 32)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !588, file: !398, line: 174, baseType: !606, size: 32)
!606 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !398, line: 133, baseType: !607)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !398, line: 115, size: 32, elements: !608)
!608 = !{!609, !610, !611, !612, !613, !614, !615, !616}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !607, file: !398, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !607, file: !398, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !607, file: !398, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !607, file: !398, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !607, file: !398, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !607, file: !398, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !607, file: !398, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !607, file: !398, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !588, file: !398, line: 175, baseType: !618, size: 64)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64)
!619 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !398, line: 175, flags: DIFlagFwdDecl)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !588, file: !398, line: 176, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !622, size: 64)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !623, line: 75, size: 256, elements: !624)
!623 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!624 = !{!625, !639, !640, !641}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !622, file: !623, line: 76, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !623, line: 68, baseType: !628)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !623, line: 63, size: 320, elements: !629)
!629 = !{!630, !632, !633, !634}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !628, file: !623, line: 64, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !628, file: !623, line: 65, baseType: !631, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !628, file: !623, line: 66, baseType: !5, size: 32, offset: 128)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !628, file: !623, line: 67, baseType: !635, size: 128, offset: 192)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 128, elements: !637)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !623, line: 29, baseType: !551)
!637 = !{!638}
!638 = !DISubrange(count: 2)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !622, file: !623, line: 77, baseType: !626, size: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !622, file: !623, line: 78, baseType: !5, size: 32, offset: 128)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !622, file: !623, line: 79, baseType: !642, size: 64, offset: 192)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !623, line: 49, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !623, line: 45, size: 832, elements: !645)
!645 = !{!646, !647, !648}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !644, file: !623, line: 46, baseType: !631, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !644, file: !623, line: 47, baseType: !621, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !644, file: !623, line: 48, baseType: !649, size: 704, offset: 128)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !650, line: 164, size: 704, elements: !651)
!650 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!651 = !{!652, !654, !664, !665, !666, !667, !668, !669, !673, !677, !678, !679, !680}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !649, file: !650, line: 166, baseType: !653, size: 64)
!653 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !649, file: !650, line: 167, baseType: !655, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !650, line: 157, size: 192, elements: !657)
!657 = !{!658, !659, !660}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !656, file: !650, line: 159, baseType: !545, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !656, file: !650, line: 160, baseType: !655, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !656, file: !650, line: 161, baseType: !661, size: 32, offset: 128)
!661 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 32, elements: !662)
!662 = !{!663}
!663 = !DISubrange(count: 4)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !649, file: !650, line: 168, baseType: !545, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !649, file: !650, line: 169, baseType: !545, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !649, file: !650, line: 170, baseType: !545, size: 64, offset: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !649, file: !650, line: 171, baseType: !653, size: 64, offset: 320)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !649, file: !650, line: 172, baseType: !543, size: 32, offset: 384)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !649, file: !650, line: 176, baseType: !670, size: 64, offset: 448)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DISubroutineType(types: !672)
!672 = !{!655, !547, !653}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !649, file: !650, line: 177, baseType: !674, size: 64, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DISubroutineType(types: !676)
!676 = !{null, !547, !655}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !649, file: !650, line: 178, baseType: !547, size: 64, offset: 576)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !649, file: !650, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !649, file: !650, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !649, file: !650, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !588, file: !398, line: 177, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !568, line: 56, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !685)
!685 = !{!686, !719, !725, !736, !742, !753, !758, !765, !771, !784, !796, !834, !839, !867, !875, !876, !881, !890, !896, !901, !905, !909, !1160, !1209, !1215, !1222, !1229, !1255, !1280, !1297, !1309, !1331, !1346, !1518}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !684, file: !149, line: 3372, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !688)
!688 = !{!689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !687, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !687, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !687, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !687, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !687, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !687, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !687, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !687, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !687, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !687, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !687, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !687, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !687, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !687, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !687, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !687, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !687, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !687, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !687, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !687, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !687, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !687, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !687, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !687, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !687, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !687, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !687, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !687, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !687, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !687, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !684, file: !149, line: 3373, baseType: !720, size: 192)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !720, file: !149, line: 403, baseType: !687, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !720, file: !149, line: 404, baseType: !682, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !720, file: !149, line: 405, baseType: !682, size: 64, offset: 128)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !684, file: !149, line: 3374, baseType: !726, size: 320)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !726, file: !149, line: 1385, baseType: !720, size: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !726, file: !149, line: 1386, baseType: !730, size: 128, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !731, line: 58, baseType: !732)
!731 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !731, line: 54, size: 128, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !732, file: !731, line: 56, baseType: !551, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !732, file: !731, line: 57, baseType: !653, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !684, file: !149, line: 3375, baseType: !737, size: 256)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !737, file: !149, line: 1398, baseType: !720, size: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !737, file: !149, line: 1399, baseType: !741, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !684, file: !149, line: 3376, baseType: !743, size: 256)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !149, line: 1409, baseType: !720, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !743, file: !149, line: 1410, baseType: !747, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !749, line: 27, size: 192, elements: !750)
!749 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !748, file: !749, line: 29, baseType: !730, size: 128)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !748, file: !749, line: 30, baseType: !3, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !684, file: !149, line: 3377, baseType: !754, size: 256)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !149, line: 1438, baseType: !720, size: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !754, file: !149, line: 1439, baseType: !682, size: 64, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !684, file: !149, line: 3378, baseType: !759, size: 256)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !760)
!760 = !{!761, !762, !763}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !759, file: !149, line: 1419, baseType: !720, size: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !759, file: !149, line: 1420, baseType: !543, size: 32, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !759, file: !149, line: 1421, baseType: !764, size: 8, offset: 224)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !546, size: 8, elements: !602)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !684, file: !149, line: 3379, baseType: !766, size: 320)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !767)
!767 = !{!768, !769, !770}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !766, file: !149, line: 1429, baseType: !720, size: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !766, file: !149, line: 1430, baseType: !682, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !766, file: !149, line: 1431, baseType: !682, size: 64, offset: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !684, file: !149, line: 3380, baseType: !772, size: 320)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !149, line: 1461, baseType: !720, size: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !772, file: !149, line: 1462, baseType: !776, size: 128, offset: 192)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !777, line: 31, size: 128, elements: !778)
!777 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!778 = !{!779, !782, !783}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !776, file: !777, line: 32, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !542)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !776, file: !777, line: 33, baseType: !5, size: 32, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !776, file: !777, line: 34, baseType: !5, size: 32, offset: 96)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !684, file: !149, line: 3381, baseType: !785, size: 384)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !786)
!786 = !{!787, !788, !793, !794, !795}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !785, file: !149, line: 2508, baseType: !720, size: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !785, file: !149, line: 2509, baseType: !789, size: 32, offset: 192)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !790, line: 58, baseType: !791)
!790 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !792, line: 44, baseType: !5)
!792 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!793 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !785, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !785, file: !149, line: 2511, baseType: !682, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !785, file: !149, line: 2512, baseType: !682, size: 64, offset: 320)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !684, file: !149, line: 3382, baseType: !797, size: 896)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !798)
!798 = !{!799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !149, line: 2653, baseType: !785, size: 384)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !797, file: !149, line: 2654, baseType: !682, size: 64, offset: 384)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !797, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !797, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !797, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !797, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !797, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !797, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !797, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !797, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !797, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !797, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !797, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !797, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !797, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !797, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !797, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !797, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !797, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !797, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !797, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !797, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !797, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !797, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !797, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !797, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !797, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !797, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !797, file: !149, line: 2705, baseType: !682, size: 64, offset: 576)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !797, file: !149, line: 2706, baseType: !682, size: 64, offset: 640)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !797, file: !149, line: 2707, baseType: !682, size: 64, offset: 704)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !797, file: !149, line: 2708, baseType: !682, size: 64, offset: 768)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !797, file: !149, line: 2711, baseType: !832, size: 64, offset: 832)
!832 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !833, size: 64)
!833 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !684, file: !149, line: 3383, baseType: !835, size: 960)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !836)
!836 = !{!837, !838}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !835, file: !149, line: 2757, baseType: !797, size: 896)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !835, file: !149, line: 2758, baseType: !567, size: 64, offset: 896)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !684, file: !149, line: 3384, baseType: !840, size: 1472)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !841)
!841 = !{!842, !863, !864, !865, !866}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !840, file: !149, line: 3115, baseType: !843, size: 1216)
!843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !844)
!844 = !{!845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862}
!845 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !843, file: !149, line: 2985, baseType: !835, size: 960)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !843, file: !149, line: 2986, baseType: !682, size: 64, offset: 960)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !843, file: !149, line: 2987, baseType: !682, size: 64, offset: 1024)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !843, file: !149, line: 2988, baseType: !682, size: 64, offset: 1088)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !843, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !843, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !843, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !843, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !843, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !843, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !843, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !843, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !843, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !843, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !843, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !843, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !843, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !843, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !840, file: !149, line: 3117, baseType: !682, size: 64, offset: 1216)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !840, file: !149, line: 3119, baseType: !682, size: 64, offset: 1280)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !840, file: !149, line: 3121, baseType: !682, size: 64, offset: 1344)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !840, file: !149, line: 3123, baseType: !682, size: 64, offset: 1408)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !684, file: !149, line: 3385, baseType: !868, size: 1088)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !869)
!869 = !{!870, !871, !872}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !868, file: !149, line: 2875, baseType: !835, size: 960)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !868, file: !149, line: 2876, baseType: !567, size: 64, offset: 960)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !868, file: !149, line: 2877, baseType: !873, size: 64, offset: 1024)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !149, line: 2856, flags: DIFlagFwdDecl)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !684, file: !149, line: 3386, baseType: !843, size: 1216)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !684, file: !149, line: 3387, baseType: !877, size: 1280)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !877, file: !149, line: 3094, baseType: !843, size: 1216)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !877, file: !149, line: 3095, baseType: !873, size: 64, offset: 1216)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !684, file: !149, line: 3388, baseType: !882, size: 1216)
!882 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !883)
!883 = !{!884, !885, !886, !887, !888, !889}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !882, file: !149, line: 2825, baseType: !797, size: 896)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !882, file: !149, line: 2827, baseType: !682, size: 64, offset: 896)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !882, file: !149, line: 2828, baseType: !682, size: 64, offset: 960)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !882, file: !149, line: 2829, baseType: !682, size: 64, offset: 1024)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !882, file: !149, line: 2830, baseType: !682, size: 64, offset: 1088)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !882, file: !149, line: 2831, baseType: !682, size: 64, offset: 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !684, file: !149, line: 3389, baseType: !891, size: 1024)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !149, line: 2851, baseType: !835, size: 960)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !891, file: !149, line: 2852, baseType: !543, size: 32, offset: 960)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !891, file: !149, line: 2853, baseType: !543, size: 32, offset: 992)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !684, file: !149, line: 3390, baseType: !897, size: 1024)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !897, file: !149, line: 2858, baseType: !835, size: 960)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !897, file: !149, line: 2859, baseType: !873, size: 64, offset: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !684, file: !149, line: 3391, baseType: !902, size: 960)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !903)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !149, line: 2863, baseType: !835, size: 960)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !684, file: !149, line: 3392, baseType: !906, size: 1472)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !907)
!907 = !{!908}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !906, file: !149, line: 3305, baseType: !840, size: 1472)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !684, file: !149, line: 3393, baseType: !910, size: 1792)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !911)
!911 = !{!912, !913, !1139, !1140, !1141, !1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !910, file: !149, line: 3249, baseType: !840, size: 1472)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !910, file: !149, line: 3251, baseType: !914, size: 64, offset: 1472)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !916, line: 463, size: 1152, elements: !917)
!916 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!917 = !{!918, !921, !1025, !1026, !1029, !1032, !1084, !1085, !1086, !1087, !1088, !1112, !1115, !1116, !1117, !1118, !1119, !1120, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !915, file: !916, line: 464, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !916, line: 464, flags: DIFlagFwdDecl)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !915, file: !916, line: 467, baseType: !922, size: 64, offset: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !924)
!924 = !{!925, !1000, !1001, !1014, !1015, !1016, !1017, !1018, !1019, !1021, !1023, !1024}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !923, file: !133, line: 377, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !568, line: 111, baseType: !927)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !929)
!929 = !{!930, !965, !966, !967, !970, !974, !975, !976, !994, !995, !996, !997, !998, !999}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !928, file: !133, line: 219, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !934)
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !933, file: !133, line: 151, baseType: !936, size: 128)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !937, file: !133, line: 150, baseType: !5, size: 32)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !937, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !937, file: !133, line: 150, baseType: !942, size: 64, offset: 64)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !943, size: 64, elements: !602)
!943 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !568, line: 108, baseType: !944)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !946)
!946 = !{!947, !948, !949, !957, !958, !959, !960, !961, !962, !963}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !945, file: !133, line: 124, baseType: !927, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !945, file: !133, line: 125, baseType: !927, size: 64, offset: 64)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !945, file: !133, line: 131, baseType: !950, size: 64, offset: 128)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !951)
!951 = !{!952, !956}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !950, file: !133, line: 129, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !568, line: 66, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !568, line: 65, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !950, file: !133, line: 130, baseType: !567, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !945, file: !133, line: 134, baseType: !547, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !945, file: !133, line: 137, baseType: !682, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !945, file: !133, line: 138, baseType: !789, size: 32, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !945, file: !133, line: 142, baseType: !5, size: 32, offset: 352)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !945, file: !133, line: 144, baseType: !543, size: 32, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !945, file: !133, line: 145, baseType: !543, size: 32, offset: 416)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !945, file: !133, line: 146, baseType: !964, size: 64, offset: 448)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !133, line: 119, baseType: !653)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !928, file: !133, line: 220, baseType: !931, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !928, file: !133, line: 223, baseType: !547, size: 64, offset: 128)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !928, file: !133, line: 226, baseType: !968, size: 64, offset: 192)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !133, line: 185, flags: DIFlagFwdDecl)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !928, file: !133, line: 229, baseType: !971, size: 128, offset: 256)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 128, elements: !637)
!972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !973, size: 64)
!973 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !133, line: 229, flags: DIFlagFwdDecl)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !928, file: !133, line: 232, baseType: !927, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !928, file: !133, line: 233, baseType: !927, size: 64, offset: 448)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !928, file: !133, line: 238, baseType: !977, size: 64, offset: 512)
!977 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !133, line: 235, size: 64, elements: !978)
!978 = !{!979, !985}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !977, file: !133, line: 236, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !133, line: 273, size: 128, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !981, file: !133, line: 275, baseType: !953, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !981, file: !133, line: 278, baseType: !953, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !977, file: !133, line: 237, baseType: !986, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !987, size: 64)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !133, line: 259, size: 320, elements: !988)
!988 = !{!989, !990, !991, !992, !993}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !987, file: !133, line: 261, baseType: !567, size: 64)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !987, file: !133, line: 262, baseType: !567, size: 64, offset: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !987, file: !133, line: 266, baseType: !567, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !987, file: !133, line: 267, baseType: !567, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !987, file: !133, line: 270, baseType: !543, size: 32, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !928, file: !133, line: 241, baseType: !964, size: 64, offset: 576)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !928, file: !133, line: 244, baseType: !543, size: 32, offset: 640)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !928, file: !133, line: 247, baseType: !543, size: 32, offset: 672)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !928, file: !133, line: 250, baseType: !543, size: 32, offset: 704)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !928, file: !133, line: 253, baseType: !543, size: 32, offset: 736)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !928, file: !133, line: 256, baseType: !543, size: 32, offset: 768)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !923, file: !133, line: 378, baseType: !926, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !923, file: !133, line: 381, baseType: !1002, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !1005)
!1005 = !{!1006}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1004, file: !133, line: 282, baseType: !1007, size: 128)
!1007 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !1008)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !1009)
!1009 = !{!1010, !1011, !1012}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1008, file: !133, line: 281, baseType: !5, size: 32)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1008, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1008, file: !133, line: 281, baseType: !1013, size: 64, offset: 64)
!1013 = !DICompositeType(tag: DW_TAG_array_type, baseType: !926, size: 64, elements: !602)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !923, file: !133, line: 384, baseType: !543, size: 32, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !923, file: !133, line: 387, baseType: !543, size: 32, offset: 224)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !923, file: !133, line: 390, baseType: !543, size: 32, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !923, file: !133, line: 394, baseType: !1002, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !923, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !923, file: !133, line: 399, baseType: !1020, size: 64, offset: 416)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !637)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !923, file: !133, line: 402, baseType: !1022, size: 64, offset: 480)
!1022 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !637)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !923, file: !133, line: 406, baseType: !543, size: 32, offset: 544)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !923, file: !133, line: 409, baseType: !543, size: 32, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !915, file: !916, line: 470, baseType: !954, size: 64, offset: 128)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !915, file: !916, line: 473, baseType: !1027, size: 64, offset: 192)
!1027 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1028, size: 64)
!1028 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !916, line: 166, flags: DIFlagFwdDecl)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !915, file: !916, line: 476, baseType: !1030, size: 64, offset: 256)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !916, line: 476, flags: DIFlagFwdDecl)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !915, file: !916, line: 479, baseType: !1033, size: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1034, line: 144, baseType: !1035)
!1034 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1034, line: 100, size: 896, elements: !1037)
!1037 = !{!1038, !1046, !1051, !1056, !1058, !1061, !1062, !1063, !1064, !1065, !1070, !1072, !1073, !1078, !1083}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1036, file: !1034, line: 102, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1034, line: 52, baseType: !1040)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = !DISubroutineType(types: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1034, line: 47, baseType: !5)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1036, file: !1034, line: 105, baseType: !1047, size: 64, offset: 64)
!1047 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1034, line: 59, baseType: !1048)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DISubroutineType(types: !1050)
!1050 = !{!543, !1044, !1044}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1036, file: !1034, line: 108, baseType: !1052, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1034, line: 63, baseType: !1053)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DISubroutineType(types: !1055)
!1055 = !{null, !547}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1036, file: !1034, line: 111, baseType: !1057, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1036, file: !1034, line: 114, baseType: !1059, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1060, line: 46, baseType: !551)
!1060 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1036, file: !1034, line: 117, baseType: !1059, size: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1036, file: !1034, line: 120, baseType: !1059, size: 64, offset: 384)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1036, file: !1034, line: 124, baseType: !5, size: 32, offset: 448)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1036, file: !1034, line: 128, baseType: !5, size: 32, offset: 480)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1036, file: !1034, line: 131, baseType: !1066, size: 64, offset: 512)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1034, line: 75, baseType: !1067)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DISubroutineType(types: !1069)
!1069 = !{!547, !1059, !1059}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1036, file: !1034, line: 132, baseType: !1071, size: 64, offset: 576)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1034, line: 78, baseType: !1053)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1036, file: !1034, line: 135, baseType: !547, size: 64, offset: 640)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1036, file: !1034, line: 136, baseType: !1074, size: 64, offset: 704)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1034, line: 82, baseType: !1075)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DISubroutineType(types: !1077)
!1077 = !{!547, !547, !1059, !1059}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1036, file: !1034, line: 137, baseType: !1079, size: 64, offset: 768)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1034, line: 83, baseType: !1080)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{null, !547, !547}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1036, file: !1034, line: 141, baseType: !5, size: 32, offset: 832)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !915, file: !916, line: 484, baseType: !682, size: 64, offset: 384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !915, file: !916, line: 488, baseType: !682, size: 64, offset: 448)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !915, file: !916, line: 493, baseType: !682, size: 64, offset: 512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !915, file: !916, line: 496, baseType: !682, size: 64, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !915, file: !916, line: 501, baseType: !1089, size: 64, offset: 640)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1091)
!1091 = !{!1092, !1095, !1096, !1097, !1098, !1100, !1101, !1106, !1107, !1108, !1109, !1110, !1111}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1090, file: !144, line: 2356, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1090, file: !144, line: 2357, baseType: !548, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1090, file: !144, line: 2358, baseType: !543, size: 32, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1090, file: !144, line: 2359, baseType: !543, size: 32, offset: 160)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1090, file: !144, line: 2360, baseType: !1099, size: 128, offset: 192)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !543, size: 128, elements: !662)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1090, file: !144, line: 2364, baseType: !543, size: 32, offset: 320)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1090, file: !144, line: 2367, baseType: !1102, size: 128, offset: 384)
!1102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1103)
!1103 = !{!1104, !1105}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1102, file: !144, line: 2351, baseType: !567, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1102, file: !144, line: 2352, baseType: !653, size: 64, offset: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1090, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1090, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1090, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1090, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1090, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1090, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !915, file: !916, line: 504, baseType: !1113, size: 64, offset: 704)
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !916, line: 504, flags: DIFlagFwdDecl)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !915, file: !916, line: 507, baseType: !1033, size: 64, offset: 768)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !915, file: !916, line: 510, baseType: !543, size: 32, offset: 832)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !915, file: !916, line: 513, baseType: !543, size: 32, offset: 864)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !915, file: !916, line: 516, baseType: !789, size: 32, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !915, file: !916, line: 519, baseType: !789, size: 32, offset: 928)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !915, file: !916, line: 522, baseType: !5, size: 32, offset: 960)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !915, file: !916, line: 523, baseType: !5, size: 32, offset: 992)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !915, file: !916, line: 528, baseType: !548, size: 64, offset: 1024)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !915, file: !916, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !915, file: !916, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !915, file: !916, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !915, file: !916, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !915, file: !916, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !915, file: !916, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !915, file: !916, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !915, file: !916, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !915, file: !916, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !915, file: !916, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !915, file: !916, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !915, file: !916, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !915, file: !916, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !915, file: !916, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !915, file: !916, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !915, file: !916, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !910, file: !149, line: 3254, baseType: !682, size: 64, offset: 1536)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !910, file: !149, line: 3257, baseType: !682, size: 64, offset: 1600)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !910, file: !149, line: 3258, baseType: !682, size: 64, offset: 1664)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !910, file: !149, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !910, file: !149, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !910, file: !149, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !910, file: !149, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !910, file: !149, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !910, file: !149, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !910, file: !149, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !910, file: !149, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !910, file: !149, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !910, file: !149, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !910, file: !149, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !910, file: !149, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !910, file: !149, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !910, file: !149, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !910, file: !149, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !910, file: !149, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !910, file: !149, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !910, file: !149, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !149, line: 3394, baseType: !1161, size: 1344)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !149, line: 2279, size: 1344, elements: !1162)
!1162 = !{!1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1188, !1189, !1190, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1161, file: !149, line: 2280, baseType: !720, size: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1161, file: !149, line: 2281, baseType: !682, size: 64, offset: 192)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1161, file: !149, line: 2282, baseType: !682, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1161, file: !149, line: 2283, baseType: !682, size: 64, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1161, file: !149, line: 2284, baseType: !682, size: 64, offset: 384)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1161, file: !149, line: 2285, baseType: !5, size: 32, offset: 448)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1161, file: !149, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1161, file: !149, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1161, file: !149, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1161, file: !149, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1161, file: !149, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1161, file: !149, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1161, file: !149, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1161, file: !149, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1161, file: !149, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1161, file: !149, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1161, file: !149, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1161, file: !149, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1161, file: !149, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1161, file: !149, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1161, file: !149, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1161, file: !149, line: 2305, baseType: !5, size: 32, offset: 512)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1161, file: !149, line: 2306, baseType: !1186, size: 32, offset: 544)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1187, line: 31, baseType: !543)
!1187 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1161, file: !149, line: 2307, baseType: !682, size: 64, offset: 576)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1161, file: !149, line: 2308, baseType: !682, size: 64, offset: 640)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1161, file: !149, line: 2314, baseType: !1191, size: 64, offset: 704)
!1191 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !149, line: 2309, size: 64, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1191, file: !149, line: 2310, baseType: !543, size: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1191, file: !149, line: 2311, baseType: !548, size: 64)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1191, file: !149, line: 2312, baseType: !1196, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !149, line: 2277, flags: DIFlagFwdDecl)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1161, file: !149, line: 2315, baseType: !682, size: 64, offset: 768)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1161, file: !149, line: 2316, baseType: !682, size: 64, offset: 832)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1161, file: !149, line: 2317, baseType: !682, size: 64, offset: 896)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1161, file: !149, line: 2318, baseType: !682, size: 64, offset: 960)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !1161, file: !149, line: 2319, baseType: !682, size: 64, offset: 1024)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !1161, file: !149, line: 2320, baseType: !682, size: 64, offset: 1088)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1161, file: !149, line: 2321, baseType: !682, size: 64, offset: 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1161, file: !149, line: 2322, baseType: !682, size: 64, offset: 1216)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1161, file: !149, line: 2324, baseType: !1207, size: 64, offset: 1280)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !149, line: 2324, flags: DIFlagFwdDecl)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !684, file: !149, line: 3395, baseType: !1210, size: 320)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !149, line: 1469, size: 320, elements: !1211)
!1211 = !{!1212, !1213, !1214}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1210, file: !149, line: 1470, baseType: !720, size: 192)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1210, file: !149, line: 1471, baseType: !682, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1210, file: !149, line: 1472, baseType: !682, size: 64, offset: 256)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !684, file: !149, line: 3396, baseType: !1216, size: 320)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !149, line: 1482, size: 320, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1216, file: !149, line: 1483, baseType: !720, size: 192)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1216, file: !149, line: 1484, baseType: !543, size: 32, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1216, file: !149, line: 1485, baseType: !1221, size: 64, offset: 256)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 64, elements: !602)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !684, file: !149, line: 3397, baseType: !1223, size: 384)
!1223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !149, line: 1829, size: 384, elements: !1224)
!1224 = !{!1225, !1226, !1227, !1228}
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1223, file: !149, line: 1830, baseType: !720, size: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1223, file: !149, line: 1831, baseType: !789, size: 32, offset: 192)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1223, file: !149, line: 1832, baseType: !682, size: 64, offset: 256)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1223, file: !149, line: 1835, baseType: !1221, size: 64, offset: 320)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !684, file: !149, line: 3398, baseType: !1230, size: 704)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !149, line: 1898, size: 704, elements: !1231)
!1231 = !{!1232, !1233, !1234, !1238, !1239, !1242}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1230, file: !149, line: 1899, baseType: !720, size: 192)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1230, file: !149, line: 1902, baseType: !682, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1230, file: !149, line: 1905, baseType: !1235, size: 64, offset: 256)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !568, line: 58, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !568, line: 57, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1230, file: !149, line: 1908, baseType: !5, size: 32, offset: 320)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1230, file: !149, line: 1911, baseType: !1240, size: 64, offset: 384)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !149, line: 1876, flags: DIFlagFwdDecl)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1230, file: !149, line: 1914, baseType: !1243, size: 256, offset: 448)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1244)
!1244 = !{!1245, !1247, !1248, !1253}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1243, file: !149, line: 1884, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1243, file: !149, line: 1885, baseType: !1246, size: 64, offset: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1243, file: !149, line: 1891, baseType: !1249, size: 64, offset: 128)
!1249 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1243, file: !149, line: 1891, size: 64, elements: !1250)
!1250 = !{!1251, !1252}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1249, file: !149, line: 1891, baseType: !1235, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1249, file: !149, line: 1891, baseType: !682, size: 64)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1243, file: !149, line: 1892, baseType: !1254, size: 64, offset: 192)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !684, file: !149, line: 3399, baseType: !1256, size: 704)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !149, line: 2008, size: 704, elements: !1257)
!1257 = !{!1258, !1259, !1260, !1261, !1262, !1263, !1275, !1276, !1277, !1278, !1279}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1256, file: !149, line: 2009, baseType: !720, size: 192)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1256, file: !149, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1256, file: !149, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1256, file: !149, line: 2014, baseType: !789, size: 32, offset: 224)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1256, file: !149, line: 2016, baseType: !682, size: 64, offset: 256)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1256, file: !149, line: 2017, baseType: !1264, size: 64, offset: 320)
!1264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1265, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1266)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1267)
!1267 = !{!1268}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1266, file: !149, line: 183, baseType: !1269, size: 128)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1271)
!1271 = !{!1272, !1273, !1274}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1270, file: !149, line: 182, baseType: !5, size: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1270, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1270, file: !149, line: 182, baseType: !1221, size: 64, offset: 64)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1256, file: !149, line: 2019, baseType: !682, size: 64, offset: 384)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1256, file: !149, line: 2020, baseType: !682, size: 64, offset: 448)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1256, file: !149, line: 2021, baseType: !682, size: 64, offset: 512)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1256, file: !149, line: 2022, baseType: !682, size: 64, offset: 576)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1256, file: !149, line: 2023, baseType: !682, size: 64, offset: 640)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !684, file: !149, line: 3400, baseType: !1281, size: 832)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !149, line: 2430, size: 832, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1281, file: !149, line: 2431, baseType: !720, size: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1281, file: !149, line: 2433, baseType: !682, size: 64, offset: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1281, file: !149, line: 2434, baseType: !682, size: 64, offset: 256)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1281, file: !149, line: 2435, baseType: !682, size: 64, offset: 320)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1281, file: !149, line: 2436, baseType: !682, size: 64, offset: 384)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1281, file: !149, line: 2437, baseType: !1264, size: 64, offset: 448)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1281, file: !149, line: 2438, baseType: !682, size: 64, offset: 512)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1281, file: !149, line: 2440, baseType: !682, size: 64, offset: 576)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1281, file: !149, line: 2441, baseType: !682, size: 64, offset: 640)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1281, file: !149, line: 2443, baseType: !1293, size: 128, offset: 704)
!1293 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !149, line: 182, baseType: !1294)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !149, line: 182, size: 128, elements: !1295)
!1295 = !{!1296}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1294, file: !149, line: 182, baseType: !1269, size: 128)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !684, file: !149, line: 3401, baseType: !1298, size: 320)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !149, line: 3327, size: 320, elements: !1299)
!1299 = !{!1300, !1301, !1308}
