; ModuleID = 'sort.bc'
source_filename = "sort.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !47 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !60, metadata !DIExpression()), !dbg !62
  call void @llvm.dbg.value(metadata %struct.__va_list_tag* %__arg, metadata !61, metadata !DIExpression()), !dbg !62
  %0 = load %struct._IO_FILE*, %struct._IO_FILE** @stdout, align 8, !dbg !63
  %call = tail call i32 @vfprintf(%struct._IO_FILE* %0, i8* %__fmt, %struct.__va_list_tag* %__arg) #6, !dbg !64
  ret i32 %call, !dbg !65
}

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.declare(metadata, metadata, metadata) #1


!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "sort.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !8, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "digit_t", scope: !15, file: !1, line: 52, baseType: !5)
!15 = distinct !DISubprogram(name: "sort_pointers", scope: !1, file: !1, line: 47, type: !16, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !22)
!16 = !DISubroutineType(types: !17)
!17 = !{null, !18, !21, !21}
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !19, line: 46, baseType: !20)
!19 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!20 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!22 = !{!23, !24, !25, !26, !31, !32, !33, !34, !38, !39, !40, !42}
!23 = !DILocalVariable(name: "n", arg: 1, scope: !15, file: !1, line: 47, type: !18)
!24 = !DILocalVariable(name: "pointers", arg: 2, scope: !15, file: !1, line: 47, type: !21)
!25 = !DILocalVariable(name: "work", arg: 3, scope: !15, file: !1, line: 47, type: !21)
!26 = !DILocalVariable(name: "count", scope: !15, file: !1, line: 59, type: !27)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !28, size: 8192, elements: !29)
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !{!30}
!30 = !DISubrange(count: 256)
!31 = !DILocalVariable(name: "big_endian_p", scope: !15, file: !1, line: 61, type: !6)
!32 = !DILocalVariable(name: "i", scope: !15, file: !1, line: 62, type: !18)
!33 = !DILocalVariable(name: "j", scope: !15, file: !1, line: 63, type: !18)
!34 = !DILocalVariable(name: "digit", scope: !35, file: !1, line: 85, type: !13)
!35 = distinct !DILexicalBlock(scope: !36, file: !1, line: 84, column: 5)
!36 = distinct !DILexicalBlock(scope: !37, file: !1, line: 83, column: 3)
!37 = distinct !DILexicalBlock(scope: !15, file: !1, line: 83, column: 3)
!38 = !DILocalVariable(name: "bias", scope: !35, file: !1, line: 86, type: !13)
!39 = !DILocalVariable(name: "top", scope: !35, file: !1, line: 87, type: !13)
!40 = !DILocalVariable(name: "countp", scope: !35, file: !1, line: 88, type: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!42 = !DILocalVariable(name: "pointerp", scope: !35, file: !1, line: 89, type: !21)
!43 = !{i32 2, !"Dwarf Version", i32 4}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{i32 1, !"wchar_size", i32 4}
!46 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!47 = distinct !DISubprogram(name: "vprintf", scope: !48, file: !48, line: 39, type: !49, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !59)
!48 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!49 = !DISubroutineType(types: !50)
!50 = !{!6, !51, !52}
!51 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !54)
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !53, file: !1, baseType: !28, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !53, file: !1, baseType: !28, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !53, file: !1, baseType: !10, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !53, file: !1, baseType: !10, size: 64, offset: 128)
!59 = !{!60, !61}
!60 = !DILocalVariable(name: "__fmt", arg: 1, scope: !47, file: !48, line: 39, type: !51)
!61 = !DILocalVariable(name: "__arg", arg: 2, scope: !47, file: !48, line: 39, type: !52)
!62 = !DILocation(line: 0, scope: !47)
!63 = !DILocation(line: 41, column: 20, scope: !47)
!64 = !DILocation(line: 41, column: 10, scope: !47)
!65 = !DILocation(line: 41, column: 3, scope: !47)
!66 = distinct !DISubprogram(name: "getchar", scope: !48, file: !48, line: 47, type: !67, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!67 = !DISubroutineType(types: !68)
!68 = !{!6}
!69 = !DILocation(line: 49, column: 16, scope: !66)
!70 = !DILocation(line: 49, column: 10, scope: !66)
!71 = !DILocation(line: 49, column: 3, scope: !66)
!72 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !48, file: !48, line: 56, type: !73, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !131)
!73 = !DISubroutineType(types: !74)
!74 = !{!6, !75}
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !106, !108, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !6, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !8, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !8, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !8, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !8, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !8, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !8, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !8, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !8, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !8, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !8, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !8, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !6, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !6, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !105, size: 16, offset: 1024)
!105 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !10, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !18, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !6, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !{!132}
!132 = !DILocalVariable(name: "__fp", arg: 1, scope: !72, file: !48, line: 56, type: !75)
!133 = !DILocation(line: 0, scope: !72)
!134 = !DILocation(line: 58, column: 10, scope: !72)
!135 = !DILocation(line: 58, column: 3, scope: !72)
!136 = distinct !DISubprogram(name: "getc_unlocked", scope: !48, file: !48, line: 66, type: !73, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !137)
!137 = !{!138}
!138 = !DILocalVariable(name: "__fp", arg: 1, scope: !136, file: !48, line: 66, type: !75)
!139 = !DILocation(line: 0, scope: !136)
!140 = !DILocation(line: 68, column: 10, scope: !136)
!141 = !DILocation(line: 68, column: 3, scope: !136)
!142 = distinct !DISubprogram(name: "getchar_unlocked", scope: !48, file: !48, line: 73, type: !67, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!143 = !DILocation(line: 75, column: 10, scope: !142)
!144 = !DILocation(line: 75, column: 3, scope: !142)
!145 = distinct !DISubprogram(name: "putchar", scope: !48, file: !48, line: 82, type: !146, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !148)
!146 = !DISubroutineType(types: !147)
!147 = !{!6, !6}
!148 = !{!149}
!149 = !DILocalVariable(name: "__c", arg: 1, scope: !145, file: !48, line: 82, type: !6)
!150 = !DILocation(line: 0, scope: !145)
!151 = !DILocation(line: 84, column: 21, scope: !145)
!152 = !DILocation(line: 84, column: 10, scope: !145)
!153 = !DILocation(line: 84, column: 3, scope: !145)
!154 = distinct !DISubprogram(name: "fputc_unlocked", scope: !48, file: !48, line: 91, type: !155, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !157)
!155 = !DISubroutineType(types: !156)
!156 = !{!6, !6, !75}
!157 = !{!158, !159}
!158 = !DILocalVariable(name: "__c", arg: 1, scope: !154, file: !48, line: 91, type: !6)
!159 = !DILocalVariable(name: "__stream", arg: 2, scope: !154, file: !48, line: 91, type: !75)
!160 = !DILocation(line: 0, scope: !154)
!161 = !DILocation(line: 93, column: 10, scope: !154)
!162 = !DILocation(line: 93, column: 3, scope: !154)
!163 = distinct !DISubprogram(name: "putc_unlocked", scope: !48, file: !48, line: 101, type: !155, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !164)
!164 = !{!165, !166}
!165 = !DILocalVariable(name: "__c", arg: 1, scope: !163, file: !48, line: 101, type: !6)
!166 = !DILocalVariable(name: "__stream", arg: 2, scope: !163, file: !48, line: 101, type: !75)
!167 = !DILocation(line: 0, scope: !163)
!168 = !DILocation(line: 103, column: 10, scope: !163)
!169 = !DILocation(line: 103, column: 3, scope: !163)
!170 = distinct !DISubprogram(name: "putchar_unlocked", scope: !48, file: !48, line: 108, type: !146, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !171)
!171 = !{!172}
!172 = !DILocalVariable(name: "__c", arg: 1, scope: !170, file: !48, line: 108, type: !6)
!173 = !DILocation(line: 0, scope: !170)
!174 = !DILocation(line: 110, column: 10, scope: !170)
!175 = !DILocation(line: 110, column: 3, scope: !170)
!176 = distinct !DISubprogram(name: "getline", scope: !48, file: !48, line: 118, type: !177, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !181)
!177 = !DISubroutineType(types: !178)
!178 = !{!179, !7, !180, !75}
!179 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !102, line: 193, baseType: !103)
