; ModuleID = 'spaces.bc'
source_filename = "spaces.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@spaces.buf = internal unnamed_addr global i8* null, align 8, !dbg !0
@spaces.maxsize = internal unnamed_addr global i32 0, align 4, !dbg !17

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !26 {
entry:
  call void @llvm.dbg.value(metadata i8* %__fmt, metadata !41, metadata !DIExpression()), !dbg !43
  call void @llvm.dbg.value(metadata %struct.__va_list_tag* %__arg, metadata !42, metadata !DIExpression()), !dbg !43
  %0 = load %struct._IO_FILE*, %struct._IO_FILE** @stdout, align 8, !dbg !44
  %call = tail call i32 @vfprintf(%struct._IO_FILE* %0, i8* %__fmt, %struct.__va_list_tag* %__arg) #5, !dbg !45
  ret i32 %call, !dbg !46
}


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "buf", scope: !2, file: !3, line: 51, type: !15, isLocal: true, isDefinition: true)
!2 = distinct !DISubprogram(name: "spaces", scope: !3, file: !3, line: 48, type: !4, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !19)
!3 = !DIFile(filename: "spaces.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !DISubroutineType(types: !5)
!5 = !{!6, !9}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !11, retainedTypes: !12, globals: !16, nameTableKind: None)
!11 = !{}
!12 = !{!13, !14, !15, !6}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!16 = !{!0, !17}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "maxsize", scope: !2, file: !3, line: 52, type: !9, isLocal: true, isDefinition: true)
!19 = !{!20, !21}
!20 = !DILocalVariable(name: "count", arg: 1, scope: !2, file: !3, line: 48, type: !9)
!21 = !DILocalVariable(name: "t", scope: !2, file: !3, line: 50, type: !15)
!22 = !{i32 2, !"Dwarf Version", i32 4}
!23 = !{i32 2, !"Debug Info Version", i32 3}
!24 = !{i32 1, !"wchar_size", i32 4}
!25 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!26 = distinct !DISubprogram(name: "vprintf", scope: !27, file: !27, line: 39, type: !28, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !40)
!27 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!28 = !DISubroutineType(types: !29)
!29 = !{!9, !30, !31}
!30 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !6)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !33)
!33 = !{!34, !36, !37, !39}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !32, file: !3, baseType: !35, size: 32)
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !32, file: !3, baseType: !35, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !32, file: !3, baseType: !38, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !32, file: !3, baseType: !38, size: 64, offset: 128)
!40 = !{!41, !42}
!41 = !DILocalVariable(name: "__fmt", arg: 1, scope: !26, file: !27, line: 39, type: !30)
!42 = !DILocalVariable(name: "__arg", arg: 2, scope: !26, file: !27, line: 39, type: !31)
!43 = !DILocation(line: 0, scope: !26)
!44 = !DILocation(line: 41, column: 20, scope: !26)
!45 = !DILocation(line: 41, column: 10, scope: !26)
!46 = !DILocation(line: 41, column: 3, scope: !26)
!47 = distinct !DISubprogram(name: "getchar", scope: !27, file: !27, line: 47, type: !48, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !11)
!48 = !DISubroutineType(types: !49)
!49 = !{!9}
!50 = !DILocation(line: 49, column: 16, scope: !47)
!51 = !DILocation(line: 49, column: 10, scope: !47)
!52 = !DILocation(line: 49, column: 3, scope: !47)
!53 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !27, file: !27, line: 56, type: !54, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !115)
!54 = !DISubroutineType(types: !55)
!55 = !{!9, !56}
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !58, line: 7, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!59 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !60, line: 49, size: 1728, elements: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!61 = !{!62, !63, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !77, !79, !80, !81, !85, !87, !89, !93, !96, !98, !101, !104, !105, !106, !110, !111}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !59, file: !60, line: 51, baseType: !9, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !59, file: !60, line: 54, baseType: !15, size: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !59, file: !60, line: 55, baseType: !15, size: 64, offset: 128)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !59, file: !60, line: 56, baseType: !15, size: 64, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !59, file: !60, line: 57, baseType: !15, size: 64, offset: 256)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !59, file: !60, line: 58, baseType: !15, size: 64, offset: 320)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !59, file: !60, line: 59, baseType: !15, size: 64, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !59, file: !60, line: 60, baseType: !15, size: 64, offset: 448)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !59, file: !60, line: 61, baseType: !15, size: 64, offset: 512)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !59, file: !60, line: 64, baseType: !15, size: 64, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !59, file: !60, line: 65, baseType: !15, size: 64, offset: 640)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !59, file: !60, line: 66, baseType: !15, size: 64, offset: 704)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !59, file: !60, line: 68, baseType: !75, size: 64, offset: 768)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !60, line: 36, flags: DIFlagFwdDecl)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !59, file: !60, line: 70, baseType: !78, size: 64, offset: 832)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !59, file: !60, line: 72, baseType: !9, size: 32, offset: 896)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !59, file: !60, line: 73, baseType: !9, size: 32, offset: 928)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !59, file: !60, line: 74, baseType: !82, size: 64, offset: 960)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !83, line: 152, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!84 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !59, file: !60, line: 77, baseType: !86, size: 16, offset: 1024)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !59, file: !60, line: 78, baseType: !88, size: 8, offset: 1040)
!88 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !59, file: !60, line: 79, baseType: !90, size: 8, offset: 1048)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 8, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 1)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !59, file: !60, line: 81, baseType: !94, size: 64, offset: 1088)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !60, line: 43, baseType: null)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !59, file: !60, line: 89, baseType: !97, size: 64, offset: 1152)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !83, line: 153, baseType: !84)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !59, file: !60, line: 91, baseType: !99, size: 64, offset: 1216)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !60, line: 37, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !59, file: !60, line: 92, baseType: !102, size: 64, offset: 1280)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !60, line: 38, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !59, file: !60, line: 93, baseType: !78, size: 64, offset: 1344)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !59, file: !60, line: 94, baseType: !38, size: 64, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !59, file: !60, line: 95, baseType: !107, size: 64, offset: 1472)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !108, line: 46, baseType: !109)
!108 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!109 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !59, file: !60, line: 96, baseType: !9, size: 32, offset: 1536)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !59, file: !60, line: 98, baseType: !112, size: 160, offset: 1568)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 160, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 20)
!115 = !{!116}
!116 = !DILocalVariable(name: "__fp", arg: 1, scope: !53, file: !27, line: 56, type: !56)
!117 = !DILocation(line: 0, scope: !53)
!118 = !DILocation(line: 58, column: 10, scope: !53)
!119 = !DILocation(line: 58, column: 3, scope: !53)
!120 = distinct !DISubprogram(name: "getc_unlocked", scope: !27, file: !27, line: 66, type: !54, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !121)
!121 = !{!122}
!122 = !DILocalVariable(name: "__fp", arg: 1, scope: !120, file: !27, line: 66, type: !56)
!123 = !DILocation(line: 0, scope: !120)
!124 = !DILocation(line: 68, column: 10, scope: !120)
!125 = !DILocation(line: 68, column: 3, scope: !120)
!126 = distinct !DISubprogram(name: "getchar_unlocked", scope: !27, file: !27, line: 73, type: !48, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !11)
!127 = !DILocation(line: 75, column: 10, scope: !126)
!128 = !DILocation(line: 75, column: 3, scope: !126)
!129 = distinct !DISubprogram(name: "putchar", scope: !27, file: !27, line: 82, type: !130, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !132)
!130 = !DISubroutineType(types: !131)
!131 = !{!9, !9}
!132 = !{!133}
!133 = !DILocalVariable(name: "__c", arg: 1, scope: !129, file: !27, line: 82, type: !9)
!134 = !DILocation(line: 0, scope: !129)
!135 = !DILocation(line: 84, column: 21, scope: !129)
!136 = !DILocation(line: 84, column: 10, scope: !129)
!137 = !DILocation(line: 84, column: 3, scope: !129)
!138 = distinct !DISubprogram(name: "fputc_unlocked", scope: !27, file: !27, line: 91, type: !139, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !141)
!139 = !DISubroutineType(types: !140)
!140 = !{!9, !9, !56}
!141 = !{!142, !143}
!142 = !DILocalVariable(name: "__c", arg: 1, scope: !138, file: !27, line: 91, type: !9)
!143 = !DILocalVariable(name: "__stream", arg: 2, scope: !138, file: !27, line: 91, type: !56)
!144 = !DILocation(line: 0, scope: !138)
!145 = !DILocation(line: 93, column: 10, scope: !138)
!146 = !DILocation(line: 93, column: 3, scope: !138)
!147 = distinct !DISubprogram(name: "putc_unlocked", scope: !27, file: !27, line: 101, type: !139, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !148)
!148 = !{!149, !150}
!149 = !DILocalVariable(name: "__c", arg: 1, scope: !147, file: !27, line: 101, type: !9)
!150 = !DILocalVariable(name: "__stream", arg: 2, scope: !147, file: !27, line: 101, type: !56)
!151 = !DILocation(line: 0, scope: !147)
!152 = !DILocation(line: 103, column: 10, scope: !147)
!153 = !DILocation(line: 103, column: 3, scope: !147)
!154 = distinct !DISubprogram(name: "putchar_unlocked", scope: !27, file: !27, line: 108, type: !130, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !155)
!155 = !{!156}
!156 = !DILocalVariable(name: "__c", arg: 1, scope: !154, file: !27, line: 108, type: !9)
!157 = !DILocation(line: 0, scope: !154)
!158 = !DILocation(line: 110, column: 10, scope: !154)
!159 = !DILocation(line: 110, column: 3, scope: !154)
!160 = distinct !DISubprogram(name: "getline", scope: !27, file: !27, line: 118, type: !161, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !10, retainedNodes: !166)
!161 = !DISubroutineType(types: !162)
!162 = !{!163, !164, !165, !56}
!163 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !83, line: 193, baseType: !84)
