; ModuleID = 'sparseset.bc'
source_filename = "sparseset.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.sparseset_def = type { i32*, i32*, i32, i32, i32, i8, i8, [2 x i32] }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [12 x i8] c"sparseset.c\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"?\00", align 1
@.str.2 = private unnamed_addr constant [14 x i8] c"./sparseset.h\00", align 1

; Function Attrs: inlinehint nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "sparseset.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "sparseset", file: !14, line: 41, baseType: !15)
!14 = !DIFile(filename: "./sparseset.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sparseset_def", file: !14, line: 31, size: 320, elements: !17)
!17 = !{!18, !21, !22, !23, !24, !25, !26, !27}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "dense", scope: !16, file: !14, line: 33, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !20, size: 64)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "sparse", scope: !16, file: !14, line: 34, baseType: !19, size: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "members", scope: !16, file: !14, line: 35, baseType: !20, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !16, file: !14, line: 36, baseType: !20, size: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !16, file: !14, line: 37, baseType: !20, size: 32, offset: 192)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "iter_inc", scope: !16, file: !14, line: 38, baseType: !5, size: 8, offset: 224)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "iterating", scope: !16, file: !14, line: 39, baseType: !5, size: 8, offset: 232)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "elms", scope: !16, file: !14, line: 40, baseType: !28, size: 64, offset: 256)
!28 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 64, elements: !29)
!29 = !{!30}
!30 = !DISubrange(count: 2)
!31 = !{i32 2, !"Dwarf Version", i32 4}
!32 = !{i32 2, !"Debug Info Version", i32 3}
!33 = !{i32 1, !"wchar_size", i32 4}
!34 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!35 = distinct !DISubprogram(name: "vprintf", scope: !36, file: !36, line: 39, type: !37, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !47)
!36 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!37 = !DISubroutineType(types: !38)
!38 = !{!6, !39, !40}
!39 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !42)
!42 = !{!43, !44, !45, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !41, file: !1, baseType: !20, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !41, file: !1, baseType: !20, size: 32, offset: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !41, file: !1, baseType: !10, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !41, file: !1, baseType: !10, size: 64, offset: 128)
!47 = !{!48, !49}
!48 = !DILocalVariable(name: "__fmt", arg: 1, scope: !35, file: !36, line: 39, type: !39)
!49 = !DILocalVariable(name: "__arg", arg: 2, scope: !35, file: !36, line: 39, type: !40)
!50 = !DILocation(line: 0, scope: !35)
!51 = !DILocation(line: 41, column: 20, scope: !35)
!52 = !DILocation(line: 41, column: 10, scope: !35)
!53 = !DILocation(line: 41, column: 3, scope: !35)
!54 = distinct !DISubprogram(name: "getchar", scope: !36, file: !36, line: 47, type: !55, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!55 = !DISubroutineType(types: !56)
!56 = !{!6}
!57 = !DILocation(line: 49, column: 16, scope: !54)
!58 = !DILocation(line: 49, column: 10, scope: !54)
!59 = !DILocation(line: 49, column: 3, scope: !54)
!60 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !36, file: !36, line: 56, type: !61, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !122)
!61 = !DISubroutineType(types: !62)
!62 = !{!6, !63}
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !65, line: 7, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !67, line: 49, size: 1728, elements: !68)
!67 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!68 = !{!69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !84, !86, !87, !88, !92, !94, !96, !100, !103, !105, !108, !111, !112, !113, !117, !118}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !66, file: !67, line: 51, baseType: !6, size: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !66, file: !67, line: 54, baseType: !8, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !66, file: !67, line: 55, baseType: !8, size: 64, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !66, file: !67, line: 56, baseType: !8, size: 64, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !66, file: !67, line: 57, baseType: !8, size: 64, offset: 256)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !66, file: !67, line: 58, baseType: !8, size: 64, offset: 320)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !66, file: !67, line: 59, baseType: !8, size: 64, offset: 384)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !66, file: !67, line: 60, baseType: !8, size: 64, offset: 448)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !66, file: !67, line: 61, baseType: !8, size: 64, offset: 512)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !66, file: !67, line: 64, baseType: !8, size: 64, offset: 576)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !66, file: !67, line: 65, baseType: !8, size: 64, offset: 640)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !66, file: !67, line: 66, baseType: !8, size: 64, offset: 704)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !66, file: !67, line: 68, baseType: !82, size: 64, offset: 768)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !67, line: 36, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !66, file: !67, line: 70, baseType: !85, size: 64, offset: 832)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !66, file: !67, line: 72, baseType: !6, size: 32, offset: 896)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !66, file: !67, line: 73, baseType: !6, size: 32, offset: 928)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !66, file: !67, line: 74, baseType: !89, size: 64, offset: 960)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !90, line: 152, baseType: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!91 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !66, file: !67, line: 77, baseType: !93, size: 16, offset: 1024)
!93 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !66, file: !67, line: 78, baseType: !95, size: 8, offset: 1040)
!95 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !66, file: !67, line: 79, baseType: !97, size: 8, offset: 1048)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 1)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !66, file: !67, line: 81, baseType: !101, size: 64, offset: 1088)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !67, line: 43, baseType: null)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !66, file: !67, line: 89, baseType: !104, size: 64, offset: 1152)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !90, line: 153, baseType: !91)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !66, file: !67, line: 91, baseType: !106, size: 64, offset: 1216)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !67, line: 37, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !66, file: !67, line: 92, baseType: !109, size: 64, offset: 1280)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !67, line: 38, flags: DIFlagFwdDecl)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !66, file: !67, line: 93, baseType: !85, size: 64, offset: 1344)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !66, file: !67, line: 94, baseType: !10, size: 64, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !66, file: !67, line: 95, baseType: !114, size: 64, offset: 1472)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !115, line: 46, baseType: !116)
!115 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!116 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !66, file: !67, line: 96, baseType: !6, size: 32, offset: 1536)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !66, file: !67, line: 98, baseType: !119, size: 160, offset: 1568)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !120)
!120 = !{!121}
!121 = !DISubrange(count: 20)
!122 = !{!123}
!123 = !DILocalVariable(name: "__fp", arg: 1, scope: !60, file: !36, line: 56, type: !63)
!124 = !DILocation(line: 0, scope: !60)
!125 = !DILocation(line: 58, column: 10, scope: !60)
!126 = !DILocation(line: 58, column: 3, scope: !60)
!127 = distinct !DISubprogram(name: "getc_unlocked", scope: !36, file: !36, line: 66, type: !61, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !128)
!128 = !{!129}
!129 = !DILocalVariable(name: "__fp", arg: 1, scope: !127, file: !36, line: 66, type: !63)
!130 = !DILocation(line: 0, scope: !127)
!131 = !DILocation(line: 68, column: 10, scope: !127)
!132 = !DILocation(line: 68, column: 3, scope: !127)
!133 = distinct !DISubprogram(name: "getchar_unlocked", scope: !36, file: !36, line: 73, type: !55, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!134 = !DILocation(line: 75, column: 10, scope: !133)
!135 = !DILocation(line: 75, column: 3, scope: !133)
!136 = distinct !DISubprogram(name: "putchar", scope: !36, file: !36, line: 82, type: !137, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !139)
!137 = !DISubroutineType(types: !138)
!138 = !{!6, !6}
!139 = !{!140}
!140 = !DILocalVariable(name: "__c", arg: 1, scope: !136, file: !36, line: 82, type: !6)
!141 = !DILocation(line: 0, scope: !136)
!142 = !DILocation(line: 84, column: 21, scope: !136)
!143 = !DILocation(line: 84, column: 10, scope: !136)
!144 = !DILocation(line: 84, column: 3, scope: !136)
!145 = distinct !DISubprogram(name: "fputc_unlocked", scope: !36, file: !36, line: 91, type: !146, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !148)
!146 = !DISubroutineType(types: !147)
!147 = !{!6, !6, !63}
!148 = !{!149, !150}
!149 = !DILocalVariable(name: "__c", arg: 1, scope: !145, file: !36, line: 91, type: !6)
!150 = !DILocalVariable(name: "__stream", arg: 2, scope: !145, file: !36, line: 91, type: !63)
!151 = !DILocation(line: 0, scope: !145)
!152 = !DILocation(line: 93, column: 10, scope: !145)
!153 = !DILocation(line: 93, column: 3, scope: !145)
!154 = distinct !DISubprogram(name: "putc_unlocked", scope: !36, file: !36, line: 101, type: !146, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !155)
!155 = !{!156, !157}
!156 = !DILocalVariable(name: "__c", arg: 1, scope: !154, file: !36, line: 101, type: !6)
!157 = !DILocalVariable(name: "__stream", arg: 2, scope: !154, file: !36, line: 101, type: !63)
!158 = !DILocation(line: 0, scope: !154)
!159 = !DILocation(line: 103, column: 10, scope: !154)
!160 = !DILocation(line: 103, column: 3, scope: !154)
!161 = distinct !DISubprogram(name: "putchar_unlocked", scope: !36, file: !36, line: 108, type: !137, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !162)
!162 = !{!163}
!163 = !DILocalVariable(name: "__c", arg: 1, scope: !161, file: !36, line: 108, type: !6)
!164 = !DILocation(line: 0, scope: !161)
!165 = !DILocation(line: 110, column: 10, scope: !161)
!166 = !DILocation(line: 110, column: 3, scope: !161)
!167 = distinct !DISubprogram(name: "getline", scope: !36, file: !36, line: 118, type: !168, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !172)
!168 = !DISubroutineType(types: !169)
!169 = !{!170, !7, !171, !63}
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !90, line: 193, baseType: !91)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!172 = !{!173, !174, !175}
!173 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !167, file: !36, line: 118, type: !7)
!174 = !DILocalVariable(name: "__n", arg: 2, scope: !167, file: !36, line: 118, type: !171)
!175 = !DILocalVariable(name: "__stream", arg: 3, scope: !167, file: !36, line: 118, type: !63)
!176 = !DILocation(line: 0, scope: !167)
!177 = !DILocation(line: 120, column: 10, scope: !167)
!178 = !DILocation(line: 120, column: 3, scope: !167)
!179 = distinct !DISubprogram(name: "feof_unlocked", scope: !36, file: !36, line: 128, type: !61, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !180)
!180 = !{!181}
!181 = !DILocalVariable(name: "__stream", arg: 1, scope: !179, file: !36, line: 128, type: !63)
!182 = !DILocation(line: 0, scope: !179)
!183 = !DILocation(line: 130, column: 10, scope: !179)
!184 = !DILocation(line: 130, column: 3, scope: !179)
!185 = distinct !DISubprogram(name: "ferror_unlocked", scope: !36, file: !36, line: 135, type: !61, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !186)
!186 = !{!187}
!187 = !DILocalVariable(name: "__stream", arg: 1, scope: !185, file: !36, line: 135, type: !63)
!188 = !DILocation(line: 0, scope: !185)
!189 = !DILocation(line: 137, column: 10, scope: !185)
!190 = !DILocation(line: 137, column: 3, scope: !185)
!191 = distinct !DISubprogram(name: "tolower", scope: !192, file: !192, line: 207, type: !137, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !193)
!192 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!193 = !{!194}
!194 = !DILocalVariable(name: "__c", arg: 1, scope: !191, file: !192, line: 207, type: !6)
!195 = !DILocation(line: 0, scope: !191)
!196 = !DILocation(line: 209, column: 22, scope: !191)
!197 = !DILocation(line: 209, column: 39, scope: !191)
!198 = !DILocation(line: 209, column: 38, scope: !191)
!199 = !DILocation(line: 209, column: 37, scope: !191)
!200 = !DILocation(line: 209, column: 10, scope: !191)
!201 = !DILocation(line: 209, column: 3, scope: !191)
!202 = distinct !DISubprogram(name: "toupper", scope: !192, file: !192, line: 213, type: !137, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !203)
!203 = !{!204}
!204 = !DILocalVariable(name: "__c", arg: 1, scope: !202, file: !192, line: 213, type: !6)
!205 = !DILocation(line: 0, scope: !202)
!206 = !DILocation(line: 215, column: 22, scope: !202)
!207 = !DILocation(line: 215, column: 39, scope: !202)
!208 = !DILocation(line: 215, column: 38, scope: !202)
!209 = !DILocation(line: 215, column: 37, scope: !202)
!210 = !DILocation(line: 215, column: 10, scope: !202)
!211 = !DILocation(line: 215, column: 3, scope: !202)
!212 = distinct !DISubprogram(name: "atoi", scope: !213, file: !213, line: 361, type: !214, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !216)
!213 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!214 = !DISubroutineType(types: !215)
!215 = !{!6, !11}
!216 = !{!217}
!217 = !DILocalVariable(name: "__nptr", arg: 1, scope: !212, file: !213, line: 361, type: !11)
!218 = !DILocation(line: 0, scope: !212)
!219 = !DILocation(line: 363, column: 16, scope: !212)
!220 = !DILocation(line: 363, column: 10, scope: !212)
!221 = !DILocation(line: 363, column: 3, scope: !212)
!222 = distinct !DISubprogram(name: "atol", scope: !213, file: !213, line: 366, type: !223, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !225)
!223 = !DISubroutineType(types: !224)
!224 = !{!91, !11}
!225 = !{!226}
!226 = !DILocalVariable(name: "__nptr", arg: 1, scope: !222, file: !213, line: 366, type: !11)
!227 = !DILocation(line: 0, scope: !222)
!228 = !DILocation(line: 368, column: 10, scope: !222)
!229 = !DILocation(line: 368, column: 3, scope: !222)
!230 = distinct !DISubprogram(name: "atoll", scope: !213, file: !213, line: 373, type: !231, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !234)
!231 = !DISubroutineType(types: !232)
!232 = !{!233, !11}
!233 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!234 = !{!235}
!235 = !DILocalVariable(name: "__nptr", arg: 1, scope: !230, file: !213, line: 373, type: !11)
!236 = !DILocation(line: 0, scope: !230)
!237 = !DILocation(line: 375, column: 10, scope: !230)
!238 = !DILocation(line: 375, column: 3, scope: !230)
!239 = distinct !DISubprogram(name: "bsearch", scope: !240, file: !240, line: 20, type: !241, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !249)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!241 = !DISubroutineType(types: !242)
!242 = !{!10, !243, !243, !114, !114, !245}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!245 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !213, line: 808, baseType: !246)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!6, !243, !243}
!249 = !{!250, !251, !252, !253, !254, !255, !256, !257, !258, !259}
!250 = !DILocalVariable(name: "__key", arg: 1, scope: !239, file: !240, line: 20, type: !243)
!251 = !DILocalVariable(name: "__base", arg: 2, scope: !239, file: !240, line: 20, type: !243)
!252 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !239, file: !240, line: 20, type: !114)
!253 = !DILocalVariable(name: "__size", arg: 4, scope: !239, file: !240, line: 20, type: !114)
!254 = !DILocalVariable(name: "__compar", arg: 5, scope: !239, file: !240, line: 21, type: !245)
!255 = !DILocalVariable(name: "__l", scope: !239, file: !240, line: 23, type: !114)
!256 = !DILocalVariable(name: "__u", scope: !239, file: !240, line: 23, type: !114)
!257 = !DILocalVariable(name: "__idx", scope: !239, file: !240, line: 23, type: !114)
!258 = !DILocalVariable(name: "__p", scope: !239, file: !240, line: 24, type: !243)
!259 = !DILocalVariable(name: "__comparison", scope: !239, file: !240, line: 25, type: !6)
!260 = !DILocation(line: 0, scope: !239)
!261 = !DILocation(line: 29, column: 3, scope: !239)
!262 = !DILocation(line: 27, column: 7, scope: !239)
!263 = !DILocation(line: 29, column: 14, scope: !239)
!264 = !DILocation(line: 31, column: 20, scope: !265)
!265 = distinct !DILexicalBlock(scope: !239, file: !240, line: 30, column: 5)
!266 = !DILocation(line: 31, column: 27, scope: !265)
!267 = !DILocation(line: 32, column: 56, scope: !265)
!268 = !DILocation(line: 32, column: 47, scope: !265)
!269 = !DILocation(line: 33, column: 22, scope: !265)
!270 = !DILocation(line: 34, column: 24, scope: !271)
!271 = distinct !DILexicalBlock(scope: !265, file: !240, line: 34, column: 11)
!272 = !DILocation(line: 34, column: 11, scope: !265)
!273 = !DILocation(line: 36, column: 29, scope: !274)
!274 = distinct !DILexicalBlock(scope: !271, file: !240, line: 36, column: 16)
!275 = !DILocation(line: 36, column: 16, scope: !271)
!276 = !DILocation(line: 37, column: 14, scope: !274)
!277 = distinct !{!277, !261, !278}
!278 = !DILocation(line: 40, column: 5, scope: !239)
!279 = !DILocation(line: 43, column: 1, scope: !239)
!280 = distinct !DISubprogram(name: "atof", scope: !281, file: !281, line: 25, type: !282, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !285)
!281 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!282 = !DISubroutineType(types: !283)
!283 = !{!284, !11}
!284 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!285 = !{!286}
!286 = !DILocalVariable(name: "__nptr", arg: 1, scope: !280, file: !281, line: 25, type: !11)
!287 = !DILocation(line: 0, scope: !280)
!288 = !DILocation(line: 27, column: 10, scope: !280)
!289 = !DILocation(line: 27, column: 3, scope: !280)
!290 = distinct !DISubprogram(name: "strtoimax", scope: !291, file: !291, line: 324, type: !292, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !298)
!291 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!292 = !DISubroutineType(types: !293)
!293 = !{!294, !39, !297, !6}
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !295, line: 101, baseType: !296)
!295 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !90, line: 72, baseType: !91)
!297 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !7)
!298 = !{!299, !300, !301}
!299 = !DILocalVariable(name: "nptr", arg: 1, scope: !290, file: !291, line: 324, type: !39)
!300 = !DILocalVariable(name: "endptr", arg: 2, scope: !290, file: !291, line: 324, type: !297)
!301 = !DILocalVariable(name: "base", arg: 3, scope: !290, file: !291, line: 324, type: !6)
!302 = !DILocation(line: 0, scope: !290)
!303 = !DILocation(line: 327, column: 10, scope: !290)
!304 = !DILocation(line: 327, column: 3, scope: !290)
!305 = distinct !DISubprogram(name: "strtoumax", scope: !291, file: !291, line: 336, type: !306, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !310)
!306 = !DISubroutineType(types: !307)
!307 = !{!308, !39, !297, !6}
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !295, line: 102, baseType: !309)
!309 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !90, line: 73, baseType: !116)
!310 = !{!311, !312, !313}
!311 = !DILocalVariable(name: "nptr", arg: 1, scope: !305, file: !291, line: 336, type: !39)
!312 = !DILocalVariable(name: "endptr", arg: 2, scope: !305, file: !291, line: 336, type: !297)
!313 = !DILocalVariable(name: "base", arg: 3, scope: !305, file: !291, line: 336, type: !6)
!314 = !DILocation(line: 0, scope: !305)
!315 = !DILocation(line: 339, column: 10, scope: !305)
!316 = !DILocation(line: 339, column: 3, scope: !305)
!317 = distinct !DISubprogram(name: "wcstoimax", scope: !291, file: !291, line: 348, type: !318, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !327)
!318 = !DISubroutineType(types: !319)
!319 = !{!294, !320, !324, !6}
!320 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !321)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !323)
!323 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !291, line: 34, baseType: !6)
!324 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !325)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64)
!327 = !{!328, !329, !330}
!328 = !DILocalVariable(name: "nptr", arg: 1, scope: !317, file: !291, line: 348, type: !320)
!329 = !DILocalVariable(name: "endptr", arg: 2, scope: !317, file: !291, line: 348, type: !324)
!330 = !DILocalVariable(name: "base", arg: 3, scope: !317, file: !291, line: 348, type: !6)
!331 = !DILocation(line: 0, scope: !317)
!332 = !DILocation(line: 351, column: 10, scope: !317)
!333 = !DILocation(line: 351, column: 3, scope: !317)
!334 = distinct !DISubprogram(name: "wcstoumax", scope: !291, file: !291, line: 362, type: !335, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !337)
!335 = !DISubroutineType(types: !336)
!336 = !{!308, !320, !324, !6}
!337 = !{!338, !339, !340}
!338 = !DILocalVariable(name: "nptr", arg: 1, scope: !334, file: !291, line: 362, type: !320)
!339 = !DILocalVariable(name: "endptr", arg: 2, scope: !334, file: !291, line: 362, type: !324)
!340 = !DILocalVariable(name: "base", arg: 3, scope: !334, file: !291, line: 362, type: !6)
!341 = !DILocation(line: 0, scope: !334)
!342 = !DILocation(line: 365, column: 10, scope: !334)
!343 = !DILocation(line: 365, column: 3, scope: !334)
!344 = distinct !DISubprogram(name: "stat", scope: !345, file: !345, line: 453, type: !346, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !385)
!345 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!346 = !DISubroutineType(types: !347)
!347 = !{!6, !11, !348}
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !350, line: 46, size: 1152, elements: !351)
!350 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!351 = !{!352, !354, !356, !358, !360, !362, !364, !365, !366, !367, !369, !371, !379, !380, !381}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !349, file: !350, line: 48, baseType: !353, size: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !90, line: 145, baseType: !116)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !349, file: !350, line: 53, baseType: !355, size: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !90, line: 148, baseType: !116)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !349, file: !350, line: 61, baseType: !357, size: 64, offset: 128)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !90, line: 151, baseType: !116)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !349, file: !350, line: 62, baseType: !359, size: 32, offset: 192)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !90, line: 150, baseType: !20)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !349, file: !350, line: 64, baseType: !361, size: 32, offset: 224)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !90, line: 146, baseType: !20)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !349, file: !350, line: 65, baseType: !363, size: 32, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !90, line: 147, baseType: !20)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !349, file: !350, line: 67, baseType: !6, size: 32, offset: 288)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !349, file: !350, line: 69, baseType: !353, size: 64, offset: 320)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !349, file: !350, line: 74, baseType: !89, size: 64, offset: 384)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !349, file: !350, line: 78, baseType: !368, size: 64, offset: 448)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !90, line: 174, baseType: !91)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !349, file: !350, line: 80, baseType: !370, size: 64, offset: 512)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !90, line: 179, baseType: !91)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !349, file: !350, line: 91, baseType: !372, size: 128, offset: 576)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !373, line: 10, size: 128, elements: !374)
!373 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!374 = !{!375, !377}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !372, file: !373, line: 12, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !90, line: 160, baseType: !91)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !372, file: !373, line: 16, baseType: !378, size: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !90, line: 196, baseType: !91)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !349, file: !350, line: 92, baseType: !372, size: 128, offset: 704)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !349, file: !350, line: 93, baseType: !372, size: 128, offset: 832)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !349, file: !350, line: 106, baseType: !382, size: 192, offset: 960)
!382 = !DICompositeType(tag: DW_TAG_array_type, baseType: !378, size: 192, elements: !383)
!383 = !{!384}
!384 = !DISubrange(count: 3)
!385 = !{!386, !387}
!386 = !DILocalVariable(name: "__path", arg: 1, scope: !344, file: !345, line: 453, type: !11)
!387 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !344, file: !345, line: 453, type: !348)
!388 = !DILocation(line: 0, scope: !344)
!389 = !DILocation(line: 455, column: 10, scope: !344)
!390 = !DILocation(line: 455, column: 3, scope: !344)
!391 = distinct !DISubprogram(name: "lstat", scope: !345, file: !345, line: 460, type: !346, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !392)
!392 = !{!393, !394}
!393 = !DILocalVariable(name: "__path", arg: 1, scope: !391, file: !345, line: 460, type: !11)
!394 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !391, file: !345, line: 460, type: !348)
!395 = !DILocation(line: 0, scope: !391)
!396 = !DILocation(line: 462, column: 10, scope: !391)
!397 = !DILocation(line: 462, column: 3, scope: !391)
!398 = distinct !DISubprogram(name: "fstat", scope: !345, file: !345, line: 467, type: !399, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !401)
!399 = !DISubroutineType(types: !400)
!400 = !{!6, !6, !348}
!401 = !{!402, !403}
!402 = !DILocalVariable(name: "__fd", arg: 1, scope: !398, file: !345, line: 467, type: !6)
!403 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !398, file: !345, line: 467, type: !348)
!404 = !DILocation(line: 0, scope: !398)
!405 = !DILocation(line: 469, column: 10, scope: !398)
!406 = !DILocation(line: 469, column: 3, scope: !398)
!407 = distinct !DISubprogram(name: "fstatat", scope: !345, file: !345, line: 474, type: !408, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{!6, !6, !11, !348, !6}
!410 = !{!411, !412, !413, !414}
!411 = !DILocalVariable(name: "__fd", arg: 1, scope: !407, file: !345, line: 474, type: !6)
!412 = !DILocalVariable(name: "__filename", arg: 2, scope: !407, file: !345, line: 474, type: !11)
!413 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !407, file: !345, line: 474, type: !348)
!414 = !DILocalVariable(name: "__flag", arg: 4, scope: !407, file: !345, line: 474, type: !6)
!415 = !DILocation(line: 0, scope: !407)
!416 = !DILocation(line: 477, column: 10, scope: !407)
!417 = !DILocation(line: 477, column: 3, scope: !407)
!418 = distinct !DISubprogram(name: "mknod", scope: !345, file: !345, line: 483, type: !419, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !421)
!419 = !DISubroutineType(types: !420)
!420 = !{!6, !11, !359, !353}
!421 = !{!422, !423, !424}
!422 = !DILocalVariable(name: "__path", arg: 1, scope: !418, file: !345, line: 483, type: !11)
!423 = !DILocalVariable(name: "__mode", arg: 2, scope: !418, file: !345, line: 483, type: !359)
!424 = !DILocalVariable(name: "__dev", arg: 3, scope: !418, file: !345, line: 483, type: !353)
!425 = !DILocation(line: 0, scope: !418)
!426 = !DILocation(line: 485, column: 10, scope: !418)
!427 = !DILocation(line: 485, column: 3, scope: !418)
!428 = distinct !DISubprogram(name: "mknodat", scope: !345, file: !345, line: 491, type: !429, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !431)
!429 = !DISubroutineType(types: !430)
!430 = !{!6, !6, !11, !359, !353}
!431 = !{!432, !433, !434, !435}
!432 = !DILocalVariable(name: "__fd", arg: 1, scope: !428, file: !345, line: 491, type: !6)
!433 = !DILocalVariable(name: "__path", arg: 2, scope: !428, file: !345, line: 491, type: !11)
!434 = !DILocalVariable(name: "__mode", arg: 3, scope: !428, file: !345, line: 491, type: !359)
!435 = !DILocalVariable(name: "__dev", arg: 4, scope: !428, file: !345, line: 491, type: !353)
!436 = !DILocation(line: 0, scope: !428)
!437 = !DILocation(line: 494, column: 10, scope: !428)
!438 = !DILocation(line: 494, column: 3, scope: !428)
!439 = distinct !DISubprogram(name: "stat64", scope: !345, file: !345, line: 502, type: !440, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !462)
!440 = !DISubroutineType(types: !441)
!441 = !{!6, !11, !442}
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !350, line: 119, size: 1152, elements: !444)
!444 = !{!445, !446, !448, !449, !450, !451, !452, !453, !454, !455, !456, !458, !459, !460, !461}
!445 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !443, file: !350, line: 121, baseType: !353, size: 64)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !443, file: !350, line: 123, baseType: !447, size: 64, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !90, line: 149, baseType: !116)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !443, file: !350, line: 124, baseType: !357, size: 64, offset: 128)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !443, file: !350, line: 125, baseType: !359, size: 32, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !443, file: !350, line: 132, baseType: !361, size: 32, offset: 224)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !443, file: !350, line: 133, baseType: !363, size: 32, offset: 256)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !443, file: !350, line: 135, baseType: !6, size: 32, offset: 288)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !443, file: !350, line: 136, baseType: !353, size: 64, offset: 320)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !443, file: !350, line: 137, baseType: !89, size: 64, offset: 384)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !443, file: !350, line: 143, baseType: !368, size: 64, offset: 448)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !443, file: !350, line: 144, baseType: !457, size: 64, offset: 512)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !90, line: 180, baseType: !91)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !443, file: !350, line: 152, baseType: !372, size: 128, offset: 576)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !443, file: !350, line: 153, baseType: !372, size: 128, offset: 704)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !443, file: !350, line: 154, baseType: !372, size: 128, offset: 832)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !443, file: !350, line: 164, baseType: !382, size: 192, offset: 960)
!462 = !{!463, !464}
!463 = !DILocalVariable(name: "__path", arg: 1, scope: !439, file: !345, line: 502, type: !11)
!464 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !439, file: !345, line: 502, type: !442)
!465 = !DILocation(line: 0, scope: !439)
!466 = !DILocation(line: 504, column: 10, scope: !439)
!467 = !DILocation(line: 504, column: 3, scope: !439)
!468 = distinct !DISubprogram(name: "lstat64", scope: !345, file: !345, line: 509, type: !440, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !469)
!469 = !{!470, !471}
!470 = !DILocalVariable(name: "__path", arg: 1, scope: !468, file: !345, line: 509, type: !11)
!471 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !468, file: !345, line: 509, type: !442)
!472 = !DILocation(line: 0, scope: !468)
!473 = !DILocation(line: 511, column: 10, scope: !468)
!474 = !DILocation(line: 511, column: 3, scope: !468)
!475 = distinct !DISubprogram(name: "fstat64", scope: !345, file: !345, line: 516, type: !476, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !478)
!476 = !DISubroutineType(types: !477)
!477 = !{!6, !6, !442}
!478 = !{!479, !480}
!479 = !DILocalVariable(name: "__fd", arg: 1, scope: !475, file: !345, line: 516, type: !6)
!480 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !475, file: !345, line: 516, type: !442)
!481 = !DILocation(line: 0, scope: !475)
!482 = !DILocation(line: 518, column: 10, scope: !475)
!483 = !DILocation(line: 518, column: 3, scope: !475)
!484 = distinct !DISubprogram(name: "fstatat64", scope: !345, file: !345, line: 523, type: !485, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !487)
!485 = !DISubroutineType(types: !486)
!486 = !{!6, !6, !11, !442, !6}
!487 = !{!488, !489, !490, !491}
!488 = !DILocalVariable(name: "__fd", arg: 1, scope: !484, file: !345, line: 523, type: !6)
!489 = !DILocalVariable(name: "__filename", arg: 2, scope: !484, file: !345, line: 523, type: !11)
!490 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !484, file: !345, line: 523, type: !442)
!491 = !DILocalVariable(name: "__flag", arg: 4, scope: !484, file: !345, line: 523, type: !6)
!492 = !DILocation(line: 0, scope: !484)
!493 = !DILocation(line: 526, column: 10, scope: !484)
!494 = !DILocation(line: 526, column: 3, scope: !484)
!495 = distinct !DISubprogram(name: "sparseset_alloc", scope: !1, file: !1, line: 28, type: !496, scopeLine: 29, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !498)
!496 = !DISubroutineType(types: !497)
!497 = !{!13, !20}
!498 = !{!499, !500, !501}
!499 = !DILocalVariable(name: "n_elms", arg: 1, scope: !495, file: !1, line: 28, type: !20)
!500 = !DILocalVariable(name: "n_bytes", scope: !495, file: !1, line: 30, type: !20)
!501 = !DILocalVariable(name: "set", scope: !495, file: !1, line: 38, type: !13)
!502 = !DILocation(line: 0, scope: !495)
!503 = !DILocation(line: 31, column: 21, scope: !495)
!504 = !DILocation(line: 31, column: 5, scope: !495)
!505 = !DILocation(line: 38, column: 43, scope: !495)
!506 = !DILocation(line: 38, column: 31, scope: !495)
!507 = !DILocation(line: 38, column: 19, scope: !495)
!508 = !DILocation(line: 39, column: 23, scope: !495)
!509 = !DILocation(line: 39, column: 14, scope: !495)
!510 = !DILocation(line: 40, column: 24, scope: !495)
!511 = !DILocation(line: 40, column: 19, scope: !495)
!512 = !DILocation(line: 40, column: 8, scope: !495)
!513 = !DILocation(line: 40, column: 15, scope: !495)
!514 = !DILocation(line: 41, column: 8, scope: !495)
!515 = !DILocation(line: 41, column: 13, scope: !495)
!516 = !DILocation(line: 42, column: 3, scope: !495)
!517 = !DILocation(line: 43, column: 3, scope: !495)
