; ModuleID = 'splay-tree.bc'
source_filename = "splay-tree.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.splay_tree_s = type { %struct.splay_tree_node_s*, i32 (i64, i64)*, void (i64)*, void (i64)*, i8* (i32, i8*)*, void (i8*, i8*)*, i8* }
%struct.splay_tree_node_s = type { i64, i64, %struct.splay_tree_node_s*, %struct.splay_tree_node_s* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @atoi(i8* %__nptr) local_unnamed_addr #0 !dbg !61 {
entry:
  call void @llvm.dbg.value(metadata i8* %__nptr, metadata !66, metadata !DIExpression()), !dbg !67
  %call = tail call i64 @strtol(i8* %__nptr, i8** null, i32 10) #5, !dbg !68
  %conv = trunc i64 %call to i32, !dbg !69
  ret i32 %conv, !dbg !70
}

declare dso_local i64 @strtol(i8*, i8**, i32) local_unnamed_addr #1

; Function Attrs: inlinehint nounwind uwtable

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "splay-tree.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !8, !9, !11, !12, !13, !6, !19, !24}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !6, size: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !7)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree", file: !14, line: 128, baseType: !15)
!14 = !DIFile(filename: "./include/splay-tree.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "splay_tree_s", file: !14, line: 109, size: 448, elements: !17)
!17 = !{!18, !31, !36, !41, !46, !51, !56}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !16, file: !14, line: 111, baseType: !19, size: 64)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_node", file: !14, line: 66, baseType: !20)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !21, size: 64)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "splay_tree_node_s", file: !14, line: 96, size: 256, elements: !22)
!22 = !{!23, !27, !29, !30}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !21, file: !14, line: 98, baseType: !24, size: 64)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_key", file: !14, line: 62, baseType: !25)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "libi_uhostptr_t", file: !14, line: 41, baseType: !26)
!26 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !21, file: !14, line: 101, baseType: !28, size: 64, offset: 64)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_value", file: !14, line: 63, baseType: !25)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !21, file: !14, line: 104, baseType: !19, size: 64, offset: 128)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !21, file: !14, line: 105, baseType: !19, size: 64, offset: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "comp", scope: !16, file: !14, line: 114, baseType: !32, size: 64, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_compare_fn", file: !14, line: 70, baseType: !33)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DISubroutineType(types: !35)
!35 = !{!4, !24, !24}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "delete_key", scope: !16, file: !14, line: 117, baseType: !37, size: 64, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_delete_key_fn", file: !14, line: 74, baseType: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DISubroutineType(types: !40)
!40 = !{null, !24}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "delete_value", scope: !16, file: !14, line: 120, baseType: !42, size: 64, offset: 192)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_delete_value_fn", file: !14, line: 78, baseType: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !28}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "allocate", scope: !16, file: !14, line: 123, baseType: !47, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_allocate_fn", file: !14, line: 87, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64)
!49 = !DISubroutineType(types: !50)
!50 = !{!8, !4, !8}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "deallocate", scope: !16, file: !14, line: 124, baseType: !52, size: 64, offset: 320)
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "splay_tree_deallocate_fn", file: !14, line: 93, baseType: !53)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DISubroutineType(types: !55)
!55 = !{null, !8, !8}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "allocate_data", scope: !16, file: !14, line: 125, baseType: !8, size: 64, offset: 384)
!57 = !{i32 2, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!61 = distinct !DISubprogram(name: "atoi", scope: !62, file: !62, line: 361, type: !63, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !65)
!62 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!63 = !DISubroutineType(types: !64)
!64 = !{!4, !9}
!65 = !{!66}
!66 = !DILocalVariable(name: "__nptr", arg: 1, scope: !61, file: !62, line: 361, type: !9)
!67 = !DILocation(line: 0, scope: !61)
!68 = !DILocation(line: 363, column: 16, scope: !61)
!69 = !DILocation(line: 363, column: 10, scope: !61)
!70 = !DILocation(line: 363, column: 3, scope: !61)
!71 = distinct !DISubprogram(name: "atol", scope: !62, file: !62, line: 366, type: !72, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !75)
!72 = !DISubroutineType(types: !73)
!73 = !{!74, !9}
!74 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!75 = !{!76}
!76 = !DILocalVariable(name: "__nptr", arg: 1, scope: !71, file: !62, line: 366, type: !9)
!77 = !DILocation(line: 0, scope: !71)
!78 = !DILocation(line: 368, column: 10, scope: !71)
!79 = !DILocation(line: 368, column: 3, scope: !71)
!80 = distinct !DISubprogram(name: "atoll", scope: !62, file: !62, line: 373, type: !81, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !84)
!81 = !DISubroutineType(types: !82)
!82 = !{!83, !9}
!83 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!84 = !{!85}
!85 = !DILocalVariable(name: "__nptr", arg: 1, scope: !80, file: !62, line: 373, type: !9)
!86 = !DILocation(line: 0, scope: !80)
!87 = !DILocation(line: 375, column: 10, scope: !80)
!88 = !DILocation(line: 375, column: 3, scope: !80)
!89 = distinct !DISubprogram(name: "bsearch", scope: !90, file: !90, line: 20, type: !91, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !101)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!91 = !DISubroutineType(types: !92)
!92 = !{!8, !93, !93, !95, !95, !97}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !96, line: 46, baseType: !26)
!96 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !62, line: 808, baseType: !98)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DISubroutineType(types: !100)
!100 = !{!4, !93, !93}
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111}
!102 = !DILocalVariable(name: "__key", arg: 1, scope: !89, file: !90, line: 20, type: !93)
!103 = !DILocalVariable(name: "__base", arg: 2, scope: !89, file: !90, line: 20, type: !93)
!104 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !89, file: !90, line: 20, type: !95)
!105 = !DILocalVariable(name: "__size", arg: 4, scope: !89, file: !90, line: 20, type: !95)
!106 = !DILocalVariable(name: "__compar", arg: 5, scope: !89, file: !90, line: 21, type: !97)
!107 = !DILocalVariable(name: "__l", scope: !89, file: !90, line: 23, type: !95)
!108 = !DILocalVariable(name: "__u", scope: !89, file: !90, line: 23, type: !95)
!109 = !DILocalVariable(name: "__idx", scope: !89, file: !90, line: 23, type: !95)
!110 = !DILocalVariable(name: "__p", scope: !89, file: !90, line: 24, type: !93)
!111 = !DILocalVariable(name: "__comparison", scope: !89, file: !90, line: 25, type: !4)
!112 = !DILocation(line: 0, scope: !89)
!113 = !DILocation(line: 29, column: 3, scope: !89)
!114 = !DILocation(line: 27, column: 7, scope: !89)
!115 = !DILocation(line: 29, column: 14, scope: !89)
!116 = !DILocation(line: 31, column: 20, scope: !117)
!117 = distinct !DILexicalBlock(scope: !89, file: !90, line: 30, column: 5)
!118 = !DILocation(line: 31, column: 27, scope: !117)
!119 = !DILocation(line: 32, column: 56, scope: !117)
!120 = !DILocation(line: 32, column: 47, scope: !117)
!121 = !DILocation(line: 33, column: 22, scope: !117)
!122 = !DILocation(line: 34, column: 24, scope: !123)
!123 = distinct !DILexicalBlock(scope: !117, file: !90, line: 34, column: 11)
!124 = !DILocation(line: 34, column: 11, scope: !117)
!125 = !DILocation(line: 36, column: 29, scope: !126)
!126 = distinct !DILexicalBlock(scope: !123, file: !90, line: 36, column: 16)
!127 = !DILocation(line: 36, column: 16, scope: !123)
!128 = !DILocation(line: 37, column: 14, scope: !126)
!129 = distinct !{!129, !113, !130}
!130 = !DILocation(line: 40, column: 5, scope: !89)
!131 = !DILocation(line: 43, column: 1, scope: !89)
!132 = distinct !DISubprogram(name: "atof", scope: !133, file: !133, line: 25, type: !134, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !137)
!133 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!134 = !DISubroutineType(types: !135)
!135 = !{!136, !9}
!136 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!137 = !{!138}
!138 = !DILocalVariable(name: "__nptr", arg: 1, scope: !132, file: !133, line: 25, type: !9)
!139 = !DILocation(line: 0, scope: !132)
!140 = !DILocation(line: 27, column: 10, scope: !132)
!141 = !DILocation(line: 27, column: 3, scope: !132)
!142 = distinct !DISubprogram(name: "vprintf", scope: !143, file: !143, line: 39, type: !144, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !155)
!143 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!144 = !DISubroutineType(types: !145)
!145 = !{!4, !146, !147}
!146 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !9)
!147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !148, size: 64)
!148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, line: 28, size: 192, elements: !149)
!149 = !{!150, !152, !153, !154}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !148, file: !1, line: 28, baseType: !151, size: 32)
!151 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !148, file: !1, line: 28, baseType: !151, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !148, file: !1, line: 28, baseType: !8, size: 64, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !148, file: !1, line: 28, baseType: !8, size: 64, offset: 128)
!155 = !{!156, !157}
!156 = !DILocalVariable(name: "__fmt", arg: 1, scope: !142, file: !143, line: 39, type: !146)
!157 = !DILocalVariable(name: "__arg", arg: 2, scope: !142, file: !143, line: 39, type: !147)
!158 = !DILocation(line: 0, scope: !142)
!159 = !DILocation(line: 41, column: 20, scope: !142)
!160 = !DILocation(line: 41, column: 10, scope: !142)
!161 = !DILocation(line: 41, column: 3, scope: !142)
!162 = distinct !DISubprogram(name: "getchar", scope: !143, file: !143, line: 47, type: !163, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!163 = !DISubroutineType(types: !164)
!164 = !{!4}
!165 = !DILocation(line: 49, column: 16, scope: !162)
!166 = !DILocation(line: 49, column: 10, scope: !162)
!167 = !DILocation(line: 49, column: 3, scope: !162)
!168 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !143, file: !143, line: 56, type: !169, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !226)
!169 = !DISubroutineType(types: !170)
!170 = !{!4, !171}
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !173, line: 7, baseType: !174)
!173 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !175, line: 49, size: 1728, elements: !176)
!175 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!176 = !{!177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !192, !194, !195, !196, !199, !201, !203, !207, !210, !212, !215, !218, !219, !220, !221, !222}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !174, file: !175, line: 51, baseType: !4, size: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !174, file: !175, line: 54, baseType: !6, size: 64, offset: 64)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !174, file: !175, line: 55, baseType: !6, size: 64, offset: 128)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !174, file: !175, line: 56, baseType: !6, size: 64, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !174, file: !175, line: 57, baseType: !6, size: 64, offset: 256)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !174, file: !175, line: 58, baseType: !6, size: 64, offset: 320)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !174, file: !175, line: 59, baseType: !6, size: 64, offset: 384)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !174, file: !175, line: 60, baseType: !6, size: 64, offset: 448)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !174, file: !175, line: 61, baseType: !6, size: 64, offset: 512)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !174, file: !175, line: 64, baseType: !6, size: 64, offset: 576)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !174, file: !175, line: 65, baseType: !6, size: 64, offset: 640)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !174, file: !175, line: 66, baseType: !6, size: 64, offset: 704)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !174, file: !175, line: 68, baseType: !190, size: 64, offset: 768)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !175, line: 36, flags: DIFlagFwdDecl)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !174, file: !175, line: 70, baseType: !193, size: 64, offset: 832)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !174, file: !175, line: 72, baseType: !4, size: 32, offset: 896)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !174, file: !175, line: 73, baseType: !4, size: 32, offset: 928)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !174, file: !175, line: 74, baseType: !197, size: 64, offset: 960)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !198, line: 152, baseType: !74)
!198 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !174, file: !175, line: 77, baseType: !200, size: 16, offset: 1024)
!200 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !174, file: !175, line: 78, baseType: !202, size: 8, offset: 1040)
!202 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !174, file: !175, line: 79, baseType: !204, size: 8, offset: 1048)
!204 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8, elements: !205)
!205 = !{!206}
!206 = !DISubrange(count: 1)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !174, file: !175, line: 81, baseType: !208, size: 64, offset: 1088)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !175, line: 43, baseType: null)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !174, file: !175, line: 89, baseType: !211, size: 64, offset: 1152)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !198, line: 153, baseType: !74)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !174, file: !175, line: 91, baseType: !213, size: 64, offset: 1216)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !175, line: 37, flags: DIFlagFwdDecl)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !174, file: !175, line: 92, baseType: !216, size: 64, offset: 1280)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !175, line: 38, flags: DIFlagFwdDecl)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !174, file: !175, line: 93, baseType: !193, size: 64, offset: 1344)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !174, file: !175, line: 94, baseType: !8, size: 64, offset: 1408)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !174, file: !175, line: 95, baseType: !95, size: 64, offset: 1472)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !174, file: !175, line: 96, baseType: !4, size: 32, offset: 1536)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !174, file: !175, line: 98, baseType: !223, size: 160, offset: 1568)
!223 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 160, elements: !224)
!224 = !{!225}
!225 = !DISubrange(count: 20)
!226 = !{!227}
!227 = !DILocalVariable(name: "__fp", arg: 1, scope: !168, file: !143, line: 56, type: !171)
!228 = !DILocation(line: 0, scope: !168)
!229 = !DILocation(line: 58, column: 10, scope: !168)
!230 = !DILocation(line: 58, column: 3, scope: !168)
!231 = distinct !DISubprogram(name: "getc_unlocked", scope: !143, file: !143, line: 66, type: !169, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !232)
!232 = !{!233}
!233 = !DILocalVariable(name: "__fp", arg: 1, scope: !231, file: !143, line: 66, type: !171)
!234 = !DILocation(line: 0, scope: !231)
!235 = !DILocation(line: 68, column: 10, scope: !231)
!236 = !DILocation(line: 68, column: 3, scope: !231)
!237 = distinct !DISubprogram(name: "getchar_unlocked", scope: !143, file: !143, line: 73, type: !163, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!238 = !DILocation(line: 75, column: 10, scope: !237)
!239 = !DILocation(line: 75, column: 3, scope: !237)
!240 = distinct !DISubprogram(name: "putchar", scope: !143, file: !143, line: 82, type: !241, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !243)
!241 = !DISubroutineType(types: !242)
!242 = !{!4, !4}
!243 = !{!244}
!244 = !DILocalVariable(name: "__c", arg: 1, scope: !240, file: !143, line: 82, type: !4)
!245 = !DILocation(line: 0, scope: !240)
!246 = !DILocation(line: 84, column: 21, scope: !240)
!247 = !DILocation(line: 84, column: 10, scope: !240)
!248 = !DILocation(line: 84, column: 3, scope: !240)
!249 = distinct !DISubprogram(name: "fputc_unlocked", scope: !143, file: !143, line: 91, type: !250, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !252)
!250 = !DISubroutineType(types: !251)
!251 = !{!4, !4, !171}
!252 = !{!253, !254}
!253 = !DILocalVariable(name: "__c", arg: 1, scope: !249, file: !143, line: 91, type: !4)
!254 = !DILocalVariable(name: "__stream", arg: 2, scope: !249, file: !143, line: 91, type: !171)
!255 = !DILocation(line: 0, scope: !249)
!256 = !DILocation(line: 93, column: 10, scope: !249)
!257 = !DILocation(line: 93, column: 3, scope: !249)
!258 = distinct !DISubprogram(name: "putc_unlocked", scope: !143, file: !143, line: 101, type: !250, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !259)
!259 = !{!260, !261}
!260 = !DILocalVariable(name: "__c", arg: 1, scope: !258, file: !143, line: 101, type: !4)
!261 = !DILocalVariable(name: "__stream", arg: 2, scope: !258, file: !143, line: 101, type: !171)
!262 = !DILocation(line: 0, scope: !258)
!263 = !DILocation(line: 103, column: 10, scope: !258)
!264 = !DILocation(line: 103, column: 3, scope: !258)
!265 = distinct !DISubprogram(name: "putchar_unlocked", scope: !143, file: !143, line: 108, type: !241, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !266)
!266 = !{!267}
!267 = !DILocalVariable(name: "__c", arg: 1, scope: !265, file: !143, line: 108, type: !4)
!268 = !DILocation(line: 0, scope: !265)
!269 = !DILocation(line: 110, column: 10, scope: !265)
!270 = !DILocation(line: 110, column: 3, scope: !265)
!271 = distinct !DISubprogram(name: "getline", scope: !143, file: !143, line: 118, type: !272, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !276)
!272 = !DISubroutineType(types: !273)
!273 = !{!274, !5, !275, !171}
!274 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !198, line: 193, baseType: !74)
