; ModuleID = 'sreal.bc'
source_filename = "sreal.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.sreal = type { i64, i32 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [13 x i8] c"(%lu * 2^%d)\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"sreal.c\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"?\00", align 1

; Function Attrs: inlinehint nounwind uwtable
define dso_local i32 @vprintf(i8* noalias %__fmt, %struct.__va_list_tag* %__arg) local_unnamed_addr #0 !dbg !18 {
entry:

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
!1 = !DIFile(filename: "sreal.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2 = !{}
!3 = !{!4, !5, !6, !7, !10, !11, !13}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !9)
!13 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!14 = !{i32 2, !"Dwarf Version", i32 4}
!15 = !{i32 2, !"Debug Info Version", i32 3}
!16 = !{i32 1, !"wchar_size", i32 4}
!17 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!18 = distinct !DISubprogram(name: "vprintf", scope: !19, file: !19, line: 39, type: !20, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !31)
!19 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!20 = !DISubroutineType(types: !21)
!21 = !{!6, !22, !23}
!22 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !11)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !25)
!25 = !{!26, !28, !29, !30}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !24, file: !1, baseType: !27, size: 32)
!27 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !24, file: !1, baseType: !27, size: 32, offset: 32)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !24, file: !1, baseType: !10, size: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !24, file: !1, baseType: !10, size: 64, offset: 128)
!31 = !{!32, !33}
!32 = !DILocalVariable(name: "__fmt", arg: 1, scope: !18, file: !19, line: 39, type: !22)
!33 = !DILocalVariable(name: "__arg", arg: 2, scope: !18, file: !19, line: 39, type: !23)
!34 = !DILocation(line: 0, scope: !18)
!35 = !DILocation(line: 41, column: 20, scope: !18)
!36 = !DILocation(line: 41, column: 10, scope: !18)
!37 = !DILocation(line: 41, column: 3, scope: !18)
!38 = distinct !DISubprogram(name: "getchar", scope: !19, file: !19, line: 47, type: !39, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!39 = !DISubroutineType(types: !40)
!40 = !{!6}
!41 = !DILocation(line: 49, column: 16, scope: !38)
!42 = !DILocation(line: 49, column: 10, scope: !38)
!43 = !DILocation(line: 49, column: 3, scope: !38)
!44 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !19, file: !19, line: 56, type: !45, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !105)
!45 = !DISubroutineType(types: !46)
!46 = !{!6, !47}
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !49, line: 7, baseType: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !51, line: 49, size: 1728, elements: !52)
!51 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!52 = !{!53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !68, !70, !71, !72, !76, !78, !80, !84, !87, !89, !92, !95, !96, !97, !100, !101}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !50, file: !51, line: 51, baseType: !6, size: 32)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !50, file: !51, line: 54, baseType: !8, size: 64, offset: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !50, file: !51, line: 55, baseType: !8, size: 64, offset: 128)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !50, file: !51, line: 56, baseType: !8, size: 64, offset: 192)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !50, file: !51, line: 57, baseType: !8, size: 64, offset: 256)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !50, file: !51, line: 58, baseType: !8, size: 64, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !50, file: !51, line: 59, baseType: !8, size: 64, offset: 384)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !50, file: !51, line: 60, baseType: !8, size: 64, offset: 448)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !50, file: !51, line: 61, baseType: !8, size: 64, offset: 512)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !50, file: !51, line: 64, baseType: !8, size: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !50, file: !51, line: 65, baseType: !8, size: 64, offset: 640)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !50, file: !51, line: 66, baseType: !8, size: 64, offset: 704)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !50, file: !51, line: 68, baseType: !66, size: 64, offset: 768)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !51, line: 36, flags: DIFlagFwdDecl)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !50, file: !51, line: 70, baseType: !69, size: 64, offset: 832)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !50, file: !51, line: 72, baseType: !6, size: 32, offset: 896)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !50, file: !51, line: 73, baseType: !6, size: 32, offset: 928)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !50, file: !51, line: 74, baseType: !73, size: 64, offset: 960)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !74, line: 152, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!75 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !50, file: !51, line: 77, baseType: !77, size: 16, offset: 1024)
!77 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !50, file: !51, line: 78, baseType: !79, size: 8, offset: 1040)
!79 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !50, file: !51, line: 79, baseType: !81, size: 8, offset: 1048)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 8, elements: !82)
!82 = !{!83}
!83 = !DISubrange(count: 1)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !50, file: !51, line: 81, baseType: !85, size: 64, offset: 1088)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !51, line: 43, baseType: null)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !50, file: !51, line: 89, baseType: !88, size: 64, offset: 1152)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !74, line: 153, baseType: !75)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !50, file: !51, line: 91, baseType: !90, size: 64, offset: 1216)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !51, line: 37, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !50, file: !51, line: 92, baseType: !93, size: 64, offset: 1280)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !51, line: 38, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !50, file: !51, line: 93, baseType: !69, size: 64, offset: 1344)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !50, file: !51, line: 94, baseType: !10, size: 64, offset: 1408)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !50, file: !51, line: 95, baseType: !98, size: 64, offset: 1472)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !99, line: 46, baseType: !13)
!99 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !50, file: !51, line: 96, baseType: !6, size: 32, offset: 1536)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !50, file: !51, line: 98, baseType: !102, size: 160, offset: 1568)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 160, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 20)
!105 = !{!106}
!106 = !DILocalVariable(name: "__fp", arg: 1, scope: !44, file: !19, line: 56, type: !47)
!107 = !DILocation(line: 0, scope: !44)
!108 = !DILocation(line: 58, column: 10, scope: !44)
!109 = !DILocation(line: 58, column: 3, scope: !44)
!110 = distinct !DISubprogram(name: "getc_unlocked", scope: !19, file: !19, line: 66, type: !45, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !111)
!111 = !{!112}
!112 = !DILocalVariable(name: "__fp", arg: 1, scope: !110, file: !19, line: 66, type: !47)
!113 = !DILocation(line: 0, scope: !110)
!114 = !DILocation(line: 68, column: 10, scope: !110)
!115 = !DILocation(line: 68, column: 3, scope: !110)
!116 = distinct !DISubprogram(name: "getchar_unlocked", scope: !19, file: !19, line: 73, type: !39, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !2)
!117 = !DILocation(line: 75, column: 10, scope: !116)
!118 = !DILocation(line: 75, column: 3, scope: !116)
!119 = distinct !DISubprogram(name: "putchar", scope: !19, file: !19, line: 82, type: !120, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !122)
!120 = !DISubroutineType(types: !121)
!121 = !{!6, !6}
!122 = !{!123}
!123 = !DILocalVariable(name: "__c", arg: 1, scope: !119, file: !19, line: 82, type: !6)
!124 = !DILocation(line: 0, scope: !119)
!125 = !DILocation(line: 84, column: 21, scope: !119)
!126 = !DILocation(line: 84, column: 10, scope: !119)
!127 = !DILocation(line: 84, column: 3, scope: !119)
!128 = distinct !DISubprogram(name: "fputc_unlocked", scope: !19, file: !19, line: 91, type: !129, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !131)
!129 = !DISubroutineType(types: !130)
!130 = !{!6, !6, !47}
!131 = !{!132, !133}
!132 = !DILocalVariable(name: "__c", arg: 1, scope: !128, file: !19, line: 91, type: !6)
!133 = !DILocalVariable(name: "__stream", arg: 2, scope: !128, file: !19, line: 91, type: !47)
!134 = !DILocation(line: 0, scope: !128)
!135 = !DILocation(line: 93, column: 10, scope: !128)
!136 = !DILocation(line: 93, column: 3, scope: !128)
!137 = distinct !DISubprogram(name: "putc_unlocked", scope: !19, file: !19, line: 101, type: !129, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !138)
!138 = !{!139, !140}
!139 = !DILocalVariable(name: "__c", arg: 1, scope: !137, file: !19, line: 101, type: !6)
!140 = !DILocalVariable(name: "__stream", arg: 2, scope: !137, file: !19, line: 101, type: !47)
!141 = !DILocation(line: 0, scope: !137)
!142 = !DILocation(line: 103, column: 10, scope: !137)
!143 = !DILocation(line: 103, column: 3, scope: !137)
!144 = distinct !DISubprogram(name: "putchar_unlocked", scope: !19, file: !19, line: 108, type: !120, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !145)
!145 = !{!146}
!146 = !DILocalVariable(name: "__c", arg: 1, scope: !144, file: !19, line: 108, type: !6)
!147 = !DILocation(line: 0, scope: !144)
!148 = !DILocation(line: 110, column: 10, scope: !144)
!149 = !DILocation(line: 110, column: 3, scope: !144)
!150 = distinct !DISubprogram(name: "getline", scope: !19, file: !19, line: 118, type: !151, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !155)
!151 = !DISubroutineType(types: !152)
!152 = !{!153, !7, !154, !47}
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !74, line: 193, baseType: !75)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!155 = !{!156, !157, !158}
!156 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !150, file: !19, line: 118, type: !7)
!157 = !DILocalVariable(name: "__n", arg: 2, scope: !150, file: !19, line: 118, type: !154)
!158 = !DILocalVariable(name: "__stream", arg: 3, scope: !150, file: !19, line: 118, type: !47)
!159 = !DILocation(line: 0, scope: !150)
!160 = !DILocation(line: 120, column: 10, scope: !150)
!161 = !DILocation(line: 120, column: 3, scope: !150)
!162 = distinct !DISubprogram(name: "feof_unlocked", scope: !19, file: !19, line: 128, type: !45, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !163)
!163 = !{!164}
!164 = !DILocalVariable(name: "__stream", arg: 1, scope: !162, file: !19, line: 128, type: !47)
!165 = !DILocation(line: 0, scope: !162)
!166 = !DILocation(line: 130, column: 10, scope: !162)
!167 = !DILocation(line: 130, column: 3, scope: !162)
!168 = distinct !DISubprogram(name: "ferror_unlocked", scope: !19, file: !19, line: 135, type: !45, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !169)
!169 = !{!170}
!170 = !DILocalVariable(name: "__stream", arg: 1, scope: !168, file: !19, line: 135, type: !47)
!171 = !DILocation(line: 0, scope: !168)
!172 = !DILocation(line: 137, column: 10, scope: !168)
!173 = !DILocation(line: 137, column: 3, scope: !168)
!174 = distinct !DISubprogram(name: "tolower", scope: !175, file: !175, line: 207, type: !120, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !176)
!175 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!176 = !{!177}
!177 = !DILocalVariable(name: "__c", arg: 1, scope: !174, file: !175, line: 207, type: !6)
!178 = !DILocation(line: 0, scope: !174)
!179 = !DILocation(line: 209, column: 22, scope: !174)
!180 = !DILocation(line: 209, column: 39, scope: !174)
!181 = !DILocation(line: 209, column: 38, scope: !174)
!182 = !DILocation(line: 209, column: 37, scope: !174)
!183 = !DILocation(line: 209, column: 10, scope: !174)
!184 = !DILocation(line: 209, column: 3, scope: !174)
!185 = distinct !DISubprogram(name: "toupper", scope: !175, file: !175, line: 213, type: !120, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !186)
!186 = !{!187}
!187 = !DILocalVariable(name: "__c", arg: 1, scope: !185, file: !175, line: 213, type: !6)
!188 = !DILocation(line: 0, scope: !185)
!189 = !DILocation(line: 215, column: 22, scope: !185)
!190 = !DILocation(line: 215, column: 39, scope: !185)
!191 = !DILocation(line: 215, column: 38, scope: !185)
!192 = !DILocation(line: 215, column: 37, scope: !185)
!193 = !DILocation(line: 215, column: 10, scope: !185)
!194 = !DILocation(line: 215, column: 3, scope: !185)
!195 = distinct !DISubprogram(name: "atoi", scope: !196, file: !196, line: 361, type: !197, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !199)
!196 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!197 = !DISubroutineType(types: !198)
!198 = !{!6, !11}
!199 = !{!200}
!200 = !DILocalVariable(name: "__nptr", arg: 1, scope: !195, file: !196, line: 361, type: !11)
!201 = !DILocation(line: 0, scope: !195)
!202 = !DILocation(line: 363, column: 16, scope: !195)
!203 = !DILocation(line: 363, column: 10, scope: !195)
!204 = !DILocation(line: 363, column: 3, scope: !195)
!205 = distinct !DISubprogram(name: "atol", scope: !196, file: !196, line: 366, type: !206, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !208)
!206 = !DISubroutineType(types: !207)
!207 = !{!75, !11}
!208 = !{!209}
!209 = !DILocalVariable(name: "__nptr", arg: 1, scope: !205, file: !196, line: 366, type: !11)
!210 = !DILocation(line: 0, scope: !205)
!211 = !DILocation(line: 368, column: 10, scope: !205)
!212 = !DILocation(line: 368, column: 3, scope: !205)
!213 = distinct !DISubprogram(name: "atoll", scope: !196, file: !196, line: 373, type: !214, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !217)
!214 = !DISubroutineType(types: !215)
!215 = !{!216, !11}
!216 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!217 = !{!218}
!218 = !DILocalVariable(name: "__nptr", arg: 1, scope: !213, file: !196, line: 373, type: !11)
!219 = !DILocation(line: 0, scope: !213)
!220 = !DILocation(line: 375, column: 10, scope: !213)
!221 = !DILocation(line: 375, column: 3, scope: !213)
!222 = distinct !DISubprogram(name: "bsearch", scope: !223, file: !223, line: 20, type: !224, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !232)
!223 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!224 = !DISubroutineType(types: !225)
!225 = !{!10, !226, !226, !98, !98, !228}
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!228 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !196, line: 808, baseType: !229)
!229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !230, size: 64)
!230 = !DISubroutineType(types: !231)
!231 = !{!6, !226, !226}
!232 = !{!233, !234, !235, !236, !237, !238, !239, !240, !241, !242}
!233 = !DILocalVariable(name: "__key", arg: 1, scope: !222, file: !223, line: 20, type: !226)
!234 = !DILocalVariable(name: "__base", arg: 2, scope: !222, file: !223, line: 20, type: !226)
!235 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !222, file: !223, line: 20, type: !98)
!236 = !DILocalVariable(name: "__size", arg: 4, scope: !222, file: !223, line: 20, type: !98)
!237 = !DILocalVariable(name: "__compar", arg: 5, scope: !222, file: !223, line: 21, type: !228)
!238 = !DILocalVariable(name: "__l", scope: !222, file: !223, line: 23, type: !98)
!239 = !DILocalVariable(name: "__u", scope: !222, file: !223, line: 23, type: !98)
!240 = !DILocalVariable(name: "__idx", scope: !222, file: !223, line: 23, type: !98)
!241 = !DILocalVariable(name: "__p", scope: !222, file: !223, line: 24, type: !226)
!242 = !DILocalVariable(name: "__comparison", scope: !222, file: !223, line: 25, type: !6)
!243 = !DILocation(line: 0, scope: !222)
!244 = !DILocation(line: 29, column: 3, scope: !222)
!245 = !DILocation(line: 27, column: 7, scope: !222)
!246 = !DILocation(line: 29, column: 14, scope: !222)
!247 = !DILocation(line: 31, column: 20, scope: !248)
!248 = distinct !DILexicalBlock(scope: !222, file: !223, line: 30, column: 5)
!249 = !DILocation(line: 31, column: 27, scope: !248)
!250 = !DILocation(line: 32, column: 56, scope: !248)
!251 = !DILocation(line: 32, column: 47, scope: !248)
!252 = !DILocation(line: 33, column: 22, scope: !248)
!253 = !DILocation(line: 34, column: 24, scope: !254)
!254 = distinct !DILexicalBlock(scope: !248, file: !223, line: 34, column: 11)
!255 = !DILocation(line: 34, column: 11, scope: !248)
!256 = !DILocation(line: 36, column: 29, scope: !257)
!257 = distinct !DILexicalBlock(scope: !254, file: !223, line: 36, column: 16)
!258 = !DILocation(line: 36, column: 16, scope: !254)
!259 = !DILocation(line: 37, column: 14, scope: !257)
!260 = distinct !{!260, !244, !261}
!261 = !DILocation(line: 40, column: 5, scope: !222)
!262 = !DILocation(line: 43, column: 1, scope: !222)
!263 = distinct !DISubprogram(name: "atof", scope: !264, file: !264, line: 25, type: !265, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !268)
!264 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!265 = !DISubroutineType(types: !266)
!266 = !{!267, !11}
!267 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!268 = !{!269}
!269 = !DILocalVariable(name: "__nptr", arg: 1, scope: !263, file: !264, line: 25, type: !11)
!270 = !DILocation(line: 0, scope: !263)
!271 = !DILocation(line: 27, column: 10, scope: !263)
!272 = !DILocation(line: 27, column: 3, scope: !263)
!273 = distinct !DISubprogram(name: "strtoimax", scope: !274, file: !274, line: 324, type: !275, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !281)
!274 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!275 = !DISubroutineType(types: !276)
!276 = !{!277, !22, !280, !6}
!277 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !278, line: 101, baseType: !279)
!278 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!279 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !74, line: 72, baseType: !75)
!280 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !7)
!281 = !{!282, !283, !284}
!282 = !DILocalVariable(name: "nptr", arg: 1, scope: !273, file: !274, line: 324, type: !22)
!283 = !DILocalVariable(name: "endptr", arg: 2, scope: !273, file: !274, line: 324, type: !280)
!284 = !DILocalVariable(name: "base", arg: 3, scope: !273, file: !274, line: 324, type: !6)
!285 = !DILocation(line: 0, scope: !273)
!286 = !DILocation(line: 327, column: 10, scope: !273)
!287 = !DILocation(line: 327, column: 3, scope: !273)
!288 = distinct !DISubprogram(name: "strtoumax", scope: !274, file: !274, line: 336, type: !289, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !293)
!289 = !DISubroutineType(types: !290)
!290 = !{!291, !22, !280, !6}
!291 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !278, line: 102, baseType: !292)
!292 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !74, line: 73, baseType: !13)
!293 = !{!294, !295, !296}
!294 = !DILocalVariable(name: "nptr", arg: 1, scope: !288, file: !274, line: 336, type: !22)
!295 = !DILocalVariable(name: "endptr", arg: 2, scope: !288, file: !274, line: 336, type: !280)
!296 = !DILocalVariable(name: "base", arg: 3, scope: !288, file: !274, line: 336, type: !6)
!297 = !DILocation(line: 0, scope: !288)
!298 = !DILocation(line: 339, column: 10, scope: !288)
!299 = !DILocation(line: 339, column: 3, scope: !288)
!300 = distinct !DISubprogram(name: "wcstoimax", scope: !274, file: !274, line: 348, type: !301, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !310)
!301 = !DISubroutineType(types: !302)
!302 = !{!277, !303, !307, !6}
!303 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !304)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !306)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !274, line: 34, baseType: !6)
!307 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !308)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !306, size: 64)
!310 = !{!311, !312, !313}
!311 = !DILocalVariable(name: "nptr", arg: 1, scope: !300, file: !274, line: 348, type: !303)
!312 = !DILocalVariable(name: "endptr", arg: 2, scope: !300, file: !274, line: 348, type: !307)
!313 = !DILocalVariable(name: "base", arg: 3, scope: !300, file: !274, line: 348, type: !6)
!314 = !DILocation(line: 0, scope: !300)
!315 = !DILocation(line: 351, column: 10, scope: !300)
!316 = !DILocation(line: 351, column: 3, scope: !300)
!317 = distinct !DISubprogram(name: "wcstoumax", scope: !274, file: !274, line: 362, type: !318, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !320)
!318 = !DISubroutineType(types: !319)
!319 = !{!291, !303, !307, !6}
!320 = !{!321, !322, !323}
!321 = !DILocalVariable(name: "nptr", arg: 1, scope: !317, file: !274, line: 362, type: !303)
!322 = !DILocalVariable(name: "endptr", arg: 2, scope: !317, file: !274, line: 362, type: !307)
!323 = !DILocalVariable(name: "base", arg: 3, scope: !317, file: !274, line: 362, type: !6)
!324 = !DILocation(line: 0, scope: !317)
!325 = !DILocation(line: 365, column: 10, scope: !317)
!326 = !DILocation(line: 365, column: 3, scope: !317)
!327 = distinct !DISubprogram(name: "stat", scope: !328, file: !328, line: 453, type: !329, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !368)
!328 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!329 = !DISubroutineType(types: !330)
!330 = !{!6, !11, !331}
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !333, line: 46, size: 1152, elements: !334)
!333 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!334 = !{!335, !337, !339, !341, !343, !345, !347, !348, !349, !350, !352, !354, !362, !363, !364}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !332, file: !333, line: 48, baseType: !336, size: 64)
!336 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !74, line: 145, baseType: !13)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !332, file: !333, line: 53, baseType: !338, size: 64, offset: 64)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !74, line: 148, baseType: !13)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !332, file: !333, line: 61, baseType: !340, size: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !74, line: 151, baseType: !13)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !332, file: !333, line: 62, baseType: !342, size: 32, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !74, line: 150, baseType: !27)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !332, file: !333, line: 64, baseType: !344, size: 32, offset: 224)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !74, line: 146, baseType: !27)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !332, file: !333, line: 65, baseType: !346, size: 32, offset: 256)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !74, line: 147, baseType: !27)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !332, file: !333, line: 67, baseType: !6, size: 32, offset: 288)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !332, file: !333, line: 69, baseType: !336, size: 64, offset: 320)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !332, file: !333, line: 74, baseType: !73, size: 64, offset: 384)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !332, file: !333, line: 78, baseType: !351, size: 64, offset: 448)
!351 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !74, line: 174, baseType: !75)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !332, file: !333, line: 80, baseType: !353, size: 64, offset: 512)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !74, line: 179, baseType: !75)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !332, file: !333, line: 91, baseType: !355, size: 128, offset: 576)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !356, line: 10, size: 128, elements: !357)
!356 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!357 = !{!358, !360}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !355, file: !356, line: 12, baseType: !359, size: 64)
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !74, line: 160, baseType: !75)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !355, file: !356, line: 16, baseType: !361, size: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !74, line: 196, baseType: !75)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !332, file: !333, line: 92, baseType: !355, size: 128, offset: 704)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !332, file: !333, line: 93, baseType: !355, size: 128, offset: 832)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !332, file: !333, line: 106, baseType: !365, size: 192, offset: 960)
!365 = !DICompositeType(tag: DW_TAG_array_type, baseType: !361, size: 192, elements: !366)
!366 = !{!367}
!367 = !DISubrange(count: 3)
!368 = !{!369, !370}
!369 = !DILocalVariable(name: "__path", arg: 1, scope: !327, file: !328, line: 453, type: !11)
!370 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !327, file: !328, line: 453, type: !331)
!371 = !DILocation(line: 0, scope: !327)
!372 = !DILocation(line: 455, column: 10, scope: !327)
!373 = !DILocation(line: 455, column: 3, scope: !327)
!374 = distinct !DISubprogram(name: "lstat", scope: !328, file: !328, line: 460, type: !329, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !375)
!375 = !{!376, !377}
!376 = !DILocalVariable(name: "__path", arg: 1, scope: !374, file: !328, line: 460, type: !11)
!377 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !374, file: !328, line: 460, type: !331)
!378 = !DILocation(line: 0, scope: !374)
!379 = !DILocation(line: 462, column: 10, scope: !374)
!380 = !DILocation(line: 462, column: 3, scope: !374)
!381 = distinct !DISubprogram(name: "fstat", scope: !328, file: !328, line: 467, type: !382, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !384)
!382 = !DISubroutineType(types: !383)
!383 = !{!6, !6, !331}
!384 = !{!385, !386}
!385 = !DILocalVariable(name: "__fd", arg: 1, scope: !381, file: !328, line: 467, type: !6)
!386 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !381, file: !328, line: 467, type: !331)
!387 = !DILocation(line: 0, scope: !381)
!388 = !DILocation(line: 469, column: 10, scope: !381)
!389 = !DILocation(line: 469, column: 3, scope: !381)
!390 = distinct !DISubprogram(name: "fstatat", scope: !328, file: !328, line: 474, type: !391, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !393)
!391 = !DISubroutineType(types: !392)
!392 = !{!6, !6, !11, !331, !6}
!393 = !{!394, !395, !396, !397}
!394 = !DILocalVariable(name: "__fd", arg: 1, scope: !390, file: !328, line: 474, type: !6)
!395 = !DILocalVariable(name: "__filename", arg: 2, scope: !390, file: !328, line: 474, type: !11)
!396 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !390, file: !328, line: 474, type: !331)
!397 = !DILocalVariable(name: "__flag", arg: 4, scope: !390, file: !328, line: 474, type: !6)
!398 = !DILocation(line: 0, scope: !390)
!399 = !DILocation(line: 477, column: 10, scope: !390)
!400 = !DILocation(line: 477, column: 3, scope: !390)
!401 = distinct !DISubprogram(name: "mknod", scope: !328, file: !328, line: 483, type: !402, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !404)
!402 = !DISubroutineType(types: !403)
!403 = !{!6, !11, !342, !336}
!404 = !{!405, !406, !407}
!405 = !DILocalVariable(name: "__path", arg: 1, scope: !401, file: !328, line: 483, type: !11)
!406 = !DILocalVariable(name: "__mode", arg: 2, scope: !401, file: !328, line: 483, type: !342)
!407 = !DILocalVariable(name: "__dev", arg: 3, scope: !401, file: !328, line: 483, type: !336)
!408 = !DILocation(line: 0, scope: !401)
!409 = !DILocation(line: 485, column: 10, scope: !401)
!410 = !DILocation(line: 485, column: 3, scope: !401)
!411 = distinct !DISubprogram(name: "mknodat", scope: !328, file: !328, line: 491, type: !412, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !414)
!412 = !DISubroutineType(types: !413)
!413 = !{!6, !6, !11, !342, !336}
!414 = !{!415, !416, !417, !418}
!415 = !DILocalVariable(name: "__fd", arg: 1, scope: !411, file: !328, line: 491, type: !6)
!416 = !DILocalVariable(name: "__path", arg: 2, scope: !411, file: !328, line: 491, type: !11)
!417 = !DILocalVariable(name: "__mode", arg: 3, scope: !411, file: !328, line: 491, type: !342)
!418 = !DILocalVariable(name: "__dev", arg: 4, scope: !411, file: !328, line: 491, type: !336)
!419 = !DILocation(line: 0, scope: !411)
!420 = !DILocation(line: 494, column: 10, scope: !411)
!421 = !DILocation(line: 494, column: 3, scope: !411)
!422 = distinct !DISubprogram(name: "stat64", scope: !328, file: !328, line: 502, type: !423, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !445)
!423 = !DISubroutineType(types: !424)
!424 = !{!6, !11, !425}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !333, line: 119, size: 1152, elements: !427)
!427 = !{!428, !429, !431, !432, !433, !434, !435, !436, !437, !438, !439, !441, !442, !443, !444}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !426, file: !333, line: 121, baseType: !336, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !426, file: !333, line: 123, baseType: !430, size: 64, offset: 64)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !74, line: 149, baseType: !13)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !426, file: !333, line: 124, baseType: !340, size: 64, offset: 128)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !426, file: !333, line: 125, baseType: !342, size: 32, offset: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !426, file: !333, line: 132, baseType: !344, size: 32, offset: 224)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !426, file: !333, line: 133, baseType: !346, size: 32, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !426, file: !333, line: 135, baseType: !6, size: 32, offset: 288)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !426, file: !333, line: 136, baseType: !336, size: 64, offset: 320)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !426, file: !333, line: 137, baseType: !73, size: 64, offset: 384)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !426, file: !333, line: 143, baseType: !351, size: 64, offset: 448)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !426, file: !333, line: 144, baseType: !440, size: 64, offset: 512)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !74, line: 180, baseType: !75)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !426, file: !333, line: 152, baseType: !355, size: 128, offset: 576)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !426, file: !333, line: 153, baseType: !355, size: 128, offset: 704)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !426, file: !333, line: 154, baseType: !355, size: 128, offset: 832)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !426, file: !333, line: 164, baseType: !365, size: 192, offset: 960)
!445 = !{!446, !447}
!446 = !DILocalVariable(name: "__path", arg: 1, scope: !422, file: !328, line: 502, type: !11)
!447 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !422, file: !328, line: 502, type: !425)
!448 = !DILocation(line: 0, scope: !422)
!449 = !DILocation(line: 504, column: 10, scope: !422)
!450 = !DILocation(line: 504, column: 3, scope: !422)
!451 = distinct !DISubprogram(name: "lstat64", scope: !328, file: !328, line: 509, type: !423, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !452)
!452 = !{!453, !454}
!453 = !DILocalVariable(name: "__path", arg: 1, scope: !451, file: !328, line: 509, type: !11)
!454 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !451, file: !328, line: 509, type: !425)
!455 = !DILocation(line: 0, scope: !451)
!456 = !DILocation(line: 511, column: 10, scope: !451)
!457 = !DILocation(line: 511, column: 3, scope: !451)
!458 = distinct !DISubprogram(name: "fstat64", scope: !328, file: !328, line: 516, type: !459, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !461)
!459 = !DISubroutineType(types: !460)
!460 = !{!6, !6, !425}
!461 = !{!462, !463}
!462 = !DILocalVariable(name: "__fd", arg: 1, scope: !458, file: !328, line: 516, type: !6)
!463 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !458, file: !328, line: 516, type: !425)
!464 = !DILocation(line: 0, scope: !458)
!465 = !DILocation(line: 518, column: 10, scope: !458)
!466 = !DILocation(line: 518, column: 3, scope: !458)
!467 = distinct !DISubprogram(name: "fstatat64", scope: !328, file: !328, line: 523, type: !468, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !470)
!468 = !DISubroutineType(types: !469)
!469 = !{!6, !6, !11, !425, !6}
!470 = !{!471, !472, !473, !474}
!471 = !DILocalVariable(name: "__fd", arg: 1, scope: !467, file: !328, line: 523, type: !6)
!472 = !DILocalVariable(name: "__filename", arg: 2, scope: !467, file: !328, line: 523, type: !11)
!473 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !467, file: !328, line: 523, type: !425)
!474 = !DILocalVariable(name: "__flag", arg: 4, scope: !467, file: !328, line: 523, type: !6)
!475 = !DILocation(line: 0, scope: !467)
!476 = !DILocation(line: 526, column: 10, scope: !467)
!477 = !DILocation(line: 526, column: 3, scope: !467)
!478 = distinct !DISubprogram(name: "dump_sreal", scope: !1, file: !1, line: 65, type: !479, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !488)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !47, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "sreal", file: !483, line: 53, baseType: !484)
!483 = !DIFile(filename: "./sreal.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sreal", file: !483, line: 44, size: 128, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !484, file: !483, line: 50, baseType: !13, size: 64)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !484, file: !483, line: 52, baseType: !6, size: 32, offset: 64)
!488 = !{!489, !490}
!489 = !DILocalVariable(name: "file", arg: 1, scope: !478, file: !1, line: 65, type: !47)
!490 = !DILocalVariable(name: "x", arg: 2, scope: !478, file: !1, line: 65, type: !481)
!491 = !DILocation(line: 0, scope: !478)
!492 = !DILocation(line: 72, column: 66, scope: !478)
!493 = !DILocation(line: 72, column: 74, scope: !478)
!494 = !DILocation(line: 72, column: 3, scope: !478)
!495 = !DILocation(line: 74, column: 1, scope: !478)
!496 = distinct !DISubprogram(name: "sreal_init", scope: !1, file: !1, line: 270, type: !497, scopeLine: 271, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !499)
!497 = !DISubroutineType(types: !498)
!498 = !{!481, !481, !13, !6}
!499 = !{!500, !501, !502}
!500 = !DILocalVariable(name: "r", arg: 1, scope: !496, file: !1, line: 270, type: !481)
!501 = !DILocalVariable(name: "sig", arg: 2, scope: !496, file: !1, line: 270, type: !13)
!502 = !DILocalVariable(name: "exp", arg: 3, scope: !496, file: !1, line: 270, type: !6)
!503 = !DILocation(line: 0, scope: !496)
!504 = !DILocation(line: 277, column: 6, scope: !496)
!505 = !DILocation(line: 277, column: 10, scope: !496)
!506 = !DILocation(line: 278, column: 6, scope: !496)
!507 = !DILocation(line: 278, column: 10, scope: !496)
!508 = !DILocation(line: 280, column: 3, scope: !496)
!509 = !DILocation(line: 281, column: 3, scope: !496)
!510 = distinct !DISubprogram(name: "normalize", scope: !1, file: !1, line: 134, type: !511, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !513)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !481}
!513 = !{!514, !515}
!514 = !DILocalVariable(name: "x", arg: 1, scope: !510, file: !1, line: 134, type: !481)
!515 = !DILocalVariable(name: "last_bit", scope: !516, file: !1, line: 240, type: !6)
!516 = distinct !DILexicalBlock(scope: !517, file: !1, line: 239, column: 5)
!517 = distinct !DILexicalBlock(scope: !518, file: !1, line: 238, column: 12)
!518 = distinct !DILexicalBlock(scope: !519, file: !1, line: 222, column: 12)
!519 = distinct !DILexicalBlock(scope: !510, file: !1, line: 218, column: 7)
!520 = !DILocation(line: 0, scope: !510)
!521 = !DILocation(line: 218, column: 10, scope: !519)
!522 = !DILocation(line: 218, column: 14, scope: !519)
!523 = !DILocation(line: 218, column: 7, scope: !510)
!524 = !DILocation(line: 220, column: 10, scope: !525)
!525 = distinct !DILexicalBlock(scope: !519, file: !1, line: 219, column: 5)
!526 = !DILocation(line: 220, column: 14, scope: !525)
!527 = !DILocation(line: 221, column: 5, scope: !525)
!528 = !DILocation(line: 222, column: 19, scope: !518)
!529 = !DILocation(line: 222, column: 12, scope: !519)
!530 = !DILocation(line: 0, scope: !531)
!531 = distinct !DILexicalBlock(scope: !532, file: !1, line: 225, column: 2)
!532 = distinct !DILexicalBlock(scope: !518, file: !1, line: 223, column: 5)
!533 = !DILocation(line: 227, column: 10, scope: !531)
!534 = !DILocation(line: 224, column: 7, scope: !532)
!535 = !DILocation(line: 226, column: 11, scope: !531)
!536 = !DILocation(line: 229, column: 21, scope: !532)
!537 = !DILocation(line: 228, column: 2, scope: !531)
!538 = distinct !{!538, !534, !539}
!539 = !DILocation(line: 229, column: 36, scope: !532)
!540 = !DILocation(line: 232, column: 18, scope: !541)
!541 = distinct !DILexicalBlock(scope: !532, file: !1, line: 232, column: 11)
!542 = !DILocation(line: 232, column: 11, scope: !532)
!543 = !DILocation(line: 234, column: 11, scope: !544)
!544 = distinct !DILexicalBlock(scope: !541, file: !1, line: 233, column: 2)
!545 = !DILocation(line: 235, column: 11, scope: !544)
!546 = !DILocation(line: 236, column: 2, scope: !544)
!547 = !DILocation(line: 238, column: 19, scope: !517)
!548 = !DILocation(line: 238, column: 12, scope: !518)
!549 = !DILocation(line: 0, scope: !550)
