; ModuleID = 'stack-ptr-mod.bc'
source_filename = "stack-ptr-mod.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!634 = !DIEnumerator(name: "SMAX", value: 71, isUnsigned: true)
!635 = !DIEnumerator(name: "UMIN", value: 72, isUnsigned: true)
!636 = !DIEnumerator(name: "UMAX", value: 73, isUnsigned: true)
!637 = !DIEnumerator(name: "PRE_DEC", value: 74, isUnsigned: true)
!638 = !DIEnumerator(name: "PRE_INC", value: 75, isUnsigned: true)
!639 = !DIEnumerator(name: "POST_DEC", value: 76, isUnsigned: true)
!640 = !DIEnumerator(name: "POST_INC", value: 77, isUnsigned: true)
!641 = !DIEnumerator(name: "PRE_MODIFY", value: 78, isUnsigned: true)
!642 = !DIEnumerator(name: "POST_MODIFY", value: 79, isUnsigned: true)
!643 = !DIEnumerator(name: "NE", value: 80, isUnsigned: true)
!644 = !DIEnumerator(name: "EQ", value: 81, isUnsigned: true)
!645 = !DIEnumerator(name: "GE", value: 82, isUnsigned: true)
!646 = !DIEnumerator(name: "GT", value: 83, isUnsigned: true)
!647 = !DIEnumerator(name: "LE", value: 84, isUnsigned: true)
!648 = !DIEnumerator(name: "LT", value: 85, isUnsigned: true)
!649 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!650 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!651 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!652 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!653 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!654 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!655 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!656 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!657 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!658 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!659 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!660 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!661 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!662 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!663 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!664 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!665 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!666 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!667 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!668 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!669 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!670 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!671 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!672 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!673 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!674 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!675 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!676 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!677 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!678 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!679 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!680 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!681 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!682 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!683 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!684 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!685 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!686 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!687 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!688 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!689 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!690 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!691 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!692 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!693 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!694 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!695 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!696 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!697 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!698 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!699 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!700 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!701 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!702 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!703 = !{!704, !705, !706, !707, !710, !711, !560}
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!706 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !709)
!713 = !{!0}
!714 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_opt_pass", file: !6, line: 162, size: 640, elements: !715)
!715 = !{!716}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pass", scope: !714, file: !6, line: 164, baseType: !717, size: 640)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opt_pass", file: !6, line: 114, size: 640, elements: !718)
!718 = !{!719, !720, !721, !725, !729, !731, !732, !733, !735, !736, !737, !738, !739}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !717, file: !6, line: 117, baseType: !5, size: 32)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !717, file: !6, line: 121, baseType: !711, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "gate", scope: !717, file: !6, line: 125, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = !DISubroutineType(types: !724)
!724 = !{!705}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !717, file: !6, line: 130, baseType: !726, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DISubroutineType(types: !728)
!728 = !{!7}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !717, file: !6, line: 133, baseType: !730, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !717, file: !6, line: 136, baseType: !730, size: 64, offset: 320)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "static_pass_number", scope: !717, file: !6, line: 139, baseType: !706, size: 32, offset: 384)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "tv_id", scope: !717, file: !6, line: 143, baseType: !734, size: 32, offset: 416)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "timevar_id_t", file: !14, line: 80, baseType: !13)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "properties_required", scope: !717, file: !6, line: 146, baseType: !7, size: 32, offset: 448)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "properties_provided", scope: !717, file: !6, line: 147, baseType: !7, size: 32, offset: 480)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "properties_destroyed", scope: !717, file: !6, line: 148, baseType: !7, size: 32, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_start", scope: !717, file: !6, line: 151, baseType: !7, size: 32, offset: 544)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_finish", scope: !717, file: !6, line: 152, baseType: !7, size: 32, offset: 576)
!740 = !{i32 2, !"Dwarf Version", i32 4}
!741 = !{i32 2, !"Debug Info Version", i32 3}
!742 = !{i32 1, !"wchar_size", i32 4}
!743 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!744 = distinct !DISubprogram(name: "vprintf", scope: !745, file: !745, line: 39, type: !746, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !756)
!745 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!746 = !DISubroutineType(types: !747)
!747 = !{!706, !748, !749}
!748 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !711)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !751)
!751 = !{!752, !753, !754, !755}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !750, file: !3, baseType: !7, size: 32)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !750, file: !3, baseType: !7, size: 32, offset: 32)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !750, file: !3, baseType: !710, size: 64, offset: 64)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !750, file: !3, baseType: !710, size: 64, offset: 128)
!756 = !{!757, !758}
!757 = !DILocalVariable(name: "__fmt", arg: 1, scope: !744, file: !745, line: 39, type: !748)
!758 = !DILocalVariable(name: "__arg", arg: 2, scope: !744, file: !745, line: 39, type: !749)
!759 = !DILocation(line: 0, scope: !744)
!760 = !DILocation(line: 41, column: 20, scope: !744)
!761 = !DILocation(line: 41, column: 10, scope: !744)
!762 = !DILocation(line: 41, column: 3, scope: !744)
!763 = distinct !DISubprogram(name: "getchar", scope: !745, file: !745, line: 47, type: !764, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!764 = !DISubroutineType(types: !765)
!765 = !{!706}
!766 = !{}
!767 = !DILocation(line: 49, column: 16, scope: !763)
!768 = !DILocation(line: 49, column: 10, scope: !763)
!769 = !DILocation(line: 49, column: 3, scope: !763)
!770 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !745, file: !745, line: 56, type: !771, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !832)
!771 = !DISubroutineType(types: !772)
!772 = !{!706, !773}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !775, line: 7, baseType: !776)
!775 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !777, line: 49, size: 1728, elements: !778)
!777 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!778 = !{!779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !794, !796, !797, !798, !802, !804, !806, !810, !813, !815, !818, !821, !822, !823, !827, !828}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !776, file: !777, line: 51, baseType: !706, size: 32)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !776, file: !777, line: 54, baseType: !708, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !776, file: !777, line: 55, baseType: !708, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !776, file: !777, line: 56, baseType: !708, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !776, file: !777, line: 57, baseType: !708, size: 64, offset: 256)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !776, file: !777, line: 58, baseType: !708, size: 64, offset: 320)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !776, file: !777, line: 59, baseType: !708, size: 64, offset: 384)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !776, file: !777, line: 60, baseType: !708, size: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !776, file: !777, line: 61, baseType: !708, size: 64, offset: 512)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !776, file: !777, line: 64, baseType: !708, size: 64, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !776, file: !777, line: 65, baseType: !708, size: 64, offset: 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !776, file: !777, line: 66, baseType: !708, size: 64, offset: 704)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !776, file: !777, line: 68, baseType: !792, size: 64, offset: 768)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !777, line: 36, flags: DIFlagFwdDecl)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !776, file: !777, line: 70, baseType: !795, size: 64, offset: 832)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !776, file: !777, line: 72, baseType: !706, size: 32, offset: 896)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !776, file: !777, line: 73, baseType: !706, size: 32, offset: 928)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !776, file: !777, line: 74, baseType: !799, size: 64, offset: 960)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !800, line: 152, baseType: !801)
!800 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!801 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !776, file: !777, line: 77, baseType: !803, size: 16, offset: 1024)
!803 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !776, file: !777, line: 78, baseType: !805, size: 8, offset: 1040)
!805 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !776, file: !777, line: 79, baseType: !807, size: 8, offset: 1048)
!807 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 8, elements: !808)
!808 = !{!809}
!809 = !DISubrange(count: 1)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !776, file: !777, line: 81, baseType: !811, size: 64, offset: 1088)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !777, line: 43, baseType: null)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !776, file: !777, line: 89, baseType: !814, size: 64, offset: 1152)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !800, line: 153, baseType: !801)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !776, file: !777, line: 91, baseType: !816, size: 64, offset: 1216)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !777, line: 37, flags: DIFlagFwdDecl)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !776, file: !777, line: 92, baseType: !819, size: 64, offset: 1280)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !777, line: 38, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !776, file: !777, line: 93, baseType: !795, size: 64, offset: 1344)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !776, file: !777, line: 94, baseType: !710, size: 64, offset: 1408)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !776, file: !777, line: 95, baseType: !824, size: 64, offset: 1472)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !825, line: 46, baseType: !826)
!825 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!826 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !776, file: !777, line: 96, baseType: !706, size: 32, offset: 1536)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !776, file: !777, line: 98, baseType: !829, size: 160, offset: 1568)
!829 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 160, elements: !830)
!830 = !{!831}
!831 = !DISubrange(count: 20)
!832 = !{!833}
!833 = !DILocalVariable(name: "__fp", arg: 1, scope: !770, file: !745, line: 56, type: !773)
!834 = !DILocation(line: 0, scope: !770)
!835 = !DILocation(line: 58, column: 10, scope: !770)
!836 = !DILocation(line: 58, column: 3, scope: !770)
!837 = distinct !DISubprogram(name: "getc_unlocked", scope: !745, file: !745, line: 66, type: !771, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !838)
!838 = !{!839}
!839 = !DILocalVariable(name: "__fp", arg: 1, scope: !837, file: !745, line: 66, type: !773)
!840 = !DILocation(line: 0, scope: !837)
!841 = !DILocation(line: 68, column: 10, scope: !837)
!842 = !DILocation(line: 68, column: 3, scope: !837)
!843 = distinct !DISubprogram(name: "getchar_unlocked", scope: !745, file: !745, line: 73, type: !764, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!844 = !DILocation(line: 75, column: 10, scope: !843)
!845 = !DILocation(line: 75, column: 3, scope: !843)
!846 = distinct !DISubprogram(name: "putchar", scope: !745, file: !745, line: 82, type: !847, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !849)
!847 = !DISubroutineType(types: !848)
!848 = !{!706, !706}
!849 = !{!850}
!850 = !DILocalVariable(name: "__c", arg: 1, scope: !846, file: !745, line: 82, type: !706)
!851 = !DILocation(line: 0, scope: !846)
!852 = !DILocation(line: 84, column: 21, scope: !846)
!853 = !DILocation(line: 84, column: 10, scope: !846)
!854 = !DILocation(line: 84, column: 3, scope: !846)
!855 = distinct !DISubprogram(name: "fputc_unlocked", scope: !745, file: !745, line: 91, type: !856, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !858)
!856 = !DISubroutineType(types: !857)
!857 = !{!706, !706, !773}
!858 = !{!859, !860}
!859 = !DILocalVariable(name: "__c", arg: 1, scope: !855, file: !745, line: 91, type: !706)
!860 = !DILocalVariable(name: "__stream", arg: 2, scope: !855, file: !745, line: 91, type: !773)
!861 = !DILocation(line: 0, scope: !855)
!862 = !DILocation(line: 93, column: 10, scope: !855)
!863 = !DILocation(line: 93, column: 3, scope: !855)
!864 = distinct !DISubprogram(name: "putc_unlocked", scope: !745, file: !745, line: 101, type: !856, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !865)
!865 = !{!866, !867}
!866 = !DILocalVariable(name: "__c", arg: 1, scope: !864, file: !745, line: 101, type: !706)
!867 = !DILocalVariable(name: "__stream", arg: 2, scope: !864, file: !745, line: 101, type: !773)
!868 = !DILocation(line: 0, scope: !864)
!869 = !DILocation(line: 103, column: 10, scope: !864)
!870 = !DILocation(line: 103, column: 3, scope: !864)
!871 = distinct !DISubprogram(name: "putchar_unlocked", scope: !745, file: !745, line: 108, type: !847, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !872)
!872 = !{!873}
!873 = !DILocalVariable(name: "__c", arg: 1, scope: !871, file: !745, line: 108, type: !706)
!874 = !DILocation(line: 0, scope: !871)
!875 = !DILocation(line: 110, column: 10, scope: !871)
!876 = !DILocation(line: 110, column: 3, scope: !871)
!877 = distinct !DISubprogram(name: "getline", scope: !745, file: !745, line: 118, type: !878, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !882)
!878 = !DISubroutineType(types: !879)
!879 = !{!880, !707, !881, !773}
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !800, line: 193, baseType: !801)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!882 = !{!883, !884, !885}
!883 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !877, file: !745, line: 118, type: !707)
!884 = !DILocalVariable(name: "__n", arg: 2, scope: !877, file: !745, line: 118, type: !881)
!885 = !DILocalVariable(name: "__stream", arg: 3, scope: !877, file: !745, line: 118, type: !773)
!886 = !DILocation(line: 0, scope: !877)
!887 = !DILocation(line: 120, column: 10, scope: !877)
!888 = !DILocation(line: 120, column: 3, scope: !877)
!889 = distinct !DISubprogram(name: "feof_unlocked", scope: !745, file: !745, line: 128, type: !771, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !890)
!890 = !{!891}
!891 = !DILocalVariable(name: "__stream", arg: 1, scope: !889, file: !745, line: 128, type: !773)
!892 = !DILocation(line: 0, scope: !889)
!893 = !DILocation(line: 130, column: 10, scope: !889)
!894 = !DILocation(line: 130, column: 3, scope: !889)
!895 = distinct !DISubprogram(name: "ferror_unlocked", scope: !745, file: !745, line: 135, type: !771, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !896)
!896 = !{!897}
!897 = !DILocalVariable(name: "__stream", arg: 1, scope: !895, file: !745, line: 135, type: !773)
!898 = !DILocation(line: 0, scope: !895)
!899 = !DILocation(line: 137, column: 10, scope: !895)
!900 = !DILocation(line: 137, column: 3, scope: !895)
!901 = distinct !DISubprogram(name: "tolower", scope: !902, file: !902, line: 207, type: !847, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !903)
!902 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!903 = !{!904}
!904 = !DILocalVariable(name: "__c", arg: 1, scope: !901, file: !902, line: 207, type: !706)
!905 = !DILocation(line: 0, scope: !901)
!906 = !DILocation(line: 209, column: 22, scope: !901)
!907 = !DILocation(line: 209, column: 39, scope: !901)
!908 = !DILocation(line: 209, column: 38, scope: !901)
!909 = !DILocation(line: 209, column: 37, scope: !901)
!910 = !DILocation(line: 209, column: 10, scope: !901)
!911 = !DILocation(line: 209, column: 3, scope: !901)
!912 = distinct !DISubprogram(name: "toupper", scope: !902, file: !902, line: 213, type: !847, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !913)
!913 = !{!914}
!914 = !DILocalVariable(name: "__c", arg: 1, scope: !912, file: !902, line: 213, type: !706)
!915 = !DILocation(line: 0, scope: !912)
!916 = !DILocation(line: 215, column: 22, scope: !912)
!917 = !DILocation(line: 215, column: 39, scope: !912)
!918 = !DILocation(line: 215, column: 38, scope: !912)
!919 = !DILocation(line: 215, column: 37, scope: !912)
!920 = !DILocation(line: 215, column: 10, scope: !912)
!921 = !DILocation(line: 215, column: 3, scope: !912)
!922 = distinct !DISubprogram(name: "atoi", scope: !923, file: !923, line: 361, type: !924, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !926)
!923 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!924 = !DISubroutineType(types: !925)
!925 = !{!706, !711}
!926 = !{!927}
!927 = !DILocalVariable(name: "__nptr", arg: 1, scope: !922, file: !923, line: 361, type: !711)
!928 = !DILocation(line: 0, scope: !922)
!929 = !DILocation(line: 363, column: 16, scope: !922)
!930 = !DILocation(line: 363, column: 10, scope: !922)
!931 = !DILocation(line: 363, column: 3, scope: !922)
!932 = distinct !DISubprogram(name: "atol", scope: !923, file: !923, line: 366, type: !933, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !935)
!933 = !DISubroutineType(types: !934)
!934 = !{!801, !711}
!935 = !{!936}
!936 = !DILocalVariable(name: "__nptr", arg: 1, scope: !932, file: !923, line: 366, type: !711)
!937 = !DILocation(line: 0, scope: !932)
!938 = !DILocation(line: 368, column: 10, scope: !932)
!939 = !DILocation(line: 368, column: 3, scope: !932)
!940 = distinct !DISubprogram(name: "atoll", scope: !923, file: !923, line: 373, type: !941, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!941 = !DISubroutineType(types: !942)
!942 = !{!943, !711}
!943 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!944 = !{!945}
!945 = !DILocalVariable(name: "__nptr", arg: 1, scope: !940, file: !923, line: 373, type: !711)
!946 = !DILocation(line: 0, scope: !940)
!947 = !DILocation(line: 375, column: 10, scope: !940)
!948 = !DILocation(line: 375, column: 3, scope: !940)
!949 = distinct !DISubprogram(name: "bsearch", scope: !950, file: !950, line: 20, type: !951, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !959)
!950 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!951 = !DISubroutineType(types: !952)
!952 = !{!710, !953, !953, !824, !824, !955}
!953 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !923, line: 808, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = !DISubroutineType(types: !958)
!958 = !{!706, !953, !953}
!959 = !{!960, !961, !962, !963, !964, !965, !966, !967, !968, !969}
!960 = !DILocalVariable(name: "__key", arg: 1, scope: !949, file: !950, line: 20, type: !953)
!961 = !DILocalVariable(name: "__base", arg: 2, scope: !949, file: !950, line: 20, type: !953)
!962 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !949, file: !950, line: 20, type: !824)
!963 = !DILocalVariable(name: "__size", arg: 4, scope: !949, file: !950, line: 20, type: !824)
!964 = !DILocalVariable(name: "__compar", arg: 5, scope: !949, file: !950, line: 21, type: !955)
!965 = !DILocalVariable(name: "__l", scope: !949, file: !950, line: 23, type: !824)
!966 = !DILocalVariable(name: "__u", scope: !949, file: !950, line: 23, type: !824)
!967 = !DILocalVariable(name: "__idx", scope: !949, file: !950, line: 23, type: !824)
!968 = !DILocalVariable(name: "__p", scope: !949, file: !950, line: 24, type: !953)
!969 = !DILocalVariable(name: "__comparison", scope: !949, file: !950, line: 25, type: !706)
!970 = !DILocation(line: 0, scope: !949)
!971 = !DILocation(line: 29, column: 3, scope: !949)
!972 = !DILocation(line: 27, column: 7, scope: !949)
!973 = !DILocation(line: 29, column: 14, scope: !949)
!974 = !DILocation(line: 31, column: 20, scope: !975)
!975 = distinct !DILexicalBlock(scope: !949, file: !950, line: 30, column: 5)
!976 = !DILocation(line: 31, column: 27, scope: !975)
!977 = !DILocation(line: 32, column: 56, scope: !975)
!978 = !DILocation(line: 32, column: 47, scope: !975)
!979 = !DILocation(line: 33, column: 22, scope: !975)
!980 = !DILocation(line: 34, column: 24, scope: !981)
!981 = distinct !DILexicalBlock(scope: !975, file: !950, line: 34, column: 11)
!982 = !DILocation(line: 34, column: 11, scope: !975)
!983 = !DILocation(line: 36, column: 29, scope: !984)
!984 = distinct !DILexicalBlock(scope: !981, file: !950, line: 36, column: 16)
!985 = !DILocation(line: 36, column: 16, scope: !981)
!986 = !DILocation(line: 37, column: 14, scope: !984)
!987 = distinct !{!987, !971, !988}
!988 = !DILocation(line: 40, column: 5, scope: !949)
!989 = !DILocation(line: 43, column: 1, scope: !949)
!990 = distinct !DISubprogram(name: "atof", scope: !991, file: !991, line: 25, type: !992, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !995)
!991 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!992 = !DISubroutineType(types: !993)
!993 = !{!994, !711}
!994 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!995 = !{!996}
!996 = !DILocalVariable(name: "__nptr", arg: 1, scope: !990, file: !991, line: 25, type: !711)
!997 = !DILocation(line: 0, scope: !990)
!998 = !DILocation(line: 27, column: 10, scope: !990)
!999 = !DILocation(line: 27, column: 3, scope: !990)
!1000 = distinct !DISubprogram(name: "strtoimax", scope: !1001, file: !1001, line: 324, type: !1002, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1008)
!1001 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!1004, !748, !1007, !706}
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !1005, line: 101, baseType: !1006)
!1005 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !800, line: 72, baseType: !801)
!1007 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !707)
!1008 = !{!1009, !1010, !1011}
!1009 = !DILocalVariable(name: "nptr", arg: 1, scope: !1000, file: !1001, line: 324, type: !748)
!1010 = !DILocalVariable(name: "endptr", arg: 2, scope: !1000, file: !1001, line: 324, type: !1007)
!1011 = !DILocalVariable(name: "base", arg: 3, scope: !1000, file: !1001, line: 324, type: !706)
!1012 = !DILocation(line: 0, scope: !1000)
!1013 = !DILocation(line: 327, column: 10, scope: !1000)
!1014 = !DILocation(line: 327, column: 3, scope: !1000)
!1015 = distinct !DISubprogram(name: "strtoumax", scope: !1001, file: !1001, line: 336, type: !1016, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1020)
!1016 = !DISubroutineType(types: !1017)
!1017 = !{!1018, !748, !1007, !706}
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !1005, line: 102, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !800, line: 73, baseType: !826)
!1020 = !{!1021, !1022, !1023}
!1021 = !DILocalVariable(name: "nptr", arg: 1, scope: !1015, file: !1001, line: 336, type: !748)
!1022 = !DILocalVariable(name: "endptr", arg: 2, scope: !1015, file: !1001, line: 336, type: !1007)
!1023 = !DILocalVariable(name: "base", arg: 3, scope: !1015, file: !1001, line: 336, type: !706)
!1024 = !DILocation(line: 0, scope: !1015)
!1025 = !DILocation(line: 339, column: 10, scope: !1015)
!1026 = !DILocation(line: 339, column: 3, scope: !1015)
!1027 = distinct !DISubprogram(name: "wcstoimax", scope: !1001, file: !1001, line: 348, type: !1028, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1037)
!1028 = !DISubroutineType(types: !1029)
!1029 = !{!1004, !1030, !1034, !706}
!1030 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1031)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !1001, line: 34, baseType: !706)
!1034 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !1035)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1037 = !{!1038, !1039, !1040}
!1038 = !DILocalVariable(name: "nptr", arg: 1, scope: !1027, file: !1001, line: 348, type: !1030)
!1039 = !DILocalVariable(name: "endptr", arg: 2, scope: !1027, file: !1001, line: 348, type: !1034)
!1040 = !DILocalVariable(name: "base", arg: 3, scope: !1027, file: !1001, line: 348, type: !706)
!1041 = !DILocation(line: 0, scope: !1027)
!1042 = !DILocation(line: 351, column: 10, scope: !1027)
!1043 = !DILocation(line: 351, column: 3, scope: !1027)
!1044 = distinct !DISubprogram(name: "wcstoumax", scope: !1001, file: !1001, line: 362, type: !1045, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1047)
!1045 = !DISubroutineType(types: !1046)
!1046 = !{!1018, !1030, !1034, !706}
!1047 = !{!1048, !1049, !1050}
!1048 = !DILocalVariable(name: "nptr", arg: 1, scope: !1044, file: !1001, line: 362, type: !1030)
!1049 = !DILocalVariable(name: "endptr", arg: 2, scope: !1044, file: !1001, line: 362, type: !1034)
!1050 = !DILocalVariable(name: "base", arg: 3, scope: !1044, file: !1001, line: 362, type: !706)
!1051 = !DILocation(line: 0, scope: !1044)
!1052 = !DILocation(line: 365, column: 10, scope: !1044)
!1053 = !DILocation(line: 365, column: 3, scope: !1044)
!1054 = distinct !DISubprogram(name: "stat", scope: !1055, file: !1055, line: 453, type: !1056, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1095)
!1055 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!1056 = !DISubroutineType(types: !1057)
!1057 = !{!706, !711, !1058}
!1058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1059, size: 64)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1060, line: 46, size: 1152, elements: !1061)
!1060 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!1061 = !{!1062, !1064, !1066, !1068, !1070, !1072, !1074, !1075, !1076, !1077, !1079, !1081, !1089, !1090, !1091}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1059, file: !1060, line: 48, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !800, line: 145, baseType: !826)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1059, file: !1060, line: 53, baseType: !1065, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !800, line: 148, baseType: !826)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1059, file: !1060, line: 61, baseType: !1067, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !800, line: 151, baseType: !826)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1059, file: !1060, line: 62, baseType: !1069, size: 32, offset: 192)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !800, line: 150, baseType: !7)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1059, file: !1060, line: 64, baseType: !1071, size: 32, offset: 224)
!1071 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !800, line: 146, baseType: !7)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1059, file: !1060, line: 65, baseType: !1073, size: 32, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !800, line: 147, baseType: !7)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1059, file: !1060, line: 67, baseType: !706, size: 32, offset: 288)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1059, file: !1060, line: 69, baseType: !1063, size: 64, offset: 320)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1059, file: !1060, line: 74, baseType: !799, size: 64, offset: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1059, file: !1060, line: 78, baseType: !1078, size: 64, offset: 448)
!1078 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !800, line: 174, baseType: !801)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1059, file: !1060, line: 80, baseType: !1080, size: 64, offset: 512)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !800, line: 179, baseType: !801)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1059, file: !1060, line: 91, baseType: !1082, size: 128, offset: 576)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1083, line: 10, size: 128, elements: !1084)
!1083 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!1084 = !{!1085, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1082, file: !1083, line: 12, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !800, line: 160, baseType: !801)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1082, file: !1083, line: 16, baseType: !1088, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !800, line: 196, baseType: !801)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1059, file: !1060, line: 92, baseType: !1082, size: 128, offset: 704)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1059, file: !1060, line: 93, baseType: !1082, size: 128, offset: 832)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1059, file: !1060, line: 106, baseType: !1092, size: 192, offset: 960)
!1092 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1088, size: 192, elements: !1093)
!1093 = !{!1094}
!1094 = !DISubrange(count: 3)
!1095 = !{!1096, !1097}
!1096 = !DILocalVariable(name: "__path", arg: 1, scope: !1054, file: !1055, line: 453, type: !711)
!1097 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1054, file: !1055, line: 453, type: !1058)
!1098 = !DILocation(line: 0, scope: !1054)
!1099 = !DILocation(line: 455, column: 10, scope: !1054)
!1100 = !DILocation(line: 455, column: 3, scope: !1054)
!1101 = distinct !DISubprogram(name: "lstat", scope: !1055, file: !1055, line: 460, type: !1056, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1102)
!1102 = !{!1103, !1104}
!1103 = !DILocalVariable(name: "__path", arg: 1, scope: !1101, file: !1055, line: 460, type: !711)
!1104 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1101, file: !1055, line: 460, type: !1058)
!1105 = !DILocation(line: 0, scope: !1101)
!1106 = !DILocation(line: 462, column: 10, scope: !1101)
!1107 = !DILocation(line: 462, column: 3, scope: !1101)
!1108 = distinct !DISubprogram(name: "fstat", scope: !1055, file: !1055, line: 467, type: !1109, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1111)
!1109 = !DISubroutineType(types: !1110)
!1110 = !{!706, !706, !1058}
!1111 = !{!1112, !1113}
!1112 = !DILocalVariable(name: "__fd", arg: 1, scope: !1108, file: !1055, line: 467, type: !706)
!1113 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1108, file: !1055, line: 467, type: !1058)
!1114 = !DILocation(line: 0, scope: !1108)
!1115 = !DILocation(line: 469, column: 10, scope: !1108)
!1116 = !DILocation(line: 469, column: 3, scope: !1108)
!1117 = distinct !DISubprogram(name: "fstatat", scope: !1055, file: !1055, line: 474, type: !1118, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1120)
!1118 = !DISubroutineType(types: !1119)
!1119 = !{!706, !706, !711, !1058, !706}
!1120 = !{!1121, !1122, !1123, !1124}
!1121 = !DILocalVariable(name: "__fd", arg: 1, scope: !1117, file: !1055, line: 474, type: !706)
!1122 = !DILocalVariable(name: "__filename", arg: 2, scope: !1117, file: !1055, line: 474, type: !711)
!1123 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !1117, file: !1055, line: 474, type: !1058)
!1124 = !DILocalVariable(name: "__flag", arg: 4, scope: !1117, file: !1055, line: 474, type: !706)
!1125 = !DILocation(line: 0, scope: !1117)
!1126 = !DILocation(line: 477, column: 10, scope: !1117)
!1127 = !DILocation(line: 477, column: 3, scope: !1117)
!1128 = distinct !DISubprogram(name: "mknod", scope: !1055, file: !1055, line: 483, type: !1129, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1131)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!706, !711, !1069, !1063}
!1131 = !{!1132, !1133, !1134}
!1132 = !DILocalVariable(name: "__path", arg: 1, scope: !1128, file: !1055, line: 483, type: !711)
!1133 = !DILocalVariable(name: "__mode", arg: 2, scope: !1128, file: !1055, line: 483, type: !1069)
!1134 = !DILocalVariable(name: "__dev", arg: 3, scope: !1128, file: !1055, line: 483, type: !1063)
!1135 = !DILocation(line: 0, scope: !1128)
!1136 = !DILocation(line: 485, column: 10, scope: !1128)
!1137 = !DILocation(line: 485, column: 3, scope: !1128)
!1138 = distinct !DISubprogram(name: "mknodat", scope: !1055, file: !1055, line: 491, type: !1139, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1141)
!1139 = !DISubroutineType(types: !1140)
!1140 = !{!706, !706, !711, !1069, !1063}
!1141 = !{!1142, !1143, !1144, !1145}
!1142 = !DILocalVariable(name: "__fd", arg: 1, scope: !1138, file: !1055, line: 491, type: !706)
!1143 = !DILocalVariable(name: "__path", arg: 2, scope: !1138, file: !1055, line: 491, type: !711)
!1144 = !DILocalVariable(name: "__mode", arg: 3, scope: !1138, file: !1055, line: 491, type: !1069)
!1145 = !DILocalVariable(name: "__dev", arg: 4, scope: !1138, file: !1055, line: 491, type: !1063)
!1146 = !DILocation(line: 0, scope: !1138)
!1147 = !DILocation(line: 494, column: 10, scope: !1138)
!1148 = !DILocation(line: 494, column: 3, scope: !1138)
!1149 = distinct !DISubprogram(name: "stat64", scope: !1055, file: !1055, line: 502, type: !1150, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1172)
!1150 = !DISubroutineType(types: !1151)
!1151 = !{!706, !711, !1152}
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !1060, line: 119, size: 1152, elements: !1154)
!1154 = !{!1155, !1156, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1168, !1169, !1170, !1171}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1153, file: !1060, line: 121, baseType: !1063, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1153, file: !1060, line: 123, baseType: !1157, size: 64, offset: 64)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !800, line: 149, baseType: !826)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1153, file: !1060, line: 124, baseType: !1067, size: 64, offset: 128)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1153, file: !1060, line: 125, baseType: !1069, size: 32, offset: 192)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1153, file: !1060, line: 132, baseType: !1071, size: 32, offset: 224)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1153, file: !1060, line: 133, baseType: !1073, size: 32, offset: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1153, file: !1060, line: 135, baseType: !706, size: 32, offset: 288)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1153, file: !1060, line: 136, baseType: !1063, size: 64, offset: 320)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1153, file: !1060, line: 137, baseType: !799, size: 64, offset: 384)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1153, file: !1060, line: 143, baseType: !1078, size: 64, offset: 448)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1153, file: !1060, line: 144, baseType: !1167, size: 64, offset: 512)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !800, line: 180, baseType: !801)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1153, file: !1060, line: 152, baseType: !1082, size: 128, offset: 576)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1153, file: !1060, line: 153, baseType: !1082, size: 128, offset: 704)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1153, file: !1060, line: 154, baseType: !1082, size: 128, offset: 832)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1153, file: !1060, line: 164, baseType: !1092, size: 192, offset: 960)
!1172 = !{!1173, !1174}
!1173 = !DILocalVariable(name: "__path", arg: 1, scope: !1149, file: !1055, line: 502, type: !711)
!1174 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1149, file: !1055, line: 502, type: !1152)
!1175 = !DILocation(line: 0, scope: !1149)
!1176 = !DILocation(line: 504, column: 10, scope: !1149)
!1177 = !DILocation(line: 504, column: 3, scope: !1149)
!1178 = distinct !DISubprogram(name: "lstat64", scope: !1055, file: !1055, line: 509, type: !1150, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1179)
!1179 = !{!1180, !1181}
!1180 = !DILocalVariable(name: "__path", arg: 1, scope: !1178, file: !1055, line: 509, type: !711)
!1181 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1178, file: !1055, line: 509, type: !1152)
!1182 = !DILocation(line: 0, scope: !1178)
!1183 = !DILocation(line: 511, column: 10, scope: !1178)
!1184 = !DILocation(line: 511, column: 3, scope: !1178)
!1185 = distinct !DISubprogram(name: "fstat64", scope: !1055, file: !1055, line: 516, type: !1186, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1188)
!1186 = !DISubroutineType(types: !1187)
!1187 = !{!706, !706, !1152}
!1188 = !{!1189, !1190}
!1189 = !DILocalVariable(name: "__fd", arg: 1, scope: !1185, file: !1055, line: 516, type: !706)
!1190 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !1185, file: !1055, line: 516, type: !1152)
!1191 = !DILocation(line: 0, scope: !1185)
!1192 = !DILocation(line: 518, column: 10, scope: !1185)
!1193 = !DILocation(line: 518, column: 3, scope: !1185)
!1194 = distinct !DISubprogram(name: "fstatat64", scope: !1055, file: !1055, line: 523, type: !1195, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1197)
!1195 = !DISubroutineType(types: !1196)
!1196 = !{!706, !706, !711, !1152, !706}
!1197 = !{!1198, !1199, !1200, !1201}
!1198 = !DILocalVariable(name: "__fd", arg: 1, scope: !1194, file: !1055, line: 523, type: !706)
!1199 = !DILocalVariable(name: "__filename", arg: 2, scope: !1194, file: !1055, line: 523, type: !711)
!1200 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !1194, file: !1055, line: 523, type: !1152)
!1201 = !DILocalVariable(name: "__flag", arg: 4, scope: !1194, file: !1055, line: 523, type: !706)
!1202 = !DILocation(line: 0, scope: !1194)
!1203 = !DILocation(line: 526, column: 10, scope: !1194)
!1204 = !DILocation(line: 526, column: 3, scope: !1194)
!1205 = distinct !DISubprogram(name: "rest_of_handle_stack_ptr_mod", scope: !3, file: !3, line: 88, type: !727, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !766)
!1206 = !DILocation(line: 90, column: 3, scope: !1205)
!1207 = !DILocation(line: 91, column: 3, scope: !1205)
!1208 = distinct !DISubprogram(name: "notice_stack_pointer_modification", scope: !3, file: !3, line: 53, type: !1209, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1211)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{null}
!1211 = !{!1212, !2268}
!1212 = !DILocalVariable(name: "bb", scope: !1208, file: !3, line: 55, type: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1214, line: 111, baseType: !1215)
!1214 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !1217)
!1217 = !{!1218, !2233, !2234, !2235, !2238, !2242, !2243, !2244, !2262, !2263, !2264, !2265, !2266, !2267}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1216, file: !318, line: 219, baseType: !1219, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !1221)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !1222)
!1222 = !{!1223}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1221, file: !318, line: 151, baseType: !1224, size: 128)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !1225)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !1226)
!1226 = !{!1227, !1228, !1229}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1225, file: !318, line: 150, baseType: !7, size: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1225, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1225, file: !318, line: 150, baseType: !1230, size: 64, offset: 64)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1231, size: 64, elements: !808)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1214, line: 108, baseType: !1232)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !1234)
!1234 = !{!1235, !1236, !1237, !2225, !2226, !2227, !2228, !2229, !2230, !2231}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1233, file: !318, line: 124, baseType: !1215, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1233, file: !318, line: 125, baseType: !1215, size: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1233, file: !318, line: 131, baseType: !1238, size: 64, offset: 128)
!1238 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !1239)
!1239 = !{!1240, !1244}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1238, file: !318, line: 129, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1214, line: 66, baseType: !1242)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1214, line: 65, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1238, file: !318, line: 130, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1214, line: 50, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !1248)
!1248 = !{!1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1247, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1247, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1247, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1247, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1247, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1247, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1247, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1247, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1247, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1247, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1247, file: !561, line: 321, baseType: !1260, size: 320, offset: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !1261)
!1261 = !{!1262, !2160, !2162, !2223, !2224}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1260, file: !561, line: 316, baseType: !1263, size: 64)
!1263 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1264, size: 64, elements: !808)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !1265)
!1265 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !1266)
!1266 = !{!1267, !1268, !1269, !1270, !1271, !1279, !1280, !1292, !1295, !1355, !2138, !2139, !2150, !2157}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1265, file: !561, line: 168, baseType: !706, size: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1265, file: !561, line: 169, baseType: !7, size: 32)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1265, file: !561, line: 170, baseType: !711, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1265, file: !561, line: 171, baseType: !1245, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1265, file: !561, line: 172, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1214, line: 53, baseType: !1273)
!1273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1274, size: 64)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !1275)
!1275 = !{!1276, !1277}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1274, file: !561, line: 360, baseType: !706, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1274, file: !561, line: 361, baseType: !1278, size: 64, offset: 64)
!1278 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1245, size: 64, elements: !808)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1265, file: !561, line: 173, baseType: !189, size: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1265, file: !561, line: 174, baseType: !1281, size: 32)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1282, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1282, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1282, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1282, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1282, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1282, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1282, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1282, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1265, file: !561, line: 175, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1265, file: !561, line: 176, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1297, size: 64)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1298, line: 75, size: 256, elements: !1299)
!1298 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1299 = !{!1300, !1314, !1315, !1316}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1297, file: !1298, line: 76, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1298, line: 68, baseType: !1303)
!1303 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1298, line: 63, size: 320, elements: !1304)
!1304 = !{!1305, !1307, !1308, !1309}
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1303, file: !1298, line: 64, baseType: !1306, size: 64)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1303, file: !1298, line: 65, baseType: !1306, size: 64, offset: 64)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1303, file: !1298, line: 66, baseType: !7, size: 32, offset: 128)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1303, file: !1298, line: 67, baseType: !1310, size: 128, offset: 192)
!1310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1311, size: 128, elements: !1312)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1298, line: 29, baseType: !826)
!1312 = !{!1313}
!1313 = !DISubrange(count: 2)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1297, file: !1298, line: 77, baseType: !1301, size: 64, offset: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1297, file: !1298, line: 78, baseType: !7, size: 32, offset: 128)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1297, file: !1298, line: 79, baseType: !1317, size: 64, offset: 192)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1298, line: 49, baseType: !1319)
!1319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1298, line: 45, size: 832, elements: !1320)
!1320 = !{!1321, !1322, !1323}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1319, file: !1298, line: 46, baseType: !1306, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1319, file: !1298, line: 47, baseType: !1296, size: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1319, file: !1298, line: 48, baseType: !1324, size: 704, offset: 128)
!1324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1325, line: 164, size: 704, elements: !1326)
!1325 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1326 = !{!1327, !1328, !1338, !1339, !1340, !1341, !1342, !1343, !1347, !1351, !1352, !1353, !1354}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1324, file: !1325, line: 166, baseType: !801, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1324, file: !1325, line: 167, baseType: !1329, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1325, line: 157, size: 192, elements: !1331)
!1331 = !{!1332, !1333, !1334}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1330, file: !1325, line: 159, baseType: !708, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1330, file: !1325, line: 160, baseType: !1329, size: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1330, file: !1325, line: 161, baseType: !1335, size: 32, offset: 128)
!1335 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 32, elements: !1336)
!1336 = !{!1337}
!1337 = !DISubrange(count: 4)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1324, file: !1325, line: 168, baseType: !708, size: 64, offset: 128)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1324, file: !1325, line: 169, baseType: !708, size: 64, offset: 192)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1324, file: !1325, line: 170, baseType: !708, size: 64, offset: 256)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1324, file: !1325, line: 171, baseType: !801, size: 64, offset: 320)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1324, file: !1325, line: 172, baseType: !706, size: 32, offset: 384)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1324, file: !1325, line: 176, baseType: !1344, size: 64, offset: 448)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1345, size: 64)
!1345 = !DISubroutineType(types: !1346)
!1346 = !{!1329, !710, !801}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1324, file: !1325, line: 177, baseType: !1348, size: 64, offset: 512)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = !DISubroutineType(types: !1350)
!1350 = !{null, !710, !1329}
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1324, file: !1325, line: 178, baseType: !710, size: 64, offset: 576)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1324, file: !1325, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1324, file: !1325, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1324, file: !1325, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1265, file: !561, line: 177, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1214, line: 56, baseType: !1357)
!1357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1358, size: 64)
!1358 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !1359)
!1359 = !{!1360, !1393, !1399, !1410, !1427, !1438, !1443, !1449, !1455, !1468, !1480, !1518, !1523, !1551, !1559, !1560, !1565, !1574, !1580, !1585, !1589, !1593, !1763, !1812, !1818, !1825, !1832, !1858, !1883, !1900, !1912, !1934, !1949, !2120}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1358, file: !334, line: 3372, baseType: !1361, size: 64)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !1362)
!1362 = !{!1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1361, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1361, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1361, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1361, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1361, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1361, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1361, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1361, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1361, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1361, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1361, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1361, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1361, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1361, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1361, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1361, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1361, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1361, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1361, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1361, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1361, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1361, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1361, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1361, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1361, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1361, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1361, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1361, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1361, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1361, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1358, file: !334, line: 3373, baseType: !1394, size: 192)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !1395)
!1395 = !{!1396, !1397, !1398}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1394, file: !334, line: 403, baseType: !1361, size: 64)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1394, file: !334, line: 404, baseType: !1356, size: 64, offset: 64)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1394, file: !334, line: 405, baseType: !1356, size: 64, offset: 128)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1358, file: !334, line: 3374, baseType: !1400, size: 320)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !1401)
!1401 = !{!1402, !1403}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1400, file: !334, line: 1385, baseType: !1394, size: 192)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1400, file: !334, line: 1386, baseType: !1404, size: 128, offset: 192)
!1404 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1405, line: 58, baseType: !1406)
!1405 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1405, line: 54, size: 128, elements: !1407)
!1407 = !{!1408, !1409}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1406, file: !1405, line: 56, baseType: !826, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1406, file: !1405, line: 57, baseType: !801, size: 64, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1358, file: !334, line: 3375, baseType: !1411, size: 256)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !1412)
!1412 = !{!1413, !1414}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1411, file: !334, line: 1398, baseType: !1394, size: 192)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1411, file: !334, line: 1399, baseType: !1415, size: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1417, line: 52, size: 256, elements: !1418)
!1417 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1418 = !{!1419, !1420, !1421, !1422, !1423, !1424, !1425}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1416, file: !1417, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1416, file: !1417, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1416, file: !1417, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1416, file: !1417, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1416, file: !1417, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1416, file: !1417, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1416, file: !1417, line: 62, baseType: !1426, size: 192, offset: 64)
!1426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !826, size: 192, elements: !1093)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1358, file: !334, line: 3376, baseType: !1428, size: 256)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !1429)
!1429 = !{!1430, !1431}
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1428, file: !334, line: 1409, baseType: !1394, size: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1428, file: !334, line: 1410, baseType: !1432, size: 64, offset: 192)
!1432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1433, size: 64)
!1433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1434, line: 27, size: 192, elements: !1435)
!1434 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1435 = !{!1436, !1437}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1433, file: !1434, line: 29, baseType: !1404, size: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1433, file: !1434, line: 30, baseType: !189, size: 32, offset: 128)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1358, file: !334, line: 3377, baseType: !1439, size: 256)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !1440)
!1440 = !{!1441, !1442}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1439, file: !334, line: 1438, baseType: !1394, size: 192)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1439, file: !334, line: 1439, baseType: !1356, size: 64, offset: 192)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1358, file: !334, line: 3378, baseType: !1444, size: 256)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !1445)
!1445 = !{!1446, !1447, !1448}
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1444, file: !334, line: 1419, baseType: !1394, size: 192)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1444, file: !334, line: 1420, baseType: !706, size: 32, offset: 192)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1444, file: !334, line: 1421, baseType: !807, size: 8, offset: 224)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1358, file: !334, line: 3379, baseType: !1450, size: 320)
!1450 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !1451)
!1451 = !{!1452, !1453, !1454}
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1450, file: !334, line: 1429, baseType: !1394, size: 192)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1450, file: !334, line: 1430, baseType: !1356, size: 64, offset: 192)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1450, file: !334, line: 1431, baseType: !1356, size: 64, offset: 256)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1358, file: !334, line: 3380, baseType: !1456, size: 320)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !1457)
!1457 = !{!1458, !1459}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1456, file: !334, line: 1461, baseType: !1394, size: 192)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1456, file: !334, line: 1462, baseType: !1460, size: 128, offset: 192)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1461, line: 31, size: 128, elements: !1462)
!1461 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1462 = !{!1463, !1466, !1467}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1460, file: !1461, line: 32, baseType: !1464, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1465, size: 64)
!1465 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !705)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1460, file: !1461, line: 33, baseType: !7, size: 32, offset: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1460, file: !1461, line: 34, baseType: !7, size: 32, offset: 96)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1358, file: !334, line: 3381, baseType: !1469, size: 384)
!1469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !1470)
!1470 = !{!1471, !1472, !1477, !1478, !1479}
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1469, file: !334, line: 2508, baseType: !1394, size: 192)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1469, file: !334, line: 2509, baseType: !1473, size: 32, offset: 192)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1474, line: 58, baseType: !1475)
!1474 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1475 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1476, line: 44, baseType: !7)
!1476 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1469, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1469, file: !334, line: 2511, baseType: !1356, size: 64, offset: 256)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1469, file: !334, line: 2512, baseType: !1356, size: 64, offset: 320)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1358, file: !334, line: 3382, baseType: !1481, size: 896)
!1481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !1482)
!1482 = !{!1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513, !1514, !1515}
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1481, file: !334, line: 2653, baseType: !1469, size: 384)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1481, file: !334, line: 2654, baseType: !1356, size: 64, offset: 384)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1481, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1481, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1481, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1481, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1481, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1481, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1481, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1481, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1481, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1481, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1481, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1496 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1481, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1497 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1481, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1481, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1481, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1481, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1481, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1481, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1503 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1481, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1481, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1481, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1481, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1481, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1508 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1481, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1509 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1481, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1481, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1481, file: !334, line: 2705, baseType: !1356, size: 64, offset: 576)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1481, file: !334, line: 2706, baseType: !1356, size: 64, offset: 640)
!1513 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1481, file: !334, line: 2707, baseType: !1356, size: 64, offset: 704)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1481, file: !334, line: 2708, baseType: !1356, size: 64, offset: 768)
!1515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1481, file: !334, line: 2711, baseType: !1516, size: 64, offset: 832)
!1516 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1517, size: 64)
!1517 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1358, file: !334, line: 3383, baseType: !1519, size: 960)
!1519 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !1520)
!1520 = !{!1521, !1522}
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1519, file: !334, line: 2757, baseType: !1481, size: 896)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1519, file: !334, line: 2758, baseType: !1245, size: 64, offset: 896)
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1358, file: !334, line: 3384, baseType: !1524, size: 1472)
!1524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1525)
!1525 = !{!1526, !1547, !1548, !1549, !1550}
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1524, file: !334, line: 3115, baseType: !1527, size: 1216)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1528)
!1528 = !{!1529, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546}
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1527, file: !334, line: 2985, baseType: !1519, size: 960)
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1527, file: !334, line: 2986, baseType: !1356, size: 64, offset: 960)
!1531 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1527, file: !334, line: 2987, baseType: !1356, size: 64, offset: 1024)
!1532 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1527, file: !334, line: 2988, baseType: !1356, size: 64, offset: 1088)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1527, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1527, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1527, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1527, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1527, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1527, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1527, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1540 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1527, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1541 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1527, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1527, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1527, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1527, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1527, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1527, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1524, file: !334, line: 3117, baseType: !1356, size: 64, offset: 1216)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1524, file: !334, line: 3119, baseType: !1356, size: 64, offset: 1280)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1524, file: !334, line: 3121, baseType: !1356, size: 64, offset: 1344)
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1524, file: !334, line: 3123, baseType: !1356, size: 64, offset: 1408)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1358, file: !334, line: 3385, baseType: !1552, size: 1088)
!1552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1553)
!1553 = !{!1554, !1555, !1556}
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1552, file: !334, line: 2875, baseType: !1519, size: 960)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1552, file: !334, line: 2876, baseType: !1245, size: 64, offset: 960)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1552, file: !334, line: 2877, baseType: !1557, size: 64, offset: 1024)
!1557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1558, size: 64)
!1558 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !334, line: 2856, flags: DIFlagFwdDecl)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1358, file: !334, line: 3386, baseType: !1527, size: 1216)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1358, file: !334, line: 3387, baseType: !1561, size: 1280)
!1561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1562)
!1562 = !{!1563, !1564}
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1561, file: !334, line: 3094, baseType: !1527, size: 1216)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1561, file: !334, line: 3095, baseType: !1557, size: 64, offset: 1216)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1358, file: !334, line: 3388, baseType: !1566, size: 1216)
!1566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1567)
!1567 = !{!1568, !1569, !1570, !1571, !1572, !1573}
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1566, file: !334, line: 2825, baseType: !1481, size: 896)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1566, file: !334, line: 2827, baseType: !1356, size: 64, offset: 896)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1566, file: !334, line: 2828, baseType: !1356, size: 64, offset: 960)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1566, file: !334, line: 2829, baseType: !1356, size: 64, offset: 1024)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1566, file: !334, line: 2830, baseType: !1356, size: 64, offset: 1088)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1566, file: !334, line: 2831, baseType: !1356, size: 64, offset: 1152)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1358, file: !334, line: 3389, baseType: !1575, size: 1024)
!1575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1576)
!1576 = !{!1577, !1578, !1579}
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1575, file: !334, line: 2851, baseType: !1519, size: 960)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1575, file: !334, line: 2852, baseType: !706, size: 32, offset: 960)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1575, file: !334, line: 2853, baseType: !706, size: 32, offset: 992)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1358, file: !334, line: 3390, baseType: !1581, size: 1024)
!1581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1582)
!1582 = !{!1583, !1584}
!1583 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1581, file: !334, line: 2858, baseType: !1519, size: 960)
!1584 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1581, file: !334, line: 2859, baseType: !1557, size: 64, offset: 960)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1358, file: !334, line: 3391, baseType: !1586, size: 960)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1587)
!1587 = !{!1588}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1586, file: !334, line: 2863, baseType: !1519, size: 960)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1358, file: !334, line: 3392, baseType: !1590, size: 1472)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1591)
!1591 = !{!1592}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1590, file: !334, line: 3305, baseType: !1524, size: 1472)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1358, file: !334, line: 3393, baseType: !1594, size: 1792)
!1594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1595)
!1595 = !{!1596, !1597, !1742, !1743, !1744, !1745, !1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759, !1760, !1761, !1762}
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1594, file: !334, line: 3249, baseType: !1524, size: 1472)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1594, file: !334, line: 3251, baseType: !1598, size: 64, offset: 1472)
!1598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1599, size: 64)
!1599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1600, line: 463, size: 1152, elements: !1601)
!1600 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1601 = !{!1602, !1605, !1635, !1636, !1639, !1642, !1687, !1688, !1689, !1690, !1691, !1715, !1718, !1719, !1720, !1721, !1722, !1723, !1724, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741}
