; ModuleID = 'statistics.bc'
source_filename = "statistics.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type opaque
%struct.gimple_seq_d = type opaque
%struct.gimple_df = type opaque
%struct.loops = type opaque
%union.tree_node = type { %struct.tree_function_decl }

!364 = !DIEnumerator(name: "TV_EXPAND", value: 116, isUnsigned: true)
!365 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!366 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!367 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!368 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!369 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!370 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!371 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!372 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!373 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!374 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!375 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!376 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!377 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!378 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!379 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!380 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!381 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!382 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!383 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!384 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!385 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!386 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!387 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!388 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!389 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!390 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!391 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!392 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!393 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!394 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!395 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!396 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!397 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!398 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!399 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!400 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!401 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!402 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!403 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!404 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!405 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!406 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!407 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!408 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!409 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!410 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!411 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!412 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!413 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!414 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!415 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!416 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!417 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!418 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!419 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!420 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!421 = !{!422, !423, !424, !425, !428, !429, !431, !483, !426, !493, !494, !517, !518}
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!424 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64)
!427 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !427)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !432, size: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !433, size: 64)
!433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !434, line: 100, size: 896, elements: !435)
!434 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!435 = !{!436, !444, !449, !454, !456, !460, !461, !462, !463, !464, !469, !471, !472, !477, !482}
!436 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !433, file: !434, line: 102, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !434, line: 52, baseType: !438)
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !439, size: 64)
!439 = !DISubroutineType(types: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !434, line: 47, baseType: !7)
!442 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !443, size: 64)
!443 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !433, file: !434, line: 105, baseType: !445, size: 64, offset: 64)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !434, line: 59, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!424, !442, !442}
!449 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !433, file: !434, line: 108, baseType: !450, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !434, line: 63, baseType: !451)
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !428}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !433, file: !434, line: 111, baseType: !455, size: 64, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !433, file: !434, line: 114, baseType: !457, size: 64, offset: 256)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !458, line: 46, baseType: !459)
!458 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!459 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !433, file: !434, line: 117, baseType: !457, size: 64, offset: 320)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !433, file: !434, line: 120, baseType: !457, size: 64, offset: 384)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !433, file: !434, line: 124, baseType: !7, size: 32, offset: 448)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !433, file: !434, line: 128, baseType: !7, size: 32, offset: 480)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !433, file: !434, line: 131, baseType: !465, size: 64, offset: 512)
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !434, line: 75, baseType: !466)
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DISubroutineType(types: !468)
!468 = !{!428, !457, !457}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !433, file: !434, line: 132, baseType: !470, size: 64, offset: 576)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !434, line: 78, baseType: !451)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !433, file: !434, line: 135, baseType: !428, size: 64, offset: 640)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !433, file: !434, line: 136, baseType: !473, size: 64, offset: 704)
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !434, line: 82, baseType: !474)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DISubroutineType(types: !476)
!476 = !{!428, !428, !457, !457}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !433, file: !434, line: 137, baseType: !478, size: 64, offset: 768)
!478 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !434, line: 83, baseType: !479)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !428, !428}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !433, file: !434, line: 141, baseType: !7, size: 32, offset: 832)
!483 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !484, size: 64)
!484 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "statistics_counter_t", file: !3, line: 45, baseType: !486)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "statistics_counter_s", file: !3, line: 39, size: 256, elements: !487)
!487 = !{!488, !489, !490, !491, !492}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !486, file: !3, line: 40, baseType: !429, size: 64)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !486, file: !3, line: 41, baseType: !424, size: 32, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "histogram_p", scope: !486, file: !3, line: 42, baseType: !423, size: 8, offset: 96)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !486, file: !3, line: 43, baseType: !459, size: 64, offset: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "prev_dumped_count", scope: !486, file: !3, line: 44, baseType: !459, size: 64, offset: 192)
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!494 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !495, size: 64)
!495 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "opt_pass", file: !239, line: 114, size: 640, elements: !496)
!496 = !{!497, !498, !499, !503, !507, !508, !509, !510, !512, !513, !514, !515, !516}
!497 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !495, file: !239, line: 117, baseType: !238, size: 32)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !495, file: !239, line: 121, baseType: !429, size: 64, offset: 64)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "gate", scope: !495, file: !239, line: 125, baseType: !500, size: 64, offset: 128)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DISubroutineType(types: !502)
!502 = !{!423}
!503 = !DIDerivedType(tag: DW_TAG_member, name: "execute", scope: !495, file: !239, line: 130, baseType: !504, size: 64, offset: 192)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DISubroutineType(types: !506)
!506 = !{!7}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "sub", scope: !495, file: !239, line: 133, baseType: !494, size: 64, offset: 256)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !495, file: !239, line: 136, baseType: !494, size: 64, offset: 320)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "static_pass_number", scope: !495, file: !239, line: 139, baseType: !424, size: 32, offset: 384)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "tv_id", scope: !495, file: !239, line: 143, baseType: !511, size: 32, offset: 416)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "timevar_id_t", file: !246, line: 80, baseType: !245)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "properties_required", scope: !495, file: !239, line: 146, baseType: !7, size: 32, offset: 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "properties_provided", scope: !495, file: !239, line: 147, baseType: !7, size: 32, offset: 480)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "properties_destroyed", scope: !495, file: !239, line: 148, baseType: !7, size: 32, offset: 512)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_start", scope: !495, file: !239, line: 151, baseType: !7, size: 32, offset: 544)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "todo_flags_finish", scope: !495, file: !239, line: 152, baseType: !7, size: 32, offset: 576)
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!519 = !{!520, !522, !0, !524, !528}
!520 = !DIGlobalVariableExpression(var: !521, expr: !DIExpression())
!521 = distinct !DIGlobalVariable(name: "statistics_dump_nr", scope: !2, file: !3, line: 32, type: !424, isLocal: true, isDefinition: true)
!522 = !DIGlobalVariableExpression(var: !523, expr: !DIExpression())
!523 = distinct !DIGlobalVariable(name: "statistics_dump_flags", scope: !2, file: !3, line: 33, type: !424, isLocal: true, isDefinition: true)
!524 = !DIGlobalVariableExpression(var: !525, expr: !DIExpression())
!525 = distinct !DIGlobalVariable(name: "statistics_hashes", scope: !2, file: !3, line: 48, type: !526, isLocal: true, isDefinition: true)
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !527, size: 64)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !434, line: 144, baseType: !432)
!528 = !DIGlobalVariableExpression(var: !529, expr: !DIExpression())
!529 = distinct !DIGlobalVariable(name: "nr_statistics_hashes", scope: !2, file: !3, line: 49, type: !7, isLocal: true, isDefinition: true)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !532, line: 7, baseType: !533)
!532 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !534, line: 49, size: 1728, elements: !535)
!534 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !551, !553, !554, !555, !559, !561, !563, !567, !570, !572, !575, !578, !579, !580, !581, !582}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !533, file: !534, line: 51, baseType: !424, size: 32)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !533, file: !534, line: 54, baseType: !426, size: 64, offset: 64)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !533, file: !534, line: 55, baseType: !426, size: 64, offset: 128)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !533, file: !534, line: 56, baseType: !426, size: 64, offset: 192)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !533, file: !534, line: 57, baseType: !426, size: 64, offset: 256)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !533, file: !534, line: 58, baseType: !426, size: 64, offset: 320)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !533, file: !534, line: 59, baseType: !426, size: 64, offset: 384)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !533, file: !534, line: 60, baseType: !426, size: 64, offset: 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !533, file: !534, line: 61, baseType: !426, size: 64, offset: 512)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !533, file: !534, line: 64, baseType: !426, size: 64, offset: 576)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !533, file: !534, line: 65, baseType: !426, size: 64, offset: 640)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !533, file: !534, line: 66, baseType: !426, size: 64, offset: 704)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !533, file: !534, line: 68, baseType: !549, size: 64, offset: 768)
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!550 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !534, line: 36, flags: DIFlagFwdDecl)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !533, file: !534, line: 70, baseType: !552, size: 64, offset: 832)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !533, file: !534, line: 72, baseType: !424, size: 32, offset: 896)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !533, file: !534, line: 73, baseType: !424, size: 32, offset: 928)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !533, file: !534, line: 74, baseType: !556, size: 64, offset: 960)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !557, line: 152, baseType: !558)
!557 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!558 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !533, file: !534, line: 77, baseType: !560, size: 16, offset: 1024)
!560 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !533, file: !534, line: 78, baseType: !562, size: 8, offset: 1040)
!562 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !533, file: !534, line: 79, baseType: !564, size: 8, offset: 1048)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 8, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 1)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !533, file: !534, line: 81, baseType: !568, size: 64, offset: 1088)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !534, line: 43, baseType: null)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !533, file: !534, line: 89, baseType: !571, size: 64, offset: 1152)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !557, line: 153, baseType: !558)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !533, file: !534, line: 91, baseType: !573, size: 64, offset: 1216)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !534, line: 37, flags: DIFlagFwdDecl)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !533, file: !534, line: 92, baseType: !576, size: 64, offset: 1280)
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !534, line: 38, flags: DIFlagFwdDecl)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !533, file: !534, line: 93, baseType: !552, size: 64, offset: 1344)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !533, file: !534, line: 94, baseType: !428, size: 64, offset: 1408)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !533, file: !534, line: 95, baseType: !457, size: 64, offset: 1472)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !533, file: !534, line: 96, baseType: !424, size: 32, offset: 1536)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !533, file: !534, line: 98, baseType: !583, size: 160, offset: 1568)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !427, size: 160, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 20)
!586 = !{i32 2, !"Dwarf Version", i32 4}
!587 = !{i32 2, !"Debug Info Version", i32 3}
!588 = !{i32 1, !"wchar_size", i32 4}
!589 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!590 = distinct !DISubprogram(name: "vprintf", scope: !591, file: !591, line: 39, type: !592, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !602)
!591 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!592 = !DISubroutineType(types: !593)
!593 = !{!424, !594, !595}
!594 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !429)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !597)
!597 = !{!598, !599, !600, !601}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !596, file: !3, baseType: !7, size: 32)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !596, file: !3, baseType: !7, size: 32, offset: 32)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !596, file: !3, baseType: !428, size: 64, offset: 64)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !596, file: !3, baseType: !428, size: 64, offset: 128)
!602 = !{!603, !604}
!603 = !DILocalVariable(name: "__fmt", arg: 1, scope: !590, file: !591, line: 39, type: !594)
!604 = !DILocalVariable(name: "__arg", arg: 2, scope: !590, file: !591, line: 39, type: !595)
!605 = !DILocation(line: 0, scope: !590)
!606 = !DILocation(line: 41, column: 20, scope: !590)
!607 = !DILocation(line: 41, column: 10, scope: !590)
!608 = !DILocation(line: 41, column: 3, scope: !590)
!609 = distinct !DISubprogram(name: "getchar", scope: !591, file: !591, line: 47, type: !610, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!424}
!612 = !{}
!613 = !DILocation(line: 49, column: 16, scope: !609)
!614 = !DILocation(line: 49, column: 10, scope: !609)
!615 = !DILocation(line: 49, column: 3, scope: !609)
!616 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !591, file: !591, line: 56, type: !617, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!424, !530}
!619 = !{!620}
!620 = !DILocalVariable(name: "__fp", arg: 1, scope: !616, file: !591, line: 56, type: !530)
!621 = !DILocation(line: 0, scope: !616)
!622 = !DILocation(line: 58, column: 10, scope: !616)
!623 = !DILocation(line: 58, column: 3, scope: !616)
!624 = distinct !DISubprogram(name: "getc_unlocked", scope: !591, file: !591, line: 66, type: !617, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !625)
!625 = !{!626}
!626 = !DILocalVariable(name: "__fp", arg: 1, scope: !624, file: !591, line: 66, type: !530)
!627 = !DILocation(line: 0, scope: !624)
!628 = !DILocation(line: 68, column: 10, scope: !624)
!629 = !DILocation(line: 68, column: 3, scope: !624)
!630 = distinct !DISubprogram(name: "getchar_unlocked", scope: !591, file: !591, line: 73, type: !610, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!631 = !DILocation(line: 75, column: 10, scope: !630)
!632 = !DILocation(line: 75, column: 3, scope: !630)
!633 = distinct !DISubprogram(name: "putchar", scope: !591, file: !591, line: 82, type: !634, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !636)
!634 = !DISubroutineType(types: !635)
!635 = !{!424, !424}
!636 = !{!637}
!637 = !DILocalVariable(name: "__c", arg: 1, scope: !633, file: !591, line: 82, type: !424)
!638 = !DILocation(line: 0, scope: !633)
!639 = !DILocation(line: 84, column: 21, scope: !633)
!640 = !DILocation(line: 84, column: 10, scope: !633)
!641 = !DILocation(line: 84, column: 3, scope: !633)
!642 = distinct !DISubprogram(name: "fputc_unlocked", scope: !591, file: !591, line: 91, type: !643, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !645)
!643 = !DISubroutineType(types: !644)
!644 = !{!424, !424, !530}
!645 = !{!646, !647}
!646 = !DILocalVariable(name: "__c", arg: 1, scope: !642, file: !591, line: 91, type: !424)
!647 = !DILocalVariable(name: "__stream", arg: 2, scope: !642, file: !591, line: 91, type: !530)
!648 = !DILocation(line: 0, scope: !642)
!649 = !DILocation(line: 93, column: 10, scope: !642)
!650 = !DILocation(line: 93, column: 3, scope: !642)
!651 = distinct !DISubprogram(name: "putc_unlocked", scope: !591, file: !591, line: 101, type: !643, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !652)
!652 = !{!653, !654}
!653 = !DILocalVariable(name: "__c", arg: 1, scope: !651, file: !591, line: 101, type: !424)
!654 = !DILocalVariable(name: "__stream", arg: 2, scope: !651, file: !591, line: 101, type: !530)
!655 = !DILocation(line: 0, scope: !651)
!656 = !DILocation(line: 103, column: 10, scope: !651)
!657 = !DILocation(line: 103, column: 3, scope: !651)
!658 = distinct !DISubprogram(name: "putchar_unlocked", scope: !591, file: !591, line: 108, type: !634, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !659)
!659 = !{!660}
!660 = !DILocalVariable(name: "__c", arg: 1, scope: !658, file: !591, line: 108, type: !424)
!661 = !DILocation(line: 0, scope: !658)
!662 = !DILocation(line: 110, column: 10, scope: !658)
!663 = !DILocation(line: 110, column: 3, scope: !658)
!664 = distinct !DISubprogram(name: "getline", scope: !591, file: !591, line: 118, type: !665, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !669)
!665 = !DISubroutineType(types: !666)
!666 = !{!667, !425, !668, !530}
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !557, line: 193, baseType: !558)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!669 = !{!670, !671, !672}
!670 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !664, file: !591, line: 118, type: !425)
!671 = !DILocalVariable(name: "__n", arg: 2, scope: !664, file: !591, line: 118, type: !668)
!672 = !DILocalVariable(name: "__stream", arg: 3, scope: !664, file: !591, line: 118, type: !530)
!673 = !DILocation(line: 0, scope: !664)
!674 = !DILocation(line: 120, column: 10, scope: !664)
!675 = !DILocation(line: 120, column: 3, scope: !664)
!676 = distinct !DISubprogram(name: "feof_unlocked", scope: !591, file: !591, line: 128, type: !617, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !677)
!677 = !{!678}
!678 = !DILocalVariable(name: "__stream", arg: 1, scope: !676, file: !591, line: 128, type: !530)
!679 = !DILocation(line: 0, scope: !676)
!680 = !DILocation(line: 130, column: 10, scope: !676)
!681 = !DILocation(line: 130, column: 3, scope: !676)
!682 = distinct !DISubprogram(name: "ferror_unlocked", scope: !591, file: !591, line: 135, type: !617, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !683)
!683 = !{!684}
!684 = !DILocalVariable(name: "__stream", arg: 1, scope: !682, file: !591, line: 135, type: !530)
!685 = !DILocation(line: 0, scope: !682)
!686 = !DILocation(line: 137, column: 10, scope: !682)
!687 = !DILocation(line: 137, column: 3, scope: !682)
!688 = distinct !DISubprogram(name: "tolower", scope: !689, file: !689, line: 207, type: !634, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !690)
!689 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!690 = !{!691}
!691 = !DILocalVariable(name: "__c", arg: 1, scope: !688, file: !689, line: 207, type: !424)
!692 = !DILocation(line: 0, scope: !688)
!693 = !DILocation(line: 209, column: 22, scope: !688)
!694 = !DILocation(line: 209, column: 39, scope: !688)
!695 = !DILocation(line: 209, column: 38, scope: !688)
!696 = !DILocation(line: 209, column: 37, scope: !688)
!697 = !DILocation(line: 209, column: 10, scope: !688)
!698 = !DILocation(line: 209, column: 3, scope: !688)
!699 = distinct !DISubprogram(name: "toupper", scope: !689, file: !689, line: 213, type: !634, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !700)
!700 = !{!701}
!701 = !DILocalVariable(name: "__c", arg: 1, scope: !699, file: !689, line: 213, type: !424)
!702 = !DILocation(line: 0, scope: !699)
!703 = !DILocation(line: 215, column: 22, scope: !699)
!704 = !DILocation(line: 215, column: 39, scope: !699)
!705 = !DILocation(line: 215, column: 38, scope: !699)
!706 = !DILocation(line: 215, column: 37, scope: !699)
!707 = !DILocation(line: 215, column: 10, scope: !699)
!708 = !DILocation(line: 215, column: 3, scope: !699)
!709 = distinct !DISubprogram(name: "atoi", scope: !710, file: !710, line: 361, type: !711, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !713)
!710 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!711 = !DISubroutineType(types: !712)
!712 = !{!424, !429}
!713 = !{!714}
!714 = !DILocalVariable(name: "__nptr", arg: 1, scope: !709, file: !710, line: 361, type: !429)
!715 = !DILocation(line: 0, scope: !709)
!716 = !DILocation(line: 363, column: 16, scope: !709)
!717 = !DILocation(line: 363, column: 10, scope: !709)
!718 = !DILocation(line: 363, column: 3, scope: !709)
!719 = distinct !DISubprogram(name: "atol", scope: !710, file: !710, line: 366, type: !720, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !722)
!720 = !DISubroutineType(types: !721)
!721 = !{!558, !429}
!722 = !{!723}
!723 = !DILocalVariable(name: "__nptr", arg: 1, scope: !719, file: !710, line: 366, type: !429)
!724 = !DILocation(line: 0, scope: !719)
!725 = !DILocation(line: 368, column: 10, scope: !719)
!726 = !DILocation(line: 368, column: 3, scope: !719)
!727 = distinct !DISubprogram(name: "atoll", scope: !710, file: !710, line: 373, type: !728, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !731)
!728 = !DISubroutineType(types: !729)
!729 = !{!730, !429}
!730 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!731 = !{!732}
!732 = !DILocalVariable(name: "__nptr", arg: 1, scope: !727, file: !710, line: 373, type: !429)
!733 = !DILocation(line: 0, scope: !727)
!734 = !DILocation(line: 375, column: 10, scope: !727)
!735 = !DILocation(line: 375, column: 3, scope: !727)
!736 = distinct !DISubprogram(name: "bsearch", scope: !737, file: !737, line: 20, type: !738, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !741)
!737 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!738 = !DISubroutineType(types: !739)
!739 = !{!428, !442, !442, !457, !457, !740}
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !710, line: 808, baseType: !446)
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!742 = !DILocalVariable(name: "__key", arg: 1, scope: !736, file: !737, line: 20, type: !442)
!743 = !DILocalVariable(name: "__base", arg: 2, scope: !736, file: !737, line: 20, type: !442)
!744 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !736, file: !737, line: 20, type: !457)
!745 = !DILocalVariable(name: "__size", arg: 4, scope: !736, file: !737, line: 20, type: !457)
!746 = !DILocalVariable(name: "__compar", arg: 5, scope: !736, file: !737, line: 21, type: !740)
!747 = !DILocalVariable(name: "__l", scope: !736, file: !737, line: 23, type: !457)
!748 = !DILocalVariable(name: "__u", scope: !736, file: !737, line: 23, type: !457)
!749 = !DILocalVariable(name: "__idx", scope: !736, file: !737, line: 23, type: !457)
!750 = !DILocalVariable(name: "__p", scope: !736, file: !737, line: 24, type: !442)
!751 = !DILocalVariable(name: "__comparison", scope: !736, file: !737, line: 25, type: !424)
!752 = !DILocation(line: 0, scope: !736)
!753 = !DILocation(line: 29, column: 3, scope: !736)
!754 = !DILocation(line: 27, column: 7, scope: !736)
!755 = !DILocation(line: 29, column: 14, scope: !736)
!756 = !DILocation(line: 31, column: 20, scope: !757)
!757 = distinct !DILexicalBlock(scope: !736, file: !737, line: 30, column: 5)
!758 = !DILocation(line: 31, column: 27, scope: !757)
!759 = !DILocation(line: 32, column: 56, scope: !757)
!760 = !DILocation(line: 32, column: 47, scope: !757)
!761 = !DILocation(line: 33, column: 22, scope: !757)
!762 = !DILocation(line: 34, column: 24, scope: !763)
!763 = distinct !DILexicalBlock(scope: !757, file: !737, line: 34, column: 11)
!764 = !DILocation(line: 34, column: 11, scope: !757)
!765 = !DILocation(line: 36, column: 29, scope: !766)
!766 = distinct !DILexicalBlock(scope: !763, file: !737, line: 36, column: 16)
!767 = !DILocation(line: 36, column: 16, scope: !763)
!768 = !DILocation(line: 37, column: 14, scope: !766)
!769 = distinct !{!769, !753, !770}
!770 = !DILocation(line: 40, column: 5, scope: !736)
!771 = !DILocation(line: 43, column: 1, scope: !736)
!772 = distinct !DISubprogram(name: "atof", scope: !773, file: !773, line: 25, type: !774, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !777)
!773 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!774 = !DISubroutineType(types: !775)
!775 = !{!776, !429}
!776 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!777 = !{!778}
!778 = !DILocalVariable(name: "__nptr", arg: 1, scope: !772, file: !773, line: 25, type: !429)
!779 = !DILocation(line: 0, scope: !772)
!780 = !DILocation(line: 27, column: 10, scope: !772)
!781 = !DILocation(line: 27, column: 3, scope: !772)
!782 = distinct !DISubprogram(name: "strtoimax", scope: !783, file: !783, line: 324, type: !784, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !790)
!783 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!784 = !DISubroutineType(types: !785)
!785 = !{!786, !594, !789, !424}
!786 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !787, line: 101, baseType: !788)
!787 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!788 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !557, line: 72, baseType: !558)
!789 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !425)
!790 = !{!791, !792, !793}
!791 = !DILocalVariable(name: "nptr", arg: 1, scope: !782, file: !783, line: 324, type: !594)
!792 = !DILocalVariable(name: "endptr", arg: 2, scope: !782, file: !783, line: 324, type: !789)
!793 = !DILocalVariable(name: "base", arg: 3, scope: !782, file: !783, line: 324, type: !424)
!794 = !DILocation(line: 0, scope: !782)
!795 = !DILocation(line: 327, column: 10, scope: !782)
!796 = !DILocation(line: 327, column: 3, scope: !782)
!797 = distinct !DISubprogram(name: "strtoumax", scope: !783, file: !783, line: 336, type: !798, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !802)
!798 = !DISubroutineType(types: !799)
!799 = !{!800, !594, !789, !424}
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !787, line: 102, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !557, line: 73, baseType: !459)
!802 = !{!803, !804, !805}
!803 = !DILocalVariable(name: "nptr", arg: 1, scope: !797, file: !783, line: 336, type: !594)
!804 = !DILocalVariable(name: "endptr", arg: 2, scope: !797, file: !783, line: 336, type: !789)
!805 = !DILocalVariable(name: "base", arg: 3, scope: !797, file: !783, line: 336, type: !424)
!806 = !DILocation(line: 0, scope: !797)
!807 = !DILocation(line: 339, column: 10, scope: !797)
!808 = !DILocation(line: 339, column: 3, scope: !797)
!809 = distinct !DISubprogram(name: "wcstoimax", scope: !783, file: !783, line: 348, type: !810, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !819)
!810 = !DISubroutineType(types: !811)
!811 = !{!786, !812, !816, !424}
!812 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !813)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !783, line: 34, baseType: !424)
!816 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !817)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !818, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!819 = !{!820, !821, !822}
!820 = !DILocalVariable(name: "nptr", arg: 1, scope: !809, file: !783, line: 348, type: !812)
!821 = !DILocalVariable(name: "endptr", arg: 2, scope: !809, file: !783, line: 348, type: !816)
!822 = !DILocalVariable(name: "base", arg: 3, scope: !809, file: !783, line: 348, type: !424)
!823 = !DILocation(line: 0, scope: !809)
!824 = !DILocation(line: 351, column: 10, scope: !809)
!825 = !DILocation(line: 351, column: 3, scope: !809)
!826 = distinct !DISubprogram(name: "wcstoumax", scope: !783, file: !783, line: 362, type: !827, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !829)
!827 = !DISubroutineType(types: !828)
!828 = !{!800, !812, !816, !424}
!829 = !{!830, !831, !832}
!830 = !DILocalVariable(name: "nptr", arg: 1, scope: !826, file: !783, line: 362, type: !812)
!831 = !DILocalVariable(name: "endptr", arg: 2, scope: !826, file: !783, line: 362, type: !816)
!832 = !DILocalVariable(name: "base", arg: 3, scope: !826, file: !783, line: 362, type: !424)
!833 = !DILocation(line: 0, scope: !826)
!834 = !DILocation(line: 365, column: 10, scope: !826)
!835 = !DILocation(line: 365, column: 3, scope: !826)
!836 = distinct !DISubprogram(name: "stat", scope: !837, file: !837, line: 453, type: !838, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !877)
!837 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!838 = !DISubroutineType(types: !839)
!839 = !{!424, !429, !840}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !842, line: 46, size: 1152, elements: !843)
!842 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!843 = !{!844, !846, !848, !850, !852, !854, !856, !857, !858, !859, !861, !863, !871, !872, !873}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !841, file: !842, line: 48, baseType: !845, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !557, line: 145, baseType: !459)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !841, file: !842, line: 53, baseType: !847, size: 64, offset: 64)
!847 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !557, line: 148, baseType: !459)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !841, file: !842, line: 61, baseType: !849, size: 64, offset: 128)
!849 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !557, line: 151, baseType: !459)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !841, file: !842, line: 62, baseType: !851, size: 32, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !557, line: 150, baseType: !7)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !841, file: !842, line: 64, baseType: !853, size: 32, offset: 224)
!853 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !557, line: 146, baseType: !7)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !841, file: !842, line: 65, baseType: !855, size: 32, offset: 256)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !557, line: 147, baseType: !7)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !841, file: !842, line: 67, baseType: !424, size: 32, offset: 288)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !841, file: !842, line: 69, baseType: !845, size: 64, offset: 320)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !841, file: !842, line: 74, baseType: !556, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !841, file: !842, line: 78, baseType: !860, size: 64, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !557, line: 174, baseType: !558)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !841, file: !842, line: 80, baseType: !862, size: 64, offset: 512)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !557, line: 179, baseType: !558)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !841, file: !842, line: 91, baseType: !864, size: 128, offset: 576)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !865, line: 10, size: 128, elements: !866)
!865 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!866 = !{!867, !869}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !864, file: !865, line: 12, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !557, line: 160, baseType: !558)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !864, file: !865, line: 16, baseType: !870, size: 64, offset: 64)
!870 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !557, line: 196, baseType: !558)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !841, file: !842, line: 92, baseType: !864, size: 128, offset: 704)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !841, file: !842, line: 93, baseType: !864, size: 128, offset: 832)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !841, file: !842, line: 106, baseType: !874, size: 192, offset: 960)
!874 = !DICompositeType(tag: DW_TAG_array_type, baseType: !870, size: 192, elements: !875)
!875 = !{!876}
!876 = !DISubrange(count: 3)
!877 = !{!878, !879}
!878 = !DILocalVariable(name: "__path", arg: 1, scope: !836, file: !837, line: 453, type: !429)
!879 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !836, file: !837, line: 453, type: !840)
!880 = !DILocation(line: 0, scope: !836)
!881 = !DILocation(line: 455, column: 10, scope: !836)
!882 = !DILocation(line: 455, column: 3, scope: !836)
!883 = distinct !DISubprogram(name: "lstat", scope: !837, file: !837, line: 460, type: !838, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !884)
!884 = !{!885, !886}
!885 = !DILocalVariable(name: "__path", arg: 1, scope: !883, file: !837, line: 460, type: !429)
!886 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !883, file: !837, line: 460, type: !840)
!887 = !DILocation(line: 0, scope: !883)
!888 = !DILocation(line: 462, column: 10, scope: !883)
!889 = !DILocation(line: 462, column: 3, scope: !883)
!890 = distinct !DISubprogram(name: "fstat", scope: !837, file: !837, line: 467, type: !891, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !893)
!891 = !DISubroutineType(types: !892)
!892 = !{!424, !424, !840}
!893 = !{!894, !895}
!894 = !DILocalVariable(name: "__fd", arg: 1, scope: !890, file: !837, line: 467, type: !424)
!895 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !890, file: !837, line: 467, type: !840)
!896 = !DILocation(line: 0, scope: !890)
!897 = !DILocation(line: 469, column: 10, scope: !890)
!898 = !DILocation(line: 469, column: 3, scope: !890)
!899 = distinct !DISubprogram(name: "fstatat", scope: !837, file: !837, line: 474, type: !900, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !902)
!900 = !DISubroutineType(types: !901)
!901 = !{!424, !424, !429, !840, !424}
!902 = !{!903, !904, !905, !906}
!903 = !DILocalVariable(name: "__fd", arg: 1, scope: !899, file: !837, line: 474, type: !424)
!904 = !DILocalVariable(name: "__filename", arg: 2, scope: !899, file: !837, line: 474, type: !429)
!905 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !899, file: !837, line: 474, type: !840)
!906 = !DILocalVariable(name: "__flag", arg: 4, scope: !899, file: !837, line: 474, type: !424)
!907 = !DILocation(line: 0, scope: !899)
!908 = !DILocation(line: 477, column: 10, scope: !899)
!909 = !DILocation(line: 477, column: 3, scope: !899)
!910 = distinct !DISubprogram(name: "mknod", scope: !837, file: !837, line: 483, type: !911, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !913)
!911 = !DISubroutineType(types: !912)
!912 = !{!424, !429, !851, !845}
!913 = !{!914, !915, !916}
!914 = !DILocalVariable(name: "__path", arg: 1, scope: !910, file: !837, line: 483, type: !429)
!915 = !DILocalVariable(name: "__mode", arg: 2, scope: !910, file: !837, line: 483, type: !851)
!916 = !DILocalVariable(name: "__dev", arg: 3, scope: !910, file: !837, line: 483, type: !845)
!917 = !DILocation(line: 0, scope: !910)
!918 = !DILocation(line: 485, column: 10, scope: !910)
!919 = !DILocation(line: 485, column: 3, scope: !910)
!920 = distinct !DISubprogram(name: "mknodat", scope: !837, file: !837, line: 491, type: !921, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !923)
!921 = !DISubroutineType(types: !922)
!922 = !{!424, !424, !429, !851, !845}
!923 = !{!924, !925, !926, !927}
!924 = !DILocalVariable(name: "__fd", arg: 1, scope: !920, file: !837, line: 491, type: !424)
!925 = !DILocalVariable(name: "__path", arg: 2, scope: !920, file: !837, line: 491, type: !429)
!926 = !DILocalVariable(name: "__mode", arg: 3, scope: !920, file: !837, line: 491, type: !851)
!927 = !DILocalVariable(name: "__dev", arg: 4, scope: !920, file: !837, line: 491, type: !845)
!928 = !DILocation(line: 0, scope: !920)
!929 = !DILocation(line: 494, column: 10, scope: !920)
!930 = !DILocation(line: 494, column: 3, scope: !920)
!931 = distinct !DISubprogram(name: "stat64", scope: !837, file: !837, line: 502, type: !932, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !954)
!932 = !DISubroutineType(types: !933)
!933 = !{!424, !429, !934}
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !842, line: 119, size: 1152, elements: !936)
!936 = !{!937, !938, !940, !941, !942, !943, !944, !945, !946, !947, !948, !950, !951, !952, !953}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !935, file: !842, line: 121, baseType: !845, size: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !935, file: !842, line: 123, baseType: !939, size: 64, offset: 64)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !557, line: 149, baseType: !459)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !935, file: !842, line: 124, baseType: !849, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !935, file: !842, line: 125, baseType: !851, size: 32, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !935, file: !842, line: 132, baseType: !853, size: 32, offset: 224)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !935, file: !842, line: 133, baseType: !855, size: 32, offset: 256)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !935, file: !842, line: 135, baseType: !424, size: 32, offset: 288)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !935, file: !842, line: 136, baseType: !845, size: 64, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !935, file: !842, line: 137, baseType: !556, size: 64, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !935, file: !842, line: 143, baseType: !860, size: 64, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !935, file: !842, line: 144, baseType: !949, size: 64, offset: 512)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !557, line: 180, baseType: !558)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !935, file: !842, line: 152, baseType: !864, size: 128, offset: 576)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !935, file: !842, line: 153, baseType: !864, size: 128, offset: 704)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !935, file: !842, line: 154, baseType: !864, size: 128, offset: 832)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !935, file: !842, line: 164, baseType: !874, size: 192, offset: 960)
!954 = !{!955, !956}
!955 = !DILocalVariable(name: "__path", arg: 1, scope: !931, file: !837, line: 502, type: !429)
!956 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !931, file: !837, line: 502, type: !934)
!957 = !DILocation(line: 0, scope: !931)
!958 = !DILocation(line: 504, column: 10, scope: !931)
!959 = !DILocation(line: 504, column: 3, scope: !931)
!960 = distinct !DISubprogram(name: "lstat64", scope: !837, file: !837, line: 509, type: !932, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !961)
!961 = !{!962, !963}
!962 = !DILocalVariable(name: "__path", arg: 1, scope: !960, file: !837, line: 509, type: !429)
!963 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !960, file: !837, line: 509, type: !934)
!964 = !DILocation(line: 0, scope: !960)
!965 = !DILocation(line: 511, column: 10, scope: !960)
!966 = !DILocation(line: 511, column: 3, scope: !960)
!967 = distinct !DISubprogram(name: "fstat64", scope: !837, file: !837, line: 516, type: !968, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !970)
!968 = !DISubroutineType(types: !969)
!969 = !{!424, !424, !934}
!970 = !{!971, !972}
!971 = !DILocalVariable(name: "__fd", arg: 1, scope: !967, file: !837, line: 516, type: !424)
!972 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !967, file: !837, line: 516, type: !934)
!973 = !DILocation(line: 0, scope: !967)
!974 = !DILocation(line: 518, column: 10, scope: !967)
!975 = !DILocation(line: 518, column: 3, scope: !967)
!976 = distinct !DISubprogram(name: "fstatat64", scope: !837, file: !837, line: 523, type: !977, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !979)
!977 = !DISubroutineType(types: !978)
!978 = !{!424, !424, !429, !934, !424}
!979 = !{!980, !981, !982, !983}
!980 = !DILocalVariable(name: "__fd", arg: 1, scope: !976, file: !837, line: 523, type: !424)
!981 = !DILocalVariable(name: "__filename", arg: 2, scope: !976, file: !837, line: 523, type: !429)
!982 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !976, file: !837, line: 523, type: !934)
!983 = !DILocalVariable(name: "__flag", arg: 4, scope: !976, file: !837, line: 523, type: !424)
!984 = !DILocation(line: 0, scope: !976)
!985 = !DILocation(line: 526, column: 10, scope: !976)
!986 = !DILocation(line: 526, column: 3, scope: !976)
!987 = distinct !DISubprogram(name: "statistics_fini_pass", scope: !3, file: !3, line: 173, type: !988, scopeLine: 174, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!988 = !DISubroutineType(types: !989)
!989 = !{null}
!990 = !DILocation(line: 175, column: 7, scope: !991)
!991 = distinct !DILexicalBlock(scope: !987, file: !3, line: 175, column: 7)
!992 = !DILocation(line: 175, column: 21, scope: !991)
!993 = !DILocation(line: 175, column: 40, scope: !991)
!994 = !DILocation(line: 175, column: 7, scope: !987)
!995 = !DILocation(line: 178, column: 7, scope: !996)
!996 = distinct !DILexicalBlock(scope: !987, file: !3, line: 178, column: 7)
!997 = !DILocation(line: 179, column: 7, scope: !996)
!998 = !DILocation(line: 179, column: 10, scope: !996)
!999 = !DILocation(line: 179, column: 21, scope: !996)
!1000 = !DILocation(line: 178, column: 7, scope: !987)
!1001 = !DILocation(line: 181, column: 7, scope: !1002)
!1002 = distinct !DILexicalBlock(scope: !996, file: !3, line: 180, column: 5)
!1003 = !DILocation(line: 182, column: 16, scope: !1002)
!1004 = !DILocation(line: 182, column: 7, scope: !1002)
!1005 = !DILocation(line: 183, column: 16, scope: !1002)
!1006 = !DILocation(line: 183, column: 7, scope: !1002)
!1007 = !DILocation(line: 184, column: 31, scope: !1002)
!1008 = !DILocation(line: 184, column: 7, scope: !1002)
!1009 = !DILocation(line: 186, column: 16, scope: !1002)
!1010 = !DILocation(line: 186, column: 7, scope: !1002)
!1011 = !DILocation(line: 187, column: 5, scope: !1002)
!1012 = !DILocation(line: 188, column: 7, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !987, file: !3, line: 188, column: 7)
!1014 = !DILocation(line: 189, column: 7, scope: !1013)
!1015 = !DILocation(line: 189, column: 12, scope: !1013)
!1016 = !DILocation(line: 189, column: 34, scope: !1013)
!1017 = !DILocation(line: 190, column: 5, scope: !1013)
!1018 = !DILocation(line: 190, column: 30, scope: !1013)
!1019 = !DILocation(line: 188, column: 7, scope: !987)
!1020 = !DILocation(line: 191, column: 29, scope: !1013)
!1021 = !DILocation(line: 191, column: 5, scope: !1013)
!1022 = !DILocation(line: 193, column: 27, scope: !987)
!1023 = !DILocation(line: 193, column: 3, scope: !987)
!1024 = !DILocation(line: 195, column: 1, scope: !987)
!1025 = distinct !DISubprogram(name: "curr_statistics_hash", scope: !3, file: !3, line: 83, type: !1026, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1028)
!1026 = !DISubroutineType(types: !1027)
!1027 = !{!527}
!1028 = !{!1029}
!1029 = !DILocalVariable(name: "idx", scope: !1025, file: !3, line: 85, type: !7)
!1030 = !DILocation(line: 87, column: 3, scope: !1025)
!1031 = !DILocation(line: 88, column: 9, scope: !1025)
!1032 = !DILocation(line: 0, scope: !1025)
!1033 = !DILocation(line: 88, column: 23, scope: !1025)
!1034 = !DILocation(line: 90, column: 13, scope: !1035)
!1035 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 90, column: 7)
!1036 = !DILocation(line: 90, column: 11, scope: !1035)
!1037 = !DILocation(line: 91, column: 7, scope: !1035)
!1038 = !DILocation(line: 91, column: 10, scope: !1035)
!1039 = !DILocation(line: 91, column: 33, scope: !1035)
!1040 = !DILocation(line: 90, column: 7, scope: !1025)
!1041 = !DILocation(line: 92, column: 5, scope: !1035)
!1042 = !DILocation(line: 94, column: 7, scope: !1025)
!1043 = !DILocation(line: 96, column: 27, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 95, column: 5)
!1045 = distinct !DILexicalBlock(scope: !1025, file: !3, line: 94, column: 7)
!1046 = !DILocation(line: 96, column: 25, scope: !1044)
!1047 = !DILocation(line: 97, column: 15, scope: !1044)
!1048 = !DILocation(line: 97, column: 35, scope: !1044)
!1049 = !DILocation(line: 97, column: 33, scope: !1044)
!1050 = !DILocation(line: 98, column: 17, scope: !1044)
!1051 = !DILocation(line: 98, column: 8, scope: !1044)
!1052 = !DILocation(line: 98, column: 41, scope: !1044)
!1053 = !DILocation(line: 97, column: 7, scope: !1044)
!1054 = !DILocation(line: 99, column: 28, scope: !1044)
!1055 = !DILocation(line: 100, column: 5, scope: !1044)
!1056 = !DILocation(line: 102, column: 28, scope: !1025)
!1057 = !DILocation(line: 102, column: 3, scope: !1025)
!1058 = !DILocation(line: 102, column: 26, scope: !1025)
!1059 = !DILocation(line: 106, column: 10, scope: !1025)
!1060 = !DILocation(line: 106, column: 3, scope: !1025)
!1061 = !DILocation(line: 107, column: 1, scope: !1025)
!1062 = distinct !DISubprogram(name: "statistics_fini_pass_1", scope: !3, file: !3, line: 113, type: !1063, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1065)
!1063 = !DISubroutineType(types: !1064)
!1064 = !{!424, !455, !428}
!1065 = !{!1066, !1067, !1068, !1069}
!1066 = !DILocalVariable(name: "slot", arg: 1, scope: !1062, file: !3, line: 113, type: !455)
!1067 = !DILocalVariable(name: "data", arg: 2, scope: !1062, file: !3, line: 113, type: !428)
!1068 = !DILocalVariable(name: "counter", scope: !1062, file: !3, line: 115, type: !493)
!1069 = !DILocalVariable(name: "count", scope: !1062, file: !3, line: 116, type: !459)
!1070 = !DILocation(line: 0, scope: !1062)
!1071 = !DILocation(line: 115, column: 59, scope: !1062)
!1072 = !DILocation(line: 116, column: 43, scope: !1062)
!1073 = !DILocation(line: 116, column: 60, scope: !1062)
!1074 = !DILocation(line: 116, column: 49, scope: !1062)
!1075 = !DILocation(line: 117, column: 13, scope: !1076)
!1076 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 117, column: 7)
!1077 = !DILocation(line: 117, column: 7, scope: !1062)
!1078 = !DILocation(line: 119, column: 16, scope: !1079)
!1079 = distinct !DILexicalBlock(scope: !1062, file: !3, line: 119, column: 7)
!1080 = !DILocation(line: 119, column: 7, scope: !1079)
!1081 = !DILocation(line: 0, scope: !1079)
!1082 = !DILocation(line: 119, column: 7, scope: !1062)
!1083 = !DILocation(line: 121, column: 29, scope: !1079)
!1084 = !DILocation(line: 120, column: 5, scope: !1079)
!1085 = !DILocation(line: 123, column: 5, scope: !1079)
!1086 = !DILocation(line: 125, column: 41, scope: !1062)
!1087 = !DILocation(line: 125, column: 30, scope: !1062)
!1088 = !DILocation(line: 126, column: 3, scope: !1062)
!1089 = !DILocation(line: 127, column: 1, scope: !1062)
!1090 = distinct !DISubprogram(name: "statistics_fini_pass_2", scope: !3, file: !3, line: 133, type: !1063, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1091)
!1091 = !{!1092, !1093, !1094, !1095}
!1092 = !DILocalVariable(name: "slot", arg: 1, scope: !1090, file: !3, line: 133, type: !455)
!1093 = !DILocalVariable(name: "data", arg: 2, scope: !1090, file: !3, line: 133, type: !428)
!1094 = !DILocalVariable(name: "counter", scope: !1090, file: !3, line: 135, type: !493)
!1095 = !DILocalVariable(name: "count", scope: !1090, file: !3, line: 136, type: !459)
!1096 = !DILocation(line: 0, scope: !1090)
!1097 = !DILocation(line: 135, column: 59, scope: !1090)
!1098 = !DILocation(line: 136, column: 43, scope: !1090)
!1099 = !DILocation(line: 136, column: 60, scope: !1090)
!1100 = !DILocation(line: 136, column: 49, scope: !1090)
!1101 = !DILocation(line: 137, column: 13, scope: !1102)
!1102 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 137, column: 7)
!1103 = !DILocation(line: 137, column: 7, scope: !1090)
!1104 = !DILocation(line: 139, column: 30, scope: !1090)
!1105 = !DILocation(line: 140, column: 16, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1090, file: !3, line: 140, column: 7)
!1107 = !DILocation(line: 140, column: 7, scope: !1106)
!1108 = !DILocation(line: 0, scope: !1106)
!1109 = !DILocation(line: 140, column: 7, scope: !1090)
!1110 = !DILocation(line: 145, column: 29, scope: !1106)
!1111 = !DILocation(line: 146, column: 7, scope: !1106)
!1112 = !DILocation(line: 146, column: 14, scope: !1106)
!1113 = !DILocation(line: 141, column: 5, scope: !1106)
!1114 = !DILocation(line: 154, column: 7, scope: !1106)
!1115 = !DILocation(line: 154, column: 14, scope: !1106)
!1116 = !DILocation(line: 149, column: 5, scope: !1106)
!1117 = !DILocation(line: 156, column: 41, scope: !1090)
!1118 = !DILocation(line: 156, column: 30, scope: !1090)
!1119 = !DILocation(line: 157, column: 3, scope: !1090)
!1120 = !DILocation(line: 158, column: 1, scope: !1090)
!1121 = distinct !DISubprogram(name: "statistics_fini_pass_3", scope: !3, file: !3, line: 163, type: !1063, scopeLine: 164, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1122)
!1122 = !{!1123, !1124, !1125}
!1123 = !DILocalVariable(name: "slot", arg: 1, scope: !1121, file: !3, line: 163, type: !455)
!1124 = !DILocalVariable(name: "data", arg: 2, scope: !1121, file: !3, line: 163, type: !428)
!1125 = !DILocalVariable(name: "counter", scope: !1121, file: !3, line: 165, type: !493)
!1126 = !DILocation(line: 0, scope: !1121)
!1127 = !DILocation(line: 165, column: 59, scope: !1121)
!1128 = !DILocation(line: 166, column: 41, scope: !1121)
!1129 = !DILocation(line: 166, column: 12, scope: !1121)
!1130 = !DILocation(line: 166, column: 30, scope: !1121)
!1131 = !DILocation(line: 167, column: 3, scope: !1121)
!1132 = distinct !DISubprogram(name: "statistics_fini", scope: !3, file: !3, line: 226, type: !988, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1133)
!1133 = !{!1134}
!1134 = !DILocalVariable(name: "i", scope: !1135, file: !3, line: 233, type: !7)
!1135 = distinct !DILexicalBlock(scope: !1136, file: !3, line: 232, column: 5)
!1136 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 231, column: 7)
!1137 = !DILocation(line: 228, column: 8, scope: !1138)
!1138 = distinct !DILexicalBlock(scope: !1132, file: !3, line: 228, column: 7)
!1139 = !DILocation(line: 228, column: 7, scope: !1132)
!1140 = !DILocation(line: 231, column: 7, scope: !1136)
!1141 = !DILocation(line: 231, column: 29, scope: !1136)
!1142 = !DILocation(line: 231, column: 7, scope: !1132)
!1143 = !DILocation(line: 234, column: 7, scope: !1144)
!1144 = distinct !DILexicalBlock(scope: !1135, file: !3, line: 234, column: 7)
!1145 = !DILocation(line: 0, scope: !1144)
!1146 = !DILocation(line: 0, scope: !1135)
!1147 = !DILocation(line: 234, column: 23, scope: !1148)
!1148 = distinct !DILexicalBlock(scope: !1144, file: !3, line: 234, column: 7)
!1149 = !DILocation(line: 234, column: 21, scope: !1148)
!1150 = !DILocation(line: 235, column: 6, scope: !1151)
!1151 = distinct !DILexicalBlock(scope: !1148, file: !3, line: 235, column: 6)
!1152 = !DILocation(line: 235, column: 27, scope: !1151)
!1153 = !DILocation(line: 236, column: 6, scope: !1151)
!1154 = !DILocation(line: 236, column: 9, scope: !1151)
!1155 = !DILocation(line: 236, column: 29, scope: !1151)
!1156 = !DILocation(line: 235, column: 6, scope: !1148)
!1157 = !DILocation(line: 237, column: 28, scope: !1151)
!1158 = !DILocation(line: 238, column: 26, scope: !1151)
!1159 = !DILocation(line: 237, column: 4, scope: !1151)
!1160 = !DILocation(line: 234, column: 45, scope: !1148)
!1161 = !DILocation(line: 234, column: 7, scope: !1148)
!1162 = distinct !{!1162, !1143, !1163}
!1163 = !DILocation(line: 238, column: 45, scope: !1144)
!1164 = !DILocation(line: 241, column: 33, scope: !1132)
!1165 = !DILocation(line: 241, column: 13, scope: !1132)
!1166 = !DILocation(line: 241, column: 3, scope: !1132)
!1167 = !DILocation(line: 242, column: 1, scope: !1132)
!1168 = distinct !DISubprogram(name: "statistics_fini_1", scope: !3, file: !3, line: 200, type: !1063, scopeLine: 201, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1169)
!1169 = !{!1170, !1171, !1172, !1173}
!1170 = !DILocalVariable(name: "slot", arg: 1, scope: !1168, file: !3, line: 200, type: !455)
!1171 = !DILocalVariable(name: "data", arg: 2, scope: !1168, file: !3, line: 200, type: !428)
!1172 = !DILocalVariable(name: "pass", scope: !1168, file: !3, line: 202, type: !494)
!1173 = !DILocalVariable(name: "counter", scope: !1168, file: !3, line: 203, type: !493)
!1174 = !DILocation(line: 0, scope: !1168)
!1175 = !DILocation(line: 203, column: 59, scope: !1168)
!1176 = !DILocation(line: 204, column: 16, scope: !1177)
!1177 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 204, column: 7)
!1178 = !DILocation(line: 204, column: 22, scope: !1177)
!1179 = !DILocation(line: 204, column: 7, scope: !1168)
!1180 = !DILocation(line: 206, column: 16, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1168, file: !3, line: 206, column: 7)
!1182 = !DILocation(line: 206, column: 7, scope: !1181)
!1183 = !DILocation(line: 0, scope: !1181)
!1184 = !DILocation(line: 206, column: 7, scope: !1168)
!1185 = !DILocation(line: 211, column: 29, scope: !1181)
!1186 = !DILocation(line: 207, column: 5, scope: !1181)
!1187 = !DILocation(line: 214, column: 5, scope: !1181)
!1188 = !DILocation(line: 221, column: 1, scope: !1168)
!1189 = distinct !DISubprogram(name: "statistics_early_init", scope: !3, file: !3, line: 247, type: !988, scopeLine: 248, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!1190 = !DILocation(line: 249, column: 24, scope: !1189)
!1191 = !DILocation(line: 249, column: 22, scope: !1189)
!1192 = !DILocation(line: 251, column: 1, scope: !1189)
!1193 = distinct !DISubprogram(name: "statistics_init", scope: !3, file: !3, line: 256, type: !988, scopeLine: 257, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !612)
!1194 = !DILocation(line: 258, column: 38, scope: !1193)
!1195 = !DILocation(line: 258, column: 26, scope: !1193)
!1196 = !DILocation(line: 258, column: 24, scope: !1193)
!1197 = !DILocation(line: 259, column: 47, scope: !1193)
!1198 = !DILocation(line: 259, column: 27, scope: !1193)
!1199 = !DILocation(line: 259, column: 68, scope: !1193)
!1200 = !DILocation(line: 259, column: 25, scope: !1193)
!1201 = !DILocation(line: 260, column: 1, scope: !1193)
!1202 = distinct !DISubprogram(name: "statistics_counter_event", scope: !3, file: !3, line: 291, type: !1203, scopeLine: 292, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1911)
!1203 = !DISubroutineType(types: !1204)
!1204 = !{null, !1205, !429, !424}
!1205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1206, size: 64)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1207, line: 463, size: 1152, elements: !1208)
!1207 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1208 = !{!1209, !1212, !1215, !1219, !1222, !1225, !1226, !1855, !1856, !1857, !1858, !1884, !1887, !1888, !1889, !1890, !1891, !1892, !1893, !1894, !1895, !1896, !1897, !1898, !1899, !1900, !1901, !1902, !1903, !1904, !1905, !1906, !1907, !1908, !1909, !1910}
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1206, file: !1207, line: 464, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1207, line: 464, flags: DIFlagFwdDecl)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1206, file: !1207, line: 467, baseType: !1213, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !1207, line: 467, flags: DIFlagFwdDecl)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1206, file: !1207, line: 470, baseType: !1216, size: 64, offset: 128)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1218, line: 65, flags: DIFlagFwdDecl)
!1218 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1206, file: !1207, line: 473, baseType: !1220, size: 64, offset: 192)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1207, line: 166, flags: DIFlagFwdDecl)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1206, file: !1207, line: 476, baseType: !1223, size: 64, offset: 256)
!1223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1224, size: 64)
!1224 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1207, line: 476, flags: DIFlagFwdDecl)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1206, file: !1207, line: 479, baseType: !527, size: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1206, file: !1207, line: 484, baseType: !1227, size: 64, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1218, line: 56, baseType: !1228)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !1230)
!1230 = !{!1231, !1264, !1270, !1281, !1288, !1295, !1300, !1306, !1312, !1325, !1337, !1375, !1383, !1411, !1419, !1420, !1425, !1434, !1440, !1445, !1449, !1453, !1479, !1528, !1534, !1541, !1548, !1574, !1599, !1616, !1628, !1650, !1666, !1837}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1229, file: !6, line: 3372, baseType: !1232, size: 64)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !1233)
!1233 = !{!1234, !1235, !1236, !1237, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261, !1262, !1263}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1232, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1232, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1232, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1232, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1232, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1232, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1232, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1232, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1232, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1232, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1232, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1232, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1232, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1232, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1232, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1232, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1232, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1232, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1232, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1232, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1232, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1232, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1232, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1232, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1232, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1232, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1232, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1232, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1232, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1232, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1229, file: !6, line: 3373, baseType: !1265, size: 192)
!1265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !1266)
!1266 = !{!1267, !1268, !1269}
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1265, file: !6, line: 403, baseType: !1232, size: 64)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1265, file: !6, line: 404, baseType: !1227, size: 64, offset: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1265, file: !6, line: 405, baseType: !1227, size: 64, offset: 128)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1229, file: !6, line: 3374, baseType: !1271, size: 320)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !1272)
!1272 = !{!1273, !1274}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1271, file: !6, line: 1385, baseType: !1265, size: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1271, file: !6, line: 1386, baseType: !1275, size: 128, offset: 192)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1276, line: 58, baseType: !1277)
!1276 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1276, line: 54, size: 128, elements: !1278)
!1278 = !{!1279, !1280}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1277, file: !1276, line: 56, baseType: !459, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1277, file: !1276, line: 57, baseType: !558, size: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1229, file: !6, line: 3375, baseType: !1282, size: 256)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !1283)
!1283 = !{!1284, !1285}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1282, file: !6, line: 1398, baseType: !1265, size: 192)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1282, file: !6, line: 1399, baseType: !1286, size: 64, offset: 192)
!1286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1287, size: 64)
!1287 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1229, file: !6, line: 3376, baseType: !1289, size: 256)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !1290)
!1290 = !{!1291, !1292}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1289, file: !6, line: 1409, baseType: !1265, size: 192)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1289, file: !6, line: 1410, baseType: !1293, size: 64, offset: 192)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1229, file: !6, line: 3377, baseType: !1296, size: 256)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !1297)
!1297 = !{!1298, !1299}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1296, file: !6, line: 1438, baseType: !1265, size: 192)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1296, file: !6, line: 1439, baseType: !1227, size: 64, offset: 192)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1229, file: !6, line: 3378, baseType: !1301, size: 256)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !1302)
!1302 = !{!1303, !1304, !1305}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1301, file: !6, line: 1419, baseType: !1265, size: 192)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1301, file: !6, line: 1420, baseType: !424, size: 32, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1301, file: !6, line: 1421, baseType: !564, size: 8, offset: 224)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1229, file: !6, line: 3379, baseType: !1307, size: 320)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !1308)
!1308 = !{!1309, !1310, !1311}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1307, file: !6, line: 1429, baseType: !1265, size: 192)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1307, file: !6, line: 1430, baseType: !1227, size: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1307, file: !6, line: 1431, baseType: !1227, size: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1229, file: !6, line: 3380, baseType: !1313, size: 320)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !1314)
!1314 = !{!1315, !1316}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1313, file: !6, line: 1461, baseType: !1265, size: 192)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1313, file: !6, line: 1462, baseType: !1317, size: 128, offset: 192)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1318, line: 31, size: 128, elements: !1319)
!1318 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1319 = !{!1320, !1323, !1324}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1317, file: !1318, line: 32, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1322, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !423)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1317, file: !1318, line: 33, baseType: !7, size: 32, offset: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1317, file: !1318, line: 34, baseType: !7, size: 32, offset: 96)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1229, file: !6, line: 3381, baseType: !1326, size: 384)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !1327)
!1327 = !{!1328, !1329, !1334, !1335, !1336}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1326, file: !6, line: 2508, baseType: !1265, size: 192)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1326, file: !6, line: 2509, baseType: !1330, size: 32, offset: 192)
!1330 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1331, line: 58, baseType: !1332)
!1331 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1332 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1333, line: 44, baseType: !7)
!1333 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1326, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1326, file: !6, line: 2511, baseType: !1227, size: 64, offset: 256)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1326, file: !6, line: 2512, baseType: !1227, size: 64, offset: 320)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1229, file: !6, line: 3382, baseType: !1338, size: 896)
!1338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !1339)
!1339 = !{!1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372}
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1338, file: !6, line: 2653, baseType: !1326, size: 384)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1338, file: !6, line: 2654, baseType: !1227, size: 64, offset: 384)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1338, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1338, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1338, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1338, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1338, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1338, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1338, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1338, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1338, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1338, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1338, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1338, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1338, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1338, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1338, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1338, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1338, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1338, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1338, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1338, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1338, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1338, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1338, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1338, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1338, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1338, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1338, file: !6, line: 2705, baseType: !1227, size: 64, offset: 576)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1338, file: !6, line: 2706, baseType: !1227, size: 64, offset: 640)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1338, file: !6, line: 2707, baseType: !1227, size: 64, offset: 704)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1338, file: !6, line: 2708, baseType: !1227, size: 64, offset: 768)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1338, file: !6, line: 2711, baseType: !1373, size: 64, offset: 832)
!1373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1374, size: 64)
!1374 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1229, file: !6, line: 3383, baseType: !1376, size: 960)
!1376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !1377)
!1377 = !{!1378, !1379}
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1376, file: !6, line: 2757, baseType: !1338, size: 896)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1376, file: !6, line: 2758, baseType: !1380, size: 64, offset: 896)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1218, line: 50, baseType: !1381)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1218, line: 49, flags: DIFlagFwdDecl)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1229, file: !6, line: 3384, baseType: !1384, size: 1472)
!1384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !1385)
!1385 = !{!1386, !1407, !1408, !1409, !1410}
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1384, file: !6, line: 3115, baseType: !1387, size: 1216)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1387, file: !6, line: 2985, baseType: !1376, size: 960)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1387, file: !6, line: 2986, baseType: !1227, size: 64, offset: 960)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1387, file: !6, line: 2987, baseType: !1227, size: 64, offset: 1024)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1387, file: !6, line: 2988, baseType: !1227, size: 64, offset: 1088)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1387, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1387, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1387, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1387, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1387, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1387, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1387, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1387, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1387, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1387, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1387, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1387, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1387, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1387, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1384, file: !6, line: 3117, baseType: !1227, size: 64, offset: 1216)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1384, file: !6, line: 3119, baseType: !1227, size: 64, offset: 1280)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1384, file: !6, line: 3121, baseType: !1227, size: 64, offset: 1344)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1384, file: !6, line: 3123, baseType: !1227, size: 64, offset: 1408)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1229, file: !6, line: 3385, baseType: !1412, size: 1088)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !1413)
!1413 = !{!1414, !1415, !1416}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1412, file: !6, line: 2875, baseType: !1376, size: 960)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1412, file: !6, line: 2876, baseType: !1380, size: 64, offset: 960)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1412, file: !6, line: 2877, baseType: !1417, size: 64, offset: 1024)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !6, line: 2856, flags: DIFlagFwdDecl)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1229, file: !6, line: 3386, baseType: !1387, size: 1216)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1229, file: !6, line: 3387, baseType: !1421, size: 1280)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !1422)
!1422 = !{!1423, !1424}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1421, file: !6, line: 3094, baseType: !1387, size: 1216)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1421, file: !6, line: 3095, baseType: !1417, size: 64, offset: 1216)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1229, file: !6, line: 3388, baseType: !1426, size: 1216)
!1426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !1427)
!1427 = !{!1428, !1429, !1430, !1431, !1432, !1433}
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1426, file: !6, line: 2825, baseType: !1338, size: 896)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1426, file: !6, line: 2827, baseType: !1227, size: 64, offset: 896)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1426, file: !6, line: 2828, baseType: !1227, size: 64, offset: 960)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1426, file: !6, line: 2829, baseType: !1227, size: 64, offset: 1024)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1426, file: !6, line: 2830, baseType: !1227, size: 64, offset: 1088)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1426, file: !6, line: 2831, baseType: !1227, size: 64, offset: 1152)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1229, file: !6, line: 3389, baseType: !1435, size: 1024)
