; ModuleID = 'stmt.bc'
source_filename = "stmt.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.rtl_data = type { %struct.expr_status, %struct.emit_status, %struct.varasm_status, %struct.incoming_args, %struct.function_subsections, %struct.rtl_eh, i32, %struct.rtx_def*, %struct.initial_value_struct*, %union.tree_node*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def*, i64, %struct.rtx_def*, %struct.VEC_temp_slot_p_gc*, %struct.temp_slot*, i32, i32, i32, i32, i32, i32, %struct.rtx_def*, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.expr_status = type { i32, i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.rtx_def* }
%struct.emit_status = type { i32, i32, %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack*, i32, i32, i32, i32, i8* }
%struct.sequence_stack = type { %struct.rtx_def*, %struct.rtx_def*, %struct.sequence_stack* }
%struct.varasm_status = type { %struct.rtx_constant_pool*, i32 }

!577 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!578 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!579 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!580 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!581 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!582 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!583 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!584 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!585 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!586 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!587 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!588 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !550, line: 727, baseType: !7, size: 32, elements: !589)
!589 = !{!590, !591, !592, !593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613}
!590 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!591 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!592 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!593 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!594 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!595 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!596 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!597 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!598 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!599 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!600 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!601 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!602 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!603 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!604 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!605 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!606 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!607 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!608 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!609 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!610 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!611 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!612 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!613 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!614 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !615, line: 52, baseType: !7, size: 32, elements: !616)
!615 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!616 = !{!617, !618, !619, !620, !621, !622, !623}
!617 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!618 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!619 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!620 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!621 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!622 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!623 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!624 = !{!625, !626, !627, !628, !631, !632, !141, !629, !634, !635, !636, !993, !384, !762, !1996, !810, !5, !1997, !527, !1998, !2000, !959, !2002, !2004, !2005, !2006, !7, !2007, !691, !2016}
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!627 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !630)
!634 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!635 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !637, line: 56, baseType: !638)
!637 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !142, line: 3371, size: 1792, elements: !640)
!640 = !{!641, !674, !680, !692, !711, !722, !727, !736, !742, !755, !767, !805, !1296, !1324, !1332, !1333, !1338, !1347, !1353, !1358, !1362, !1366, !1649, !1696, !1702, !1708, !1715, !1726, !1740, !1757, !1769, !1791, !1806, !1978}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !639, file: !142, line: 3372, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !142, line: 360, size: 64, elements: !643)
!643 = !{!644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !642, file: !142, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !642, file: !142, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !642, file: !142, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !642, file: !142, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !642, file: !142, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !642, file: !142, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !642, file: !142, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !642, file: !142, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !642, file: !142, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !642, file: !142, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !642, file: !142, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !642, file: !142, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !642, file: !142, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !642, file: !142, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !642, file: !142, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !642, file: !142, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !642, file: !142, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !642, file: !142, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !642, file: !142, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !642, file: !142, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !642, file: !142, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !642, file: !142, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !642, file: !142, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !642, file: !142, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !642, file: !142, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !642, file: !142, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !642, file: !142, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !642, file: !142, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !642, file: !142, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !642, file: !142, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !639, file: !142, line: 3373, baseType: !675, size: 192)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !142, line: 402, size: 192, elements: !676)
!676 = !{!677, !678, !679}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !675, file: !142, line: 403, baseType: !642, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !675, file: !142, line: 404, baseType: !636, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !142, line: 405, baseType: !636, size: 64, offset: 128)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !639, file: !142, line: 3374, baseType: !681, size: 320)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !142, line: 1384, size: 320, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !681, file: !142, line: 1385, baseType: !675, size: 192)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !681, file: !142, line: 1386, baseType: !685, size: 128, offset: 192)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !686, line: 58, baseType: !687)
!686 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !686, line: 54, size: 128, elements: !688)
!688 = !{!689, !690}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !687, file: !686, line: 56, baseType: !635, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !687, file: !686, line: 57, baseType: !691, size: 64, offset: 64)
!691 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !639, file: !142, line: 3375, baseType: !693, size: 256)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !142, line: 1397, size: 256, elements: !694)
!694 = !{!695, !696}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !693, file: !142, line: 1398, baseType: !675, size: 192)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !693, file: !142, line: 1399, baseType: !697, size: 64, offset: 192)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !699, line: 52, size: 256, elements: !700)
!699 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!700 = !{!701, !702, !703, !704, !705, !706, !707}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !698, file: !699, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !698, file: !699, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !698, file: !699, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !698, file: !699, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !698, file: !699, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !698, file: !699, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !698, file: !699, line: 62, baseType: !708, size: 192, offset: 64)
!708 = !DICompositeType(tag: DW_TAG_array_type, baseType: !635, size: 192, elements: !709)
!709 = !{!710}
!710 = !DISubrange(count: 3)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !639, file: !142, line: 3376, baseType: !712, size: 256)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !142, line: 1408, size: 256, elements: !713)
!713 = !{!714, !715}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !142, line: 1409, baseType: !675, size: 192)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !712, file: !142, line: 1410, baseType: !716, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !718, line: 27, size: 192, elements: !719)
!718 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !717, file: !718, line: 29, baseType: !685, size: 128)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !717, file: !718, line: 30, baseType: !5, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !639, file: !142, line: 3377, baseType: !723, size: 256)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !142, line: 1437, size: 256, elements: !724)
!724 = !{!725, !726}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !723, file: !142, line: 1438, baseType: !675, size: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !723, file: !142, line: 1439, baseType: !636, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !639, file: !142, line: 3378, baseType: !728, size: 256)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !142, line: 1418, size: 256, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !728, file: !142, line: 1419, baseType: !675, size: 192)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !728, file: !142, line: 1420, baseType: !627, size: 32, offset: 192)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !728, file: !142, line: 1421, baseType: !733, size: 8, offset: 224)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 8, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 1)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !639, file: !142, line: 3379, baseType: !737, size: 320)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !142, line: 1428, size: 320, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !737, file: !142, line: 1429, baseType: !675, size: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !737, file: !142, line: 1430, baseType: !636, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !737, file: !142, line: 1431, baseType: !636, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !639, file: !142, line: 3380, baseType: !743, size: 320)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !142, line: 1460, size: 320, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !142, line: 1461, baseType: !675, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !743, file: !142, line: 1462, baseType: !747, size: 128, offset: 192)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !748, line: 31, size: 128, elements: !749)
!748 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!749 = !{!750, !753, !754}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !747, file: !748, line: 32, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !747, file: !748, line: 33, baseType: !7, size: 32, offset: 64)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !747, file: !748, line: 34, baseType: !7, size: 32, offset: 96)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !639, file: !142, line: 3381, baseType: !756, size: 384)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !142, line: 2507, size: 384, elements: !757)
!757 = !{!758, !759, !764, !765, !766}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !756, file: !142, line: 2508, baseType: !675, size: 192)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !756, file: !142, line: 2509, baseType: !760, size: 32, offset: 192)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !761, line: 58, baseType: !762)
!761 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !763, line: 44, baseType: !7)
!763 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!764 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !756, file: !142, line: 2510, baseType: !7, size: 32, offset: 224)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !756, file: !142, line: 2511, baseType: !636, size: 64, offset: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !756, file: !142, line: 2512, baseType: !636, size: 64, offset: 320)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !639, file: !142, line: 3382, baseType: !768, size: 896)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !142, line: 2652, size: 896, elements: !769)
!769 = !{!770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !768, file: !142, line: 2653, baseType: !756, size: 384)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !768, file: !142, line: 2654, baseType: !636, size: 64, offset: 384)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !768, file: !142, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !768, file: !142, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !768, file: !142, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !768, file: !142, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !768, file: !142, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !768, file: !142, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !768, file: !142, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !768, file: !142, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !768, file: !142, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !768, file: !142, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !768, file: !142, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !768, file: !142, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !768, file: !142, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !768, file: !142, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !768, file: !142, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !768, file: !142, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !768, file: !142, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !768, file: !142, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !768, file: !142, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !768, file: !142, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !768, file: !142, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !768, file: !142, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !768, file: !142, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !768, file: !142, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !768, file: !142, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !768, file: !142, line: 2703, baseType: !7, size: 32, offset: 512)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !768, file: !142, line: 2705, baseType: !636, size: 64, offset: 576)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !768, file: !142, line: 2706, baseType: !636, size: 64, offset: 640)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !768, file: !142, line: 2707, baseType: !636, size: 64, offset: 704)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !768, file: !142, line: 2708, baseType: !636, size: 64, offset: 768)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !768, file: !142, line: 2711, baseType: !803, size: 64, offset: 832)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !142, line: 2711, flags: DIFlagFwdDecl)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !639, file: !142, line: 3383, baseType: !806, size: 960)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !142, line: 2756, size: 960, elements: !807)
!807 = !{!808, !809}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !142, line: 2757, baseType: !768, size: 896)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !806, file: !142, line: 2758, baseType: !810, size: 64, offset: 896)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !637, line: 50, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !385, line: 240, size: 384, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !812, file: !385, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !812, file: !385, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !812, file: !385, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !812, file: !385, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !812, file: !385, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !812, file: !385, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !812, file: !385, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !812, file: !385, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !812, file: !385, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !812, file: !385, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !812, file: !385, line: 321, baseType: !825, size: 320, offset: 64)
!825 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !385, line: 315, size: 320, elements: !826)
!826 = !{!827, !1229, !1231, !1294, !1295}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !825, file: !385, line: 316, baseType: !828, size: 64)
!828 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 64, elements: !734)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !385, line: 183, baseType: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !385, line: 166, size: 64, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !844, !845, !857, !860, !920, !921, !1206, !1219, !1226}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !830, file: !385, line: 168, baseType: !627, size: 32)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !830, file: !385, line: 169, baseType: !7, size: 32)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !830, file: !385, line: 170, baseType: !632, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !830, file: !385, line: 171, baseType: !810, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !830, file: !385, line: 172, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !637, line: 53, baseType: !838)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !839, size: 64)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !385, line: 359, size: 128, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !839, file: !385, line: 360, baseType: !627, size: 32)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !839, file: !385, line: 361, baseType: !843, size: 64, offset: 64)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 64, elements: !734)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !830, file: !385, line: 173, baseType: !5, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !830, file: !385, line: 174, baseType: !846, size: 32)
!846 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !385, line: 133, baseType: !847)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !385, line: 115, size: 32, elements: !848)
!848 = !{!849, !850, !851, !852, !853, !854, !855, !856}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !847, file: !385, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !847, file: !385, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !847, file: !385, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !847, file: !385, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !847, file: !385, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !847, file: !385, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !847, file: !385, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !847, file: !385, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !830, file: !385, line: 175, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !385, line: 175, flags: DIFlagFwdDecl)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !830, file: !385, line: 176, baseType: !861, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !863, line: 75, size: 256, elements: !864)
!863 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!864 = !{!865, !879, !880, !881}
!865 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !862, file: !863, line: 76, baseType: !866, size: 64)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !863, line: 68, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !863, line: 63, size: 320, elements: !869)
!869 = !{!870, !872, !873, !874}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !868, file: !863, line: 64, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !868, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !868, file: !863, line: 65, baseType: !871, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !868, file: !863, line: 66, baseType: !7, size: 32, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !868, file: !863, line: 67, baseType: !875, size: 128, offset: 192)
!875 = !DICompositeType(tag: DW_TAG_array_type, baseType: !876, size: 128, elements: !877)
!876 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !863, line: 29, baseType: !635)
!877 = !{!878}
!878 = !DISubrange(count: 2)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !862, file: !863, line: 77, baseType: !866, size: 64, offset: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !862, file: !863, line: 78, baseType: !7, size: 32, offset: 128)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !862, file: !863, line: 79, baseType: !882, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !863, line: 49, baseType: !884)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !863, line: 45, size: 832, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !884, file: !863, line: 46, baseType: !871, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !884, file: !863, line: 47, baseType: !861, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !884, file: !863, line: 48, baseType: !889, size: 704, offset: 128)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !890, line: 164, size: 704, elements: !891)
!890 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!891 = !{!892, !893, !903, !904, !905, !906, !907, !908, !912, !916, !917, !918, !919}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !889, file: !890, line: 166, baseType: !691, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !889, file: !890, line: 167, baseType: !894, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !890, line: 157, size: 192, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !895, file: !890, line: 159, baseType: !629, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !895, file: !890, line: 160, baseType: !894, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !895, file: !890, line: 161, baseType: !900, size: 32, offset: 128)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !630, size: 32, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 4)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !889, file: !890, line: 168, baseType: !629, size: 64, offset: 128)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !889, file: !890, line: 169, baseType: !629, size: 64, offset: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !889, file: !890, line: 170, baseType: !629, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !889, file: !890, line: 171, baseType: !691, size: 64, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !889, file: !890, line: 172, baseType: !627, size: 32, offset: 384)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !889, file: !890, line: 176, baseType: !909, size: 64, offset: 448)
!909 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !910, size: 64)
!910 = !DISubroutineType(types: !911)
!911 = !{!894, !631, !691}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !889, file: !890, line: 177, baseType: !913, size: 64, offset: 512)
!913 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !914, size: 64)
!914 = !DISubroutineType(types: !915)
!915 = !{null, !631, !894}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !889, file: !890, line: 178, baseType: !631, size: 64, offset: 576)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !889, file: !890, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !889, file: !890, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !889, file: !890, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !830, file: !385, line: 177, baseType: !636, size: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !830, file: !385, line: 178, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !924)
!924 = !{!925, !1171, !1172, !1173, !1176, !1180, !1181, !1182, !1200, !1201, !1202, !1203, !1204, !1205}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !923, file: !337, line: 219, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !929)
!929 = !{!930}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !928, file: !337, line: 151, baseType: !931, size: 128)
!931 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !932)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !933)
!933 = !{!934, !935, !936}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !932, file: !337, line: 150, baseType: !7, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !932, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !932, file: !337, line: 150, baseType: !937, size: 64, offset: 64)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 64, elements: !734)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !637, line: 108, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !941)
!941 = !{!942, !943, !944, !1163, !1164, !1165, !1166, !1167, !1168, !1169}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !940, file: !337, line: 124, baseType: !922, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !940, file: !337, line: 125, baseType: !922, size: 64, offset: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !940, file: !337, line: 131, baseType: !945, size: 64, offset: 128)
!945 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !946)
!946 = !{!947, !1162}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !945, file: !337, line: 129, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !637, line: 66, baseType: !949)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !550, line: 143, size: 192, elements: !951)
!951 = !{!952, !1160, !1161}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !950, file: !550, line: 145, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !637, line: 69, baseType: !954)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !550, line: 136, size: 192, elements: !956)
!956 = !{!957, !1158, !1159}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !955, file: !550, line: 137, baseType: !958, size: 64)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !637, line: 58, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !550, line: 737, size: 768, elements: !961)
!961 = !{!962, !979, !1013, !1019, !1024, !1029, !1036, !1042, !1048, !1053, !1067, !1072, !1078, !1083, !1093, !1098, !1116, !1123, !1130, !1136, !1141, !1147, !1153}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !960, file: !550, line: 738, baseType: !963, size: 256)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !550, line: 271, size: 256, elements: !964)
!964 = !{!965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !963, file: !550, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !963, file: !550, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !963, file: !550, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !963, file: !550, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !963, file: !550, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !963, file: !550, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !963, file: !550, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !963, file: !550, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !963, file: !550, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !963, file: !550, line: 312, baseType: !7, size: 32, offset: 32)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !963, file: !550, line: 316, baseType: !760, size: 32, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !963, file: !550, line: 319, baseType: !7, size: 32, offset: 96)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !963, file: !550, line: 323, baseType: !922, size: 64, offset: 128)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !963, file: !550, line: 327, baseType: !636, size: 64, offset: 192)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !960, file: !550, line: 739, baseType: !980, size: 448)
!980 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !550, line: 350, size: 448, elements: !981)
!981 = !{!982, !1011}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !980, file: !550, line: 353, baseType: !983, size: 384)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !550, line: 333, size: 384, elements: !984)
!984 = !{!985, !986, !994}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !983, file: !550, line: 336, baseType: !963, size: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !983, file: !550, line: 343, baseType: !987, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !989, line: 37, size: 128, elements: !990)
!989 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !988, file: !989, line: 39, baseType: !987, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !988, file: !989, line: 40, baseType: !993, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !983, file: !550, line: 344, baseType: !995, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !996, size: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !989, line: 45, size: 320, elements: !997)
!997 = !{!998, !999}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !996, file: !989, line: 47, baseType: !995, size: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !996, file: !989, line: 48, baseType: !1000, size: 256, offset: 64)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !142, line: 1883, size: 256, elements: !1001)
!1001 = !{!1002, !1004, !1005, !1010}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1000, file: !142, line: 1884, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1000, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1000, file: !142, line: 1885, baseType: !1003, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1000, file: !142, line: 1891, baseType: !1006, size: 64, offset: 128)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1000, file: !142, line: 1891, size: 64, elements: !1007)
!1007 = !{!1008, !1009}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1006, file: !142, line: 1891, baseType: !958, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1006, file: !142, line: 1891, baseType: !636, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1000, file: !142, line: 1892, baseType: !993, size: 64, offset: 192)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !980, file: !550, line: 359, baseType: !1012, size: 64, offset: 384)
!1012 = !DICompositeType(tag: DW_TAG_array_type, baseType: !636, size: 64, elements: !734)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !960, file: !550, line: 740, baseType: !1014, size: 512)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !550, line: 365, size: 512, elements: !1015)
!1015 = !{!1016, !1017, !1018}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1014, file: !550, line: 368, baseType: !983, size: 384)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1014, file: !550, line: 373, baseType: !636, size: 64, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1014, file: !550, line: 374, baseType: !636, size: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !960, file: !550, line: 741, baseType: !1020, size: 576)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !550, line: 380, size: 576, elements: !1021)
!1021 = !{!1022, !1023}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1020, file: !550, line: 383, baseType: !1014, size: 512)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1020, file: !550, line: 389, baseType: !1012, size: 64, offset: 512)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !960, file: !550, line: 742, baseType: !1025, size: 320)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !550, line: 395, size: 320, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1025, file: !550, line: 397, baseType: !963, size: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1025, file: !550, line: 400, baseType: !948, size: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !960, file: !550, line: 743, baseType: !1030, size: 448)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !550, line: 406, size: 448, elements: !1031)
!1031 = !{!1032, !1033, !1034, !1035}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1030, file: !550, line: 408, baseType: !963, size: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1030, file: !550, line: 412, baseType: !636, size: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1030, file: !550, line: 420, baseType: !636, size: 64, offset: 320)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1030, file: !550, line: 423, baseType: !948, size: 64, offset: 384)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !960, file: !550, line: 744, baseType: !1037, size: 384)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !550, line: 429, size: 384, elements: !1038)
!1038 = !{!1039, !1040, !1041}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1037, file: !550, line: 431, baseType: !963, size: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1037, file: !550, line: 434, baseType: !636, size: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1037, file: !550, line: 437, baseType: !948, size: 64, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !960, file: !550, line: 745, baseType: !1043, size: 384)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !550, line: 443, size: 384, elements: !1044)
!1044 = !{!1045, !1046, !1047}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1043, file: !550, line: 445, baseType: !963, size: 256)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1043, file: !550, line: 449, baseType: !636, size: 64, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1043, file: !550, line: 453, baseType: !948, size: 64, offset: 320)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !960, file: !550, line: 746, baseType: !1049, size: 320)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !550, line: 459, size: 320, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1049, file: !550, line: 461, baseType: !963, size: 256)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1049, file: !550, line: 464, baseType: !636, size: 64, offset: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !960, file: !550, line: 747, baseType: !1054, size: 768)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !550, line: 469, size: 768, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059, !1060}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1054, file: !550, line: 471, baseType: !963, size: 256)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1054, file: !550, line: 474, baseType: !7, size: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1054, file: !550, line: 475, baseType: !7, size: 32, offset: 288)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1054, file: !550, line: 478, baseType: !636, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1054, file: !550, line: 481, baseType: !1061, size: 384, offset: 384)
!1061 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1062, size: 384, elements: !734)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !142, line: 1917, size: 384, elements: !1063)
!1063 = !{!1064, !1065, !1066}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1062, file: !142, line: 1920, baseType: !1000, size: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1062, file: !142, line: 1921, baseType: !636, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1062, file: !142, line: 1922, baseType: !760, size: 32, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !960, file: !550, line: 748, baseType: !1068, size: 320)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !550, line: 487, size: 320, elements: !1069)
!1069 = !{!1070, !1071}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1068, file: !550, line: 490, baseType: !963, size: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1068, file: !550, line: 494, baseType: !627, size: 32, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !960, file: !550, line: 749, baseType: !1073, size: 384)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !550, line: 500, size: 384, elements: !1074)
!1074 = !{!1075, !1076, !1077}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1073, file: !550, line: 502, baseType: !963, size: 256)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1073, file: !550, line: 506, baseType: !948, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1073, file: !550, line: 510, baseType: !948, size: 64, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !960, file: !550, line: 750, baseType: !1079, size: 320)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !550, line: 529, size: 320, elements: !1080)
!1080 = !{!1081, !1082}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1079, file: !550, line: 531, baseType: !963, size: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1079, file: !550, line: 540, baseType: !948, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !960, file: !550, line: 751, baseType: !1084, size: 704)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !550, line: 546, size: 704, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089, !1090, !1091, !1092}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1084, file: !550, line: 549, baseType: !1014, size: 512)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1084, file: !550, line: 553, baseType: !632, size: 64, offset: 512)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1084, file: !550, line: 557, baseType: !626, size: 8, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1084, file: !550, line: 558, baseType: !626, size: 8, offset: 584)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1084, file: !550, line: 559, baseType: !626, size: 8, offset: 592)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1084, file: !550, line: 560, baseType: !626, size: 8, offset: 600)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1084, file: !550, line: 566, baseType: !1012, size: 64, offset: 640)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !960, file: !550, line: 752, baseType: !1094, size: 384)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !550, line: 571, size: 384, elements: !1095)
!1095 = !{!1096, !1097}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1094, file: !550, line: 573, baseType: !1025, size: 320)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1094, file: !550, line: 577, baseType: !636, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !960, file: !550, line: 753, baseType: !1099, size: 576)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !550, line: 600, size: 576, elements: !1100)
!1100 = !{!1101, !1102, !1103, !1106, !1115}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1099, file: !550, line: 602, baseType: !1025, size: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1099, file: !550, line: 605, baseType: !636, size: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1099, file: !550, line: 609, baseType: !1104, size: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1105, line: 46, baseType: !635)
!1105 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1099, file: !550, line: 612, baseType: !1107, size: 64, offset: 448)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !550, line: 581, size: 320, elements: !1109)
!1109 = !{!1110, !1111, !1112, !1113, !1114}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1108, file: !550, line: 583, baseType: !141, size: 32)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1108, file: !550, line: 586, baseType: !636, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1108, file: !550, line: 589, baseType: !636, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1108, file: !550, line: 592, baseType: !636, size: 64, offset: 192)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1108, file: !550, line: 595, baseType: !636, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1099, file: !550, line: 616, baseType: !948, size: 64, offset: 512)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !960, file: !550, line: 754, baseType: !1117, size: 512)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !550, line: 622, size: 512, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1117, file: !550, line: 624, baseType: !1025, size: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1117, file: !550, line: 628, baseType: !636, size: 64, offset: 320)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1117, file: !550, line: 632, baseType: !636, size: 64, offset: 384)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1117, file: !550, line: 636, baseType: !636, size: 64, offset: 448)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !960, file: !550, line: 755, baseType: !1124, size: 704)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !550, line: 642, size: 704, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1129}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1124, file: !550, line: 644, baseType: !1117, size: 512)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1124, file: !550, line: 648, baseType: !636, size: 64, offset: 512)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1124, file: !550, line: 652, baseType: !636, size: 64, offset: 576)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1124, file: !550, line: 653, baseType: !636, size: 64, offset: 640)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !960, file: !550, line: 756, baseType: !1131, size: 448)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !550, line: 663, size: 448, elements: !1132)
!1132 = !{!1133, !1134, !1135}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1131, file: !550, line: 665, baseType: !1025, size: 320)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1131, file: !550, line: 668, baseType: !636, size: 64, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1131, file: !550, line: 673, baseType: !636, size: 64, offset: 384)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !960, file: !550, line: 757, baseType: !1137, size: 384)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !550, line: 694, size: 384, elements: !1138)
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1137, file: !550, line: 696, baseType: !1025, size: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1137, file: !550, line: 699, baseType: !636, size: 64, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !960, file: !550, line: 758, baseType: !1142, size: 384)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !550, line: 681, size: 384, elements: !1143)
!1143 = !{!1144, !1145, !1146}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1142, file: !550, line: 683, baseType: !963, size: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1142, file: !550, line: 686, baseType: !636, size: 64, offset: 256)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1142, file: !550, line: 689, baseType: !636, size: 64, offset: 320)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !960, file: !550, line: 759, baseType: !1148, size: 384)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !550, line: 707, size: 384, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1148, file: !550, line: 709, baseType: !963, size: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1148, file: !550, line: 712, baseType: !636, size: 64, offset: 256)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1148, file: !550, line: 712, baseType: !636, size: 64, offset: 320)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !960, file: !550, line: 760, baseType: !1154, size: 320)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !550, line: 718, size: 320, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1154, file: !550, line: 720, baseType: !963, size: 256)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1154, file: !550, line: 723, baseType: !636, size: 64, offset: 256)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !955, file: !550, line: 138, baseType: !954, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !955, file: !550, line: 139, baseType: !954, size: 64, offset: 128)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !950, file: !550, line: 146, baseType: !953, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !950, file: !550, line: 152, baseType: !948, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !945, file: !337, line: 130, baseType: !810, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !940, file: !337, line: 134, baseType: !631, size: 64, offset: 192)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !940, file: !337, line: 137, baseType: !636, size: 64, offset: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !940, file: !337, line: 138, baseType: !760, size: 32, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !940, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !940, file: !337, line: 144, baseType: !627, size: 32, offset: 384)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !940, file: !337, line: 145, baseType: !627, size: 32, offset: 416)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !940, file: !337, line: 146, baseType: !1170, size: 64, offset: 448)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !691)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !923, file: !337, line: 220, baseType: !926, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !923, file: !337, line: 223, baseType: !631, size: 64, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !923, file: !337, line: 226, baseType: !1174, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !923, file: !337, line: 229, baseType: !1177, size: 128, offset: 256)
!1177 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1178, size: 128, elements: !877)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !923, file: !337, line: 232, baseType: !922, size: 64, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !923, file: !337, line: 233, baseType: !922, size: 64, offset: 448)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !923, file: !337, line: 238, baseType: !1183, size: 64, offset: 512)
!1183 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !1184)
!1184 = !{!1185, !1191}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1183, file: !337, line: 236, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1187, size: 64)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !1188)
!1188 = !{!1189, !1190}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1187, file: !337, line: 275, baseType: !948, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1187, file: !337, line: 278, baseType: !948, size: 64, offset: 64)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1183, file: !337, line: 237, baseType: !1192, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !1194)
!1194 = !{!1195, !1196, !1197, !1198, !1199}
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1193, file: !337, line: 261, baseType: !810, size: 64)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1193, file: !337, line: 262, baseType: !810, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1193, file: !337, line: 266, baseType: !810, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1193, file: !337, line: 267, baseType: !810, size: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1193, file: !337, line: 270, baseType: !627, size: 32, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !923, file: !337, line: 241, baseType: !1170, size: 64, offset: 576)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !923, file: !337, line: 244, baseType: !627, size: 32, offset: 640)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !923, file: !337, line: 247, baseType: !627, size: 32, offset: 672)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !923, file: !337, line: 250, baseType: !627, size: 32, offset: 704)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !923, file: !337, line: 253, baseType: !627, size: 32, offset: 736)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !923, file: !337, line: 256, baseType: !627, size: 32, offset: 768)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !830, file: !385, line: 179, baseType: !1207, size: 64)
!1207 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1208, size: 64)
!1208 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !385, line: 150, baseType: !1209)
!1209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !385, line: 142, size: 320, elements: !1210)
!1210 = !{!1211, !1212, !1213, !1214, !1217, !1218}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1209, file: !385, line: 144, baseType: !636, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1209, file: !385, line: 145, baseType: !810, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1209, file: !385, line: 146, baseType: !810, size: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1209, file: !385, line: 147, baseType: !1215, size: 32, offset: 192)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1216, line: 31, baseType: !627)
!1216 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1209, file: !385, line: 148, baseType: !7, size: 32, offset: 224)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1209, file: !385, line: 149, baseType: !626, size: 8, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !830, file: !385, line: 180, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !385, line: 162, baseType: !1222)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !385, line: 159, size: 128, elements: !1223)
!1223 = !{!1224, !1225}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1222, file: !385, line: 160, baseType: !636, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1222, file: !385, line: 161, baseType: !691, size: 64, offset: 64)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !830, file: !385, line: 181, baseType: !1227, size: 64)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !385, line: 181, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !825, file: !385, line: 317, baseType: !1230, size: 64)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !691, size: 64, elements: !734)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !825, file: !385, line: 318, baseType: !1232, size: 320)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !385, line: 188, size: 320, elements: !1233)
!1233 = !{!1234, !1236, !1293}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1232, file: !385, line: 190, baseType: !1235, size: 192)
!1235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !829, size: 192, elements: !709)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1232, file: !385, line: 193, baseType: !1237, size: 64, offset: 192)
!1237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1238, size: 64)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !385, line: 206, size: 320, elements: !1239)
!1239 = !{!1240, !1278, !1279, !1280, !1292}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1238, file: !385, line: 208, baseType: !1241, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !637, line: 62, baseType: !1243)
!1243 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1244, line: 538, size: 256, elements: !1245)
!1244 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1245 = !{!1246, !1250, !1256, !1269}
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1243, file: !1244, line: 539, baseType: !1247, size: 32)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1244, line: 482, size: 32, elements: !1248)
!1248 = !{!1249}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1247, file: !1244, line: 484, baseType: !7, size: 32)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1243, file: !1244, line: 540, baseType: !1251, size: 192)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1244, line: 488, size: 192, elements: !1252)
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1251, file: !1244, line: 489, baseType: !1247, size: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1251, file: !1244, line: 492, baseType: !632, size: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1251, file: !1244, line: 496, baseType: !636, size: 64, offset: 128)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1243, file: !1244, line: 541, baseType: !1257, size: 256)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1244, line: 504, size: 256, elements: !1258)
!1258 = !{!1259, !1260, !1267, !1268}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1257, file: !1244, line: 505, baseType: !1247, size: 32)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1257, file: !1244, line: 509, baseType: !1261, size: 64, offset: 64)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1244, line: 501, baseType: !1262)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = !DISubroutineType(types: !1264)
!1264 = !{null, !1265}
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1257, file: !1244, line: 510, baseType: !1265, size: 64, offset: 128)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1257, file: !1244, line: 513, baseType: !1241, size: 64, offset: 192)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1243, file: !1244, line: 542, baseType: !1270, size: 128)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1244, line: 530, size: 128, elements: !1271)
!1271 = !{!1272, !1273}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1270, file: !1244, line: 531, baseType: !1247, size: 32)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1270, file: !1244, line: 534, baseType: !1274, size: 64, offset: 64)
!1274 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1244, line: 525, baseType: !1275)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DISubroutineType(types: !1277)
!1277 = !{!626, !636, !632, !635, !635}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1238, file: !385, line: 211, baseType: !7, size: 32, offset: 64)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1238, file: !385, line: 214, baseType: !691, size: 64, offset: 128)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1238, file: !385, line: 224, baseType: !1281, size: 64, offset: 192)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !385, line: 202, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !385, line: 202, size: 128, elements: !1284)
!1284 = !{!1285}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1283, file: !385, line: 202, baseType: !1286, size: 128)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !385, line: 200, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !385, line: 200, size: 128, elements: !1288)
!1288 = !{!1289, !1290, !1291}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1287, file: !385, line: 200, baseType: !7, size: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1287, file: !385, line: 200, baseType: !7, size: 32, offset: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1287, file: !385, line: 200, baseType: !843, size: 64, offset: 64)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1238, file: !385, line: 234, baseType: !1281, size: 64, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1232, file: !385, line: 197, baseType: !691, size: 64, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !825, file: !385, line: 319, baseType: !698, size: 256)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !825, file: !385, line: 320, baseType: !717, size: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !639, file: !142, line: 3384, baseType: !1297, size: 1472)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !142, line: 3114, size: 1472, elements: !1298)
!1298 = !{!1299, !1320, !1321, !1322, !1323}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1297, file: !142, line: 3115, baseType: !1300, size: 1216)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !142, line: 2984, size: 1216, elements: !1301)
!1301 = !{!1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1300, file: !142, line: 2985, baseType: !806, size: 960)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1300, file: !142, line: 2986, baseType: !636, size: 64, offset: 960)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1300, file: !142, line: 2987, baseType: !636, size: 64, offset: 1024)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1300, file: !142, line: 2988, baseType: !636, size: 64, offset: 1088)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1300, file: !142, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1300, file: !142, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1300, file: !142, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1300, file: !142, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1300, file: !142, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1300, file: !142, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1300, file: !142, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1300, file: !142, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1300, file: !142, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1300, file: !142, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1300, file: !142, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1300, file: !142, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1300, file: !142, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1300, file: !142, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1297, file: !142, line: 3117, baseType: !636, size: 64, offset: 1216)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1297, file: !142, line: 3119, baseType: !636, size: 64, offset: 1280)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1297, file: !142, line: 3121, baseType: !636, size: 64, offset: 1344)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1297, file: !142, line: 3123, baseType: !636, size: 64, offset: 1408)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !639, file: !142, line: 3385, baseType: !1325, size: 1088)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !142, line: 2874, size: 1088, elements: !1326)
!1326 = !{!1327, !1328, !1329}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1325, file: !142, line: 2875, baseType: !806, size: 960)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1325, file: !142, line: 2876, baseType: !810, size: 64, offset: 960)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1325, file: !142, line: 2877, baseType: !1330, size: 64, offset: 1024)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !142, line: 2856, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !639, file: !142, line: 3386, baseType: !1300, size: 1216)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !639, file: !142, line: 3387, baseType: !1334, size: 1280)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !142, line: 3093, size: 1280, elements: !1335)
!1335 = !{!1336, !1337}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1334, file: !142, line: 3094, baseType: !1300, size: 1216)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1334, file: !142, line: 3095, baseType: !1330, size: 64, offset: 1216)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !639, file: !142, line: 3388, baseType: !1339, size: 1216)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !142, line: 2824, size: 1216, elements: !1340)
!1340 = !{!1341, !1342, !1343, !1344, !1345, !1346}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1339, file: !142, line: 2825, baseType: !768, size: 896)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1339, file: !142, line: 2827, baseType: !636, size: 64, offset: 896)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1339, file: !142, line: 2828, baseType: !636, size: 64, offset: 960)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1339, file: !142, line: 2829, baseType: !636, size: 64, offset: 1024)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1339, file: !142, line: 2830, baseType: !636, size: 64, offset: 1088)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1339, file: !142, line: 2831, baseType: !636, size: 64, offset: 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !639, file: !142, line: 3389, baseType: !1348, size: 1024)
!1348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !142, line: 2850, size: 1024, elements: !1349)
!1349 = !{!1350, !1351, !1352}
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1348, file: !142, line: 2851, baseType: !806, size: 960)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1348, file: !142, line: 2852, baseType: !627, size: 32, offset: 960)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1348, file: !142, line: 2853, baseType: !627, size: 32, offset: 992)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !639, file: !142, line: 3390, baseType: !1354, size: 1024)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !142, line: 2857, size: 1024, elements: !1355)
!1355 = !{!1356, !1357}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1354, file: !142, line: 2858, baseType: !806, size: 960)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1354, file: !142, line: 2859, baseType: !1330, size: 64, offset: 960)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !639, file: !142, line: 3391, baseType: !1359, size: 960)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !142, line: 2862, size: 960, elements: !1360)
!1360 = !{!1361}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1359, file: !142, line: 2863, baseType: !806, size: 960)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !639, file: !142, line: 3392, baseType: !1363, size: 1472)
!1363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !142, line: 3304, size: 1472, elements: !1364)
!1364 = !{!1365}
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1363, file: !142, line: 3305, baseType: !1297, size: 1472)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !639, file: !142, line: 3393, baseType: !1367, size: 1792)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !142, line: 3248, size: 1792, elements: !1368)
!1368 = !{!1369, !1370, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1367, file: !142, line: 3249, baseType: !1297, size: 1472)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1367, file: !142, line: 3251, baseType: !1371, size: 64, offset: 1472)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1373, line: 463, size: 1152, elements: !1374)
!1373 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1374 = !{!1375, !1534, !1565, !1566, !1569, !1572, !1573, !1574, !1575, !1576, !1577, !1601, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627}
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1372, file: !1373, line: 464, baseType: !1376, size: 64)
!1376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1377, size: 64)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !135, line: 194, size: 384, elements: !1378)
!1378 = !{!1379, !1428, !1441, !1455, !1503, !1515}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1377, file: !135, line: 197, baseType: !1380, size: 64)
!1380 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !135, line: 182, baseType: !1381)
!1381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1382, size: 64)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !135, line: 116, size: 704, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388, !1389, !1416, !1425, !1426, !1427}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1382, file: !135, line: 119, baseType: !1381, size: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1382, file: !135, line: 122, baseType: !1381, size: 64, offset: 64)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1382, file: !135, line: 123, baseType: !1381, size: 64, offset: 128)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1382, file: !135, line: 126, baseType: !627, size: 32, offset: 192)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1382, file: !135, line: 129, baseType: !134, size: 32, offset: 224)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1382, file: !135, line: 165, baseType: !1390, size: 192, offset: 256)
!1390 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !135, line: 132, size: 192, elements: !1391)
!1391 = !{!1392, !1405, !1411}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1390, file: !135, line: 137, baseType: !1393, size: 128)
!1393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !135, line: 133, size: 128, elements: !1394)
!1394 = !{!1395, !1404}
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1393, file: !135, line: 135, baseType: !1396, size: 64)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !135, line: 93, size: 320, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1402, !1403}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1397, file: !135, line: 96, baseType: !1396, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1397, file: !135, line: 97, baseType: !1396, size: 64, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1397, file: !135, line: 101, baseType: !636, size: 64, offset: 128)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1397, file: !135, line: 106, baseType: !636, size: 64, offset: 192)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1397, file: !135, line: 111, baseType: !636, size: 64, offset: 256)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1393, file: !135, line: 136, baseType: !1396, size: 64, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1390, file: !135, line: 151, baseType: !1406, size: 192)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !135, line: 139, size: 192, elements: !1407)
!1407 = !{!1408, !1409, !1410}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1406, file: !135, line: 141, baseType: !636, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1406, file: !135, line: 145, baseType: !636, size: 64, offset: 64)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1406, file: !135, line: 150, baseType: !627, size: 32, offset: 128)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1390, file: !135, line: 164, baseType: !1412, size: 128)
!1412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !135, line: 153, size: 128, elements: !1413)
!1413 = !{!1414, !1415}
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1412, file: !135, line: 161, baseType: !636, size: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1412, file: !135, line: 163, baseType: !760, size: 32, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1382, file: !135, line: 168, baseType: !1417, size: 64, offset: 448)
!1417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1418, size: 64)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !135, line: 67, size: 320, elements: !1419)
