; ModuleID = 'stor-layout.bc'
source_filename = "stor-layout.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!351 = !DIEnumerator(name: "OMP_CLAUSE_LASTPRIVATE", value: 4, isUnsigned: true)
!352 = !DIEnumerator(name: "OMP_CLAUSE_REDUCTION", value: 5, isUnsigned: true)
!353 = !DIEnumerator(name: "OMP_CLAUSE_COPYIN", value: 6, isUnsigned: true)
!354 = !DIEnumerator(name: "OMP_CLAUSE_COPYPRIVATE", value: 7, isUnsigned: true)
!355 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!356 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!357 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!358 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!359 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!360 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!361 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!362 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!363 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !135, line: 1817, baseType: !7, size: 32, elements: !364)
!364 = !{!365, !366, !367, !368, !369}
!365 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!366 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!367 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!368 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!369 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!370 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !135, line: 1805, baseType: !7, size: 32, elements: !371)
!371 = !{!372, !373, !374, !375, !376}
!372 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!373 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!374 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!375 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!376 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!377 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !378, line: 36, baseType: !7, size: 32, elements: !379)
!378 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!379 = !{!380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398}
!380 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!381 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!382 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!383 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!384 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!385 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!386 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!387 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!388 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!389 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!390 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!391 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!392 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!393 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!394 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!395 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!396 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!397 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!398 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!399 = !{!400, !401, !402, !403, !406, !407, !134, !409, !1674, !5, !377, !584, !1675, !536, !463, !465, !1402, !7}
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64)
!401 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!402 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !405)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !410, line: 56, baseType: !411)
!410 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!411 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !413)
!413 = !{!414, !447, !453, !466, !485, !496, !501, !510, !516, !529, !541, !579, !1072, !1100, !1108, !1109, !1114, !1123, !1129, !1134, !1138, !1142, !1316, !1363, !1369, !1375, !1382, !1393, !1418, !1435, !1447, !1469, !1484, !1656}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !412, file: !135, line: 3372, baseType: !415, size: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !416)
!416 = !{!417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !415, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !415, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !415, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !415, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !415, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !415, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !415, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !415, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !415, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !415, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !415, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !415, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !415, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !415, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !415, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !415, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !415, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !415, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !415, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !415, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !415, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !415, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !415, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !415, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !415, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !415, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !415, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !415, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !415, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !415, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !412, file: !135, line: 3373, baseType: !448, size: 192)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !449)
!449 = !{!450, !451, !452}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !448, file: !135, line: 403, baseType: !415, size: 64)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !448, file: !135, line: 404, baseType: !409, size: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !448, file: !135, line: 405, baseType: !409, size: 64, offset: 128)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !412, file: !135, line: 3374, baseType: !454, size: 320)
!454 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !455)
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !454, file: !135, line: 1385, baseType: !448, size: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !454, file: !135, line: 1386, baseType: !458, size: 128, offset: 192)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !459, line: 58, baseType: !460)
!459 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !459, line: 54, size: 128, elements: !461)
!461 = !{!462, !464}
!462 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !460, file: !459, line: 56, baseType: !463, size: 64)
!463 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !460, file: !459, line: 57, baseType: !465, size: 64, offset: 64)
!465 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !412, file: !135, line: 3375, baseType: !467, size: 256)
!467 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !468)
!468 = !{!469, !470}
!469 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !467, file: !135, line: 1398, baseType: !448, size: 192)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !467, file: !135, line: 1399, baseType: !471, size: 64, offset: 192)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !473, line: 52, size: 256, elements: !474)
!473 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!474 = !{!475, !476, !477, !478, !479, !480, !481}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !472, file: !473, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !472, file: !473, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !472, file: !473, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !472, file: !473, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !472, file: !473, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !472, file: !473, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !472, file: !473, line: 62, baseType: !482, size: 192, offset: 64)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 192, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 3)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !412, file: !135, line: 3376, baseType: !486, size: 256)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !486, file: !135, line: 1409, baseType: !448, size: 192)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !486, file: !135, line: 1410, baseType: !490, size: 64, offset: 192)
!490 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !491, size: 64)
!491 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !492, line: 27, size: 192, elements: !493)
!492 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!493 = !{!494, !495}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !491, file: !492, line: 29, baseType: !458, size: 128)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !491, file: !492, line: 30, baseType: !5, size: 32, offset: 128)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !412, file: !135, line: 3377, baseType: !497, size: 256)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !498)
!498 = !{!499, !500}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !497, file: !135, line: 1438, baseType: !448, size: 192)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !497, file: !135, line: 1439, baseType: !409, size: 64, offset: 192)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !412, file: !135, line: 3378, baseType: !502, size: 256)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !503)
!503 = !{!504, !505, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !502, file: !135, line: 1419, baseType: !448, size: 192)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !502, file: !135, line: 1420, baseType: !402, size: 32, offset: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !502, file: !135, line: 1421, baseType: !507, size: 8, offset: 224)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 8, elements: !508)
!508 = !{!509}
!509 = !DISubrange(count: 1)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !412, file: !135, line: 3379, baseType: !511, size: 320)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !511, file: !135, line: 1429, baseType: !448, size: 192)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !511, file: !135, line: 1430, baseType: !409, size: 64, offset: 192)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !511, file: !135, line: 1431, baseType: !409, size: 64, offset: 256)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !412, file: !135, line: 3380, baseType: !517, size: 320)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !517, file: !135, line: 1461, baseType: !448, size: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !517, file: !135, line: 1462, baseType: !521, size: 128, offset: 192)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !522, line: 31, size: 128, elements: !523)
!522 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!523 = !{!524, !527, !528}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !521, file: !522, line: 32, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !401)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !521, file: !522, line: 33, baseType: !7, size: 32, offset: 64)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !521, file: !522, line: 34, baseType: !7, size: 32, offset: 96)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !412, file: !135, line: 3381, baseType: !530, size: 384)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !531)
!531 = !{!532, !533, !538, !539, !540}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !530, file: !135, line: 2508, baseType: !448, size: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !530, file: !135, line: 2509, baseType: !534, size: 32, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !535, line: 58, baseType: !536)
!535 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !537, line: 44, baseType: !7)
!537 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!538 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !530, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !530, file: !135, line: 2511, baseType: !409, size: 64, offset: 256)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !530, file: !135, line: 2512, baseType: !409, size: 64, offset: 320)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !412, file: !135, line: 3382, baseType: !542, size: 896)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !543)
!543 = !{!544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !542, file: !135, line: 2653, baseType: !530, size: 384)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !542, file: !135, line: 2654, baseType: !409, size: 64, offset: 384)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !542, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !542, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !542, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !542, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !542, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !542, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !542, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !542, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !542, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !542, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !542, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !542, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !542, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !542, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !542, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !542, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !542, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !542, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !542, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !542, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !542, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !542, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !542, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !542, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !542, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !542, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !542, file: !135, line: 2705, baseType: !409, size: 64, offset: 576)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !542, file: !135, line: 2706, baseType: !409, size: 64, offset: 640)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !542, file: !135, line: 2707, baseType: !409, size: 64, offset: 704)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !542, file: !135, line: 2708, baseType: !409, size: 64, offset: 768)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !542, file: !135, line: 2711, baseType: !577, size: 64, offset: 832)
!577 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !578, size: 64)
!578 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !412, file: !135, line: 3383, baseType: !580, size: 960)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !135, line: 2757, baseType: !542, size: 896)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !580, file: !135, line: 2758, baseType: !584, size: 64, offset: 896)
!584 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !410, line: 50, baseType: !585)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !587, line: 240, size: 384, elements: !588)
!587 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!588 = !{!589, !590, !591, !592, !593, !594, !595, !596, !597, !598, !599}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !586, file: !587, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !586, file: !587, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !586, file: !587, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !586, file: !587, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !586, file: !587, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !586, file: !587, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !586, file: !587, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !586, file: !587, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !586, file: !587, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !586, file: !587, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !586, file: !587, line: 321, baseType: !600, size: 320, offset: 64)
!600 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !587, line: 315, size: 320, elements: !601)
!601 = !{!602, !1005, !1007, !1070, !1071}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !600, file: !587, line: 316, baseType: !603, size: 64)
!603 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 64, elements: !508)
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !587, line: 183, baseType: !605)
!605 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !587, line: 166, size: 64, elements: !606)
!606 = !{!607, !608, !609, !610, !611, !619, !620, !632, !635, !695, !696, !982, !995, !1002}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !605, file: !587, line: 168, baseType: !402, size: 32)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !605, file: !587, line: 169, baseType: !7, size: 32)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !605, file: !587, line: 170, baseType: !407, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !605, file: !587, line: 171, baseType: !584, size: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !605, file: !587, line: 172, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !410, line: 53, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !587, line: 359, size: 128, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !614, file: !587, line: 360, baseType: !402, size: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !614, file: !587, line: 361, baseType: !618, size: 64, offset: 64)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !584, size: 64, elements: !508)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !605, file: !587, line: 173, baseType: !5, size: 32)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !605, file: !587, line: 174, baseType: !621, size: 32)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !587, line: 133, baseType: !622)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !587, line: 115, size: 32, elements: !623)
!623 = !{!624, !625, !626, !627, !628, !629, !630, !631}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !622, file: !587, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !622, file: !587, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !622, file: !587, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !622, file: !587, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !622, file: !587, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !622, file: !587, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !622, file: !587, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !622, file: !587, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !605, file: !587, line: 175, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !587, line: 175, flags: DIFlagFwdDecl)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !605, file: !587, line: 176, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !638, line: 75, size: 256, elements: !639)
!638 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!639 = !{!640, !654, !655, !656}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !637, file: !638, line: 76, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !638, line: 68, baseType: !643)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !638, line: 63, size: 320, elements: !644)
!644 = !{!645, !647, !648, !649}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !643, file: !638, line: 64, baseType: !646, size: 64)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !643, file: !638, line: 65, baseType: !646, size: 64, offset: 64)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !643, file: !638, line: 66, baseType: !7, size: 32, offset: 128)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !643, file: !638, line: 67, baseType: !650, size: 128, offset: 192)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 128, elements: !652)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !638, line: 29, baseType: !463)
!652 = !{!653}
!653 = !DISubrange(count: 2)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !637, file: !638, line: 77, baseType: !641, size: 64, offset: 64)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !637, file: !638, line: 78, baseType: !7, size: 32, offset: 128)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !637, file: !638, line: 79, baseType: !657, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !638, line: 49, baseType: !659)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !638, line: 45, size: 832, elements: !660)
!660 = !{!661, !662, !663}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !659, file: !638, line: 46, baseType: !646, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !659, file: !638, line: 47, baseType: !636, size: 64, offset: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !659, file: !638, line: 48, baseType: !664, size: 704, offset: 128)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !665, line: 164, size: 704, elements: !666)
!665 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!666 = !{!667, !668, !678, !679, !680, !681, !682, !683, !687, !691, !692, !693, !694}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !664, file: !665, line: 166, baseType: !465, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !664, file: !665, line: 167, baseType: !669, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !670, size: 64)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !665, line: 157, size: 192, elements: !671)
!671 = !{!672, !673, !674}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !670, file: !665, line: 159, baseType: !404, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !670, file: !665, line: 160, baseType: !669, size: 64, offset: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !670, file: !665, line: 161, baseType: !675, size: 32, offset: 128)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !405, size: 32, elements: !676)
!676 = !{!677}
!677 = !DISubrange(count: 4)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !664, file: !665, line: 168, baseType: !404, size: 64, offset: 128)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !664, file: !665, line: 169, baseType: !404, size: 64, offset: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !664, file: !665, line: 170, baseType: !404, size: 64, offset: 256)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !664, file: !665, line: 171, baseType: !465, size: 64, offset: 320)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !664, file: !665, line: 172, baseType: !402, size: 32, offset: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !664, file: !665, line: 176, baseType: !684, size: 64, offset: 448)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DISubroutineType(types: !686)
!686 = !{!669, !406, !465}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !664, file: !665, line: 177, baseType: !688, size: 64, offset: 512)
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!689 = !DISubroutineType(types: !690)
!690 = !{null, !406, !669}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !664, file: !665, line: 178, baseType: !406, size: 64, offset: 576)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !664, file: !665, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !664, file: !665, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !664, file: !665, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !605, file: !587, line: 177, baseType: !409, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !605, file: !587, line: 178, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !699)
!699 = !{!700, !947, !948, !949, !952, !956, !957, !958, !976, !977, !978, !979, !980, !981}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !698, file: !330, line: 219, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !703)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !704)
!704 = !{!705}
!705 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !703, file: !330, line: 151, baseType: !706, size: 128)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !708)
!708 = !{!709, !710, !711}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !707, file: !330, line: 150, baseType: !7, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !707, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !707, file: !330, line: 150, baseType: !712, size: 64, offset: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !713, size: 64, elements: !508)
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !410, line: 108, baseType: !714)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !716)
!716 = !{!717, !718, !719, !939, !940, !941, !942, !943, !944, !945}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !715, file: !330, line: 124, baseType: !697, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !715, file: !330, line: 125, baseType: !697, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !715, file: !330, line: 131, baseType: !720, size: 64, offset: 128)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !721)
!721 = !{!722, !938}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !720, file: !330, line: 129, baseType: !723, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !410, line: 66, baseType: !724)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !726, line: 143, size: 192, elements: !727)
!726 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!727 = !{!728, !936, !937}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !725, file: !726, line: 145, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !410, line: 69, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !726, line: 136, size: 192, elements: !732)
!732 = !{!733, !934, !935}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !731, file: !726, line: 137, baseType: !734, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !410, line: 58, baseType: !735)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !726, line: 737, size: 768, elements: !737)
!737 = !{!738, !755, !789, !795, !800, !805, !812, !818, !824, !829, !843, !848, !854, !859, !869, !874, !892, !899, !906, !912, !917, !923, !929}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !736, file: !726, line: 738, baseType: !739, size: 256)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !726, line: 271, size: 256, elements: !740)
!740 = !{!741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !739, file: !726, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !739, file: !726, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !739, file: !726, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !739, file: !726, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !739, file: !726, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !739, file: !726, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !739, file: !726, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !739, file: !726, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !739, file: !726, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !739, file: !726, line: 312, baseType: !7, size: 32, offset: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !739, file: !726, line: 316, baseType: !534, size: 32, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !739, file: !726, line: 319, baseType: !7, size: 32, offset: 96)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !739, file: !726, line: 323, baseType: !697, size: 64, offset: 128)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !739, file: !726, line: 327, baseType: !409, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !736, file: !726, line: 739, baseType: !756, size: 448)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !726, line: 350, size: 448, elements: !757)
!757 = !{!758, !787}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !756, file: !726, line: 353, baseType: !759, size: 384)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !726, line: 333, size: 384, elements: !760)
!760 = !{!761, !762, !770}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !759, file: !726, line: 336, baseType: !739, size: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !759, file: !726, line: 343, baseType: !763, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !765, line: 37, size: 128, elements: !766)
!765 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !764, file: !765, line: 39, baseType: !763, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !764, file: !765, line: 40, baseType: !769, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !759, file: !726, line: 344, baseType: !771, size: 64, offset: 320)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !765, line: 45, size: 320, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !772, file: !765, line: 47, baseType: !771, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !772, file: !765, line: 48, baseType: !776, size: 256, offset: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !777)
!777 = !{!778, !780, !781, !786}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !776, file: !135, line: 1884, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !776, file: !135, line: 1885, baseType: !779, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !776, file: !135, line: 1891, baseType: !782, size: 64, offset: 128)
!782 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !776, file: !135, line: 1891, size: 64, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !782, file: !135, line: 1891, baseType: !734, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !782, file: !135, line: 1891, baseType: !409, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !776, file: !135, line: 1892, baseType: !769, size: 64, offset: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !756, file: !726, line: 359, baseType: !788, size: 64, offset: 384)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 64, elements: !508)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !736, file: !726, line: 740, baseType: !790, size: 512)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !726, line: 365, size: 512, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !790, file: !726, line: 368, baseType: !759, size: 384)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !790, file: !726, line: 373, baseType: !409, size: 64, offset: 384)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !790, file: !726, line: 374, baseType: !409, size: 64, offset: 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !736, file: !726, line: 741, baseType: !796, size: 576)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !726, line: 380, size: 576, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !796, file: !726, line: 383, baseType: !790, size: 512)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !796, file: !726, line: 389, baseType: !788, size: 64, offset: 512)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !736, file: !726, line: 742, baseType: !801, size: 320)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !726, line: 395, size: 320, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !801, file: !726, line: 397, baseType: !739, size: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !801, file: !726, line: 400, baseType: !723, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !736, file: !726, line: 743, baseType: !806, size: 448)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !726, line: 406, size: 448, elements: !807)
!807 = !{!808, !809, !810, !811}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !806, file: !726, line: 408, baseType: !739, size: 256)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !806, file: !726, line: 412, baseType: !409, size: 64, offset: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !806, file: !726, line: 420, baseType: !409, size: 64, offset: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !806, file: !726, line: 423, baseType: !723, size: 64, offset: 384)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !736, file: !726, line: 744, baseType: !813, size: 384)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !726, line: 429, size: 384, elements: !814)
!814 = !{!815, !816, !817}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !813, file: !726, line: 431, baseType: !739, size: 256)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !813, file: !726, line: 434, baseType: !409, size: 64, offset: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !813, file: !726, line: 437, baseType: !723, size: 64, offset: 320)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !736, file: !726, line: 745, baseType: !819, size: 384)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !726, line: 443, size: 384, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !819, file: !726, line: 445, baseType: !739, size: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !819, file: !726, line: 449, baseType: !409, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !819, file: !726, line: 453, baseType: !723, size: 64, offset: 320)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !736, file: !726, line: 746, baseType: !825, size: 320)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !726, line: 459, size: 320, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !825, file: !726, line: 461, baseType: !739, size: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !825, file: !726, line: 464, baseType: !409, size: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !736, file: !726, line: 747, baseType: !830, size: 768)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !726, line: 469, size: 768, elements: !831)
!831 = !{!832, !833, !834, !835, !836}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !830, file: !726, line: 471, baseType: !739, size: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !830, file: !726, line: 474, baseType: !7, size: 32, offset: 256)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !830, file: !726, line: 475, baseType: !7, size: 32, offset: 288)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !830, file: !726, line: 478, baseType: !409, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !830, file: !726, line: 481, baseType: !837, size: 384, offset: 384)
!837 = !DICompositeType(tag: DW_TAG_array_type, baseType: !838, size: 384, elements: !508)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !838, file: !135, line: 1920, baseType: !776, size: 256)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !838, file: !135, line: 1921, baseType: !409, size: 64, offset: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !838, file: !135, line: 1922, baseType: !534, size: 32, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !736, file: !726, line: 748, baseType: !844, size: 320)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !726, line: 487, size: 320, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !844, file: !726, line: 490, baseType: !739, size: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !844, file: !726, line: 494, baseType: !402, size: 32, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !736, file: !726, line: 749, baseType: !849, size: 384)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !726, line: 500, size: 384, elements: !850)
!850 = !{!851, !852, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !849, file: !726, line: 502, baseType: !739, size: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !849, file: !726, line: 506, baseType: !723, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !849, file: !726, line: 510, baseType: !723, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !736, file: !726, line: 750, baseType: !855, size: 320)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !726, line: 529, size: 320, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !855, file: !726, line: 531, baseType: !739, size: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !855, file: !726, line: 540, baseType: !723, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !736, file: !726, line: 751, baseType: !860, size: 704)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !726, line: 546, size: 704, elements: !861)
!861 = !{!862, !863, !864, !865, !866, !867, !868}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !860, file: !726, line: 549, baseType: !790, size: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !860, file: !726, line: 553, baseType: !407, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !860, file: !726, line: 557, baseType: !401, size: 8, offset: 576)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !860, file: !726, line: 558, baseType: !401, size: 8, offset: 584)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !860, file: !726, line: 559, baseType: !401, size: 8, offset: 592)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !860, file: !726, line: 560, baseType: !401, size: 8, offset: 600)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !860, file: !726, line: 566, baseType: !788, size: 64, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !736, file: !726, line: 752, baseType: !870, size: 384)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !726, line: 571, size: 384, elements: !871)
!871 = !{!872, !873}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !870, file: !726, line: 573, baseType: !801, size: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !870, file: !726, line: 577, baseType: !409, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !736, file: !726, line: 753, baseType: !875, size: 576)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !726, line: 600, size: 576, elements: !876)
!876 = !{!877, !878, !879, !882, !891}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !875, file: !726, line: 602, baseType: !801, size: 320)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !875, file: !726, line: 605, baseType: !409, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !875, file: !726, line: 609, baseType: !880, size: 64, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !881, line: 46, baseType: !463)
!881 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!882 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !875, file: !726, line: 612, baseType: !883, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !726, line: 581, size: 320, elements: !885)
!885 = !{!886, !887, !888, !889, !890}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !884, file: !726, line: 583, baseType: !134, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !884, file: !726, line: 586, baseType: !409, size: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !884, file: !726, line: 589, baseType: !409, size: 64, offset: 128)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !884, file: !726, line: 592, baseType: !409, size: 64, offset: 192)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !884, file: !726, line: 595, baseType: !409, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !875, file: !726, line: 616, baseType: !723, size: 64, offset: 512)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !736, file: !726, line: 754, baseType: !893, size: 512)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !726, line: 622, size: 512, elements: !894)
!894 = !{!895, !896, !897, !898}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !893, file: !726, line: 624, baseType: !801, size: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !893, file: !726, line: 628, baseType: !409, size: 64, offset: 320)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !893, file: !726, line: 632, baseType: !409, size: 64, offset: 384)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !893, file: !726, line: 636, baseType: !409, size: 64, offset: 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !736, file: !726, line: 755, baseType: !900, size: 704)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !726, line: 642, size: 704, elements: !901)
!901 = !{!902, !903, !904, !905}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !900, file: !726, line: 644, baseType: !893, size: 512)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !900, file: !726, line: 648, baseType: !409, size: 64, offset: 512)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !900, file: !726, line: 652, baseType: !409, size: 64, offset: 576)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !900, file: !726, line: 653, baseType: !409, size: 64, offset: 640)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !736, file: !726, line: 756, baseType: !907, size: 448)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !726, line: 663, size: 448, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !907, file: !726, line: 665, baseType: !801, size: 320)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !907, file: !726, line: 668, baseType: !409, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !907, file: !726, line: 673, baseType: !409, size: 64, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !736, file: !726, line: 757, baseType: !913, size: 384)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !726, line: 694, size: 384, elements: !914)
!914 = !{!915, !916}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !913, file: !726, line: 696, baseType: !801, size: 320)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !913, file: !726, line: 699, baseType: !409, size: 64, offset: 320)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !736, file: !726, line: 758, baseType: !918, size: 384)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !726, line: 681, size: 384, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !918, file: !726, line: 683, baseType: !739, size: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !918, file: !726, line: 686, baseType: !409, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !918, file: !726, line: 689, baseType: !409, size: 64, offset: 320)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !736, file: !726, line: 759, baseType: !924, size: 384)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !726, line: 707, size: 384, elements: !925)
!925 = !{!926, !927, !928}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !924, file: !726, line: 709, baseType: !739, size: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !924, file: !726, line: 712, baseType: !409, size: 64, offset: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !924, file: !726, line: 712, baseType: !409, size: 64, offset: 320)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !736, file: !726, line: 760, baseType: !930, size: 320)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !726, line: 718, size: 320, elements: !931)
!931 = !{!932, !933}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !930, file: !726, line: 720, baseType: !739, size: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !930, file: !726, line: 723, baseType: !409, size: 64, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !731, file: !726, line: 138, baseType: !730, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !731, file: !726, line: 139, baseType: !730, size: 64, offset: 128)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !725, file: !726, line: 146, baseType: !729, size: 64, offset: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !725, file: !726, line: 152, baseType: !723, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !720, file: !330, line: 130, baseType: !584, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !715, file: !330, line: 134, baseType: !406, size: 64, offset: 192)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !715, file: !330, line: 137, baseType: !409, size: 64, offset: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !715, file: !330, line: 138, baseType: !534, size: 32, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !715, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !715, file: !330, line: 144, baseType: !402, size: 32, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !715, file: !330, line: 145, baseType: !402, size: 32, offset: 416)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !715, file: !330, line: 146, baseType: !946, size: 64, offset: 448)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !465)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !698, file: !330, line: 220, baseType: !701, size: 64, offset: 64)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !698, file: !330, line: 223, baseType: !406, size: 64, offset: 128)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !698, file: !330, line: 226, baseType: !950, size: 64, offset: 192)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !698, file: !330, line: 229, baseType: !953, size: 128, offset: 256)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !954, size: 128, elements: !652)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !698, file: !330, line: 232, baseType: !697, size: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !698, file: !330, line: 233, baseType: !697, size: 64, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !698, file: !330, line: 238, baseType: !959, size: 64, offset: 512)
!959 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !960)
!960 = !{!961, !967}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !959, file: !330, line: 236, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !964)
!964 = !{!965, !966}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !963, file: !330, line: 275, baseType: !723, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !963, file: !330, line: 278, baseType: !723, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !959, file: !330, line: 237, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !970)
!970 = !{!971, !972, !973, !974, !975}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !969, file: !330, line: 261, baseType: !584, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !969, file: !330, line: 262, baseType: !584, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !969, file: !330, line: 266, baseType: !584, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !969, file: !330, line: 267, baseType: !584, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !969, file: !330, line: 270, baseType: !402, size: 32, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !698, file: !330, line: 241, baseType: !946, size: 64, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !698, file: !330, line: 244, baseType: !402, size: 32, offset: 640)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !698, file: !330, line: 247, baseType: !402, size: 32, offset: 672)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !698, file: !330, line: 250, baseType: !402, size: 32, offset: 704)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !698, file: !330, line: 253, baseType: !402, size: 32, offset: 736)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !698, file: !330, line: 256, baseType: !402, size: 32, offset: 768)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !605, file: !587, line: 179, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !587, line: 150, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !587, line: 142, size: 320, elements: !986)
!986 = !{!987, !988, !989, !990, !993, !994}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !985, file: !587, line: 144, baseType: !409, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !985, file: !587, line: 145, baseType: !584, size: 64, offset: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !985, file: !587, line: 146, baseType: !584, size: 64, offset: 128)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !985, file: !587, line: 147, baseType: !991, size: 32, offset: 192)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !992, line: 31, baseType: !402)
!992 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!993 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !985, file: !587, line: 148, baseType: !7, size: 32, offset: 224)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !985, file: !587, line: 149, baseType: !401, size: 8, offset: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !605, file: !587, line: 180, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !587, line: 162, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !587, line: 159, size: 128, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !998, file: !587, line: 160, baseType: !409, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !998, file: !587, line: 161, baseType: !465, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !605, file: !587, line: 181, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !587, line: 181, flags: DIFlagFwdDecl)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !600, file: !587, line: 317, baseType: !1006, size: 64)
!1006 = !DICompositeType(tag: DW_TAG_array_type, baseType: !465, size: 64, elements: !508)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !600, file: !587, line: 318, baseType: !1008, size: 320)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !587, line: 188, size: 320, elements: !1009)
!1009 = !{!1010, !1012, !1069}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1008, file: !587, line: 190, baseType: !1011, size: 192)
!1011 = !DICompositeType(tag: DW_TAG_array_type, baseType: !604, size: 192, elements: !483)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1008, file: !587, line: 193, baseType: !1013, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !587, line: 206, size: 320, elements: !1015)
!1015 = !{!1016, !1054, !1055, !1056, !1068}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1014, file: !587, line: 208, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !410, line: 62, baseType: !1019)
!1019 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1020, line: 538, size: 256, elements: !1021)
!1020 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1021 = !{!1022, !1026, !1032, !1045}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1019, file: !1020, line: 539, baseType: !1023, size: 32)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1020, line: 482, size: 32, elements: !1024)
!1024 = !{!1025}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1023, file: !1020, line: 484, baseType: !7, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1019, file: !1020, line: 540, baseType: !1027, size: 192)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1020, line: 488, size: 192, elements: !1028)
!1028 = !{!1029, !1030, !1031}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1027, file: !1020, line: 489, baseType: !1023, size: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1027, file: !1020, line: 492, baseType: !407, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1027, file: !1020, line: 496, baseType: !409, size: 64, offset: 128)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1019, file: !1020, line: 541, baseType: !1033, size: 256)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1020, line: 504, size: 256, elements: !1034)
!1034 = !{!1035, !1036, !1043, !1044}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1033, file: !1020, line: 505, baseType: !1023, size: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1033, file: !1020, line: 509, baseType: !1037, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1020, line: 501, baseType: !1038)
!1038 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1039, size: 64)
!1039 = !DISubroutineType(types: !1040)
!1040 = !{null, !1041}
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1033, file: !1020, line: 510, baseType: !1041, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1033, file: !1020, line: 513, baseType: !1017, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1019, file: !1020, line: 542, baseType: !1046, size: 128)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1020, line: 530, size: 128, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1046, file: !1020, line: 531, baseType: !1023, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1046, file: !1020, line: 534, baseType: !1050, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1020, line: 525, baseType: !1051)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DISubroutineType(types: !1053)
!1053 = !{!401, !409, !407, !463, !463}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1014, file: !587, line: 211, baseType: !7, size: 32, offset: 64)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1014, file: !587, line: 214, baseType: !465, size: 64, offset: 128)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1014, file: !587, line: 224, baseType: !1057, size: 64, offset: 192)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !587, line: 202, baseType: !1059)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !587, line: 202, size: 128, elements: !1060)
!1060 = !{!1061}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1059, file: !587, line: 202, baseType: !1062, size: 128)
!1062 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !587, line: 200, baseType: !1063)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !587, line: 200, size: 128, elements: !1064)
!1064 = !{!1065, !1066, !1067}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1063, file: !587, line: 200, baseType: !7, size: 32)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1063, file: !587, line: 200, baseType: !7, size: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1063, file: !587, line: 200, baseType: !618, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1014, file: !587, line: 234, baseType: !1057, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1008, file: !587, line: 197, baseType: !465, size: 64, offset: 256)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !600, file: !587, line: 319, baseType: !472, size: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !600, file: !587, line: 320, baseType: !491, size: 192)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !412, file: !135, line: 3384, baseType: !1073, size: 1472)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1074)
!1074 = !{!1075, !1096, !1097, !1098, !1099}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1073, file: !135, line: 3115, baseType: !1076, size: 1216)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1076, file: !135, line: 2985, baseType: !580, size: 960)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1076, file: !135, line: 2986, baseType: !409, size: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1076, file: !135, line: 2987, baseType: !409, size: 64, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1076, file: !135, line: 2988, baseType: !409, size: 64, offset: 1088)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1076, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1076, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1076, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1076, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1076, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1076, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1076, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1076, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1076, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1076, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1076, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1076, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1076, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1076, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1073, file: !135, line: 3117, baseType: !409, size: 64, offset: 1216)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1073, file: !135, line: 3119, baseType: !409, size: 64, offset: 1280)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1073, file: !135, line: 3121, baseType: !409, size: 64, offset: 1344)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1073, file: !135, line: 3123, baseType: !409, size: 64, offset: 1408)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !412, file: !135, line: 3385, baseType: !1101, size: 1088)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1102)
!1102 = !{!1103, !1104, !1105}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1101, file: !135, line: 2875, baseType: !580, size: 960)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1101, file: !135, line: 2876, baseType: !584, size: 64, offset: 960)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1101, file: !135, line: 2877, baseType: !1106, size: 64, offset: 1024)
!1106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1107, size: 64)
!1107 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !135, line: 2856, flags: DIFlagFwdDecl)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !412, file: !135, line: 3386, baseType: !1076, size: 1216)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !412, file: !135, line: 3387, baseType: !1110, size: 1280)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !135, line: 3094, baseType: !1076, size: 1216)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1110, file: !135, line: 3095, baseType: !1106, size: 64, offset: 1216)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !412, file: !135, line: 3388, baseType: !1115, size: 1216)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1116)
!1116 = !{!1117, !1118, !1119, !1120, !1121, !1122}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !135, line: 2825, baseType: !542, size: 896)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1115, file: !135, line: 2827, baseType: !409, size: 64, offset: 896)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1115, file: !135, line: 2828, baseType: !409, size: 64, offset: 960)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1115, file: !135, line: 2829, baseType: !409, size: 64, offset: 1024)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1115, file: !135, line: 2830, baseType: !409, size: 64, offset: 1088)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1115, file: !135, line: 2831, baseType: !409, size: 64, offset: 1152)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !412, file: !135, line: 3389, baseType: !1124, size: 1024)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1125)
!1125 = !{!1126, !1127, !1128}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1124, file: !135, line: 2851, baseType: !580, size: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1124, file: !135, line: 2852, baseType: !402, size: 32, offset: 960)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1124, file: !135, line: 2853, baseType: !402, size: 32, offset: 992)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !412, file: !135, line: 3390, baseType: !1130, size: 1024)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1131)
!1131 = !{!1132, !1133}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1130, file: !135, line: 2858, baseType: !580, size: 960)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1130, file: !135, line: 2859, baseType: !1106, size: 64, offset: 960)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !412, file: !135, line: 3391, baseType: !1135, size: 960)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1136)
!1136 = !{!1137}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1135, file: !135, line: 2863, baseType: !580, size: 960)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !412, file: !135, line: 3392, baseType: !1139, size: 1472)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1140)
!1140 = !{!1141}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !135, line: 3305, baseType: !1073, size: 1472)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !412, file: !135, line: 3393, baseType: !1143, size: 1792)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1144)
!1144 = !{!1145, !1146, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1143, file: !135, line: 3249, baseType: !1073, size: 1472)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1143, file: !135, line: 3251, baseType: !1147, size: 64, offset: 1472)
!1147 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1148, size: 64)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1149, line: 463, size: 1152, elements: !1150)
!1149 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1150 = !{!1151, !1154, !1185, !1186, !1189, !1192, !1240, !1241, !1242, !1243, !1244, !1268, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1148, file: !1149, line: 464, baseType: !1152, size: 64)
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1149, line: 464, flags: DIFlagFwdDecl)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1148, file: !1149, line: 467, baseType: !1155, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1157)
!1157 = !{!1158, !1160, !1161, !1174, !1175, !1176, !1177, !1178, !1179, !1181, !1183, !1184}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1156, file: !330, line: 377, baseType: !1159, size: 64)
!1159 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !410, line: 111, baseType: !697)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1156, file: !330, line: 378, baseType: !1159, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1156, file: !330, line: 381, baseType: !1162, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1164)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1165)
!1165 = !{!1166}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1164, file: !330, line: 282, baseType: !1167, size: 128)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1168)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1169)
!1169 = !{!1170, !1171, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1168, file: !330, line: 281, baseType: !7, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1168, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1168, file: !330, line: 281, baseType: !1173, size: 64, offset: 64)
!1173 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1159, size: 64, elements: !508)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1156, file: !330, line: 384, baseType: !402, size: 32, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1156, file: !330, line: 387, baseType: !402, size: 32, offset: 224)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1156, file: !330, line: 390, baseType: !402, size: 32, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1156, file: !330, line: 394, baseType: !1162, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1156, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1156, file: !330, line: 399, baseType: !1180, size: 64, offset: 416)
!1180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !652)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1156, file: !330, line: 402, baseType: !1182, size: 64, offset: 480)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !652)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1156, file: !330, line: 406, baseType: !402, size: 32, offset: 544)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1156, file: !330, line: 409, baseType: !402, size: 32, offset: 576)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1148, file: !1149, line: 470, baseType: !724, size: 64, offset: 128)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1148, file: !1149, line: 473, baseType: !1187, size: 64, offset: 192)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1149, line: 166, flags: DIFlagFwdDecl)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1148, file: !1149, line: 476, baseType: !1190, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1149, line: 476, flags: DIFlagFwdDecl)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1148, file: !1149, line: 479, baseType: !1193, size: 64, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1194, line: 144, baseType: !1195)
!1194 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
