; ModuleID = 'strerror.bc'
source_filename = "strerror.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.error_info = type { i32, i8*, i8* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@error_names = internal unnamed_addr global i8** null, align 8, !dbg !0
@sys_nerr__ = internal unnamed_addr global i32 0, align 4, !dbg !36
@num_error_names = internal unnamed_addr global i32 0, align 4, !dbg !53
@strerror.buf = internal global [32 x i8] zeroinitializer, align 16, !dbg !17
@sys_errlist__ = internal unnamed_addr global i8** null, align 8, !dbg !38
@.str = private unnamed_addr constant [9 x i8] c"Error %d\00", align 1
@strerrno.buf = internal global [32 x i8] zeroinitializer, align 16, !dbg !28

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "error_names", scope: !2, file: !3, line: 452, type: !15, isLocal: true, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !16, nameTableKind: None)
!3 = !DIFile(filename: "strerror.c", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!4 = !{}
!5 = !{!6, !7, !8, !9, !12, !13, !10, !15}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!15 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!16 = !{!17, !28, !0, !36, !38, !40, !53}
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "buf", scope: !19, file: !3, line: 629, type: !25, isLocal: true, isDefinition: true)
!19 = distinct !DISubprogram(name: "strerror", scope: !3, file: !3, line: 626, type: !20, scopeLine: 627, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !22)
!20 = !DISubroutineType(types: !21)
!21 = !{!10, !8}
!22 = !{!23, !24}
!23 = !DILocalVariable(name: "errnoval", arg: 1, scope: !19, file: !3, line: 626, type: !8)
!24 = !DILocalVariable(name: "msg", scope: !19, file: !3, line: 628, type: !13)
!25 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 256, elements: !26)
!26 = !{!27}
!27 = !DISubrange(count: 32)
!28 = !DIGlobalVariableExpression(var: !29, expr: !DIExpression())
!29 = distinct !DIGlobalVariable(name: "buf", scope: !30, file: !3, line: 699, type: !25, isLocal: true, isDefinition: true)
!30 = distinct !DISubprogram(name: "strerrno", scope: !3, file: !3, line: 696, type: !31, scopeLine: 697, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !33)
!31 = !DISubroutineType(types: !32)
!32 = !{!13, !8}
!33 = !{!34, !35}
!34 = !DILocalVariable(name: "errnoval", arg: 1, scope: !30, file: !3, line: 696, type: !8)
!35 = !DILocalVariable(name: "name", scope: !30, file: !3, line: 698, type: !13)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "sys_nerr__", scope: !2, file: !3, line: 467, type: !8, isLocal: true, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "sys_errlist__", scope: !2, file: !3, line: 468, type: !15, isLocal: true, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "error_table", scope: !2, file: !3, line: 74, type: !42, isLocal: true, isDefinition: true)
!42 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 23424, elements: !51)
!43 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !44)
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "error_info", file: !3, line: 59, size: 192, elements: !45)
!45 = !{!46, !48, !50}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !44, file: !3, line: 61, baseType: !47, size: 32)
!47 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !44, file: !3, line: 62, baseType: !49, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !13)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "msg", scope: !44, file: !3, line: 64, baseType: !49, size: 64, offset: 128)
!51 = !{!52}
!52 = !DISubrange(count: 122)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "num_error_names", scope: !2, file: !3, line: 453, type: !8, isLocal: true, isDefinition: true)
!55 = !{i32 2, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!59 = distinct !DISubprogram(name: "vprintf", scope: !60, file: !60, line: 39, type: !61, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !72)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!61 = !DISubroutineType(types: !62)
!62 = !{!8, !63, !64}
!63 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !13)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !66)
!66 = !{!67, !69, !70, !71}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !65, file: !3, baseType: !68, size: 32)
!68 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !65, file: !3, baseType: !68, size: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !65, file: !3, baseType: !12, size: 64, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !65, file: !3, baseType: !12, size: 64, offset: 128)
!72 = !{!73, !74}
!73 = !DILocalVariable(name: "__fmt", arg: 1, scope: !59, file: !60, line: 39, type: !63)
!74 = !DILocalVariable(name: "__arg", arg: 2, scope: !59, file: !60, line: 39, type: !64)
!75 = !DILocation(line: 0, scope: !59)
!76 = !DILocation(line: 41, column: 20, scope: !59)
!77 = !DILocation(line: 41, column: 10, scope: !59)
!78 = !DILocation(line: 41, column: 3, scope: !59)
!79 = distinct !DISubprogram(name: "getchar", scope: !60, file: !60, line: 47, type: !80, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!80 = !DISubroutineType(types: !81)
!81 = !{!8}
!82 = !DILocation(line: 49, column: 16, scope: !79)
!83 = !DILocation(line: 49, column: 10, scope: !79)
!84 = !DILocation(line: 49, column: 3, scope: !79)
!85 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !60, file: !60, line: 56, type: !86, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !147)
!86 = !DISubroutineType(types: !87)
!87 = !{!8, !88}
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !90, line: 7, baseType: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !92, line: 49, size: 1728, elements: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106, !109, !111, !112, !113, !117, !119, !121, !125, !128, !130, !133, !136, !137, !138, !142, !143}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !91, file: !92, line: 51, baseType: !8, size: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !91, file: !92, line: 54, baseType: !10, size: 64, offset: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !91, file: !92, line: 55, baseType: !10, size: 64, offset: 128)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !91, file: !92, line: 56, baseType: !10, size: 64, offset: 192)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !91, file: !92, line: 57, baseType: !10, size: 64, offset: 256)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !91, file: !92, line: 58, baseType: !10, size: 64, offset: 320)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !91, file: !92, line: 59, baseType: !10, size: 64, offset: 384)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !91, file: !92, line: 60, baseType: !10, size: 64, offset: 448)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !91, file: !92, line: 61, baseType: !10, size: 64, offset: 512)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !91, file: !92, line: 64, baseType: !10, size: 64, offset: 576)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !91, file: !92, line: 65, baseType: !10, size: 64, offset: 640)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !91, file: !92, line: 66, baseType: !10, size: 64, offset: 704)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !91, file: !92, line: 68, baseType: !107, size: 64, offset: 768)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !92, line: 36, flags: DIFlagFwdDecl)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !91, file: !92, line: 70, baseType: !110, size: 64, offset: 832)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !91, file: !92, line: 72, baseType: !8, size: 32, offset: 896)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !91, file: !92, line: 73, baseType: !8, size: 32, offset: 928)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !91, file: !92, line: 74, baseType: !114, size: 64, offset: 960)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !115, line: 152, baseType: !116)
!115 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!116 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !91, file: !92, line: 77, baseType: !118, size: 16, offset: 1024)
!118 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !91, file: !92, line: 78, baseType: !120, size: 8, offset: 1040)
!120 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !91, file: !92, line: 79, baseType: !122, size: 8, offset: 1048)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 1)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !91, file: !92, line: 81, baseType: !126, size: 64, offset: 1088)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !92, line: 43, baseType: null)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !91, file: !92, line: 89, baseType: !129, size: 64, offset: 1152)
!129 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !115, line: 153, baseType: !116)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !91, file: !92, line: 91, baseType: !131, size: 64, offset: 1216)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !92, line: 37, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !91, file: !92, line: 92, baseType: !134, size: 64, offset: 1280)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !92, line: 38, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !91, file: !92, line: 93, baseType: !110, size: 64, offset: 1344)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !91, file: !92, line: 94, baseType: !12, size: 64, offset: 1408)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !91, file: !92, line: 95, baseType: !139, size: 64, offset: 1472)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !140, line: 46, baseType: !141)
!140 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!141 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !91, file: !92, line: 96, baseType: !8, size: 32, offset: 1536)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !91, file: !92, line: 98, baseType: !144, size: 160, offset: 1568)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 160, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 20)
!147 = !{!148}
!148 = !DILocalVariable(name: "__fp", arg: 1, scope: !85, file: !60, line: 56, type: !88)
!149 = !DILocation(line: 0, scope: !85)
!150 = !DILocation(line: 58, column: 10, scope: !85)
!151 = !DILocation(line: 58, column: 3, scope: !85)
!152 = distinct !DISubprogram(name: "getc_unlocked", scope: !60, file: !60, line: 66, type: !86, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !153)
!153 = !{!154}
!154 = !DILocalVariable(name: "__fp", arg: 1, scope: !152, file: !60, line: 66, type: !88)
!155 = !DILocation(line: 0, scope: !152)
!156 = !DILocation(line: 68, column: 10, scope: !152)
!157 = !DILocation(line: 68, column: 3, scope: !152)
!158 = distinct !DISubprogram(name: "getchar_unlocked", scope: !60, file: !60, line: 73, type: !80, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !4)
!159 = !DILocation(line: 75, column: 10, scope: !158)
!160 = !DILocation(line: 75, column: 3, scope: !158)
!161 = distinct !DISubprogram(name: "putchar", scope: !60, file: !60, line: 82, type: !162, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !164)
!162 = !DISubroutineType(types: !163)
!163 = !{!8, !8}
!164 = !{!165}
!165 = !DILocalVariable(name: "__c", arg: 1, scope: !161, file: !60, line: 82, type: !8)
!166 = !DILocation(line: 0, scope: !161)
!167 = !DILocation(line: 84, column: 21, scope: !161)
!168 = !DILocation(line: 84, column: 10, scope: !161)
!169 = !DILocation(line: 84, column: 3, scope: !161)
!170 = distinct !DISubprogram(name: "fputc_unlocked", scope: !60, file: !60, line: 91, type: !171, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !173)
!171 = !DISubroutineType(types: !172)
!172 = !{!8, !8, !88}
!173 = !{!174, !175}
!174 = !DILocalVariable(name: "__c", arg: 1, scope: !170, file: !60, line: 91, type: !8)
!175 = !DILocalVariable(name: "__stream", arg: 2, scope: !170, file: !60, line: 91, type: !88)
!176 = !DILocation(line: 0, scope: !170)
!177 = !DILocation(line: 93, column: 10, scope: !170)
!178 = !DILocation(line: 93, column: 3, scope: !170)
!179 = distinct !DISubprogram(name: "putc_unlocked", scope: !60, file: !60, line: 101, type: !171, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !180)
!180 = !{!181, !182}
!181 = !DILocalVariable(name: "__c", arg: 1, scope: !179, file: !60, line: 101, type: !8)
!182 = !DILocalVariable(name: "__stream", arg: 2, scope: !179, file: !60, line: 101, type: !88)
!183 = !DILocation(line: 0, scope: !179)
!184 = !DILocation(line: 103, column: 10, scope: !179)
!185 = !DILocation(line: 103, column: 3, scope: !179)
!186 = distinct !DISubprogram(name: "putchar_unlocked", scope: !60, file: !60, line: 108, type: !162, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !187)
!187 = !{!188}
!188 = !DILocalVariable(name: "__c", arg: 1, scope: !186, file: !60, line: 108, type: !8)
!189 = !DILocation(line: 0, scope: !186)
!190 = !DILocation(line: 110, column: 10, scope: !186)
!191 = !DILocation(line: 110, column: 3, scope: !186)
!192 = distinct !DISubprogram(name: "getline", scope: !60, file: !60, line: 118, type: !193, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !197)
!193 = !DISubroutineType(types: !194)
!194 = !{!195, !9, !196, !88}
!195 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !115, line: 193, baseType: !116)
