; ModuleID = 'stringpool.bc'
source_filename = "stringpool.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ht = type { %struct.obstack, %struct.ht_identifier**, %struct.ht_identifier* (%struct.ht*)*, i8* (i64)*, i32, i32, %struct.cpp_reader*, i32, i32, i8 }
%struct.obstack = type { i64, %struct._obstack_chunk*, i8*, i8*, i8*, i64, i32, %struct._obstack_chunk* (i8*, i64)*, void (i8*, %struct._obstack_chunk*)*, i8*, i8 }
%struct._obstack_chunk = type { i8*, %struct._obstack_chunk*, [4 x i8] }
%struct.ht_identifier = type { i8*, i32, i32 }
%struct.cpp_reader = type opaque
%struct.string_pool_data = type { %struct.ht_identifier**, i32, i32 }
%struct.ggc_root_tab = type { i8*, i64, i64, void (i8*)*, void (i8*)* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }

!183 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!184 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!185 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!186 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!187 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!188 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!189 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!190 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!191 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!192 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!193 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!194 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!195 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!196 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!197 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!198 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!199 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!200 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!201 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!202 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!203 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!204 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!205 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!206 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!207 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!208 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!209 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!210 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!211 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!212 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!213 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!214 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!215 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!216 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!217 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!218 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!219 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!224 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!225 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!226 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!227 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!228 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!229 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!230 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!231 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!232 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!233 = !{!234, !235, !236, !237, !240, !241, !243, !238, !244, !246, !884, !886, !890, !894, !896}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64)
!235 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!236 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !238, size: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!239 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !242, size: 64)
!242 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!243 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !235)
!246 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !247, line: 56, baseType: !248)
!247 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !250)
!250 = !{!251, !284, !290, !303, !310, !317, !322, !331, !337, !348, !360, !398, !406, !434, !442, !443, !448, !457, !463, !468, !472, !476, !505, !554, !560, !567, !574, !600, !625, !642, !654, !676, !694, !866}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !249, file: !6, line: 3372, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !252, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !252, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !252, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !252, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !252, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !252, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !252, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !252, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !252, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !252, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !252, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !252, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !252, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !252, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !252, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !252, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !252, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !252, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !252, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !252, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !252, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !252, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !252, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !252, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !252, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !252, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !252, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !252, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !252, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !252, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !249, file: !6, line: 3373, baseType: !285, size: 192)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !286)
!286 = !{!287, !288, !289}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !285, file: !6, line: 403, baseType: !252, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !285, file: !6, line: 404, baseType: !246, size: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !285, file: !6, line: 405, baseType: !246, size: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !249, file: !6, line: 3374, baseType: !291, size: 320)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !291, file: !6, line: 1385, baseType: !285, size: 192)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !291, file: !6, line: 1386, baseType: !295, size: 128, offset: 192)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !296, line: 58, baseType: !297)
!296 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!297 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !296, line: 54, size: 128, elements: !298)
!298 = !{!299, !301}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !297, file: !296, line: 56, baseType: !300, size: 64)
!300 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !297, file: !296, line: 57, baseType: !302, size: 64, offset: 64)
!302 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !249, file: !6, line: 3375, baseType: !304, size: 256)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !305)
!305 = !{!306, !307}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !304, file: !6, line: 1398, baseType: !285, size: 192)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !304, file: !6, line: 1399, baseType: !308, size: 64, offset: 192)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !249, file: !6, line: 3376, baseType: !311, size: 256)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !312)
!312 = !{!313, !314}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !311, file: !6, line: 1409, baseType: !285, size: 192)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !311, file: !6, line: 1410, baseType: !315, size: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64)
!316 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !249, file: !6, line: 3377, baseType: !318, size: 256)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !319)
!319 = !{!320, !321}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !318, file: !6, line: 1438, baseType: !285, size: 192)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !318, file: !6, line: 1439, baseType: !246, size: 64, offset: 192)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !249, file: !6, line: 3378, baseType: !323, size: 256)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !324)
!324 = !{!325, !326, !327}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !323, file: !6, line: 1419, baseType: !285, size: 192)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !323, file: !6, line: 1420, baseType: !236, size: 32, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !323, file: !6, line: 1421, baseType: !328, size: 8, offset: 224)
!328 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 8, elements: !329)
!329 = !{!330}
!330 = !DISubrange(count: 1)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !249, file: !6, line: 3379, baseType: !332, size: 320)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !332, file: !6, line: 1429, baseType: !285, size: 192)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !332, file: !6, line: 1430, baseType: !246, size: 64, offset: 192)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !332, file: !6, line: 1431, baseType: !246, size: 64, offset: 256)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !249, file: !6, line: 3380, baseType: !338, size: 320)
!338 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !339)
!339 = !{!340, !341}
!340 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !338, file: !6, line: 1461, baseType: !285, size: 192)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !338, file: !6, line: 1462, baseType: !342, size: 128, offset: 192)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !343, line: 31, size: 128, elements: !344)
!343 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!344 = !{!345, !346, !347}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !342, file: !343, line: 32, baseType: !244, size: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !342, file: !343, line: 33, baseType: !7, size: 32, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !342, file: !343, line: 34, baseType: !7, size: 32, offset: 96)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !249, file: !6, line: 3381, baseType: !349, size: 384)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !350)
!350 = !{!351, !352, !357, !358, !359}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !349, file: !6, line: 2508, baseType: !285, size: 192)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !349, file: !6, line: 2509, baseType: !353, size: 32, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !354, line: 58, baseType: !355)
!354 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!355 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !356, line: 44, baseType: !7)
!356 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!357 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !349, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !349, file: !6, line: 2511, baseType: !246, size: 64, offset: 256)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !349, file: !6, line: 2512, baseType: !246, size: 64, offset: 320)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !249, file: !6, line: 3382, baseType: !361, size: 896)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !362)
!362 = !{!363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !361, file: !6, line: 2653, baseType: !349, size: 384)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !361, file: !6, line: 2654, baseType: !246, size: 64, offset: 384)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !361, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !361, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !361, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !361, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !361, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !361, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !361, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !361, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !361, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !361, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !361, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !361, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !361, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !361, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !361, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !361, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !361, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !361, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !361, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !361, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !361, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !361, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !361, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !361, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !361, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !361, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !361, file: !6, line: 2705, baseType: !246, size: 64, offset: 576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !361, file: !6, line: 2706, baseType: !246, size: 64, offset: 640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !361, file: !6, line: 2707, baseType: !246, size: 64, offset: 704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !361, file: !6, line: 2708, baseType: !246, size: 64, offset: 768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !361, file: !6, line: 2711, baseType: !396, size: 64, offset: 832)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !249, file: !6, line: 3383, baseType: !399, size: 960)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !400)
!400 = !{!401, !402}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !399, file: !6, line: 2757, baseType: !361, size: 896)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !399, file: !6, line: 2758, baseType: !403, size: 64, offset: 896)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !247, line: 50, baseType: !404)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !247, line: 49, flags: DIFlagFwdDecl)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !249, file: !6, line: 3384, baseType: !407, size: 1472)
!407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !408)
!408 = !{!409, !430, !431, !432, !433}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !407, file: !6, line: 3115, baseType: !410, size: 1216)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !410, file: !6, line: 2985, baseType: !399, size: 960)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !410, file: !6, line: 2986, baseType: !246, size: 64, offset: 960)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !410, file: !6, line: 2987, baseType: !246, size: 64, offset: 1024)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !410, file: !6, line: 2988, baseType: !246, size: 64, offset: 1088)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !410, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !410, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !410, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !410, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !410, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !410, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !410, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !410, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !410, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !410, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !410, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !410, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !410, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !410, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !407, file: !6, line: 3117, baseType: !246, size: 64, offset: 1216)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !407, file: !6, line: 3119, baseType: !246, size: 64, offset: 1280)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !407, file: !6, line: 3121, baseType: !246, size: 64, offset: 1344)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !407, file: !6, line: 3123, baseType: !246, size: 64, offset: 1408)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !249, file: !6, line: 3385, baseType: !435, size: 1088)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !436)
!436 = !{!437, !438, !439}
!437 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !435, file: !6, line: 2875, baseType: !399, size: 960)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !435, file: !6, line: 2876, baseType: !403, size: 64, offset: 960)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !435, file: !6, line: 2877, baseType: !440, size: 64, offset: 1024)
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !441, size: 64)
!441 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !6, line: 2856, flags: DIFlagFwdDecl)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !249, file: !6, line: 3386, baseType: !410, size: 1216)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !249, file: !6, line: 3387, baseType: !444, size: 1280)
!444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !445)
!445 = !{!446, !447}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !444, file: !6, line: 3094, baseType: !410, size: 1216)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !444, file: !6, line: 3095, baseType: !440, size: 64, offset: 1216)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !249, file: !6, line: 3388, baseType: !449, size: 1216)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !450)
!450 = !{!451, !452, !453, !454, !455, !456}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !449, file: !6, line: 2825, baseType: !361, size: 896)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !449, file: !6, line: 2827, baseType: !246, size: 64, offset: 896)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !449, file: !6, line: 2828, baseType: !246, size: 64, offset: 960)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !449, file: !6, line: 2829, baseType: !246, size: 64, offset: 1024)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !449, file: !6, line: 2830, baseType: !246, size: 64, offset: 1088)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !449, file: !6, line: 2831, baseType: !246, size: 64, offset: 1152)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !249, file: !6, line: 3389, baseType: !458, size: 1024)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !458, file: !6, line: 2851, baseType: !399, size: 960)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !458, file: !6, line: 2852, baseType: !236, size: 32, offset: 960)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !458, file: !6, line: 2853, baseType: !236, size: 32, offset: 992)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !249, file: !6, line: 3390, baseType: !464, size: 1024)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !464, file: !6, line: 2858, baseType: !399, size: 960)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !464, file: !6, line: 2859, baseType: !440, size: 64, offset: 960)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !249, file: !6, line: 3391, baseType: !469, size: 960)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !470)
!470 = !{!471}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !469, file: !6, line: 2863, baseType: !399, size: 960)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !249, file: !6, line: 3392, baseType: !473, size: 1472)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !474)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !473, file: !6, line: 3305, baseType: !407, size: 1472)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !249, file: !6, line: 3393, baseType: !477, size: 1792)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !478)
!478 = !{!479, !480, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !477, file: !6, line: 3249, baseType: !407, size: 1472)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !477, file: !6, line: 3251, baseType: !481, size: 64, offset: 1472)
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !483, line: 41, flags: DIFlagFwdDecl)
!483 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!484 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !477, file: !6, line: 3254, baseType: !246, size: 64, offset: 1536)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !477, file: !6, line: 3257, baseType: !246, size: 64, offset: 1600)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !477, file: !6, line: 3258, baseType: !246, size: 64, offset: 1664)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !477, file: !6, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !477, file: !6, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !477, file: !6, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !477, file: !6, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !477, file: !6, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !477, file: !6, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !477, file: !6, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !477, file: !6, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !477, file: !6, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !477, file: !6, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !477, file: !6, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !477, file: !6, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !477, file: !6, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !477, file: !6, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !477, file: !6, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !477, file: !6, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !477, file: !6, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !477, file: !6, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !249, file: !6, line: 3394, baseType: !506, size: 1344)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !6, line: 2279, size: 1344, elements: !507)
!507 = !{!508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !533, !534, !535, !543, !544, !545, !546, !547, !548, !549, !550, !551}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !506, file: !6, line: 2280, baseType: !285, size: 192)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !506, file: !6, line: 2281, baseType: !246, size: 64, offset: 192)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !506, file: !6, line: 2282, baseType: !246, size: 64, offset: 256)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !506, file: !6, line: 2283, baseType: !246, size: 64, offset: 320)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !506, file: !6, line: 2284, baseType: !246, size: 64, offset: 384)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !506, file: !6, line: 2285, baseType: !7, size: 32, offset: 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !506, file: !6, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !506, file: !6, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !506, file: !6, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !506, file: !6, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !506, file: !6, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !506, file: !6, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !506, file: !6, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !506, file: !6, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !506, file: !6, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !506, file: !6, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !506, file: !6, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !506, file: !6, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !506, file: !6, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !506, file: !6, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !506, file: !6, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !506, file: !6, line: 2305, baseType: !7, size: 32, offset: 512)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !506, file: !6, line: 2306, baseType: !531, size: 32, offset: 544)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !532, line: 31, baseType: !236)
!532 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!533 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !506, file: !6, line: 2307, baseType: !246, size: 64, offset: 576)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !506, file: !6, line: 2308, baseType: !246, size: 64, offset: 640)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !506, file: !6, line: 2314, baseType: !536, size: 64, offset: 704)
!536 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !6, line: 2309, size: 64, elements: !537)
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !536, file: !6, line: 2310, baseType: !236, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !536, file: !6, line: 2311, baseType: !241, size: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !536, file: !6, line: 2312, baseType: !541, size: 64)
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !6, line: 2277, flags: DIFlagFwdDecl)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !506, file: !6, line: 2315, baseType: !246, size: 64, offset: 768)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !506, file: !6, line: 2316, baseType: !246, size: 64, offset: 832)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !506, file: !6, line: 2317, baseType: !246, size: 64, offset: 896)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !506, file: !6, line: 2318, baseType: !246, size: 64, offset: 960)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !506, file: !6, line: 2319, baseType: !246, size: 64, offset: 1024)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !506, file: !6, line: 2320, baseType: !246, size: 64, offset: 1088)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !506, file: !6, line: 2321, baseType: !246, size: 64, offset: 1152)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !506, file: !6, line: 2322, baseType: !246, size: 64, offset: 1216)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !506, file: !6, line: 2324, baseType: !552, size: 64, offset: 1280)
!552 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !553, size: 64)
!553 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !6, line: 2324, flags: DIFlagFwdDecl)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !249, file: !6, line: 3395, baseType: !555, size: 320)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !6, line: 1469, size: 320, elements: !556)
!556 = !{!557, !558, !559}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !555, file: !6, line: 1470, baseType: !285, size: 192)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !555, file: !6, line: 1471, baseType: !246, size: 64, offset: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !555, file: !6, line: 1472, baseType: !246, size: 64, offset: 256)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !249, file: !6, line: 3396, baseType: !561, size: 320)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !6, line: 1482, size: 320, elements: !562)
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !561, file: !6, line: 1483, baseType: !285, size: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !561, file: !6, line: 1484, baseType: !236, size: 32, offset: 192)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !561, file: !6, line: 1485, baseType: !566, size: 64, offset: 256)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !246, size: 64, elements: !329)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !249, file: !6, line: 3397, baseType: !568, size: 384)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !6, line: 1829, size: 384, elements: !569)
!569 = !{!570, !571, !572, !573}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !568, file: !6, line: 1830, baseType: !285, size: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !568, file: !6, line: 1831, baseType: !353, size: 32, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !568, file: !6, line: 1832, baseType: !246, size: 64, offset: 256)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !568, file: !6, line: 1835, baseType: !566, size: 64, offset: 320)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !249, file: !6, line: 3398, baseType: !575, size: 704)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !6, line: 1898, size: 704, elements: !576)
!576 = !{!577, !578, !579, !583, !584, !587}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !575, file: !6, line: 1899, baseType: !285, size: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !575, file: !6, line: 1902, baseType: !246, size: 64, offset: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !575, file: !6, line: 1905, baseType: !580, size: 64, offset: 256)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !247, line: 58, baseType: !581)
!581 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !582, size: 64)
!582 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !247, line: 57, flags: DIFlagFwdDecl)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !575, file: !6, line: 1908, baseType: !7, size: 32, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !575, file: !6, line: 1911, baseType: !585, size: 64, offset: 384)
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !6, line: 1876, flags: DIFlagFwdDecl)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !575, file: !6, line: 1914, baseType: !588, size: 256, offset: 448)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !589)
!589 = !{!590, !592, !593, !598}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !588, file: !6, line: 1884, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !588, file: !6, line: 1885, baseType: !591, size: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !588, file: !6, line: 1891, baseType: !594, size: 64, offset: 128)
!594 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !588, file: !6, line: 1891, size: 64, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !594, file: !6, line: 1891, baseType: !580, size: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !594, file: !6, line: 1891, baseType: !246, size: 64)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !588, file: !6, line: 1892, baseType: !599, size: 64, offset: 192)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !249, file: !6, line: 3399, baseType: !601, size: 704)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !6, line: 2008, size: 704, elements: !602)
!602 = !{!603, !604, !605, !606, !607, !608, !620, !621, !622, !623, !624}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !601, file: !6, line: 2009, baseType: !285, size: 192)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !601, file: !6, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !601, file: !6, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !601, file: !6, line: 2014, baseType: !353, size: 32, offset: 224)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !601, file: !6, line: 2016, baseType: !246, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !601, file: !6, line: 2017, baseType: !609, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !610, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !611)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !612)
!612 = !{!613}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !611, file: !6, line: 183, baseType: !614, size: 128)
!614 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !615)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !616)
!616 = !{!617, !618, !619}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !615, file: !6, line: 182, baseType: !7, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !615, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !615, file: !6, line: 182, baseType: !566, size: 64, offset: 64)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !601, file: !6, line: 2019, baseType: !246, size: 64, offset: 384)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !601, file: !6, line: 2020, baseType: !246, size: 64, offset: 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !601, file: !6, line: 2021, baseType: !246, size: 64, offset: 512)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !601, file: !6, line: 2022, baseType: !246, size: 64, offset: 576)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !601, file: !6, line: 2023, baseType: !246, size: 64, offset: 640)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !249, file: !6, line: 3400, baseType: !626, size: 832)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !6, line: 2430, size: 832, elements: !627)
!627 = !{!628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !626, file: !6, line: 2431, baseType: !285, size: 192)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !626, file: !6, line: 2433, baseType: !246, size: 64, offset: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !626, file: !6, line: 2434, baseType: !246, size: 64, offset: 256)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !626, file: !6, line: 2435, baseType: !246, size: 64, offset: 320)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !626, file: !6, line: 2436, baseType: !246, size: 64, offset: 384)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !626, file: !6, line: 2437, baseType: !609, size: 64, offset: 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !626, file: !6, line: 2438, baseType: !246, size: 64, offset: 512)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !626, file: !6, line: 2440, baseType: !246, size: 64, offset: 576)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !626, file: !6, line: 2441, baseType: !246, size: 64, offset: 640)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !626, file: !6, line: 2443, baseType: !638, size: 128, offset: 704)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !6, line: 182, baseType: !639)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !6, line: 182, size: 128, elements: !640)
!640 = !{!641}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !639, file: !6, line: 182, baseType: !614, size: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !249, file: !6, line: 3401, baseType: !643, size: 320)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !6, line: 3327, size: 320, elements: !644)
!644 = !{!645, !646, !653}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !643, file: !6, line: 3329, baseType: !285, size: 192)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !643, file: !6, line: 3330, baseType: !647, size: 64, offset: 192)
!647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !648, size: 64)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !6, line: 3320, size: 192, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !648, file: !6, line: 3322, baseType: !647, size: 64)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !648, file: !6, line: 3323, baseType: !647, size: 64, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !648, file: !6, line: 3324, baseType: !246, size: 64, offset: 128)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !643, file: !6, line: 3331, baseType: !647, size: 64, offset: 256)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !249, file: !6, line: 3402, baseType: !655, size: 256)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !6, line: 1540, size: 256, elements: !656)
!656 = !{!657, !658}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !655, file: !6, line: 1541, baseType: !285, size: 192)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !655, file: !6, line: 1542, baseType: !659, size: 64, offset: 192)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !6, line: 1538, baseType: !661)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !6, line: 1538, size: 192, elements: !662)
!662 = !{!663}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !661, file: !6, line: 1538, baseType: !664, size: 192)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !6, line: 1537, baseType: !665)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !6, line: 1537, size: 192, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !665, file: !6, line: 1537, baseType: !7, size: 32)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !665, file: !6, line: 1537, baseType: !7, size: 32, offset: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !665, file: !6, line: 1537, baseType: !670, size: 128, offset: 64)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 128, elements: !329)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !6, line: 1535, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !6, line: 1532, size: 128, elements: !673)
!673 = !{!674, !675}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !672, file: !6, line: 1533, baseType: !246, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !672, file: !6, line: 1534, baseType: !246, size: 64, offset: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !249, file: !6, line: 3403, baseType: !677, size: 512)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !6, line: 1938, size: 512, elements: !678)
!678 = !{!679, !680, !681, !682, !688, !692, !693}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !6, line: 1939, baseType: !285, size: 192)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !677, file: !6, line: 1940, baseType: !353, size: 32, offset: 192)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !677, file: !6, line: 1941, baseType: !5, size: 32, offset: 224)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !677, file: !6, line: 1946, baseType: !683, size: 32, offset: 256)
!683 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !6, line: 1942, size: 32, elements: !684)
!684 = !{!685, !686, !687}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !683, file: !6, line: 1943, baseType: !25, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !683, file: !6, line: 1944, baseType: !32, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !683, file: !6, line: 1945, baseType: !39, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !677, file: !6, line: 1950, baseType: !689, size: 64, offset: 320)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !247, line: 66, baseType: !690)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !247, line: 65, flags: DIFlagFwdDecl)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !677, file: !6, line: 1951, baseType: !689, size: 64, offset: 384)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !677, file: !6, line: 1953, baseType: !566, size: 64, offset: 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !249, file: !6, line: 3404, baseType: !695, size: 1664)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !6, line: 3337, size: 1664, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !695, file: !6, line: 3338, baseType: !285, size: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !695, file: !6, line: 3341, baseType: !699, size: 1472, offset: 192)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !700, line: 410, size: 1472, elements: !701)
!700 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!701 = !{!702, !703, !704, !705, !706, !707, !708, !709, !710, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763, !764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "align_functions", scope: !699, file: !700, line: 412, baseType: !236, size: 32)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "align_jumps", scope: !699, file: !700, line: 413, baseType: !236, size: 32, offset: 32)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "align_labels", scope: !699, file: !700, line: 414, baseType: !236, size: 32, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "align_loops", scope: !699, file: !700, line: 415, baseType: !236, size: 32, offset: 96)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns", scope: !699, file: !700, line: 416, baseType: !236, size: 32, offset: 128)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_stalled_insns_dep", scope: !699, file: !700, line: 417, baseType: !236, size: 32, offset: 160)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "optimize", scope: !699, file: !700, line: 418, baseType: !235, size: 8, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_size", scope: !699, file: !700, line: 419, baseType: !235, size: 8, offset: 200)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "flag_argument_noalias", scope: !699, file: !700, line: 420, baseType: !711, size: 8, offset: 208)
!711 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "flag_asynchronous_unwind_tables", scope: !699, file: !700, line: 421, baseType: !711, size: 8, offset: 216)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_on_count_reg", scope: !699, file: !700, line: 422, baseType: !711, size: 8, offset: 224)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_probabilities", scope: !699, file: !700, line: 423, baseType: !711, size: 8, offset: 232)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize", scope: !699, file: !700, line: 424, baseType: !711, size: 8, offset: 240)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "flag_branch_target_load_optimize2", scope: !699, file: !700, line: 425, baseType: !711, size: 8, offset: 248)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "flag_btr_bb_exclusive", scope: !699, file: !700, line: 426, baseType: !711, size: 8, offset: 256)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "flag_caller_saves", scope: !699, file: !700, line: 427, baseType: !711, size: 8, offset: 264)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_common", scope: !699, file: !700, line: 428, baseType: !711, size: 8, offset: 272)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "flag_conserve_stack", scope: !699, file: !700, line: 429, baseType: !711, size: 8, offset: 280)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cprop_registers", scope: !699, file: !700, line: 430, baseType: !711, size: 8, offset: 288)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "flag_crossjumping", scope: !699, file: !700, line: 431, baseType: !711, size: 8, offset: 296)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cse_follow_jumps", scope: !699, file: !700, line: 432, baseType: !711, size: 8, offset: 304)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_fortran_rules", scope: !699, file: !700, line: 433, baseType: !711, size: 8, offset: 312)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "flag_cx_limited_range", scope: !699, file: !700, line: 434, baseType: !711, size: 8, offset: 320)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "flag_data_sections", scope: !699, file: !700, line: 435, baseType: !711, size: 8, offset: 328)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dce", scope: !699, file: !700, line: 436, baseType: !711, size: 8, offset: 336)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "flag_defer_pop", scope: !699, file: !700, line: 437, baseType: !711, size: 8, offset: 344)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delayed_branch", scope: !699, file: !700, line: 438, baseType: !711, size: 8, offset: 352)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "flag_delete_null_pointer_checks", scope: !699, file: !700, line: 439, baseType: !711, size: 8, offset: 360)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "flag_dse", scope: !699, file: !700, line: 440, baseType: !711, size: 8, offset: 368)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "flag_early_inlining", scope: !699, file: !700, line: 441, baseType: !711, size: 8, offset: 376)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "flag_exceptions", scope: !699, file: !700, line: 442, baseType: !711, size: 8, offset: 384)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "flag_expensive_optimizations", scope: !699, file: !700, line: 443, baseType: !711, size: 8, offset: 392)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "flag_finite_math_only", scope: !699, file: !700, line: 444, baseType: !711, size: 8, offset: 400)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "flag_float_store", scope: !699, file: !700, line: 445, baseType: !711, size: 8, offset: 408)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "flag_forward_propagate", scope: !699, file: !700, line: 446, baseType: !711, size: 8, offset: 416)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse", scope: !699, file: !700, line: 447, baseType: !711, size: 8, offset: 424)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_after_reload", scope: !699, file: !700, line: 448, baseType: !711, size: 8, offset: 432)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_las", scope: !699, file: !700, line: 449, baseType: !711, size: 8, offset: 440)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_lm", scope: !699, file: !700, line: 450, baseType: !711, size: 8, offset: 448)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "flag_gcse_sm", scope: !699, file: !700, line: 451, baseType: !711, size: 8, offset: 456)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "flag_graphite_identity", scope: !699, file: !700, line: 452, baseType: !711, size: 8, offset: 464)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "flag_guess_branch_prob", scope: !699, file: !700, line: 453, baseType: !711, size: 8, offset: 472)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion", scope: !699, file: !700, line: 454, baseType: !711, size: 8, offset: 480)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "flag_if_conversion2", scope: !699, file: !700, line: 455, baseType: !711, size: 8, offset: 488)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions", scope: !699, file: !700, line: 456, baseType: !711, size: 8, offset: 496)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_functions_called_once", scope: !699, file: !700, line: 457, baseType: !711, size: 8, offset: 504)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "flag_inline_small_functions", scope: !699, file: !700, line: 458, baseType: !711, size: 8, offset: 512)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp", scope: !699, file: !700, line: 459, baseType: !711, size: 8, offset: 520)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_cp_clone", scope: !699, file: !700, line: 460, baseType: !711, size: 8, offset: 528)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_matrix_reorg", scope: !699, file: !700, line: 461, baseType: !711, size: 8, offset: 536)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pta", scope: !699, file: !700, line: 462, baseType: !711, size: 8, offset: 544)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_pure_const", scope: !699, file: !700, line: 463, baseType: !711, size: 8, offset: 552)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_reference", scope: !699, file: !700, line: 464, baseType: !711, size: 8, offset: 560)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_sra", scope: !699, file: !700, line: 465, baseType: !711, size: 8, offset: 568)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ipa_type_escape", scope: !699, file: !700, line: 466, baseType: !711, size: 8, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ivopts", scope: !699, file: !700, line: 467, baseType: !711, size: 8, offset: 584)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "flag_jump_tables", scope: !699, file: !700, line: 468, baseType: !711, size: 8, offset: 592)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_block", scope: !699, file: !700, line: 469, baseType: !711, size: 8, offset: 600)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_interchange", scope: !699, file: !700, line: 470, baseType: !711, size: 8, offset: 608)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_parallelize_all", scope: !699, file: !700, line: 471, baseType: !711, size: 8, offset: 616)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "flag_loop_strip_mine", scope: !699, file: !700, line: 472, baseType: !711, size: 8, offset: 624)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "flag_lto_report", scope: !699, file: !700, line: 473, baseType: !711, size: 8, offset: 632)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "flag_ltrans", scope: !699, file: !700, line: 474, baseType: !711, size: 8, offset: 640)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "flag_errno_math", scope: !699, file: !700, line: 475, baseType: !711, size: 8, offset: 648)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "flag_merge_constants", scope: !699, file: !700, line: 476, baseType: !711, size: 8, offset: 656)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "flag_modulo_sched", scope: !699, file: !700, line: 477, baseType: !711, size: 8, offset: 664)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "flag_move_loop_invariants", scope: !699, file: !700, line: 478, baseType: !711, size: 8, offset: 672)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "flag_non_call_exceptions", scope: !699, file: !700, line: 479, baseType: !711, size: 8, offset: 680)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "flag_omit_frame_pointer", scope: !699, file: !700, line: 480, baseType: !711, size: 8, offset: 688)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "flag_regmove", scope: !699, file: !700, line: 481, baseType: !711, size: 8, offset: 696)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "flag_optimize_sibling_calls", scope: !699, file: !700, line: 482, baseType: !711, size: 8, offset: 704)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pack_struct", scope: !699, file: !700, line: 483, baseType: !711, size: 8, offset: 712)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peel_loops", scope: !699, file: !700, line: 484, baseType: !711, size: 8, offset: 720)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "flag_no_peephole", scope: !699, file: !700, line: 485, baseType: !711, size: 8, offset: 728)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "flag_peephole2", scope: !699, file: !700, line: 486, baseType: !711, size: 8, offset: 736)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flag_predictive_commoning", scope: !699, file: !700, line: 487, baseType: !711, size: 8, offset: 744)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "flag_prefetch_loop_arrays", scope: !699, file: !700, line: 488, baseType: !711, size: 8, offset: 752)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "flag_pcc_struct_return", scope: !699, file: !700, line: 489, baseType: !711, size: 8, offset: 760)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rename_registers", scope: !699, file: !700, line: 490, baseType: !711, size: 8, offset: 768)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks", scope: !699, file: !700, line: 491, baseType: !711, size: 8, offset: 776)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_blocks_and_partition", scope: !699, file: !700, line: 492, baseType: !711, size: 8, offset: 784)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "flag_reorder_functions", scope: !699, file: !700, line: 493, baseType: !711, size: 8, offset: 792)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rerun_cse_after_loop", scope: !699, file: !700, line: 494, baseType: !711, size: 8, offset: 800)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "flag_resched_modulo_sched", scope: !699, file: !700, line: 495, baseType: !711, size: 8, offset: 808)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "flag_rounding_math", scope: !699, file: !700, line: 496, baseType: !711, size: 8, offset: 816)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_critical_path_heuristic", scope: !699, file: !700, line: 497, baseType: !711, size: 8, offset: 824)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_dep_count_heuristic", scope: !699, file: !700, line: 498, baseType: !711, size: 8, offset: 832)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_group_heuristic", scope: !699, file: !700, line: 499, baseType: !711, size: 8, offset: 840)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_interblock", scope: !699, file: !700, line: 500, baseType: !711, size: 8, offset: 848)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_last_insn_heuristic", scope: !699, file: !700, line: 501, baseType: !711, size: 8, offset: 856)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_pressure", scope: !699, file: !700, line: 502, baseType: !711, size: 8, offset: 864)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_rank_heuristic", scope: !699, file: !700, line: 503, baseType: !711, size: 8, offset: 872)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative", scope: !699, file: !700, line: 504, baseType: !711, size: 8, offset: 880)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched_spec_insn_heuristic", scope: !699, file: !700, line: 505, baseType: !711, size: 8, offset: 888)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load", scope: !699, file: !700, line: 506, baseType: !711, size: 8, offset: 896)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_speculative_load_dangerous", scope: !699, file: !700, line: 507, baseType: !711, size: 8, offset: 904)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sched2_use_superblocks", scope: !699, file: !700, line: 508, baseType: !711, size: 8, offset: 912)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns", scope: !699, file: !700, line: 509, baseType: !711, size: 8, offset: 920)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "flag_schedule_insns_after_reload", scope: !699, file: !700, line: 510, baseType: !711, size: 8, offset: 928)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "flag_section_anchors", scope: !699, file: !700, line: 511, baseType: !711, size: 8, offset: 936)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining", scope: !699, file: !700, line: 512, baseType: !711, size: 8, offset: 944)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_pipelining_outer_loops", scope: !699, file: !700, line: 513, baseType: !711, size: 8, offset: 952)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "flag_sel_sched_reschedule_pipelined", scope: !699, file: !700, line: 514, baseType: !711, size: 8, offset: 960)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling", scope: !699, file: !700, line: 515, baseType: !711, size: 8, offset: 968)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "flag_selective_scheduling2", scope: !699, file: !700, line: 516, baseType: !711, size: 8, offset: 976)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signaling_nans", scope: !699, file: !700, line: 517, baseType: !711, size: 8, offset: 984)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "flag_signed_zeros", scope: !699, file: !700, line: 518, baseType: !711, size: 8, offset: 992)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "flag_single_precision_constant", scope: !699, file: !700, line: 519, baseType: !711, size: 8, offset: 1000)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_ivs_in_unroller", scope: !699, file: !700, line: 520, baseType: !711, size: 8, offset: 1008)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "flag_split_wide_types", scope: !699, file: !700, line: 521, baseType: !711, size: 8, offset: 1016)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "flag_strict_aliasing", scope: !699, file: !700, line: 522, baseType: !711, size: 8, offset: 1024)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "flag_thread_jumps", scope: !699, file: !700, line: 523, baseType: !711, size: 8, offset: 1032)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "flag_toplevel_reorder", scope: !699, file: !700, line: 524, baseType: !711, size: 8, offset: 1040)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapping_math", scope: !699, file: !700, line: 525, baseType: !711, size: 8, offset: 1048)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "flag_trapv", scope: !699, file: !700, line: 526, baseType: !711, size: 8, offset: 1056)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_builtin_call_dce", scope: !699, file: !700, line: 527, baseType: !711, size: 8, offset: 1064)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ccp", scope: !699, file: !700, line: 528, baseType: !711, size: 8, offset: 1072)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ch", scope: !699, file: !700, line: 529, baseType: !711, size: 8, offset: 1080)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copy_prop", scope: !699, file: !700, line: 530, baseType: !711, size: 8, offset: 1088)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_copyrename", scope: !699, file: !700, line: 531, baseType: !711, size: 8, offset: 1096)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_cselim", scope: !699, file: !700, line: 532, baseType: !711, size: 8, offset: 1104)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dce", scope: !699, file: !700, line: 533, baseType: !711, size: 8, offset: 1112)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dom", scope: !699, file: !700, line: 534, baseType: !711, size: 8, offset: 1120)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_dse", scope: !699, file: !700, line: 535, baseType: !711, size: 8, offset: 1128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_forwprop", scope: !699, file: !700, line: 536, baseType: !711, size: 8, offset: 1136)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_fre", scope: !699, file: !700, line: 537, baseType: !711, size: 8, offset: 1144)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_distribution", scope: !699, file: !700, line: 538, baseType: !711, size: 8, offset: 1152)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_im", scope: !699, file: !700, line: 539, baseType: !711, size: 8, offset: 1160)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_ivcanon", scope: !699, file: !700, line: 540, baseType: !711, size: 8, offset: 1168)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_linear", scope: !699, file: !700, line: 541, baseType: !711, size: 8, offset: 1176)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_loop_optimize", scope: !699, file: !700, line: 542, baseType: !711, size: 8, offset: 1184)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_live_range_split", scope: !699, file: !700, line: 543, baseType: !711, size: 8, offset: 1192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_phiprop", scope: !699, file: !700, line: 544, baseType: !711, size: 8, offset: 1200)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pre", scope: !699, file: !700, line: 545, baseType: !711, size: 8, offset: 1208)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_pta", scope: !699, file: !700, line: 546, baseType: !711, size: 8, offset: 1216)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_reassoc", scope: !699, file: !700, line: 547, baseType: !711, size: 8, offset: 1224)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_scev_cprop", scope: !699, file: !700, line: 548, baseType: !711, size: 8, offset: 1232)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sink", scope: !699, file: !700, line: 549, baseType: !711, size: 8, offset: 1240)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_slp_vectorize", scope: !699, file: !700, line: 550, baseType: !711, size: 8, offset: 1248)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_sra", scope: !699, file: !700, line: 551, baseType: !711, size: 8, offset: 1256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_switch_conversion", scope: !699, file: !700, line: 552, baseType: !711, size: 8, offset: 1264)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_ter", scope: !699, file: !700, line: 553, baseType: !711, size: 8, offset: 1272)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vect_loop_version", scope: !699, file: !700, line: 554, baseType: !711, size: 8, offset: 1280)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vectorize", scope: !699, file: !700, line: 555, baseType: !711, size: 8, offset: 1288)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flag_tree_vrp", scope: !699, file: !700, line: 556, baseType: !711, size: 8, offset: 1296)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unit_at_a_time", scope: !699, file: !700, line: 557, baseType: !711, size: 8, offset: 1304)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_all_loops", scope: !699, file: !700, line: 558, baseType: !711, size: 8, offset: 1312)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unroll_loops", scope: !699, file: !700, line: 559, baseType: !711, size: 8, offset: 1320)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_loop_optimizations", scope: !699, file: !700, line: 560, baseType: !711, size: 8, offset: 1328)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unsafe_math_optimizations", scope: !699, file: !700, line: 561, baseType: !711, size: 8, offset: 1336)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unswitch_loops", scope: !699, file: !700, line: 562, baseType: !711, size: 8, offset: 1344)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "flag_unwind_tables", scope: !699, file: !700, line: 563, baseType: !711, size: 8, offset: 1352)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking", scope: !699, file: !700, line: 564, baseType: !711, size: 8, offset: 1360)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments", scope: !699, file: !700, line: 565, baseType: !711, size: 8, offset: 1368)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_assignments_toggle", scope: !699, file: !700, line: 566, baseType: !711, size: 8, offset: 1376)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "flag_var_tracking_uninit", scope: !699, file: !700, line: 567, baseType: !711, size: 8, offset: 1384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "flag_variable_expansion_in_unroller", scope: !699, file: !700, line: 568, baseType: !711, size: 8, offset: 1392)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "flag_vect_cost_model", scope: !699, file: !700, line: 569, baseType: !711, size: 8, offset: 1400)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "flag_value_profile_transformations", scope: !699, file: !700, line: 570, baseType: !711, size: 8, offset: 1408)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "flag_web", scope: !699, file: !700, line: 571, baseType: !711, size: 8, offset: 1416)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "flag_whole_program", scope: !699, file: !700, line: 572, baseType: !711, size: 8, offset: 1424)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wpa", scope: !699, file: !700, line: 573, baseType: !711, size: 8, offset: 1432)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "flag_wrapv", scope: !699, file: !700, line: 574, baseType: !711, size: 8, offset: 1440)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "target_option", scope: !249, file: !6, line: 3405, baseType: !867, size: 384)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_target_option", file: !6, line: 3352, size: 384, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !6, line: 3353, baseType: !285, size: 192)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !867, file: !6, line: 3356, baseType: !871, size: 192, offset: 192)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_target_option", file: !700, line: 578, size: 192, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags_explicit", scope: !871, file: !700, line: 580, baseType: !236, size: 32)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags_explicit", scope: !871, file: !700, line: 581, baseType: !236, size: 32, offset: 32)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "target_flags", scope: !871, file: !700, line: 582, baseType: !236, size: 32, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ix86_isa_flags", scope: !871, file: !700, line: 583, baseType: !236, size: 32, offset: 96)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !871, file: !700, line: 584, baseType: !235, size: 8, offset: 128)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "arch_specified", scope: !871, file: !700, line: 585, baseType: !235, size: 8, offset: 136)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "branch_cost", scope: !871, file: !700, line: 586, baseType: !235, size: 8, offset: 144)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fpmath", scope: !871, file: !700, line: 587, baseType: !235, size: 8, offset: 152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "schedule", scope: !871, file: !700, line: 588, baseType: !235, size: 8, offset: 160)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "tune", scope: !871, file: !700, line: 589, baseType: !235, size: 8, offset: 168)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "tune_defaulted", scope: !871, file: !700, line: 590, baseType: !235, size: 8, offset: 176)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!886 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !887, size: 64)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "string_pool_data", file: !3, line: 217, size: 128, elements: !888)
!888 = !{!889, !892, !893}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !887, file: !3, line: 222, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nslots", scope: !887, file: !3, line: 223, baseType: !7, size: 32, offset: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "nelements", scope: !887, file: !3, line: 224, baseType: !7, size: 32, offset: 96)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !895, line: 46, baseType: !300)
!895 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!896 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !338, size: 64)
!897 = !{!0, !898, !903, !922, !980}
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "digit_vector", scope: !2, file: !3, line: 43, type: !900, isLocal: false, isDefinition: true)
!900 = !DICompositeType(tag: DW_TAG_array_type, baseType: !242, size: 160, elements: !901)
!901 = !{!902}
!902 = !DISubrange(count: 20)
!903 = !DIGlobalVariableExpression(var: !904, expr: !DIExpression())
!904 = distinct !DIGlobalVariable(name: "gt_ggc_r_gt_stringpool_h", scope: !2, file: !905, line: 87, type: !906, isLocal: false, isDefinition: true)
!905 = !DIFile(filename: "./gt-stringpool.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!906 = !DICompositeType(tag: DW_TAG_array_type, baseType: !907, size: 640, elements: !920)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ggc_root_tab", file: !909, line: 69, size: 320, elements: !910)
!909 = !DIFile(filename: "./ggc.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!910 = !{!911, !912, !913, !914, !919}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !908, file: !909, line: 70, baseType: !240, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "nelt", scope: !908, file: !909, line: 71, baseType: !894, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "stride", scope: !908, file: !909, line: 72, baseType: !894, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !908, file: !909, line: 73, baseType: !915, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "gt_pointer_walker", file: !909, line: 65, baseType: !916)
!916 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !917, size: 64)
!917 = !DISubroutineType(types: !918)
!918 = !{null, !240}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "pchw", scope: !908, file: !909, line: 74, baseType: !915, size: 64, offset: 256)
!920 = !{!921}
!921 = !DISubrange(count: 2)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(name: "ident_hash", scope: !2, file: !3, line: 48, type: !924, isLocal: false, isDefinition: true)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht", file: !343, line: 46, size: 1152, elements: !926)
!926 = !{!927, !959, !962, !968, !972, !973, !974, !977, !978, !979}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "stack", scope: !925, file: !343, line: 49, baseType: !928, size: 704)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !929, line: 164, size: 704, elements: !930)
!929 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!930 = !{!931, !932, !942, !943, !944, !945, !946, !947, !951, !955, !956, !957, !958}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !928, file: !929, line: 166, baseType: !302, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !928, file: !929, line: 167, baseType: !933, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !934, size: 64)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !929, line: 157, size: 192, elements: !935)
!935 = !{!936, !937, !938}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !934, file: !929, line: 159, baseType: !238, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !934, file: !929, line: 160, baseType: !933, size: 64, offset: 64)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !934, file: !929, line: 161, baseType: !939, size: 32, offset: 128)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !239, size: 32, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 4)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !928, file: !929, line: 168, baseType: !238, size: 64, offset: 128)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !928, file: !929, line: 169, baseType: !238, size: 64, offset: 192)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !928, file: !929, line: 170, baseType: !238, size: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !928, file: !929, line: 171, baseType: !302, size: 64, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !928, file: !929, line: 172, baseType: !236, size: 32, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !928, file: !929, line: 176, baseType: !948, size: 64, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DISubroutineType(types: !950)
!950 = !{!933, !240, !302}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !928, file: !929, line: 177, baseType: !952, size: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DISubroutineType(types: !954)
!954 = !{null, !240, !933}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !928, file: !929, line: 178, baseType: !240, size: 64, offset: 576)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !928, file: !929, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !928, file: !929, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !928, file: !929, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !925, file: !343, line: 51, baseType: !960, size: 64, offset: 704)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashnode", file: !343, line: 41, baseType: !891)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_node", scope: !925, file: !343, line: 53, baseType: !963, size: 64, offset: 768)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DISubroutineType(types: !965)
!965 = !{!961, !966}
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "hash_table", file: !343, line: 40, baseType: !925)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_subobject", scope: !925, file: !343, line: 56, baseType: !969, size: 64, offset: 832)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DISubroutineType(types: !971)
!971 = !{!240, !894}
