; ModuleID = 'stub-objc.bc'
source_filename = "stub-objc.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }

!174 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!175 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!176 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!177 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!178 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!179 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!180 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!181 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!182 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!183 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!184 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!185 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!186 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!187 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!188 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!189 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!190 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!191 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!192 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!193 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!194 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!195 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!196 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!197 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!198 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!199 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!200 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!201 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!202 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!203 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!204 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!205 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!206 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!207 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!208 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!209 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!210 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!211 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!212 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!213 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!214 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!215 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!216 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!217 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!218 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!219 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!220 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!221 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!222 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!223 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!224 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!225 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!226 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!227 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!228 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!229 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!230 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!231 = !{!232, !233, !234, !235, !238, !239}
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!234 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64)
!237 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!240 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !237)
!241 = !{i32 2, !"Dwarf Version", i32 4}
!242 = !{i32 2, !"Debug Info Version", i32 3}
!243 = !{i32 1, !"wchar_size", i32 4}
!244 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!245 = distinct !DISubprogram(name: "vprintf", scope: !246, file: !246, line: 39, type: !247, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !257)
!246 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!247 = !DISubroutineType(types: !248)
!248 = !{!234, !249, !250}
!249 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !239)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !1, size: 192, elements: !252)
!252 = !{!253, !254, !255, !256}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !251, file: !1, baseType: !5, size: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !251, file: !1, baseType: !5, size: 32, offset: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !251, file: !1, baseType: !238, size: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !251, file: !1, baseType: !238, size: 64, offset: 128)
!257 = !{!258, !259}
!258 = !DILocalVariable(name: "__fmt", arg: 1, scope: !245, file: !246, line: 39, type: !249)
!259 = !DILocalVariable(name: "__arg", arg: 2, scope: !245, file: !246, line: 39, type: !250)
!260 = !DILocation(line: 0, scope: !245)
!261 = !DILocation(line: 41, column: 20, scope: !245)
!262 = !DILocation(line: 41, column: 10, scope: !245)
!263 = !DILocation(line: 41, column: 3, scope: !245)
!264 = distinct !DISubprogram(name: "getchar", scope: !246, file: !246, line: 47, type: !265, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !267)
!265 = !DISubroutineType(types: !266)
!266 = !{!234}
!267 = !{}
!268 = !DILocation(line: 49, column: 16, scope: !264)
!269 = !DILocation(line: 49, column: 10, scope: !264)
!270 = !DILocation(line: 49, column: 3, scope: !264)
!271 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !246, file: !246, line: 56, type: !272, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !333)
!272 = !DISubroutineType(types: !273)
!273 = !{!234, !274}
!274 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !275, size: 64)
!275 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !276, line: 7, baseType: !277)
!276 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !278, line: 49, size: 1728, elements: !279)
!278 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!279 = !{!280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !295, !297, !298, !299, !303, !305, !307, !311, !314, !316, !319, !322, !323, !324, !328, !329}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !277, file: !278, line: 51, baseType: !234, size: 32)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !277, file: !278, line: 54, baseType: !236, size: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !277, file: !278, line: 55, baseType: !236, size: 64, offset: 128)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !277, file: !278, line: 56, baseType: !236, size: 64, offset: 192)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !277, file: !278, line: 57, baseType: !236, size: 64, offset: 256)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !277, file: !278, line: 58, baseType: !236, size: 64, offset: 320)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !277, file: !278, line: 59, baseType: !236, size: 64, offset: 384)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !277, file: !278, line: 60, baseType: !236, size: 64, offset: 448)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !277, file: !278, line: 61, baseType: !236, size: 64, offset: 512)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !277, file: !278, line: 64, baseType: !236, size: 64, offset: 576)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !277, file: !278, line: 65, baseType: !236, size: 64, offset: 640)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !277, file: !278, line: 66, baseType: !236, size: 64, offset: 704)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !277, file: !278, line: 68, baseType: !293, size: 64, offset: 768)
!293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !294, size: 64)
!294 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !278, line: 36, flags: DIFlagFwdDecl)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !277, file: !278, line: 70, baseType: !296, size: 64, offset: 832)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !277, file: !278, line: 72, baseType: !234, size: 32, offset: 896)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !277, file: !278, line: 73, baseType: !234, size: 32, offset: 928)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !277, file: !278, line: 74, baseType: !300, size: 64, offset: 960)
!300 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !301, line: 152, baseType: !302)
!301 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!302 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !277, file: !278, line: 77, baseType: !304, size: 16, offset: 1024)
!304 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !277, file: !278, line: 78, baseType: !306, size: 8, offset: 1040)
!306 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !277, file: !278, line: 79, baseType: !308, size: 8, offset: 1048)
!308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 8, elements: !309)
!309 = !{!310}
!310 = !DISubrange(count: 1)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !277, file: !278, line: 81, baseType: !312, size: 64, offset: 1088)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !278, line: 43, baseType: null)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !277, file: !278, line: 89, baseType: !315, size: 64, offset: 1152)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !301, line: 153, baseType: !302)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !277, file: !278, line: 91, baseType: !317, size: 64, offset: 1216)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !278, line: 37, flags: DIFlagFwdDecl)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !277, file: !278, line: 92, baseType: !320, size: 64, offset: 1280)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64)
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !278, line: 38, flags: DIFlagFwdDecl)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !277, file: !278, line: 93, baseType: !296, size: 64, offset: 1344)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !277, file: !278, line: 94, baseType: !238, size: 64, offset: 1408)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !277, file: !278, line: 95, baseType: !325, size: 64, offset: 1472)
!325 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !326, line: 46, baseType: !327)
!326 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!327 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !277, file: !278, line: 96, baseType: !234, size: 32, offset: 1536)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !277, file: !278, line: 98, baseType: !330, size: 160, offset: 1568)
!330 = !DICompositeType(tag: DW_TAG_array_type, baseType: !237, size: 160, elements: !331)
!331 = !{!332}
!332 = !DISubrange(count: 20)
!333 = !{!334}
!334 = !DILocalVariable(name: "__fp", arg: 1, scope: !271, file: !246, line: 56, type: !274)
!335 = !DILocation(line: 0, scope: !271)
!336 = !DILocation(line: 58, column: 10, scope: !271)
!337 = !DILocation(line: 58, column: 3, scope: !271)
!338 = distinct !DISubprogram(name: "getc_unlocked", scope: !246, file: !246, line: 66, type: !272, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !339)
!339 = !{!340}
!340 = !DILocalVariable(name: "__fp", arg: 1, scope: !338, file: !246, line: 66, type: !274)
!341 = !DILocation(line: 0, scope: !338)
!342 = !DILocation(line: 68, column: 10, scope: !338)
!343 = !DILocation(line: 68, column: 3, scope: !338)
!344 = distinct !DISubprogram(name: "getchar_unlocked", scope: !246, file: !246, line: 73, type: !265, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !267)
!345 = !DILocation(line: 75, column: 10, scope: !344)
!346 = !DILocation(line: 75, column: 3, scope: !344)
!347 = distinct !DISubprogram(name: "putchar", scope: !246, file: !246, line: 82, type: !348, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !350)
!348 = !DISubroutineType(types: !349)
!349 = !{!234, !234}
!350 = !{!351}
!351 = !DILocalVariable(name: "__c", arg: 1, scope: !347, file: !246, line: 82, type: !234)
!352 = !DILocation(line: 0, scope: !347)
!353 = !DILocation(line: 84, column: 21, scope: !347)
!354 = !DILocation(line: 84, column: 10, scope: !347)
!355 = !DILocation(line: 84, column: 3, scope: !347)
!356 = distinct !DISubprogram(name: "fputc_unlocked", scope: !246, file: !246, line: 91, type: !357, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !359)
!357 = !DISubroutineType(types: !358)
!358 = !{!234, !234, !274}
!359 = !{!360, !361}
!360 = !DILocalVariable(name: "__c", arg: 1, scope: !356, file: !246, line: 91, type: !234)
!361 = !DILocalVariable(name: "__stream", arg: 2, scope: !356, file: !246, line: 91, type: !274)
!362 = !DILocation(line: 0, scope: !356)
!363 = !DILocation(line: 93, column: 10, scope: !356)
!364 = !DILocation(line: 93, column: 3, scope: !356)
!365 = distinct !DISubprogram(name: "putc_unlocked", scope: !246, file: !246, line: 101, type: !357, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !366)
!366 = !{!367, !368}
!367 = !DILocalVariable(name: "__c", arg: 1, scope: !365, file: !246, line: 101, type: !234)
!368 = !DILocalVariable(name: "__stream", arg: 2, scope: !365, file: !246, line: 101, type: !274)
!369 = !DILocation(line: 0, scope: !365)
!370 = !DILocation(line: 103, column: 10, scope: !365)
!371 = !DILocation(line: 103, column: 3, scope: !365)
!372 = distinct !DISubprogram(name: "putchar_unlocked", scope: !246, file: !246, line: 108, type: !348, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !373)
!373 = !{!374}
!374 = !DILocalVariable(name: "__c", arg: 1, scope: !372, file: !246, line: 108, type: !234)
!375 = !DILocation(line: 0, scope: !372)
!376 = !DILocation(line: 110, column: 10, scope: !372)
!377 = !DILocation(line: 110, column: 3, scope: !372)
!378 = distinct !DISubprogram(name: "getline", scope: !246, file: !246, line: 118, type: !379, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !383)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !235, !382, !274}
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !301, line: 193, baseType: !302)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!383 = !{!384, !385, !386}
!384 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !378, file: !246, line: 118, type: !235)
!385 = !DILocalVariable(name: "__n", arg: 2, scope: !378, file: !246, line: 118, type: !382)
!386 = !DILocalVariable(name: "__stream", arg: 3, scope: !378, file: !246, line: 118, type: !274)
!387 = !DILocation(line: 0, scope: !378)
!388 = !DILocation(line: 120, column: 10, scope: !378)
!389 = !DILocation(line: 120, column: 3, scope: !378)
!390 = distinct !DISubprogram(name: "feof_unlocked", scope: !246, file: !246, line: 128, type: !272, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !391)
!391 = !{!392}
!392 = !DILocalVariable(name: "__stream", arg: 1, scope: !390, file: !246, line: 128, type: !274)
!393 = !DILocation(line: 0, scope: !390)
!394 = !DILocation(line: 130, column: 10, scope: !390)
!395 = !DILocation(line: 130, column: 3, scope: !390)
!396 = distinct !DISubprogram(name: "ferror_unlocked", scope: !246, file: !246, line: 135, type: !272, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !397)
!397 = !{!398}
!398 = !DILocalVariable(name: "__stream", arg: 1, scope: !396, file: !246, line: 135, type: !274)
!399 = !DILocation(line: 0, scope: !396)
!400 = !DILocation(line: 137, column: 10, scope: !396)
!401 = !DILocation(line: 137, column: 3, scope: !396)
!402 = distinct !DISubprogram(name: "tolower", scope: !403, file: !403, line: 207, type: !348, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !404)
!403 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!404 = !{!405}
!405 = !DILocalVariable(name: "__c", arg: 1, scope: !402, file: !403, line: 207, type: !234)
!406 = !DILocation(line: 0, scope: !402)
!407 = !DILocation(line: 209, column: 22, scope: !402)
!408 = !DILocation(line: 209, column: 39, scope: !402)
!409 = !DILocation(line: 209, column: 38, scope: !402)
!410 = !DILocation(line: 209, column: 37, scope: !402)
!411 = !DILocation(line: 209, column: 10, scope: !402)
!412 = !DILocation(line: 209, column: 3, scope: !402)
!413 = distinct !DISubprogram(name: "toupper", scope: !403, file: !403, line: 213, type: !348, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !414)
!414 = !{!415}
!415 = !DILocalVariable(name: "__c", arg: 1, scope: !413, file: !403, line: 213, type: !234)
!416 = !DILocation(line: 0, scope: !413)
!417 = !DILocation(line: 215, column: 22, scope: !413)
!418 = !DILocation(line: 215, column: 39, scope: !413)
!419 = !DILocation(line: 215, column: 38, scope: !413)
!420 = !DILocation(line: 215, column: 37, scope: !413)
!421 = !DILocation(line: 215, column: 10, scope: !413)
!422 = !DILocation(line: 215, column: 3, scope: !413)
!423 = distinct !DISubprogram(name: "atoi", scope: !424, file: !424, line: 361, type: !425, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !427)
!424 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!425 = !DISubroutineType(types: !426)
!426 = !{!234, !239}
!427 = !{!428}
!428 = !DILocalVariable(name: "__nptr", arg: 1, scope: !423, file: !424, line: 361, type: !239)
!429 = !DILocation(line: 0, scope: !423)
!430 = !DILocation(line: 363, column: 16, scope: !423)
!431 = !DILocation(line: 363, column: 10, scope: !423)
!432 = !DILocation(line: 363, column: 3, scope: !423)
!433 = distinct !DISubprogram(name: "atol", scope: !424, file: !424, line: 366, type: !434, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !436)
!434 = !DISubroutineType(types: !435)
!435 = !{!302, !239}
!436 = !{!437}
!437 = !DILocalVariable(name: "__nptr", arg: 1, scope: !433, file: !424, line: 366, type: !239)
!438 = !DILocation(line: 0, scope: !433)
!439 = !DILocation(line: 368, column: 10, scope: !433)
!440 = !DILocation(line: 368, column: 3, scope: !433)
!441 = distinct !DISubprogram(name: "atoll", scope: !424, file: !424, line: 373, type: !442, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !445)
!442 = !DISubroutineType(types: !443)
!443 = !{!444, !239}
!444 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!445 = !{!446}
!446 = !DILocalVariable(name: "__nptr", arg: 1, scope: !441, file: !424, line: 373, type: !239)
!447 = !DILocation(line: 0, scope: !441)
!448 = !DILocation(line: 375, column: 10, scope: !441)
!449 = !DILocation(line: 375, column: 3, scope: !441)
!450 = distinct !DISubprogram(name: "bsearch", scope: !451, file: !451, line: 20, type: !452, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !460)
!451 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!452 = !DISubroutineType(types: !453)
!453 = !{!238, !454, !454, !325, !325, !456}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !424, line: 808, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!458 = !DISubroutineType(types: !459)
!459 = !{!234, !454, !454}
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469, !470}
!461 = !DILocalVariable(name: "__key", arg: 1, scope: !450, file: !451, line: 20, type: !454)
!462 = !DILocalVariable(name: "__base", arg: 2, scope: !450, file: !451, line: 20, type: !454)
!463 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !450, file: !451, line: 20, type: !325)
!464 = !DILocalVariable(name: "__size", arg: 4, scope: !450, file: !451, line: 20, type: !325)
!465 = !DILocalVariable(name: "__compar", arg: 5, scope: !450, file: !451, line: 21, type: !456)
!466 = !DILocalVariable(name: "__l", scope: !450, file: !451, line: 23, type: !325)
!467 = !DILocalVariable(name: "__u", scope: !450, file: !451, line: 23, type: !325)
!468 = !DILocalVariable(name: "__idx", scope: !450, file: !451, line: 23, type: !325)
!469 = !DILocalVariable(name: "__p", scope: !450, file: !451, line: 24, type: !454)
!470 = !DILocalVariable(name: "__comparison", scope: !450, file: !451, line: 25, type: !234)
!471 = !DILocation(line: 0, scope: !450)
!472 = !DILocation(line: 29, column: 3, scope: !450)
!473 = !DILocation(line: 27, column: 7, scope: !450)
!474 = !DILocation(line: 29, column: 14, scope: !450)
!475 = !DILocation(line: 31, column: 20, scope: !476)
!476 = distinct !DILexicalBlock(scope: !450, file: !451, line: 30, column: 5)
!477 = !DILocation(line: 31, column: 27, scope: !476)
!478 = !DILocation(line: 32, column: 56, scope: !476)
!479 = !DILocation(line: 32, column: 47, scope: !476)
!480 = !DILocation(line: 33, column: 22, scope: !476)
!481 = !DILocation(line: 34, column: 24, scope: !482)
!482 = distinct !DILexicalBlock(scope: !476, file: !451, line: 34, column: 11)
!483 = !DILocation(line: 34, column: 11, scope: !476)
!484 = !DILocation(line: 36, column: 29, scope: !485)
!485 = distinct !DILexicalBlock(scope: !482, file: !451, line: 36, column: 16)
!486 = !DILocation(line: 36, column: 16, scope: !482)
!487 = !DILocation(line: 37, column: 14, scope: !485)
!488 = distinct !{!488, !472, !489}
!489 = !DILocation(line: 40, column: 5, scope: !450)
!490 = !DILocation(line: 43, column: 1, scope: !450)
!491 = distinct !DISubprogram(name: "atof", scope: !492, file: !492, line: 25, type: !493, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !496)
!492 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!493 = !DISubroutineType(types: !494)
!494 = !{!495, !239}
!495 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!496 = !{!497}
!497 = !DILocalVariable(name: "__nptr", arg: 1, scope: !491, file: !492, line: 25, type: !239)
!498 = !DILocation(line: 0, scope: !491)
!499 = !DILocation(line: 27, column: 10, scope: !491)
!500 = !DILocation(line: 27, column: 3, scope: !491)
!501 = distinct !DISubprogram(name: "strtoimax", scope: !502, file: !502, line: 324, type: !503, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !509)
!502 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!503 = !DISubroutineType(types: !504)
!504 = !{!505, !249, !508, !234}
!505 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !506, line: 101, baseType: !507)
!506 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !301, line: 72, baseType: !302)
!508 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !235)
!509 = !{!510, !511, !512}
!510 = !DILocalVariable(name: "nptr", arg: 1, scope: !501, file: !502, line: 324, type: !249)
!511 = !DILocalVariable(name: "endptr", arg: 2, scope: !501, file: !502, line: 324, type: !508)
!512 = !DILocalVariable(name: "base", arg: 3, scope: !501, file: !502, line: 324, type: !234)
!513 = !DILocation(line: 0, scope: !501)
!514 = !DILocation(line: 327, column: 10, scope: !501)
!515 = !DILocation(line: 327, column: 3, scope: !501)
!516 = distinct !DISubprogram(name: "strtoumax", scope: !502, file: !502, line: 336, type: !517, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !521)
!517 = !DISubroutineType(types: !518)
!518 = !{!519, !249, !508, !234}
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !506, line: 102, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !301, line: 73, baseType: !327)
!521 = !{!522, !523, !524}
!522 = !DILocalVariable(name: "nptr", arg: 1, scope: !516, file: !502, line: 336, type: !249)
!523 = !DILocalVariable(name: "endptr", arg: 2, scope: !516, file: !502, line: 336, type: !508)
!524 = !DILocalVariable(name: "base", arg: 3, scope: !516, file: !502, line: 336, type: !234)
!525 = !DILocation(line: 0, scope: !516)
!526 = !DILocation(line: 339, column: 10, scope: !516)
!527 = !DILocation(line: 339, column: 3, scope: !516)
!528 = distinct !DISubprogram(name: "wcstoimax", scope: !502, file: !502, line: 348, type: !529, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !538)
!529 = !DISubroutineType(types: !530)
!530 = !{!505, !531, !535, !234}
!531 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !532)
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !534)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !502, line: 34, baseType: !234)
!535 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !536)
!536 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!538 = !{!539, !540, !541}
!539 = !DILocalVariable(name: "nptr", arg: 1, scope: !528, file: !502, line: 348, type: !531)
!540 = !DILocalVariable(name: "endptr", arg: 2, scope: !528, file: !502, line: 348, type: !535)
!541 = !DILocalVariable(name: "base", arg: 3, scope: !528, file: !502, line: 348, type: !234)
!542 = !DILocation(line: 0, scope: !528)
!543 = !DILocation(line: 351, column: 10, scope: !528)
!544 = !DILocation(line: 351, column: 3, scope: !528)
!545 = distinct !DISubprogram(name: "wcstoumax", scope: !502, file: !502, line: 362, type: !546, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !548)
!546 = !DISubroutineType(types: !547)
!547 = !{!519, !531, !535, !234}
!548 = !{!549, !550, !551}
!549 = !DILocalVariable(name: "nptr", arg: 1, scope: !545, file: !502, line: 362, type: !531)
!550 = !DILocalVariable(name: "endptr", arg: 2, scope: !545, file: !502, line: 362, type: !535)
!551 = !DILocalVariable(name: "base", arg: 3, scope: !545, file: !502, line: 362, type: !234)
!552 = !DILocation(line: 0, scope: !545)
!553 = !DILocation(line: 365, column: 10, scope: !545)
!554 = !DILocation(line: 365, column: 3, scope: !545)
!555 = distinct !DISubprogram(name: "stat", scope: !556, file: !556, line: 453, type: !557, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !596)
!556 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!557 = !DISubroutineType(types: !558)
!558 = !{!234, !239, !559}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !560, size: 64)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !561, line: 46, size: 1152, elements: !562)
!561 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!562 = !{!563, !565, !567, !569, !571, !573, !575, !576, !577, !578, !580, !582, !590, !591, !592}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !560, file: !561, line: 48, baseType: !564, size: 64)
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !301, line: 145, baseType: !327)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !560, file: !561, line: 53, baseType: !566, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !301, line: 148, baseType: !327)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !560, file: !561, line: 61, baseType: !568, size: 64, offset: 128)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !301, line: 151, baseType: !327)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !560, file: !561, line: 62, baseType: !570, size: 32, offset: 192)
!570 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !301, line: 150, baseType: !5)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !560, file: !561, line: 64, baseType: !572, size: 32, offset: 224)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !301, line: 146, baseType: !5)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !560, file: !561, line: 65, baseType: !574, size: 32, offset: 256)
!574 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !301, line: 147, baseType: !5)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !560, file: !561, line: 67, baseType: !234, size: 32, offset: 288)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !560, file: !561, line: 69, baseType: !564, size: 64, offset: 320)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !560, file: !561, line: 74, baseType: !300, size: 64, offset: 384)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !560, file: !561, line: 78, baseType: !579, size: 64, offset: 448)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !301, line: 174, baseType: !302)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !560, file: !561, line: 80, baseType: !581, size: 64, offset: 512)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !301, line: 179, baseType: !302)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !560, file: !561, line: 91, baseType: !583, size: 128, offset: 576)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !584, line: 10, size: 128, elements: !585)
!584 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!585 = !{!586, !588}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !583, file: !584, line: 12, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !301, line: 160, baseType: !302)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !583, file: !584, line: 16, baseType: !589, size: 64, offset: 64)
!589 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !301, line: 196, baseType: !302)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !560, file: !561, line: 92, baseType: !583, size: 128, offset: 704)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !560, file: !561, line: 93, baseType: !583, size: 128, offset: 832)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !560, file: !561, line: 106, baseType: !593, size: 192, offset: 960)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !589, size: 192, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 3)
!596 = !{!597, !598}
!597 = !DILocalVariable(name: "__path", arg: 1, scope: !555, file: !556, line: 453, type: !239)
!598 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !555, file: !556, line: 453, type: !559)
!599 = !DILocation(line: 0, scope: !555)
!600 = !DILocation(line: 455, column: 10, scope: !555)
!601 = !DILocation(line: 455, column: 3, scope: !555)
!602 = distinct !DISubprogram(name: "lstat", scope: !556, file: !556, line: 460, type: !557, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !603)
!603 = !{!604, !605}
!604 = !DILocalVariable(name: "__path", arg: 1, scope: !602, file: !556, line: 460, type: !239)
!605 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !602, file: !556, line: 460, type: !559)
!606 = !DILocation(line: 0, scope: !602)
!607 = !DILocation(line: 462, column: 10, scope: !602)
!608 = !DILocation(line: 462, column: 3, scope: !602)
!609 = distinct !DISubprogram(name: "fstat", scope: !556, file: !556, line: 467, type: !610, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !612)
!610 = !DISubroutineType(types: !611)
!611 = !{!234, !234, !559}
!612 = !{!613, !614}
!613 = !DILocalVariable(name: "__fd", arg: 1, scope: !609, file: !556, line: 467, type: !234)
!614 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !609, file: !556, line: 467, type: !559)
!615 = !DILocation(line: 0, scope: !609)
!616 = !DILocation(line: 469, column: 10, scope: !609)
!617 = !DILocation(line: 469, column: 3, scope: !609)
!618 = distinct !DISubprogram(name: "fstatat", scope: !556, file: !556, line: 474, type: !619, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !621)
!619 = !DISubroutineType(types: !620)
!620 = !{!234, !234, !239, !559, !234}
!621 = !{!622, !623, !624, !625}
!622 = !DILocalVariable(name: "__fd", arg: 1, scope: !618, file: !556, line: 474, type: !234)
!623 = !DILocalVariable(name: "__filename", arg: 2, scope: !618, file: !556, line: 474, type: !239)
!624 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !618, file: !556, line: 474, type: !559)
!625 = !DILocalVariable(name: "__flag", arg: 4, scope: !618, file: !556, line: 474, type: !234)
!626 = !DILocation(line: 0, scope: !618)
!627 = !DILocation(line: 477, column: 10, scope: !618)
!628 = !DILocation(line: 477, column: 3, scope: !618)
!629 = distinct !DISubprogram(name: "mknod", scope: !556, file: !556, line: 483, type: !630, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!234, !239, !570, !564}
!632 = !{!633, !634, !635}
!633 = !DILocalVariable(name: "__path", arg: 1, scope: !629, file: !556, line: 483, type: !239)
!634 = !DILocalVariable(name: "__mode", arg: 2, scope: !629, file: !556, line: 483, type: !570)
!635 = !DILocalVariable(name: "__dev", arg: 3, scope: !629, file: !556, line: 483, type: !564)
!636 = !DILocation(line: 0, scope: !629)
!637 = !DILocation(line: 485, column: 10, scope: !629)
!638 = !DILocation(line: 485, column: 3, scope: !629)
!639 = distinct !DISubprogram(name: "mknodat", scope: !556, file: !556, line: 491, type: !640, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !642)
!640 = !DISubroutineType(types: !641)
!641 = !{!234, !234, !239, !570, !564}
!642 = !{!643, !644, !645, !646}
!643 = !DILocalVariable(name: "__fd", arg: 1, scope: !639, file: !556, line: 491, type: !234)
!644 = !DILocalVariable(name: "__path", arg: 2, scope: !639, file: !556, line: 491, type: !239)
!645 = !DILocalVariable(name: "__mode", arg: 3, scope: !639, file: !556, line: 491, type: !570)
!646 = !DILocalVariable(name: "__dev", arg: 4, scope: !639, file: !556, line: 491, type: !564)
!647 = !DILocation(line: 0, scope: !639)
!648 = !DILocation(line: 494, column: 10, scope: !639)
!649 = !DILocation(line: 494, column: 3, scope: !639)
!650 = distinct !DISubprogram(name: "stat64", scope: !556, file: !556, line: 502, type: !651, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !673)
!651 = !DISubroutineType(types: !652)
!652 = !{!234, !239, !653}
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !561, line: 119, size: 1152, elements: !655)
!655 = !{!656, !657, !659, !660, !661, !662, !663, !664, !665, !666, !667, !669, !670, !671, !672}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !654, file: !561, line: 121, baseType: !564, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !654, file: !561, line: 123, baseType: !658, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !301, line: 149, baseType: !327)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !654, file: !561, line: 124, baseType: !568, size: 64, offset: 128)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !654, file: !561, line: 125, baseType: !570, size: 32, offset: 192)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !654, file: !561, line: 132, baseType: !572, size: 32, offset: 224)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !654, file: !561, line: 133, baseType: !574, size: 32, offset: 256)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !654, file: !561, line: 135, baseType: !234, size: 32, offset: 288)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !654, file: !561, line: 136, baseType: !564, size: 64, offset: 320)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !654, file: !561, line: 137, baseType: !300, size: 64, offset: 384)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !654, file: !561, line: 143, baseType: !579, size: 64, offset: 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !654, file: !561, line: 144, baseType: !668, size: 64, offset: 512)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !301, line: 180, baseType: !302)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !654, file: !561, line: 152, baseType: !583, size: 128, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !654, file: !561, line: 153, baseType: !583, size: 128, offset: 704)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !654, file: !561, line: 154, baseType: !583, size: 128, offset: 832)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !654, file: !561, line: 164, baseType: !593, size: 192, offset: 960)
!673 = !{!674, !675}
!674 = !DILocalVariable(name: "__path", arg: 1, scope: !650, file: !556, line: 502, type: !239)
!675 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !650, file: !556, line: 502, type: !653)
!676 = !DILocation(line: 0, scope: !650)
!677 = !DILocation(line: 504, column: 10, scope: !650)
!678 = !DILocation(line: 504, column: 3, scope: !650)
!679 = distinct !DISubprogram(name: "lstat64", scope: !556, file: !556, line: 509, type: !651, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !680)
!680 = !{!681, !682}
!681 = !DILocalVariable(name: "__path", arg: 1, scope: !679, file: !556, line: 509, type: !239)
!682 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !679, file: !556, line: 509, type: !653)
!683 = !DILocation(line: 0, scope: !679)
!684 = !DILocation(line: 511, column: 10, scope: !679)
!685 = !DILocation(line: 511, column: 3, scope: !679)
!686 = distinct !DISubprogram(name: "fstat64", scope: !556, file: !556, line: 516, type: !687, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !689)
!687 = !DISubroutineType(types: !688)
!688 = !{!234, !234, !653}
!689 = !{!690, !691}
!690 = !DILocalVariable(name: "__fd", arg: 1, scope: !686, file: !556, line: 516, type: !234)
!691 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !686, file: !556, line: 516, type: !653)
!692 = !DILocation(line: 0, scope: !686)
!693 = !DILocation(line: 518, column: 10, scope: !686)
!694 = !DILocation(line: 518, column: 3, scope: !686)
!695 = distinct !DISubprogram(name: "fstatat64", scope: !556, file: !556, line: 523, type: !696, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !698)
!696 = !DISubroutineType(types: !697)
!697 = !{!234, !234, !239, !653, !234}
!698 = !{!699, !700, !701, !702}
!699 = !DILocalVariable(name: "__fd", arg: 1, scope: !695, file: !556, line: 523, type: !234)
!700 = !DILocalVariable(name: "__filename", arg: 2, scope: !695, file: !556, line: 523, type: !239)
!701 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !695, file: !556, line: 523, type: !653)
!702 = !DILocalVariable(name: "__flag", arg: 4, scope: !695, file: !556, line: 523, type: !234)
!703 = !DILocation(line: 0, scope: !695)
!704 = !DILocation(line: 526, column: 10, scope: !695)
!705 = !DILocation(line: 526, column: 3, scope: !695)
!706 = distinct !DISubprogram(name: "objc_is_class_name", scope: !1, file: !1, line: 30, type: !707, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !1343)
!707 = !DISubroutineType(types: !708)
!708 = !{!709, !709}
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !710, line: 56, baseType: !711)
!710 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !713)
!713 = !{!714, !747, !753, !764, !771, !778, !783, !789, !795, !808, !820, !858, !866, !894, !902, !903, !908, !917, !923, !928, !932, !936, !965, !1014, !1020, !1027, !1034, !1060, !1085, !1102, !1114, !1136, !1154, !1325}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !712, file: !4, line: 3372, baseType: !715, size: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !716)
!716 = !{!717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !715, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !715, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !715, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !715, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !715, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !715, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !715, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !715, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !715, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !715, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !715, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !715, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !715, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !715, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !715, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !715, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !715, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !715, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !715, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !715, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !715, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !715, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !715, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !715, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !715, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !715, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !715, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !715, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !715, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !715, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !712, file: !4, line: 3373, baseType: !748, size: 192)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !748, file: !4, line: 403, baseType: !715, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !748, file: !4, line: 404, baseType: !709, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !4, line: 405, baseType: !709, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !712, file: !4, line: 3374, baseType: !754, size: 320)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !755)
!755 = !{!756, !757}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !754, file: !4, line: 1385, baseType: !748, size: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !754, file: !4, line: 1386, baseType: !758, size: 128, offset: 192)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !759, line: 58, baseType: !760)
!759 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 54, size: 128, elements: !761)
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !760, file: !759, line: 56, baseType: !327, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !760, file: !759, line: 57, baseType: !302, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !712, file: !4, line: 3375, baseType: !765, size: 256)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !766)
!766 = !{!767, !768}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !765, file: !4, line: 1398, baseType: !748, size: 192)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !765, file: !4, line: 1399, baseType: !769, size: 64, offset: 192)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !712, file: !4, line: 3376, baseType: !772, size: 256)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !773)
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !4, line: 1409, baseType: !748, size: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !772, file: !4, line: 1410, baseType: !776, size: 64, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !712, file: !4, line: 3377, baseType: !779, size: 256)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !780)
!780 = !{!781, !782}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !779, file: !4, line: 1438, baseType: !748, size: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !779, file: !4, line: 1439, baseType: !709, size: 64, offset: 192)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !712, file: !4, line: 3378, baseType: !784, size: 256)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !785)
!785 = !{!786, !787, !788}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !4, line: 1419, baseType: !748, size: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !784, file: !4, line: 1420, baseType: !234, size: 32, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !784, file: !4, line: 1421, baseType: !308, size: 8, offset: 224)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !712, file: !4, line: 3379, baseType: !790, size: 320)
!790 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !791)
!791 = !{!792, !793, !794}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !790, file: !4, line: 1429, baseType: !748, size: 192)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !790, file: !4, line: 1430, baseType: !709, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !790, file: !4, line: 1431, baseType: !709, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !712, file: !4, line: 3380, baseType: !796, size: 320)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !796, file: !4, line: 1461, baseType: !748, size: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !796, file: !4, line: 1462, baseType: !800, size: 128, offset: 192)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !801, line: 31, size: 128, elements: !802)
!801 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!802 = !{!803, !806, !807}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !800, file: !801, line: 32, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !800, file: !801, line: 33, baseType: !5, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !800, file: !801, line: 34, baseType: !5, size: 32, offset: 96)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !712, file: !4, line: 3381, baseType: !809, size: 384)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !810)
!810 = !{!811, !812, !817, !818, !819}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !809, file: !4, line: 2508, baseType: !748, size: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !809, file: !4, line: 2509, baseType: !813, size: 32, offset: 192)
!813 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !814, line: 58, baseType: !815)
!814 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !816, line: 44, baseType: !5)
!816 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!817 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !809, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !809, file: !4, line: 2511, baseType: !709, size: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !809, file: !4, line: 2512, baseType: !709, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !712, file: !4, line: 3382, baseType: !821, size: 896)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !822)
!822 = !{!823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !821, file: !4, line: 2653, baseType: !809, size: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !821, file: !4, line: 2654, baseType: !709, size: 64, offset: 384)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !821, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !821, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !821, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !821, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !821, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !821, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !821, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !821, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !821, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !821, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !821, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !821, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !821, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !821, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !821, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !821, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !821, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !821, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !821, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !821, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !821, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !821, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !821, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !821, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !821, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !821, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !821, file: !4, line: 2705, baseType: !709, size: 64, offset: 576)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !821, file: !4, line: 2706, baseType: !709, size: 64, offset: 640)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !821, file: !4, line: 2707, baseType: !709, size: 64, offset: 704)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !821, file: !4, line: 2708, baseType: !709, size: 64, offset: 768)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !821, file: !4, line: 2711, baseType: !856, size: 64, offset: 832)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !712, file: !4, line: 3383, baseType: !859, size: 960)
!859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !860)
!860 = !{!861, !862}
!861 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !859, file: !4, line: 2757, baseType: !821, size: 896)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !859, file: !4, line: 2758, baseType: !863, size: 64, offset: 896)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !710, line: 50, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !710, line: 49, flags: DIFlagFwdDecl)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !712, file: !4, line: 3384, baseType: !867, size: 1472)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !868)
!868 = !{!869, !890, !891, !892, !893}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !867, file: !4, line: 3115, baseType: !870, size: 1216)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !871)
!871 = !{!872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !870, file: !4, line: 2985, baseType: !859, size: 960)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !870, file: !4, line: 2986, baseType: !709, size: 64, offset: 960)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !870, file: !4, line: 2987, baseType: !709, size: 64, offset: 1024)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !870, file: !4, line: 2988, baseType: !709, size: 64, offset: 1088)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !870, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !870, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !870, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !870, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !870, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !870, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !870, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !870, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !870, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !870, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !870, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !870, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !870, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !870, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !867, file: !4, line: 3117, baseType: !709, size: 64, offset: 1216)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !867, file: !4, line: 3119, baseType: !709, size: 64, offset: 1280)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !867, file: !4, line: 3121, baseType: !709, size: 64, offset: 1344)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !867, file: !4, line: 3123, baseType: !709, size: 64, offset: 1408)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !712, file: !4, line: 3385, baseType: !895, size: 1088)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !895, file: !4, line: 2875, baseType: !859, size: 960)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !895, file: !4, line: 2876, baseType: !863, size: 64, offset: 960)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !895, file: !4, line: 2877, baseType: !900, size: 64, offset: 1024)
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !4, line: 2856, flags: DIFlagFwdDecl)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !712, file: !4, line: 3386, baseType: !870, size: 1216)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !712, file: !4, line: 3387, baseType: !904, size: 1280)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !905)
!905 = !{!906, !907}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !904, file: !4, line: 3094, baseType: !870, size: 1216)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !904, file: !4, line: 3095, baseType: !900, size: 64, offset: 1216)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !712, file: !4, line: 3388, baseType: !909, size: 1216)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !916}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !909, file: !4, line: 2825, baseType: !821, size: 896)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !909, file: !4, line: 2827, baseType: !709, size: 64, offset: 896)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !909, file: !4, line: 2828, baseType: !709, size: 64, offset: 960)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !909, file: !4, line: 2829, baseType: !709, size: 64, offset: 1024)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !909, file: !4, line: 2830, baseType: !709, size: 64, offset: 1088)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !909, file: !4, line: 2831, baseType: !709, size: 64, offset: 1152)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !712, file: !4, line: 3389, baseType: !918, size: 1024)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !919)
!919 = !{!920, !921, !922}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !918, file: !4, line: 2851, baseType: !859, size: 960)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !918, file: !4, line: 2852, baseType: !234, size: 32, offset: 960)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !918, file: !4, line: 2853, baseType: !234, size: 32, offset: 992)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !712, file: !4, line: 3390, baseType: !924, size: 1024)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !925)
!925 = !{!926, !927}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !924, file: !4, line: 2858, baseType: !859, size: 960)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !924, file: !4, line: 2859, baseType: !900, size: 64, offset: 960)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !712, file: !4, line: 3391, baseType: !929, size: 960)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !4, line: 2863, baseType: !859, size: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !712, file: !4, line: 3392, baseType: !933, size: 1472)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !934)
!934 = !{!935}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !4, line: 3305, baseType: !867, size: 1472)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !712, file: !4, line: 3393, baseType: !937, size: 1792)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !938)
!938 = !{!939, !940, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !937, file: !4, line: 3249, baseType: !867, size: 1472)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !937, file: !4, line: 3251, baseType: !941, size: 64, offset: 1472)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !942, size: 64)
!942 = !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !943, line: 41, flags: DIFlagFwdDecl)
!943 = !DIFile(filename: "./statistics.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!944 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !937, file: !4, line: 3254, baseType: !709, size: 64, offset: 1536)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !937, file: !4, line: 3257, baseType: !709, size: 64, offset: 1600)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !937, file: !4, line: 3258, baseType: !709, size: 64, offset: 1664)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !937, file: !4, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !937, file: !4, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !937, file: !4, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !937, file: !4, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !937, file: !4, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !937, file: !4, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !937, file: !4, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !937, file: !4, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !937, file: !4, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !937, file: !4, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !937, file: !4, line: 3276, baseType: !5, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !937, file: !4, line: 3277, baseType: !5, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !937, file: !4, line: 3279, baseType: !5, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !937, file: !4, line: 3280, baseType: !5, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !937, file: !4, line: 3281, baseType: !5, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !937, file: !4, line: 3282, baseType: !5, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !937, file: !4, line: 3283, baseType: !5, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !937, file: !4, line: 3284, baseType: !5, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !712, file: !4, line: 3394, baseType: !966, size: 1344)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !4, line: 2279, size: 1344, elements: !967)
!967 = !{!968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !983, !984, !985, !986, !987, !988, !989, !990, !993, !994, !995, !1003, !1004, !1005, !1006, !1007, !1008, !1009, !1010, !1011}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !966, file: !4, line: 2280, baseType: !748, size: 192)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !966, file: !4, line: 2281, baseType: !709, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !966, file: !4, line: 2282, baseType: !709, size: 64, offset: 256)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !966, file: !4, line: 2283, baseType: !709, size: 64, offset: 320)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !966, file: !4, line: 2284, baseType: !709, size: 64, offset: 384)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !966, file: !4, line: 2285, baseType: !5, size: 32, offset: 448)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !966, file: !4, line: 2287, baseType: !5, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !966, file: !4, line: 2288, baseType: !5, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !966, file: !4, line: 2289, baseType: !5, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !966, file: !4, line: 2290, baseType: !5, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !966, file: !4, line: 2291, baseType: !5, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !966, file: !4, line: 2292, baseType: !5, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !966, file: !4, line: 2294, baseType: !5, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !966, file: !4, line: 2296, baseType: !5, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !966, file: !4, line: 2297, baseType: !5, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !966, file: !4, line: 2298, baseType: !5, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !966, file: !4, line: 2299, baseType: !5, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !966, file: !4, line: 2300, baseType: !5, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !966, file: !4, line: 2301, baseType: !5, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !966, file: !4, line: 2302, baseType: !5, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !966, file: !4, line: 2303, baseType: !5, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !966, file: !4, line: 2305, baseType: !5, size: 32, offset: 512)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !966, file: !4, line: 2306, baseType: !991, size: 32, offset: 544)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !992, line: 31, baseType: !234)
!992 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !966, file: !4, line: 2307, baseType: !709, size: 64, offset: 576)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !966, file: !4, line: 2308, baseType: !709, size: 64, offset: 640)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !966, file: !4, line: 2314, baseType: !996, size: 64, offset: 704)
!996 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !4, line: 2309, size: 64, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !996, file: !4, line: 2310, baseType: !234, size: 32)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !996, file: !4, line: 2311, baseType: !239, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !996, file: !4, line: 2312, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !4, line: 2277, flags: DIFlagFwdDecl)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !966, file: !4, line: 2315, baseType: !709, size: 64, offset: 768)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !966, file: !4, line: 2316, baseType: !709, size: 64, offset: 832)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !966, file: !4, line: 2317, baseType: !709, size: 64, offset: 896)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !966, file: !4, line: 2318, baseType: !709, size: 64, offset: 960)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !966, file: !4, line: 2319, baseType: !709, size: 64, offset: 1024)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !966, file: !4, line: 2320, baseType: !709, size: 64, offset: 1088)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !966, file: !4, line: 2321, baseType: !709, size: 64, offset: 1152)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !966, file: !4, line: 2322, baseType: !709, size: 64, offset: 1216)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !966, file: !4, line: 2324, baseType: !1012, size: 64, offset: 1280)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !4, line: 2324, flags: DIFlagFwdDecl)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !712, file: !4, line: 3395, baseType: !1015, size: 320)
!1015 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !4, line: 1469, size: 320, elements: !1016)
!1016 = !{!1017, !1018, !1019}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1015, file: !4, line: 1470, baseType: !748, size: 192)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !1015, file: !4, line: 1471, baseType: !709, size: 64, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !1015, file: !4, line: 1472, baseType: !709, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !712, file: !4, line: 3396, baseType: !1021, size: 320)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !4, line: 1482, size: 320, elements: !1022)
!1022 = !{!1023, !1024, !1025}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1021, file: !4, line: 1483, baseType: !748, size: 192)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1021, file: !4, line: 1484, baseType: !234, size: 32, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !1021, file: !4, line: 1485, baseType: !1026, size: 64, offset: 256)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 64, elements: !309)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !712, file: !4, line: 3397, baseType: !1028, size: 384)
!1028 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !4, line: 1829, size: 384, elements: !1029)
!1029 = !{!1030, !1031, !1032, !1033}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1028, file: !4, line: 1830, baseType: !748, size: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1028, file: !4, line: 1831, baseType: !813, size: 32, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1028, file: !4, line: 1832, baseType: !709, size: 64, offset: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !1028, file: !4, line: 1835, baseType: !1026, size: 64, offset: 320)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !712, file: !4, line: 3398, baseType: !1035, size: 704)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !4, line: 1898, size: 704, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1043, !1044, !1047}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !4, line: 1899, baseType: !748, size: 192)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !1035, file: !4, line: 1902, baseType: !709, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !1035, file: !4, line: 1905, baseType: !1040, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !710, line: 58, baseType: !1041)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !710, line: 57, flags: DIFlagFwdDecl)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !1035, file: !4, line: 1908, baseType: !5, size: 32, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !1035, file: !4, line: 1911, baseType: !1045, size: 64, offset: 384)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !4, line: 1876, flags: DIFlagFwdDecl)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !1035, file: !4, line: 1914, baseType: !1048, size: 256, offset: 448)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !1049)
!1049 = !{!1050, !1052, !1053, !1058}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1048, file: !4, line: 1884, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !4, line: 1885, baseType: !1051, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1048, file: !4, line: 1891, baseType: !1054, size: 64, offset: 128)
!1054 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1048, file: !4, line: 1891, size: 64, elements: !1055)
!1055 = !{!1056, !1057}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1054, file: !4, line: 1891, baseType: !1040, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1054, file: !4, line: 1891, baseType: !709, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1048, file: !4, line: 1892, baseType: !1059, size: 64, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !712, file: !4, line: 3399, baseType: !1061, size: 704)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !4, line: 2008, size: 704, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066, !1067, !1068, !1080, !1081, !1082, !1083, !1084}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1061, file: !4, line: 2009, baseType: !748, size: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1061, file: !4, line: 2011, baseType: !5, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !1061, file: !4, line: 2012, baseType: !5, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1061, file: !4, line: 2014, baseType: !813, size: 32, offset: 224)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1061, file: !4, line: 2016, baseType: !709, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !1061, file: !4, line: 2017, baseType: !1069, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !1072)
!1072 = !{!1073}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1071, file: !4, line: 183, baseType: !1074, size: 128)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !1075)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1075, file: !4, line: 182, baseType: !5, size: 32)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1075, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1075, file: !4, line: 182, baseType: !1026, size: 64, offset: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !1061, file: !4, line: 2019, baseType: !709, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !1061, file: !4, line: 2020, baseType: !709, size: 64, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1061, file: !4, line: 2021, baseType: !709, size: 64, offset: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !1061, file: !4, line: 2022, baseType: !709, size: 64, offset: 576)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !1061, file: !4, line: 2023, baseType: !709, size: 64, offset: 640)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !712, file: !4, line: 3400, baseType: !1086, size: 832)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !4, line: 2430, size: 832, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1094, !1095, !1096, !1097}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1086, file: !4, line: 2431, baseType: !748, size: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1086, file: !4, line: 2433, baseType: !709, size: 64, offset: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !1086, file: !4, line: 2434, baseType: !709, size: 64, offset: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !1086, file: !4, line: 2435, baseType: !709, size: 64, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !1086, file: !4, line: 2436, baseType: !709, size: 64, offset: 384)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !1086, file: !4, line: 2437, baseType: !1069, size: 64, offset: 448)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !1086, file: !4, line: 2438, baseType: !709, size: 64, offset: 512)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !1086, file: !4, line: 2440, baseType: !709, size: 64, offset: 576)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !1086, file: !4, line: 2441, baseType: !709, size: 64, offset: 640)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !1086, file: !4, line: 2443, baseType: !1098, size: 128, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !4, line: 182, baseType: !1099)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !4, line: 182, size: 128, elements: !1100)
!1100 = !{!1101}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1099, file: !4, line: 182, baseType: !1074, size: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !712, file: !4, line: 3401, baseType: !1103, size: 320)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !4, line: 3327, size: 320, elements: !1104)
!1104 = !{!1105, !1106, !1113}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !4, line: 3329, baseType: !748, size: 192)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !1103, file: !4, line: 3330, baseType: !1107, size: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !4, line: 3320, size: 192, elements: !1109)
!1109 = !{!1110, !1111, !1112}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1108, file: !4, line: 3322, baseType: !1107, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1108, file: !4, line: 3323, baseType: !1107, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1108, file: !4, line: 3324, baseType: !709, size: 64, offset: 128)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !1103, file: !4, line: 3331, baseType: !1107, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !712, file: !4, line: 3402, baseType: !1115, size: 256)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !4, line: 1540, size: 256, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !4, line: 1541, baseType: !748, size: 192)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !1115, file: !4, line: 1542, baseType: !1119, size: 64, offset: 192)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !4, line: 1538, baseType: !1121)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !4, line: 1538, size: 192, elements: !1122)
!1122 = !{!1123}
