; ModuleID = 'targhooks.bc'
source_filename = "targhooks.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!2008 = !DIEnumerator(name: "CODE_FOR_vrotrv2di3", value: 2906, isUnsigned: true)
!2009 = !DIEnumerator(name: "CODE_FOR_vrotlv16qi3", value: 2907, isUnsigned: true)
!2010 = !DIEnumerator(name: "CODE_FOR_vrotlv8hi3", value: 2908, isUnsigned: true)
!2011 = !DIEnumerator(name: "CODE_FOR_vrotlv4si3", value: 2909, isUnsigned: true)
!2012 = !DIEnumerator(name: "CODE_FOR_vrotlv2di3", value: 2910, isUnsigned: true)
!2013 = !DIEnumerator(name: "CODE_FOR_vlshrv16qi3", value: 2911, isUnsigned: true)
!2014 = !DIEnumerator(name: "CODE_FOR_vlshrv8hi3", value: 2912, isUnsigned: true)
!2015 = !DIEnumerator(name: "CODE_FOR_vlshrv4si3", value: 2913, isUnsigned: true)
!2016 = !DIEnumerator(name: "CODE_FOR_vashrv16qi3", value: 2914, isUnsigned: true)
!2017 = !DIEnumerator(name: "CODE_FOR_vashrv8hi3", value: 2915, isUnsigned: true)
!2018 = !DIEnumerator(name: "CODE_FOR_vashrv4si3", value: 2916, isUnsigned: true)
!2019 = !DIEnumerator(name: "CODE_FOR_vashlv16qi3", value: 2917, isUnsigned: true)
!2020 = !DIEnumerator(name: "CODE_FOR_vashlv8hi3", value: 2918, isUnsigned: true)
!2021 = !DIEnumerator(name: "CODE_FOR_vashlv4si3", value: 2919, isUnsigned: true)
!2022 = !DIEnumerator(name: "CODE_FOR_ashlv16qi3", value: 2920, isUnsigned: true)
!2023 = !DIEnumerator(name: "CODE_FOR_lshlv16qi3", value: 2921, isUnsigned: true)
!2024 = !DIEnumerator(name: "CODE_FOR_ashrv16qi3", value: 2922, isUnsigned: true)
!2025 = !DIEnumerator(name: "CODE_FOR_ashrv2di3", value: 2923, isUnsigned: true)
!2026 = !DIEnumerator(name: "CODE_FOR_avx_vzeroall", value: 2924, isUnsigned: true)
!2027 = !DIEnumerator(name: "CODE_FOR_avx_vzeroupper", value: 2925, isUnsigned: true)
!2028 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv2df", value: 2932, isUnsigned: true)
!2029 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv4df", value: 2933, isUnsigned: true)
!2030 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv4sf", value: 2934, isUnsigned: true)
!2031 = !DIEnumerator(name: "CODE_FOR_avx_vpermilv8sf", value: 2935, isUnsigned: true)
!2032 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v8si3", value: 2936, isUnsigned: true)
!2033 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v8sf3", value: 2937, isUnsigned: true)
!2034 = !DIEnumerator(name: "CODE_FOR_avx_vperm2f128v4df3", value: 2938, isUnsigned: true)
!2035 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v32qi", value: 2939, isUnsigned: true)
!2036 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v16hi", value: 2940, isUnsigned: true)
!2037 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v8si", value: 2941, isUnsigned: true)
!2038 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v4di", value: 2942, isUnsigned: true)
!2039 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v8sf", value: 2943, isUnsigned: true)
!2040 = !DIEnumerator(name: "CODE_FOR_avx_vinsertf128v4df", value: 2944, isUnsigned: true)
!2041 = !DIEnumerator(name: "CODE_FOR_vec_initv32qi", value: 2945, isUnsigned: true)
!2042 = !DIEnumerator(name: "CODE_FOR_vec_initv16hi", value: 2946, isUnsigned: true)
!2043 = !DIEnumerator(name: "CODE_FOR_vec_initv8si", value: 2947, isUnsigned: true)
!2044 = !DIEnumerator(name: "CODE_FOR_vec_initv4di", value: 2948, isUnsigned: true)
!2045 = !DIEnumerator(name: "CODE_FOR_vec_initv8sf", value: 2949, isUnsigned: true)
!2046 = !DIEnumerator(name: "CODE_FOR_vec_initv4df", value: 2950, isUnsigned: true)
!2047 = !DIEnumerator(name: "CODE_FOR_memory_barrier", value: 2951, isUnsigned: true)
!2048 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapqi", value: 2952, isUnsigned: true)
!2049 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swaphi", value: 2953, isUnsigned: true)
!2050 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapsi", value: 2954, isUnsigned: true)
!2051 = !DIEnumerator(name: "CODE_FOR_sync_compare_and_swapdi", value: 2955, isUnsigned: true)
!2052 = !DIEnumerator(name: "CODE_FOR_nothing", value: 2956, isUnsigned: true)
!2053 = !{!2054, !2055, !2056, !2057, !2060, !2061, !366, !509, !5, !172, !2063, !2064, !2190, !2238}
!2054 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2055, size: 64)
!2055 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2056 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2058, size: 64)
!2058 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2059, size: 64)
!2059 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2062, size: 64)
!2062 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2059)
!2063 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2064 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2065, line: 56, baseType: !2066)
!2065 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2067, size: 64)
!2067 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !140, line: 3371, size: 1792, elements: !2068)
!2068 = !{!2069, !2102, !2108, !2120, !2139, !2150, !2155, !2164, !2170, !2183, !2195, !2233, !2385, !2413, !2421, !2422, !2427, !2436, !2442, !2447, !2451, !2455, !2607, !2654, !2660, !2667, !2674, !2700, !2725, !2742, !2754, !2776, !2792, !2964}
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2067, file: !140, line: 3372, baseType: !2070, size: 64)
!2070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !140, line: 360, size: 64, elements: !2071)
!2071 = !{!2072, !2073, !2074, !2075, !2076, !2077, !2078, !2079, !2080, !2081, !2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099, !2100, !2101}
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2070, file: !140, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2070, file: !140, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2070, file: !140, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2070, file: !140, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2070, file: !140, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2077 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2070, file: !140, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2070, file: !140, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2070, file: !140, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2070, file: !140, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2070, file: !140, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2070, file: !140, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2070, file: !140, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2070, file: !140, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2070, file: !140, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2070, file: !140, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2070, file: !140, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2070, file: !140, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2070, file: !140, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2070, file: !140, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2070, file: !140, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2070, file: !140, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2070, file: !140, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2070, file: !140, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2070, file: !140, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2070, file: !140, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2070, file: !140, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2070, file: !140, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2070, file: !140, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2070, file: !140, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2070, file: !140, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2067, file: !140, line: 3373, baseType: !2103, size: 192)
!2103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !140, line: 402, size: 192, elements: !2104)
!2104 = !{!2105, !2106, !2107}
!2105 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2103, file: !140, line: 403, baseType: !2070, size: 64)
!2106 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2103, file: !140, line: 404, baseType: !2064, size: 64, offset: 64)
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2103, file: !140, line: 405, baseType: !2064, size: 64, offset: 128)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2067, file: !140, line: 3374, baseType: !2109, size: 320)
!2109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !140, line: 1384, size: 320, elements: !2110)
!2110 = !{!2111, !2112}
!2111 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2109, file: !140, line: 1385, baseType: !2103, size: 192)
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2109, file: !140, line: 1386, baseType: !2113, size: 128, offset: 192)
!2113 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2114, line: 58, baseType: !2115)
!2114 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2115 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2114, line: 54, size: 128, elements: !2116)
!2116 = !{!2117, !2118}
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2115, file: !2114, line: 56, baseType: !2063, size: 64)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2115, file: !2114, line: 57, baseType: !2119, size: 64, offset: 64)
!2119 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2067, file: !140, line: 3375, baseType: !2121, size: 256)
!2121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !140, line: 1397, size: 256, elements: !2122)
!2122 = !{!2123, !2124}
!2123 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2121, file: !140, line: 1398, baseType: !2103, size: 192)
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2121, file: !140, line: 1399, baseType: !2125, size: 64, offset: 192)
!2125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2126, size: 64)
!2126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2127, line: 52, size: 256, elements: !2128)
!2127 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2128 = !{!2129, !2130, !2131, !2132, !2133, !2134, !2135}
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2126, file: !2127, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2126, file: !2127, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2126, file: !2127, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2126, file: !2127, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2126, file: !2127, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2126, file: !2127, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2126, file: !2127, line: 62, baseType: !2136, size: 192, offset: 64)
!2136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2063, size: 192, elements: !2137)
!2137 = !{!2138}
!2138 = !DISubrange(count: 3)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2067, file: !140, line: 3376, baseType: !2140, size: 256)
!2140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !140, line: 1408, size: 256, elements: !2141)
!2141 = !{!2142, !2143}
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2140, file: !140, line: 1409, baseType: !2103, size: 192)
!2143 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2140, file: !140, line: 1410, baseType: !2144, size: 64, offset: 192)
!2144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2145, size: 64)
!2145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2146, line: 27, size: 192, elements: !2147)
!2146 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2147 = !{!2148, !2149}
!2148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2145, file: !2146, line: 29, baseType: !2113, size: 128)
!2149 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2145, file: !2146, line: 30, baseType: !5, size: 32, offset: 128)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2067, file: !140, line: 3377, baseType: !2151, size: 256)
!2151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !140, line: 1437, size: 256, elements: !2152)
!2152 = !{!2153, !2154}
!2153 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2151, file: !140, line: 1438, baseType: !2103, size: 192)
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2151, file: !140, line: 1439, baseType: !2064, size: 64, offset: 192)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2067, file: !140, line: 3378, baseType: !2156, size: 256)
!2156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !140, line: 1418, size: 256, elements: !2157)
!2157 = !{!2158, !2159, !2160}
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2156, file: !140, line: 1419, baseType: !2103, size: 192)
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2156, file: !140, line: 1420, baseType: !2056, size: 32, offset: 192)
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2156, file: !140, line: 1421, baseType: !2161, size: 8, offset: 224)
!2161 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2059, size: 8, elements: !2162)
!2162 = !{!2163}
!2163 = !DISubrange(count: 1)
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2067, file: !140, line: 3379, baseType: !2165, size: 320)
!2165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !140, line: 1428, size: 320, elements: !2166)
!2166 = !{!2167, !2168, !2169}
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2165, file: !140, line: 1429, baseType: !2103, size: 192)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2165, file: !140, line: 1430, baseType: !2064, size: 64, offset: 192)
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2165, file: !140, line: 1431, baseType: !2064, size: 64, offset: 256)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2067, file: !140, line: 3380, baseType: !2171, size: 320)
!2171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !140, line: 1460, size: 320, elements: !2172)
!2172 = !{!2173, !2174}
!2173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2171, file: !140, line: 1461, baseType: !2103, size: 192)
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2171, file: !140, line: 1462, baseType: !2175, size: 128, offset: 192)
!2175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2176, line: 31, size: 128, elements: !2177)
!2176 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2177 = !{!2178, !2181, !2182}
!2178 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2175, file: !2176, line: 32, baseType: !2179, size: 64)
!2179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2180, size: 64)
!2180 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2055)
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2175, file: !2176, line: 33, baseType: !7, size: 32, offset: 64)
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2175, file: !2176, line: 34, baseType: !7, size: 32, offset: 96)
!2183 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2067, file: !140, line: 3381, baseType: !2184, size: 384)
!2184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !140, line: 2507, size: 384, elements: !2185)
!2185 = !{!2186, !2187, !2192, !2193, !2194}
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2184, file: !140, line: 2508, baseType: !2103, size: 192)
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2184, file: !140, line: 2509, baseType: !2188, size: 32, offset: 192)
!2188 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2189, line: 58, baseType: !2190)
!2189 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2190 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2191, line: 44, baseType: !7)
!2191 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2184, file: !140, line: 2510, baseType: !7, size: 32, offset: 224)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2184, file: !140, line: 2511, baseType: !2064, size: 64, offset: 256)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2184, file: !140, line: 2512, baseType: !2064, size: 64, offset: 320)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2067, file: !140, line: 3382, baseType: !2196, size: 896)
!2196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !140, line: 2652, size: 896, elements: !2197)
!2197 = !{!2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205, !2206, !2207, !2208, !2209, !2210, !2211, !2212, !2213, !2214, !2215, !2216, !2217, !2218, !2219, !2220, !2221, !2222, !2223, !2224, !2225, !2226, !2227, !2228, !2229, !2230}
!2198 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2196, file: !140, line: 2653, baseType: !2184, size: 384)
!2199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2196, file: !140, line: 2654, baseType: !2064, size: 64, offset: 384)
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2196, file: !140, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2196, file: !140, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2196, file: !140, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2203 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2196, file: !140, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2196, file: !140, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2196, file: !140, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2196, file: !140, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2196, file: !140, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2208 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2196, file: !140, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2209 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2196, file: !140, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2210 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2196, file: !140, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2211 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2196, file: !140, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2196, file: !140, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2213 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2196, file: !140, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2196, file: !140, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2196, file: !140, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2196, file: !140, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2196, file: !140, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2218 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2196, file: !140, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2219 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2196, file: !140, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2196, file: !140, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2196, file: !140, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2196, file: !140, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2223 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2196, file: !140, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2196, file: !140, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2225 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2196, file: !140, line: 2703, baseType: !7, size: 32, offset: 512)
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2196, file: !140, line: 2705, baseType: !2064, size: 64, offset: 576)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2196, file: !140, line: 2706, baseType: !2064, size: 64, offset: 640)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2196, file: !140, line: 2707, baseType: !2064, size: 64, offset: 704)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2196, file: !140, line: 2708, baseType: !2064, size: 64, offset: 768)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2196, file: !140, line: 2711, baseType: !2231, size: 64, offset: 832)
!2231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2232, size: 64)
!2232 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !140, line: 2711, flags: DIFlagFwdDecl)
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2067, file: !140, line: 3383, baseType: !2234, size: 960)
!2234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !140, line: 2756, size: 960, elements: !2235)
!2235 = !{!2236, !2237}
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2234, file: !140, line: 2757, baseType: !2196, size: 896)
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2234, file: !140, line: 2758, baseType: !2238, size: 64, offset: 896)
!2238 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2065, line: 50, baseType: !2239)
!2239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2240, size: 64)
!2240 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !367, line: 240, size: 384, elements: !2241)
!2241 = !{!2242, !2243, !2244, !2245, !2246, !2247, !2248, !2249, !2250, !2251, !2252}
!2242 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2240, file: !367, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2243 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2240, file: !367, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2244 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2240, file: !367, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2240, file: !367, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2240, file: !367, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2247 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2240, file: !367, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2248 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2240, file: !367, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2249 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2240, file: !367, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2240, file: !367, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2251 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2240, file: !367, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2252 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2240, file: !367, line: 321, baseType: !2253, size: 320, offset: 64)
!2253 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !367, line: 315, size: 320, elements: !2254)
!2254 = !{!2255, !2318, !2320, !2383, !2384}
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2253, file: !367, line: 316, baseType: !2256, size: 64)
!2256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2257, size: 64, elements: !2162)
!2257 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !367, line: 183, baseType: !2258)
!2258 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !367, line: 166, size: 64, elements: !2259)
!2259 = !{!2260, !2261, !2262, !2263, !2264, !2272, !2273, !2285, !2288, !2291, !2292, !2295, !2308, !2315}
!2260 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2258, file: !367, line: 168, baseType: !2056, size: 32)
!2261 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2258, file: !367, line: 169, baseType: !7, size: 32)
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2258, file: !367, line: 170, baseType: !2061, size: 64)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2258, file: !367, line: 171, baseType: !2238, size: 64)
!2264 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2258, file: !367, line: 172, baseType: !2265, size: 64)
!2265 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2065, line: 53, baseType: !2266)
!2266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2267, size: 64)
!2267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !367, line: 359, size: 128, elements: !2268)
!2268 = !{!2269, !2270}
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2267, file: !367, line: 360, baseType: !2056, size: 32)
!2270 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2267, file: !367, line: 361, baseType: !2271, size: 64, offset: 64)
!2271 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2238, size: 64, elements: !2162)
!2272 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2258, file: !367, line: 173, baseType: !5, size: 32)
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2258, file: !367, line: 174, baseType: !2274, size: 32)
!2274 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !367, line: 133, baseType: !2275)
!2275 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !367, line: 115, size: 32, elements: !2276)
!2276 = !{!2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284}
!2277 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2275, file: !367, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2275, file: !367, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2275, file: !367, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2280 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2275, file: !367, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2275, file: !367, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2275, file: !367, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2275, file: !367, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2275, file: !367, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2258, file: !367, line: 175, baseType: !2286, size: 64)
!2286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2287, size: 64)
!2287 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !367, line: 175, flags: DIFlagFwdDecl)
!2288 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2258, file: !367, line: 176, baseType: !2289, size: 64)
!2289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2290, size: 64)
!2290 = !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2065, line: 46, flags: DIFlagFwdDecl)
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2258, file: !367, line: 177, baseType: !2064, size: 64)
!2292 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !2258, file: !367, line: 178, baseType: !2293, size: 64)
!2293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2294, size: 64)
!2294 = !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !2065, line: 110, flags: DIFlagFwdDecl)
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !2258, file: !367, line: 179, baseType: !2296, size: 64)
!2296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2297, size: 64)
!2297 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !367, line: 150, baseType: !2298)
!2298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !367, line: 142, size: 320, elements: !2299)
!2299 = !{!2300, !2301, !2302, !2303, !2306, !2307}
!2300 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !2298, file: !367, line: 144, baseType: !2064, size: 64)
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2298, file: !367, line: 145, baseType: !2238, size: 64, offset: 64)
!2302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2298, file: !367, line: 146, baseType: !2238, size: 64, offset: 128)
!2303 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !2298, file: !367, line: 147, baseType: !2304, size: 32, offset: 192)
!2304 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2305, line: 31, baseType: !2056)
!2305 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2298, file: !367, line: 148, baseType: !7, size: 32, offset: 224)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !2298, file: !367, line: 149, baseType: !2055, size: 8, offset: 256)
!2308 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !2258, file: !367, line: 180, baseType: !2309, size: 64)
!2309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2310, size: 64)
!2310 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !367, line: 162, baseType: !2311)
!2311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !367, line: 159, size: 128, elements: !2312)
!2312 = !{!2313, !2314}
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2311, file: !367, line: 160, baseType: !2064, size: 64)
!2314 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2311, file: !367, line: 161, baseType: !2119, size: 64, offset: 64)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !2258, file: !367, line: 181, baseType: !2316, size: 64)
!2316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2317, size: 64)
!2317 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !367, line: 181, flags: DIFlagFwdDecl)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !2253, file: !367, line: 317, baseType: !2319, size: 64)
!2319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2119, size: 64, elements: !2162)
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !2253, file: !367, line: 318, baseType: !2321, size: 320)
!2321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !367, line: 188, size: 320, elements: !2322)
!2322 = !{!2323, !2325, !2382}
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2321, file: !367, line: 190, baseType: !2324, size: 192)
!2324 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2257, size: 192, elements: !2137)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2321, file: !367, line: 193, baseType: !2326, size: 64, offset: 192)
!2326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2327, size: 64)
!2327 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !367, line: 206, size: 320, elements: !2328)
!2328 = !{!2329, !2367, !2368, !2369, !2381}
!2329 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2327, file: !367, line: 208, baseType: !2330, size: 64)
!2330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2331, size: 64)
!2331 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !2065, line: 62, baseType: !2332)
!2332 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2333, line: 538, size: 256, elements: !2334)
!2333 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2334 = !{!2335, !2339, !2345, !2358}
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2332, file: !2333, line: 539, baseType: !2336, size: 32)
!2336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !2333, line: 482, size: 32, elements: !2337)
!2337 = !{!2338}
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2336, file: !2333, line: 484, baseType: !7, size: 32)
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !2332, file: !2333, line: 540, baseType: !2340, size: 192)
!2340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !2333, line: 488, size: 192, elements: !2341)
!2341 = !{!2342, !2343, !2344}
!2342 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2340, file: !2333, line: 489, baseType: !2336, size: 32)
!2343 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2340, file: !2333, line: 492, baseType: !2061, size: 64, offset: 64)
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2340, file: !2333, line: 496, baseType: !2064, size: 64, offset: 128)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !2332, file: !2333, line: 541, baseType: !2346, size: 256)
!2346 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !2333, line: 504, size: 256, elements: !2347)
!2347 = !{!2348, !2349, !2356, !2357}
!2348 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2346, file: !2333, line: 505, baseType: !2336, size: 32)
!2349 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2346, file: !2333, line: 509, baseType: !2350, size: 64, offset: 64)
!2350 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !2333, line: 501, baseType: !2351)
!2351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2352, size: 64)
!2352 = !DISubroutineType(types: !2353)
!2353 = !{null, !2354}
!2354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2355, size: 64)
!2355 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2356 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2346, file: !2333, line: 510, baseType: !2354, size: 64, offset: 128)
!2357 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2346, file: !2333, line: 513, baseType: !2330, size: 64, offset: 192)
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !2332, file: !2333, line: 542, baseType: !2359, size: 128)
!2359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !2333, line: 530, size: 128, elements: !2360)
!2360 = !{!2361, !2362}
!2361 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2359, file: !2333, line: 531, baseType: !2336, size: 32)
!2362 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2359, file: !2333, line: 534, baseType: !2363, size: 64, offset: 64)
!2363 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !2333, line: 525, baseType: !2364)
!2364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2365, size: 64)
!2365 = !DISubroutineType(types: !2366)
!2366 = !{!2055, !2064, !2061, !2063, !2063}
!2367 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2327, file: !367, line: 211, baseType: !7, size: 32, offset: 64)
!2368 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2327, file: !367, line: 214, baseType: !2119, size: 64, offset: 128)
!2369 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2327, file: !367, line: 224, baseType: !2370, size: 64, offset: 192)
!2370 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2371, size: 64)
!2371 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !367, line: 202, baseType: !2372)
!2372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !367, line: 202, size: 128, elements: !2373)
!2373 = !{!2374}
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2372, file: !367, line: 202, baseType: !2375, size: 128)
!2375 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !367, line: 200, baseType: !2376)
!2376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !367, line: 200, size: 128, elements: !2377)
!2377 = !{!2378, !2379, !2380}
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2376, file: !367, line: 200, baseType: !7, size: 32)
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2376, file: !367, line: 200, baseType: !7, size: 32, offset: 32)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2376, file: !367, line: 200, baseType: !2271, size: 64, offset: 64)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2327, file: !367, line: 234, baseType: !2370, size: 64, offset: 256)
!2382 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2321, file: !367, line: 197, baseType: !2119, size: 64, offset: 256)
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !2253, file: !367, line: 319, baseType: !2126, size: 256)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !2253, file: !367, line: 320, baseType: !2145, size: 192)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2067, file: !140, line: 3384, baseType: !2386, size: 1472)
!2386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !140, line: 3114, size: 1472, elements: !2387)
!2387 = !{!2388, !2409, !2410, !2411, !2412}
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2386, file: !140, line: 3115, baseType: !2389, size: 1216)
!2389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !140, line: 2984, size: 1216, elements: !2390)
!2390 = !{!2391, !2392, !2393, !2394, !2395, !2396, !2397, !2398, !2399, !2400, !2401, !2402, !2403, !2404, !2405, !2406, !2407, !2408}
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2389, file: !140, line: 2985, baseType: !2234, size: 960)
!2392 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2389, file: !140, line: 2986, baseType: !2064, size: 64, offset: 960)
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2389, file: !140, line: 2987, baseType: !2064, size: 64, offset: 1024)
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2389, file: !140, line: 2988, baseType: !2064, size: 64, offset: 1088)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2389, file: !140, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2389, file: !140, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2397 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2389, file: !140, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2398 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2389, file: !140, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2389, file: !140, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2400 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2389, file: !140, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2401 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2389, file: !140, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2389, file: !140, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2389, file: !140, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2389, file: !140, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2405 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2389, file: !140, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2406 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2389, file: !140, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2389, file: !140, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2389, file: !140, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2386, file: !140, line: 3117, baseType: !2064, size: 64, offset: 1216)
!2410 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2386, file: !140, line: 3119, baseType: !2064, size: 64, offset: 1280)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2386, file: !140, line: 3121, baseType: !2064, size: 64, offset: 1344)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2386, file: !140, line: 3123, baseType: !2064, size: 64, offset: 1408)
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2067, file: !140, line: 3385, baseType: !2414, size: 1088)
!2414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !140, line: 2874, size: 1088, elements: !2415)
!2415 = !{!2416, !2417, !2418}
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2414, file: !140, line: 2875, baseType: !2234, size: 960)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2414, file: !140, line: 2876, baseType: !2238, size: 64, offset: 960)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2414, file: !140, line: 2877, baseType: !2419, size: 64, offset: 1024)
!2419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2420, size: 64)
!2420 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !140, line: 2856, flags: DIFlagFwdDecl)
!2421 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2067, file: !140, line: 3386, baseType: !2389, size: 1216)
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2067, file: !140, line: 3387, baseType: !2423, size: 1280)
!2423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !140, line: 3093, size: 1280, elements: !2424)
!2424 = !{!2425, !2426}
!2425 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2423, file: !140, line: 3094, baseType: !2389, size: 1216)
!2426 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2423, file: !140, line: 3095, baseType: !2419, size: 64, offset: 1216)
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2067, file: !140, line: 3388, baseType: !2428, size: 1216)
!2428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !140, line: 2824, size: 1216, elements: !2429)
!2429 = !{!2430, !2431, !2432, !2433, !2434, !2435}
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2428, file: !140, line: 2825, baseType: !2196, size: 896)
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2428, file: !140, line: 2827, baseType: !2064, size: 64, offset: 896)
!2432 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2428, file: !140, line: 2828, baseType: !2064, size: 64, offset: 960)
!2433 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2428, file: !140, line: 2829, baseType: !2064, size: 64, offset: 1024)
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2428, file: !140, line: 2830, baseType: !2064, size: 64, offset: 1088)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2428, file: !140, line: 2831, baseType: !2064, size: 64, offset: 1152)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2067, file: !140, line: 3389, baseType: !2437, size: 1024)
!2437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !140, line: 2850, size: 1024, elements: !2438)
!2438 = !{!2439, !2440, !2441}
!2439 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2437, file: !140, line: 2851, baseType: !2234, size: 960)
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2437, file: !140, line: 2852, baseType: !2056, size: 32, offset: 960)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2437, file: !140, line: 2853, baseType: !2056, size: 32, offset: 992)
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2067, file: !140, line: 3390, baseType: !2443, size: 1024)
!2443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !140, line: 2857, size: 1024, elements: !2444)
!2444 = !{!2445, !2446}
!2445 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2443, file: !140, line: 2858, baseType: !2234, size: 960)
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2443, file: !140, line: 2859, baseType: !2419, size: 64, offset: 960)
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2067, file: !140, line: 3391, baseType: !2448, size: 960)
!2448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !140, line: 2862, size: 960, elements: !2449)
!2449 = !{!2450}
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2448, file: !140, line: 2863, baseType: !2234, size: 960)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2067, file: !140, line: 3392, baseType: !2452, size: 1472)
!2452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !140, line: 3304, size: 1472, elements: !2453)
!2453 = !{!2454}
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2452, file: !140, line: 3305, baseType: !2386, size: 1472)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2067, file: !140, line: 3393, baseType: !2456, size: 1792)
!2456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !140, line: 3248, size: 1792, elements: !2457)
!2457 = !{!2458, !2459, !2586, !2587, !2588, !2589, !2590, !2591, !2592, !2593, !2594, !2595, !2596, !2597, !2598, !2599, !2600, !2601, !2602, !2603, !2604, !2605, !2606}
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2456, file: !140, line: 3249, baseType: !2386, size: 1472)
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2456, file: !140, line: 3251, baseType: !2460, size: 64, offset: 1472)
!2460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2461, size: 64)
!2461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2462, line: 463, size: 1152, elements: !2463)
!2462 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2463 = !{!2464, !2467, !2470, !2473, !2476, !2479, !2529, !2530, !2531, !2532, !2533, !2559, !2562, !2563, !2564, !2565, !2566, !2567, !2568, !2569, !2570, !2571, !2572, !2573, !2574, !2575, !2576, !2577, !2578, !2579, !2580, !2581, !2582, !2583, !2584, !2585}
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2461, file: !2462, line: 464, baseType: !2465, size: 64)
!2465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2466, size: 64)
!2466 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2462, line: 464, flags: DIFlagFwdDecl)
!2467 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2461, file: !2462, line: 467, baseType: !2468, size: 64, offset: 64)
!2468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2469, size: 64)
!2469 = !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !2462, line: 467, flags: DIFlagFwdDecl)
!2470 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2461, file: !2462, line: 470, baseType: !2471, size: 64, offset: 128)
!2471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2472, size: 64)
!2472 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2065, line: 65, flags: DIFlagFwdDecl)
!2473 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2461, file: !2462, line: 473, baseType: !2474, size: 64, offset: 192)
!2474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2475, size: 64)
!2475 = !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2462, line: 166, flags: DIFlagFwdDecl)
!2476 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !2461, file: !2462, line: 476, baseType: !2477, size: 64, offset: 256)
!2477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2478, size: 64)
!2478 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !2462, line: 476, flags: DIFlagFwdDecl)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !2461, file: !2462, line: 479, baseType: !2480, size: 64, offset: 320)
!2480 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2481, line: 144, baseType: !2482)
!2481 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2482 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2483, size: 64)
!2483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2481, line: 100, size: 896, elements: !2484)
!2484 = !{!2485, !2491, !2496, !2501, !2503, !2506, !2507, !2508, !2509, !2510, !2515, !2517, !2518, !2523, !2528}
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2483, file: !2481, line: 102, baseType: !2486, size: 64)
!2486 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2481, line: 52, baseType: !2487)
!2487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2488, size: 64)
!2488 = !DISubroutineType(types: !2489)
!2489 = !{!2490, !2354}
!2490 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2481, line: 47, baseType: !7)
!2491 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2483, file: !2481, line: 105, baseType: !2492, size: 64, offset: 64)
!2492 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2481, line: 59, baseType: !2493)
!2493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2494, size: 64)
!2494 = !DISubroutineType(types: !2495)
!2495 = !{!2056, !2354, !2354}
!2496 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2483, file: !2481, line: 108, baseType: !2497, size: 64, offset: 128)
!2497 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2481, line: 63, baseType: !2498)
!2498 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2499, size: 64)
!2499 = !DISubroutineType(types: !2500)
!2500 = !{null, !2060}
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2483, file: !2481, line: 111, baseType: !2502, size: 64, offset: 192)
!2502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2060, size: 64)
!2503 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2483, file: !2481, line: 114, baseType: !2504, size: 64, offset: 256)
!2504 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2505, line: 46, baseType: !2063)
!2505 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2506 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2483, file: !2481, line: 117, baseType: !2504, size: 64, offset: 320)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2483, file: !2481, line: 120, baseType: !2504, size: 64, offset: 384)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2483, file: !2481, line: 124, baseType: !7, size: 32, offset: 448)
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2483, file: !2481, line: 128, baseType: !7, size: 32, offset: 480)
!2510 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2483, file: !2481, line: 131, baseType: !2511, size: 64, offset: 512)
!2511 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2481, line: 75, baseType: !2512)
!2512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2513, size: 64)
!2513 = !DISubroutineType(types: !2514)
!2514 = !{!2060, !2504, !2504}
!2515 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2483, file: !2481, line: 132, baseType: !2516, size: 64, offset: 576)
!2516 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2481, line: 78, baseType: !2498)
!2517 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2483, file: !2481, line: 135, baseType: !2060, size: 64, offset: 640)
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2483, file: !2481, line: 136, baseType: !2519, size: 64, offset: 704)
!2519 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2481, line: 82, baseType: !2520)
!2520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2521, size: 64)
!2521 = !DISubroutineType(types: !2522)
!2522 = !{!2060, !2060, !2504, !2504}
!2523 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2483, file: !2481, line: 137, baseType: !2524, size: 64, offset: 768)
!2524 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2481, line: 83, baseType: !2525)
!2525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2526, size: 64)
!2526 = !DISubroutineType(types: !2527)
!2527 = !{null, !2060, !2060}
!2528 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2483, file: !2481, line: 141, baseType: !7, size: 32, offset: 832)
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2461, file: !2462, line: 484, baseType: !2064, size: 64, offset: 384)
!2530 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !2461, file: !2462, line: 488, baseType: !2064, size: 64, offset: 448)
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !2461, file: !2462, line: 493, baseType: !2064, size: 64, offset: 512)
!2532 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !2461, file: !2462, line: 496, baseType: !2064, size: 64, offset: 576)
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2461, file: !2462, line: 501, baseType: !2534, size: 64, offset: 640)
!2534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2535, size: 64)
!2535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !135, line: 2355, size: 576, elements: !2536)
!2536 = !{!2537, !2540, !2541, !2542, !2543, !2547, !2548, !2553, !2554, !2555, !2556, !2557, !2558}
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2535, file: !135, line: 2356, baseType: !2538, size: 64)
!2538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2539, size: 64)
!2539 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !135, line: 2356, flags: DIFlagFwdDecl)
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2535, file: !135, line: 2357, baseType: !2061, size: 64, offset: 64)
!2541 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2535, file: !135, line: 2358, baseType: !2056, size: 32, offset: 128)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2535, file: !135, line: 2359, baseType: !2056, size: 32, offset: 160)
!2543 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2535, file: !135, line: 2360, baseType: !2544, size: 128, offset: 192)
!2544 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2056, size: 128, elements: !2545)
!2545 = !{!2546}
!2546 = !DISubrange(count: 4)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2535, file: !135, line: 2364, baseType: !2056, size: 32, offset: 320)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2535, file: !135, line: 2367, baseType: !2549, size: 128, offset: 384)
!2549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !135, line: 2349, size: 128, elements: !2550)
!2550 = !{!2551, !2552}
!2551 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2549, file: !135, line: 2351, baseType: !2238, size: 64)
!2552 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2549, file: !135, line: 2352, baseType: !2119, size: 64, offset: 64)
!2553 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2535, file: !135, line: 2371, baseType: !134, size: 32, offset: 512)
!2554 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2535, file: !135, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2535, file: !135, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2535, file: !135, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2557 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2535, file: !135, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2558 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2535, file: !135, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2559 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !2461, file: !2462, line: 504, baseType: !2560, size: 64, offset: 704)
!2560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2561, size: 64)
!2561 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !2462, line: 504, flags: DIFlagFwdDecl)
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !2461, file: !2462, line: 507, baseType: !2480, size: 64, offset: 768)
!2563 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !2461, file: !2462, line: 510, baseType: !2056, size: 32, offset: 832)
!2564 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !2461, file: !2462, line: 513, baseType: !2056, size: 32, offset: 864)
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !2461, file: !2462, line: 516, baseType: !2188, size: 32, offset: 896)
!2566 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !2461, file: !2462, line: 519, baseType: !2188, size: 32, offset: 928)
!2567 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !2461, file: !2462, line: 522, baseType: !7, size: 32, offset: 960)
!2568 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !2461, file: !2462, line: 523, baseType: !7, size: 32, offset: 992)
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !2461, file: !2462, line: 528, baseType: !2061, size: 64, offset: 1024)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !2461, file: !2462, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !2461, file: !2462, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2572 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !2461, file: !2462, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2573 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !2461, file: !2462, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2574 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !2461, file: !2462, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2575 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !2461, file: !2462, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2576 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !2461, file: !2462, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2577 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !2461, file: !2462, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2578 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !2461, file: !2462, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2579 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !2461, file: !2462, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !2461, file: !2462, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2581 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !2461, file: !2462, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2582 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !2461, file: !2462, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2583 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !2461, file: !2462, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !2461, file: !2462, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2585 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !2461, file: !2462, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2586 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !2456, file: !140, line: 3254, baseType: !2064, size: 64, offset: 1536)
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !2456, file: !140, line: 3257, baseType: !2064, size: 64, offset: 1600)
!2588 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !2456, file: !140, line: 3258, baseType: !2064, size: 64, offset: 1664)
!2589 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !2456, file: !140, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2590 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !2456, file: !140, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2591 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !2456, file: !140, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2592 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !2456, file: !140, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !2456, file: !140, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2594 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !2456, file: !140, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !2456, file: !140, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2596 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !2456, file: !140, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2597 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !2456, file: !140, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2598 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !2456, file: !140, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!2599 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !2456, file: !140, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!2600 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !2456, file: !140, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!2601 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !2456, file: !140, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!2602 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !2456, file: !140, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!2603 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !2456, file: !140, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!2604 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !2456, file: !140, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!2605 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !2456, file: !140, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!2606 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !2456, file: !140, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!2607 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2067, file: !140, line: 3394, baseType: !2608, size: 1344)
!2608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !140, line: 2279, size: 1344, elements: !2609)
!2609 = !{!2610, !2611, !2612, !2613, !2614, !2615, !2616, !2617, !2618, !2619, !2620, !2621, !2622, !2623, !2624, !2625, !2626, !2627, !2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2643, !2644, !2645, !2646, !2647, !2648, !2649, !2650, !2651}
!2610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2608, file: !140, line: 2280, baseType: !2103, size: 192)
!2611 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !2608, file: !140, line: 2281, baseType: !2064, size: 64, offset: 192)
!2612 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2608, file: !140, line: 2282, baseType: !2064, size: 64, offset: 256)
!2613 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2608, file: !140, line: 2283, baseType: !2064, size: 64, offset: 320)
!2614 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2608, file: !140, line: 2284, baseType: !2064, size: 64, offset: 384)
!2615 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2608, file: !140, line: 2285, baseType: !7, size: 32, offset: 448)
!2616 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !2608, file: !140, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!2617 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !2608, file: !140, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!2618 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !2608, file: !140, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!2619 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !2608, file: !140, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !2608, file: !140, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!2621 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !2608, file: !140, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!2622 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2608, file: !140, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!2623 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !2608, file: !140, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!2624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2608, file: !140, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!2625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2608, file: !140, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!2626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2608, file: !140, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!2627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2608, file: !140, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!2628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2608, file: !140, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!2629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2608, file: !140, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!2630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2608, file: !140, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!2631 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2608, file: !140, line: 2305, baseType: !7, size: 32, offset: 512)
!2632 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !2608, file: !140, line: 2306, baseType: !2304, size: 32, offset: 544)
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !2608, file: !140, line: 2307, baseType: !2064, size: 64, offset: 576)
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !2608, file: !140, line: 2308, baseType: !2064, size: 64, offset: 640)
!2635 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !2608, file: !140, line: 2314, baseType: !2636, size: 64, offset: 704)
!2636 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !140, line: 2309, size: 64, elements: !2637)
!2637 = !{!2638, !2639, !2640}
!2638 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !2636, file: !140, line: 2310, baseType: !2056, size: 32)
!2639 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !2636, file: !140, line: 2311, baseType: !2061, size: 64)
!2640 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !2636, file: !140, line: 2312, baseType: !2641, size: 64)
!2641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2642, size: 64)
!2642 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !140, line: 2277, flags: DIFlagFwdDecl)
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2608, file: !140, line: 2315, baseType: !2064, size: 64, offset: 768)
!2644 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !2608, file: !140, line: 2316, baseType: !2064, size: 64, offset: 832)
!2645 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !2608, file: !140, line: 2317, baseType: !2064, size: 64, offset: 896)
!2646 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !2608, file: !140, line: 2318, baseType: !2064, size: 64, offset: 960)
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "main_variant", scope: !2608, file: !140, line: 2319, baseType: !2064, size: 64, offset: 1024)
!2648 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !2608, file: !140, line: 2320, baseType: !2064, size: 64, offset: 1088)
!2649 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2608, file: !140, line: 2321, baseType: !2064, size: 64, offset: 1152)
!2650 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2608, file: !140, line: 2322, baseType: !2064, size: 64, offset: 1216)
!2651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2608, file: !140, line: 2324, baseType: !2652, size: 64, offset: 1280)
!2652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2653, size: 64)
!2653 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_type", file: !140, line: 2324, flags: DIFlagFwdDecl)
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !2067, file: !140, line: 3395, baseType: !2655, size: 320)
!2655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_list", file: !140, line: 1469, size: 320, elements: !2656)
!2656 = !{!2657, !2658, !2659}
!2657 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2655, file: !140, line: 1470, baseType: !2103, size: 192)
!2658 = !DIDerivedType(tag: DW_TAG_member, name: "purpose", scope: !2655, file: !140, line: 1471, baseType: !2064, size: 64, offset: 192)
!2659 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2655, file: !140, line: 1472, baseType: !2064, size: 64, offset: 256)
!2660 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2067, file: !140, line: 3396, baseType: !2661, size: 320)
!2661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vec", file: !140, line: 1482, size: 320, elements: !2662)
!2662 = !{!2663, !2664, !2665}
!2663 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2661, file: !140, line: 1483, baseType: !2103, size: 192)
!2664 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2661, file: !140, line: 1484, baseType: !2056, size: 32, offset: 192)
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !2661, file: !140, line: 1485, baseType: !2666, size: 64, offset: 256)
!2666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2064, size: 64, elements: !2162)
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "exp", scope: !2067, file: !140, line: 3397, baseType: !2668, size: 384)
!2668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_exp", file: !140, line: 1829, size: 384, elements: !2669)
!2669 = !{!2670, !2671, !2672, !2673}
!2670 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2668, file: !140, line: 1830, baseType: !2103, size: 192)
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2668, file: !140, line: 1831, baseType: !2188, size: 32, offset: 192)
!2672 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2668, file: !140, line: 1832, baseType: !2064, size: 64, offset: 256)
!2673 = !DIDerivedType(tag: DW_TAG_member, name: "operands", scope: !2668, file: !140, line: 1835, baseType: !2666, size: 64, offset: 320)
!2674 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2067, file: !140, line: 3398, baseType: !2675, size: 704)
!2675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_ssa_name", file: !140, line: 1898, size: 704, elements: !2676)
!2676 = !{!2677, !2678, !2679, !2683, !2684, !2687}
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2675, file: !140, line: 1899, baseType: !2103, size: 192)
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !2675, file: !140, line: 1902, baseType: !2064, size: 64, offset: 192)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "def_stmt", scope: !2675, file: !140, line: 1905, baseType: !2680, size: 64, offset: 256)
!2680 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2065, line: 58, baseType: !2681)
!2681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2682, size: 64)
!2682 = !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !2065, line: 57, flags: DIFlagFwdDecl)
!2683 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !2675, file: !140, line: 1908, baseType: !7, size: 32, offset: 320)
!2684 = !DIDerivedType(tag: DW_TAG_member, name: "ptr_info", scope: !2675, file: !140, line: 1911, baseType: !2685, size: 64, offset: 384)
!2685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2686, size: 64)
!2686 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_info_def", file: !140, line: 1876, flags: DIFlagFwdDecl)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "imm_uses", scope: !2675, file: !140, line: 1914, baseType: !2688, size: 256, offset: 448)
!2688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !140, line: 1883, size: 256, elements: !2689)
!2689 = !{!2690, !2692, !2693, !2698}
!2690 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2688, file: !140, line: 1884, baseType: !2691, size: 64)
!2691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2688, size: 64)
!2692 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2688, file: !140, line: 1885, baseType: !2691, size: 64, offset: 64)
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2688, file: !140, line: 1891, baseType: !2694, size: 64, offset: 128)
!2694 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2688, file: !140, line: 1891, size: 64, elements: !2695)
!2695 = !{!2696, !2697}
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2694, file: !140, line: 1891, baseType: !2680, size: 64)
!2697 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2694, file: !140, line: 1891, baseType: !2064, size: 64)
!2698 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2688, file: !140, line: 1892, baseType: !2699, size: 64, offset: 192)
!2699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2064, size: 64)
!2700 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2067, file: !140, line: 3399, baseType: !2701, size: 704)
!2701 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_block", file: !140, line: 2008, size: 704, elements: !2702)
!2702 = !{!2703, !2704, !2705, !2706, !2707, !2708, !2720, !2721, !2722, !2723, !2724}
!2703 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2701, file: !140, line: 2009, baseType: !2103, size: 192)
!2704 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2701, file: !140, line: 2011, baseType: !7, size: 1, offset: 192, flags: DIFlagBitField, extraData: i64 192)
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "block_num", scope: !2701, file: !140, line: 2012, baseType: !7, size: 31, offset: 193, flags: DIFlagBitField, extraData: i64 192)
!2706 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2701, file: !140, line: 2014, baseType: !2188, size: 32, offset: 224)
!2707 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2701, file: !140, line: 2016, baseType: !2064, size: 64, offset: 256)
!2708 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocalized_vars", scope: !2701, file: !140, line: 2017, baseType: !2709, size: 64, offset: 320)
!2709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2710, size: 64)
!2710 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !140, line: 183, baseType: !2711)
!2711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !140, line: 183, size: 128, elements: !2712)
!2712 = !{!2713}
!2713 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2711, file: !140, line: 183, baseType: !2714, size: 128)
!2714 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !140, line: 182, baseType: !2715)
!2715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !140, line: 182, size: 128, elements: !2716)
!2716 = !{!2717, !2718, !2719}
!2717 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2715, file: !140, line: 182, baseType: !7, size: 32)
!2718 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2715, file: !140, line: 182, baseType: !7, size: 32, offset: 32)
!2719 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2715, file: !140, line: 182, baseType: !2666, size: 64, offset: 64)
!2720 = !DIDerivedType(tag: DW_TAG_member, name: "subblocks", scope: !2701, file: !140, line: 2019, baseType: !2064, size: 64, offset: 384)
!2721 = !DIDerivedType(tag: DW_TAG_member, name: "supercontext", scope: !2701, file: !140, line: 2020, baseType: !2064, size: 64, offset: 448)
!2722 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2701, file: !140, line: 2021, baseType: !2064, size: 64, offset: 512)
!2723 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_origin", scope: !2701, file: !140, line: 2022, baseType: !2064, size: 64, offset: 576)
!2724 = !DIDerivedType(tag: DW_TAG_member, name: "fragment_chain", scope: !2701, file: !140, line: 2023, baseType: !2064, size: 64, offset: 640)
!2725 = !DIDerivedType(tag: DW_TAG_member, name: "binfo", scope: !2067, file: !140, line: 3400, baseType: !2726, size: 832)
!2726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_binfo", file: !140, line: 2430, size: 832, elements: !2727)
!2727 = !{!2728, !2729, !2730, !2731, !2732, !2733, !2734, !2735, !2736, !2737}
!2728 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2726, file: !140, line: 2431, baseType: !2103, size: 192)
!2729 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2726, file: !140, line: 2433, baseType: !2064, size: 64, offset: 192)
!2730 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !2726, file: !140, line: 2434, baseType: !2064, size: 64, offset: 256)
!2731 = !DIDerivedType(tag: DW_TAG_member, name: "virtuals", scope: !2726, file: !140, line: 2435, baseType: !2064, size: 64, offset: 320)
!2732 = !DIDerivedType(tag: DW_TAG_member, name: "vptr_field", scope: !2726, file: !140, line: 2436, baseType: !2064, size: 64, offset: 384)
!2733 = !DIDerivedType(tag: DW_TAG_member, name: "base_accesses", scope: !2726, file: !140, line: 2437, baseType: !2709, size: 64, offset: 448)
!2734 = !DIDerivedType(tag: DW_TAG_member, name: "inheritance", scope: !2726, file: !140, line: 2438, baseType: !2064, size: 64, offset: 512)
!2735 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_subvtt", scope: !2726, file: !140, line: 2440, baseType: !2064, size: 64, offset: 576)
!2736 = !DIDerivedType(tag: DW_TAG_member, name: "vtt_vptr", scope: !2726, file: !140, line: 2441, baseType: !2064, size: 64, offset: 640)
!2737 = !DIDerivedType(tag: DW_TAG_member, name: "base_binfos", scope: !2726, file: !140, line: 2443, baseType: !2738, size: 128, offset: 704)
!2738 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_none", file: !140, line: 182, baseType: !2739)
!2739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_none", file: !140, line: 182, size: 128, elements: !2740)
!2740 = !{!2741}
!2741 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2739, file: !140, line: 182, baseType: !2714, size: 128)
!2742 = !DIDerivedType(tag: DW_TAG_member, name: "stmt_list", scope: !2067, file: !140, line: 3401, baseType: !2743, size: 320)
!2743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list", file: !140, line: 3327, size: 320, elements: !2744)
!2744 = !{!2745, !2746, !2753}
!2745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2743, file: !140, line: 3329, baseType: !2103, size: 192)
!2746 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !2743, file: !140, line: 3330, baseType: !2747, size: 64, offset: 192)
!2747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2748, size: 64)
!2748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_statement_list_node", file: !140, line: 3320, size: 192, elements: !2749)
!2749 = !{!2750, !2751, !2752}
!2750 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2748, file: !140, line: 3322, baseType: !2747, size: 64)
!2751 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2748, file: !140, line: 3323, baseType: !2747, size: 64, offset: 64)
!2752 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2748, file: !140, line: 3324, baseType: !2064, size: 64, offset: 128)
!2753 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !2743, file: !140, line: 3331, baseType: !2747, size: 64, offset: 256)
!2754 = !DIDerivedType(tag: DW_TAG_member, name: "constructor", scope: !2067, file: !140, line: 3402, baseType: !2755, size: 256)
!2755 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_constructor", file: !140, line: 1540, size: 256, elements: !2756)
!2756 = !{!2757, !2758}
!2757 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2755, file: !140, line: 1541, baseType: !2103, size: 192)
!2758 = !DIDerivedType(tag: DW_TAG_member, name: "elts", scope: !2755, file: !140, line: 1542, baseType: !2759, size: 64, offset: 192)
!2759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2760, size: 64)
!2760 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_gc", file: !140, line: 1538, baseType: !2761)
!2761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_gc", file: !140, line: 1538, size: 192, elements: !2762)
!2762 = !{!2763}
!2763 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2761, file: !140, line: 1538, baseType: !2764, size: 192)
!2764 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_constructor_elt_base", file: !140, line: 1537, baseType: !2765)
!2765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_constructor_elt_base", file: !140, line: 1537, size: 192, elements: !2766)
!2766 = !{!2767, !2768, !2769}
!2767 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2765, file: !140, line: 1537, baseType: !7, size: 32)
!2768 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2765, file: !140, line: 1537, baseType: !7, size: 32, offset: 32)
!2769 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2765, file: !140, line: 1537, baseType: !2770, size: 128, offset: 64)
!2770 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2771, size: 128, elements: !2162)
!2771 = !DIDerivedType(tag: DW_TAG_typedef, name: "constructor_elt", file: !140, line: 1535, baseType: !2772)
!2772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "constructor_elt_d", file: !140, line: 1532, size: 128, elements: !2773)
!2773 = !{!2774, !2775}
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2772, file: !140, line: 1533, baseType: !2064, size: 64)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !2772, file: !140, line: 1534, baseType: !2064, size: 64, offset: 64)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "omp_clause", scope: !2067, file: !140, line: 3403, baseType: !2777, size: 512)
!2777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_omp_clause", file: !140, line: 1938, size: 512, elements: !2778)
!2778 = !{!2779, !2780, !2781, !2782, !2788, !2790, !2791}
!2779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2777, file: !140, line: 1939, baseType: !2103, size: 192)
!2780 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2777, file: !140, line: 1940, baseType: !2188, size: 32, offset: 192)
!2781 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2777, file: !140, line: 1941, baseType: !139, size: 32, offset: 224)
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !2777, file: !140, line: 1946, baseType: !2783, size: 32, offset: 256)
!2783 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "omp_clause_subcode", file: !140, line: 1942, size: 32, elements: !2784)
!2784 = !{!2785, !2786, !2787}
!2785 = !DIDerivedType(tag: DW_TAG_member, name: "default_kind", scope: !2783, file: !140, line: 1943, baseType: !158, size: 32)
!2786 = !DIDerivedType(tag: DW_TAG_member, name: "schedule_kind", scope: !2783, file: !140, line: 1944, baseType: !165, size: 32)
!2787 = !DIDerivedType(tag: DW_TAG_member, name: "reduction_code", scope: !2783, file: !140, line: 1945, baseType: !172, size: 32)
!2788 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_init", scope: !2777, file: !140, line: 1950, baseType: !2789, size: 64, offset: 320)
!2789 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2065, line: 66, baseType: !2471)
!2790 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reduction_merge", scope: !2777, file: !140, line: 1951, baseType: !2789, size: 64, offset: 384)
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "ops", scope: !2777, file: !140, line: 1953, baseType: !2666, size: 64, offset: 448)
!2792 = !DIDerivedType(tag: DW_TAG_member, name: "optimization", scope: !2067, file: !140, line: 3404, baseType: !2793, size: 1664)
!2793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_optimization_option", file: !140, line: 3337, size: 1664, elements: !2794)
!2794 = !{!2795, !2796}
!2795 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2793, file: !140, line: 3338, baseType: !2103, size: 192)
!2796 = !DIDerivedType(tag: DW_TAG_member, name: "opts", scope: !2793, file: !140, line: 3341, baseType: !2797, size: 1472, offset: 192)
!2797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cl_optimization", file: !2798, line: 410, size: 1472, elements: !2799)
!2798 = !DIFile(filename: "./options.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2799 = !{!2800, !2801, !2802, !2803, !2804, !2805, !2806, !2807, !2808, !2810, !2811, !2812, !2813, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2827, !2828, !2829, !2830, !2831, !2832, !2833, !2834, !2835, !2836, !2837, !2838, !2839, !2840, !2841, !2842, !2843, !2844, !2845, !2846, !2847, !2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2865, !2866, !2867, !2868, !2869, !2870, !2871, !2872, !2873, !2874, !2875, !2876, !2877, !2878, !2879, !2880, !2881, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922, !2923, !2924, !2925, !2926, !2927, !2928, !2929, !2930, !2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948, !2949, !2950, !2951, !2952, !2953, !2954, !2955, !2956, !2957, !2958, !2959, !2960, !2961, !2962, !2963}
