; ModuleID = 'timevar.bc'
source_filename = "timevar.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.timevar_def = type { %struct.timevar_time_def, %struct.timevar_time_def, i8*, i8 }
%struct.timevar_time_def = type { double, double, double, i32 }
%struct.timevar_stack_def = type { %struct.timevar_def*, %struct.timevar_stack_def* }
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct.stat = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.timespec = type { i64, i64 }
%struct.stat64 = type { i64, i64, i64, i32, i32, i32, i32, i64, i64, i64, i64, %struct.timespec, %struct.timespec, %struct.timespec, [3 x i64] }
%struct.tms = type { i64, i64, i64, i64 }

@stdout = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@stdin = external dso_local local_unnamed_addr global %struct._IO_FILE*, align 8
@timevar_enable = common dso_local local_unnamed_addr global i8 0, align 1, !dbg !0

!124 = !DIEnumerator(name: "TV_TEMPLATE_INSTANTIATION", value: 115, isUnsigned: true)
!125 = !DIEnumerator(name: "TV_EXPAND", value: 116, isUnsigned: true)
!126 = !DIEnumerator(name: "TV_VARCONST", value: 117, isUnsigned: true)
!127 = !DIEnumerator(name: "TV_LOWER_SUBREG", value: 118, isUnsigned: true)
!128 = !DIEnumerator(name: "TV_JUMP", value: 119, isUnsigned: true)
!129 = !DIEnumerator(name: "TV_FWPROP", value: 120, isUnsigned: true)
!130 = !DIEnumerator(name: "TV_CSE", value: 121, isUnsigned: true)
!131 = !DIEnumerator(name: "TV_DCE", value: 122, isUnsigned: true)
!132 = !DIEnumerator(name: "TV_DSE1", value: 123, isUnsigned: true)
!133 = !DIEnumerator(name: "TV_DSE2", value: 124, isUnsigned: true)
!134 = !DIEnumerator(name: "TV_LOOP", value: 125, isUnsigned: true)
!135 = !DIEnumerator(name: "TV_LOOP_MOVE_INVARIANTS", value: 126, isUnsigned: true)
!136 = !DIEnumerator(name: "TV_LOOP_UNSWITCH", value: 127, isUnsigned: true)
!137 = !DIEnumerator(name: "TV_LOOP_UNROLL", value: 128, isUnsigned: true)
!138 = !DIEnumerator(name: "TV_LOOP_DOLOOP", value: 129, isUnsigned: true)
!139 = !DIEnumerator(name: "TV_CPROP", value: 130, isUnsigned: true)
!140 = !DIEnumerator(name: "TV_PRE", value: 131, isUnsigned: true)
!141 = !DIEnumerator(name: "TV_HOIST", value: 132, isUnsigned: true)
!142 = !DIEnumerator(name: "TV_LSM", value: 133, isUnsigned: true)
!143 = !DIEnumerator(name: "TV_TRACER", value: 134, isUnsigned: true)
!144 = !DIEnumerator(name: "TV_WEB", value: 135, isUnsigned: true)
!145 = !DIEnumerator(name: "TV_AUTO_INC_DEC", value: 136, isUnsigned: true)
!146 = !DIEnumerator(name: "TV_CSE2", value: 137, isUnsigned: true)
!147 = !DIEnumerator(name: "TV_BRANCH_PROB", value: 138, isUnsigned: true)
!148 = !DIEnumerator(name: "TV_VPT", value: 139, isUnsigned: true)
!149 = !DIEnumerator(name: "TV_COMBINE", value: 140, isUnsigned: true)
!150 = !DIEnumerator(name: "TV_IFCVT", value: 141, isUnsigned: true)
!151 = !DIEnumerator(name: "TV_REGMOVE", value: 142, isUnsigned: true)
!152 = !DIEnumerator(name: "TV_MODE_SWITCH", value: 143, isUnsigned: true)
!153 = !DIEnumerator(name: "TV_SMS", value: 144, isUnsigned: true)
!154 = !DIEnumerator(name: "TV_SCHED", value: 145, isUnsigned: true)
!155 = !DIEnumerator(name: "TV_LOCAL_ALLOC", value: 146, isUnsigned: true)
!156 = !DIEnumerator(name: "TV_GLOBAL_ALLOC", value: 147, isUnsigned: true)
!157 = !DIEnumerator(name: "TV_IRA", value: 148, isUnsigned: true)
!158 = !DIEnumerator(name: "TV_RELOAD", value: 149, isUnsigned: true)
!159 = !DIEnumerator(name: "TV_RELOAD_CSE_REGS", value: 150, isUnsigned: true)
!160 = !DIEnumerator(name: "TV_SEQABSTR", value: 151, isUnsigned: true)
!161 = !DIEnumerator(name: "TV_GCSE_AFTER_RELOAD", value: 152, isUnsigned: true)
!162 = !DIEnumerator(name: "TV_THREAD_PROLOGUE_AND_EPILOGUE", value: 153, isUnsigned: true)
!163 = !DIEnumerator(name: "TV_IFCVT2", value: 154, isUnsigned: true)
!164 = !DIEnumerator(name: "TV_COMBINE_STACK_ADJUST", value: 155, isUnsigned: true)
!165 = !DIEnumerator(name: "TV_PEEPHOLE2", value: 156, isUnsigned: true)
!166 = !DIEnumerator(name: "TV_RENAME_REGISTERS", value: 157, isUnsigned: true)
!167 = !DIEnumerator(name: "TV_CPROP_REGISTERS", value: 158, isUnsigned: true)
!168 = !DIEnumerator(name: "TV_SCHED2", value: 159, isUnsigned: true)
!169 = !DIEnumerator(name: "TV_MACH_DEP", value: 160, isUnsigned: true)
!170 = !DIEnumerator(name: "TV_DBR_SCHED", value: 161, isUnsigned: true)
!171 = !DIEnumerator(name: "TV_REORDER_BLOCKS", value: 162, isUnsigned: true)
!172 = !DIEnumerator(name: "TV_SHORTEN_BRANCH", value: 163, isUnsigned: true)
!173 = !DIEnumerator(name: "TV_REG_STACK", value: 164, isUnsigned: true)
!174 = !DIEnumerator(name: "TV_FINAL", value: 165, isUnsigned: true)
!175 = !DIEnumerator(name: "TV_SYMOUT", value: 166, isUnsigned: true)
!176 = !DIEnumerator(name: "TV_VAR_TRACKING", value: 167, isUnsigned: true)
!177 = !DIEnumerator(name: "TV_TREE_IFCOMBINE", value: 168, isUnsigned: true)
!178 = !DIEnumerator(name: "TV_PLUGIN_INIT", value: 169, isUnsigned: true)
!179 = !DIEnumerator(name: "TV_PLUGIN_RUN", value: 170, isUnsigned: true)
!180 = !DIEnumerator(name: "TV_REST_OF_COMPILATION", value: 171, isUnsigned: true)
!181 = !DIEnumerator(name: "TIMEVAR_LAST", value: 172, isUnsigned: true)
!182 = !{!183, !184, !185, !186, !189, !190, !192, !193, !7, !212, !213, !214}
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64)
!184 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!185 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !188, size: 64)
!188 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !188)
!192 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timevar_stack_def", file: !3, line: 156, size: 128, elements: !195)
!195 = !{!196, !211}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timevar", scope: !194, file: !3, line: 159, baseType: !197, size: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timevar_def", file: !3, line: 132, size: 640, elements: !199)
!199 = !{!200, !207, !208, !209, !210}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "elapsed", scope: !198, file: !3, line: 135, baseType: !201, size: 256)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timevar_time_def", file: !6, line: 53, size: 256, elements: !202)
!202 = !{!203, !204, !205, !206}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "user", scope: !201, file: !6, line: 56, baseType: !192, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "sys", scope: !201, file: !6, line: 60, baseType: !192, size: 64, offset: 64)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "wall", scope: !201, file: !6, line: 63, baseType: !192, size: 64, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ggc_mem", scope: !201, file: !6, line: 66, baseType: !7, size: 32, offset: 192)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "start_time", scope: !198, file: !3, line: 139, baseType: !201, size: 256, offset: 256)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !198, file: !3, line: 142, baseType: !190, size: 64, offset: 512)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "standalone", scope: !198, file: !3, line: 146, baseType: !7, size: 1, offset: 576, flags: DIFlagBitField, extraData: i64 576)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !198, file: !3, line: 150, baseType: !7, size: 1, offset: 577, flags: DIFlagBitField, extraData: i64 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !3, line: 162, baseType: !193, size: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "timevar_id_t", file: !6, line: 80, baseType: !5)
!213 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!214 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!215 = !{!216, !0, !218, !223, !228, !230, !232}
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "ticks_to_msec", scope: !2, file: !3, line: 105, type: !192, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "timevar_ggc_mem_total", scope: !2, file: !3, line: 121, type: !220, isLocal: false, isDefinition: true)
!220 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !221, line: 46, baseType: !222)
!221 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!222 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!223 = !DIGlobalVariableExpression(var: !224, expr: !DIExpression())
!224 = distinct !DIGlobalVariable(name: "timevars", scope: !2, file: !3, line: 167, type: !225, isLocal: true, isDefinition: true)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !198, size: 110080, elements: !226)
!226 = !{!227}
!227 = !DISubrange(count: 172)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "stack", scope: !2, file: !3, line: 170, type: !193, isLocal: true, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "unused_stack_instances", scope: !2, file: !3, line: 174, type: !193, isLocal: true, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "start_time", scope: !2, file: !3, line: 179, type: !201, isLocal: true, isDefinition: true)
!234 = !{i32 2, !"Dwarf Version", i32 4}
!235 = !{i32 2, !"Debug Info Version", i32 3}
!236 = !{i32 1, !"wchar_size", i32 4}
!237 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!238 = distinct !DISubprogram(name: "vprintf", scope: !239, file: !239, line: 39, type: !240, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !250)
!239 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdio.h", directory: "")
!240 = !DISubroutineType(types: !241)
!241 = !{!185, !242, !243}
!242 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !190)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !3, size: 192, elements: !245)
!245 = !{!246, !247, !248, !249}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !244, file: !3, baseType: !7, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !244, file: !3, baseType: !7, size: 32, offset: 32)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !244, file: !3, baseType: !189, size: 64, offset: 64)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !244, file: !3, baseType: !189, size: 64, offset: 128)
!250 = !{!251, !252}
!251 = !DILocalVariable(name: "__fmt", arg: 1, scope: !238, file: !239, line: 39, type: !242)
!252 = !DILocalVariable(name: "__arg", arg: 2, scope: !238, file: !239, line: 39, type: !243)
!253 = !DILocation(line: 0, scope: !238)
!254 = !DILocation(line: 41, column: 20, scope: !238)
!255 = !DILocation(line: 41, column: 10, scope: !238)
!256 = !DILocation(line: 41, column: 3, scope: !238)
!257 = distinct !DISubprogram(name: "getchar", scope: !239, file: !239, line: 47, type: !258, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!258 = !DISubroutineType(types: !259)
!259 = !{!185}
!260 = !{}
!261 = !DILocation(line: 49, column: 16, scope: !257)
!262 = !DILocation(line: 49, column: 10, scope: !257)
!263 = !DILocation(line: 49, column: 3, scope: !257)
!264 = distinct !DISubprogram(name: "fgetc_unlocked", scope: !239, file: !239, line: 56, type: !265, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !322)
!265 = !DISubroutineType(types: !266)
!266 = !{!185, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !269, line: 7, baseType: !270)
!269 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !271, line: 49, size: 1728, elements: !272)
!271 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !288, !290, !291, !292, !295, !297, !299, !303, !306, !308, !311, !314, !315, !316, !317, !318}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !270, file: !271, line: 51, baseType: !185, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !270, file: !271, line: 54, baseType: !187, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !270, file: !271, line: 55, baseType: !187, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !270, file: !271, line: 56, baseType: !187, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !270, file: !271, line: 57, baseType: !187, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !270, file: !271, line: 58, baseType: !187, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !270, file: !271, line: 59, baseType: !187, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !270, file: !271, line: 60, baseType: !187, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !270, file: !271, line: 61, baseType: !187, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !270, file: !271, line: 64, baseType: !187, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !270, file: !271, line: 65, baseType: !187, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !270, file: !271, line: 66, baseType: !187, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !270, file: !271, line: 68, baseType: !286, size: 64, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !271, line: 36, flags: DIFlagFwdDecl)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !270, file: !271, line: 70, baseType: !289, size: 64, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !270, file: !271, line: 72, baseType: !185, size: 32, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !270, file: !271, line: 73, baseType: !185, size: 32, offset: 928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !270, file: !271, line: 74, baseType: !293, size: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !294, line: 152, baseType: !214)
!294 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !270, file: !271, line: 77, baseType: !296, size: 16, offset: 1024)
!296 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !270, file: !271, line: 78, baseType: !298, size: 8, offset: 1040)
!298 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !270, file: !271, line: 79, baseType: !300, size: 8, offset: 1048)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 8, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 1)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !270, file: !271, line: 81, baseType: !304, size: 64, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !271, line: 43, baseType: null)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !270, file: !271, line: 89, baseType: !307, size: 64, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !294, line: 153, baseType: !214)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !270, file: !271, line: 91, baseType: !309, size: 64, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !271, line: 37, flags: DIFlagFwdDecl)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !270, file: !271, line: 92, baseType: !312, size: 64, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !271, line: 38, flags: DIFlagFwdDecl)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !270, file: !271, line: 93, baseType: !289, size: 64, offset: 1344)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !270, file: !271, line: 94, baseType: !189, size: 64, offset: 1408)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !270, file: !271, line: 95, baseType: !220, size: 64, offset: 1472)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !270, file: !271, line: 96, baseType: !185, size: 32, offset: 1536)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !270, file: !271, line: 98, baseType: !319, size: 160, offset: 1568)
!319 = !DICompositeType(tag: DW_TAG_array_type, baseType: !188, size: 160, elements: !320)
!320 = !{!321}
!321 = !DISubrange(count: 20)
!322 = !{!323}
!323 = !DILocalVariable(name: "__fp", arg: 1, scope: !264, file: !239, line: 56, type: !267)
!324 = !DILocation(line: 0, scope: !264)
!325 = !DILocation(line: 58, column: 10, scope: !264)
!326 = !DILocation(line: 58, column: 3, scope: !264)
!327 = distinct !DISubprogram(name: "getc_unlocked", scope: !239, file: !239, line: 66, type: !265, scopeLine: 67, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !328)
!328 = !{!329}
!329 = !DILocalVariable(name: "__fp", arg: 1, scope: !327, file: !239, line: 66, type: !267)
!330 = !DILocation(line: 0, scope: !327)
!331 = !DILocation(line: 68, column: 10, scope: !327)
!332 = !DILocation(line: 68, column: 3, scope: !327)
!333 = distinct !DISubprogram(name: "getchar_unlocked", scope: !239, file: !239, line: 73, type: !258, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!334 = !DILocation(line: 75, column: 10, scope: !333)
!335 = !DILocation(line: 75, column: 3, scope: !333)
!336 = distinct !DISubprogram(name: "putchar", scope: !239, file: !239, line: 82, type: !337, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !339)
!337 = !DISubroutineType(types: !338)
!338 = !{!185, !185}
!339 = !{!340}
!340 = !DILocalVariable(name: "__c", arg: 1, scope: !336, file: !239, line: 82, type: !185)
!341 = !DILocation(line: 0, scope: !336)
!342 = !DILocation(line: 84, column: 21, scope: !336)
!343 = !DILocation(line: 84, column: 10, scope: !336)
!344 = !DILocation(line: 84, column: 3, scope: !336)
!345 = distinct !DISubprogram(name: "fputc_unlocked", scope: !239, file: !239, line: 91, type: !346, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !348)
!346 = !DISubroutineType(types: !347)
!347 = !{!185, !185, !267}
!348 = !{!349, !350}
!349 = !DILocalVariable(name: "__c", arg: 1, scope: !345, file: !239, line: 91, type: !185)
!350 = !DILocalVariable(name: "__stream", arg: 2, scope: !345, file: !239, line: 91, type: !267)
!351 = !DILocation(line: 0, scope: !345)
!352 = !DILocation(line: 93, column: 10, scope: !345)
!353 = !DILocation(line: 93, column: 3, scope: !345)
!354 = distinct !DISubprogram(name: "putc_unlocked", scope: !239, file: !239, line: 101, type: !346, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !355)
!355 = !{!356, !357}
!356 = !DILocalVariable(name: "__c", arg: 1, scope: !354, file: !239, line: 101, type: !185)
!357 = !DILocalVariable(name: "__stream", arg: 2, scope: !354, file: !239, line: 101, type: !267)
!358 = !DILocation(line: 0, scope: !354)
!359 = !DILocation(line: 103, column: 10, scope: !354)
!360 = !DILocation(line: 103, column: 3, scope: !354)
!361 = distinct !DISubprogram(name: "putchar_unlocked", scope: !239, file: !239, line: 108, type: !337, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !362)
!362 = !{!363}
!363 = !DILocalVariable(name: "__c", arg: 1, scope: !361, file: !239, line: 108, type: !185)
!364 = !DILocation(line: 0, scope: !361)
!365 = !DILocation(line: 110, column: 10, scope: !361)
!366 = !DILocation(line: 110, column: 3, scope: !361)
!367 = distinct !DISubprogram(name: "getline", scope: !239, file: !239, line: 118, type: !368, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !372)
!368 = !DISubroutineType(types: !369)
!369 = !{!370, !186, !371, !267}
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !294, line: 193, baseType: !214)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !220, size: 64)
!372 = !{!373, !374, !375}
!373 = !DILocalVariable(name: "__lineptr", arg: 1, scope: !367, file: !239, line: 118, type: !186)
!374 = !DILocalVariable(name: "__n", arg: 2, scope: !367, file: !239, line: 118, type: !371)
!375 = !DILocalVariable(name: "__stream", arg: 3, scope: !367, file: !239, line: 118, type: !267)
!376 = !DILocation(line: 0, scope: !367)
!377 = !DILocation(line: 120, column: 10, scope: !367)
!378 = !DILocation(line: 120, column: 3, scope: !367)
!379 = distinct !DISubprogram(name: "feof_unlocked", scope: !239, file: !239, line: 128, type: !265, scopeLine: 129, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !380)
!380 = !{!381}
!381 = !DILocalVariable(name: "__stream", arg: 1, scope: !379, file: !239, line: 128, type: !267)
!382 = !DILocation(line: 0, scope: !379)
!383 = !DILocation(line: 130, column: 10, scope: !379)
!384 = !DILocation(line: 130, column: 3, scope: !379)
!385 = distinct !DISubprogram(name: "ferror_unlocked", scope: !239, file: !239, line: 135, type: !265, scopeLine: 136, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !386)
!386 = !{!387}
!387 = !DILocalVariable(name: "__stream", arg: 1, scope: !385, file: !239, line: 135, type: !267)
!388 = !DILocation(line: 0, scope: !385)
!389 = !DILocation(line: 137, column: 10, scope: !385)
!390 = !DILocation(line: 137, column: 3, scope: !385)
!391 = distinct !DISubprogram(name: "tolower", scope: !392, file: !392, line: 207, type: !337, scopeLine: 208, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !393)
!392 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!393 = !{!394}
!394 = !DILocalVariable(name: "__c", arg: 1, scope: !391, file: !392, line: 207, type: !185)
!395 = !DILocation(line: 0, scope: !391)
!396 = !DILocation(line: 209, column: 22, scope: !391)
!397 = !DILocation(line: 209, column: 39, scope: !391)
!398 = !DILocation(line: 209, column: 38, scope: !391)
!399 = !DILocation(line: 209, column: 37, scope: !391)
!400 = !DILocation(line: 209, column: 10, scope: !391)
!401 = !DILocation(line: 209, column: 3, scope: !391)
!402 = distinct !DISubprogram(name: "toupper", scope: !392, file: !392, line: 213, type: !337, scopeLine: 214, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !403)
!403 = !{!404}
!404 = !DILocalVariable(name: "__c", arg: 1, scope: !402, file: !392, line: 213, type: !185)
!405 = !DILocation(line: 0, scope: !402)
!406 = !DILocation(line: 215, column: 22, scope: !402)
!407 = !DILocation(line: 215, column: 39, scope: !402)
!408 = !DILocation(line: 215, column: 38, scope: !402)
!409 = !DILocation(line: 215, column: 37, scope: !402)
!410 = !DILocation(line: 215, column: 10, scope: !402)
!411 = !DILocation(line: 215, column: 3, scope: !402)
!412 = distinct !DISubprogram(name: "atoi", scope: !413, file: !413, line: 361, type: !414, scopeLine: 362, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !416)
!413 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!414 = !DISubroutineType(types: !415)
!415 = !{!185, !190}
!416 = !{!417}
!417 = !DILocalVariable(name: "__nptr", arg: 1, scope: !412, file: !413, line: 361, type: !190)
!418 = !DILocation(line: 0, scope: !412)
!419 = !DILocation(line: 363, column: 16, scope: !412)
!420 = !DILocation(line: 363, column: 10, scope: !412)
!421 = !DILocation(line: 363, column: 3, scope: !412)
!422 = distinct !DISubprogram(name: "atol", scope: !413, file: !413, line: 366, type: !423, scopeLine: 367, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !425)
!423 = !DISubroutineType(types: !424)
!424 = !{!214, !190}
!425 = !{!426}
!426 = !DILocalVariable(name: "__nptr", arg: 1, scope: !422, file: !413, line: 366, type: !190)
!427 = !DILocation(line: 0, scope: !422)
!428 = !DILocation(line: 368, column: 10, scope: !422)
!429 = !DILocation(line: 368, column: 3, scope: !422)
!430 = distinct !DISubprogram(name: "atoll", scope: !413, file: !413, line: 373, type: !431, scopeLine: 374, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !434)
!431 = !DISubroutineType(types: !432)
!432 = !{!433, !190}
!433 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!434 = !{!435}
!435 = !DILocalVariable(name: "__nptr", arg: 1, scope: !430, file: !413, line: 373, type: !190)
!436 = !DILocation(line: 0, scope: !430)
!437 = !DILocation(line: 375, column: 10, scope: !430)
!438 = !DILocation(line: 375, column: 3, scope: !430)
!439 = distinct !DISubprogram(name: "bsearch", scope: !440, file: !440, line: 20, type: !441, scopeLine: 22, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !449)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-bsearch.h", directory: "")
!441 = !DISubroutineType(types: !442)
!442 = !{!189, !443, !443, !220, !220, !445}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !413, line: 808, baseType: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !447, size: 64)
!447 = !DISubroutineType(types: !448)
!448 = !{!185, !443, !443}
!449 = !{!450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!450 = !DILocalVariable(name: "__key", arg: 1, scope: !439, file: !440, line: 20, type: !443)
!451 = !DILocalVariable(name: "__base", arg: 2, scope: !439, file: !440, line: 20, type: !443)
!452 = !DILocalVariable(name: "__nmemb", arg: 3, scope: !439, file: !440, line: 20, type: !220)
!453 = !DILocalVariable(name: "__size", arg: 4, scope: !439, file: !440, line: 20, type: !220)
!454 = !DILocalVariable(name: "__compar", arg: 5, scope: !439, file: !440, line: 21, type: !445)
!455 = !DILocalVariable(name: "__l", scope: !439, file: !440, line: 23, type: !220)
!456 = !DILocalVariable(name: "__u", scope: !439, file: !440, line: 23, type: !220)
!457 = !DILocalVariable(name: "__idx", scope: !439, file: !440, line: 23, type: !220)
!458 = !DILocalVariable(name: "__p", scope: !439, file: !440, line: 24, type: !443)
!459 = !DILocalVariable(name: "__comparison", scope: !439, file: !440, line: 25, type: !185)
!460 = !DILocation(line: 0, scope: !439)
!461 = !DILocation(line: 29, column: 3, scope: !439)
!462 = !DILocation(line: 27, column: 7, scope: !439)
!463 = !DILocation(line: 29, column: 14, scope: !439)
!464 = !DILocation(line: 31, column: 20, scope: !465)
!465 = distinct !DILexicalBlock(scope: !439, file: !440, line: 30, column: 5)
!466 = !DILocation(line: 31, column: 27, scope: !465)
!467 = !DILocation(line: 32, column: 56, scope: !465)
!468 = !DILocation(line: 32, column: 47, scope: !465)
!469 = !DILocation(line: 33, column: 22, scope: !465)
!470 = !DILocation(line: 34, column: 24, scope: !471)
!471 = distinct !DILexicalBlock(scope: !465, file: !440, line: 34, column: 11)
!472 = !DILocation(line: 34, column: 11, scope: !465)
!473 = !DILocation(line: 36, column: 29, scope: !474)
!474 = distinct !DILexicalBlock(scope: !471, file: !440, line: 36, column: 16)
!475 = !DILocation(line: 36, column: 16, scope: !471)
!476 = !DILocation(line: 37, column: 14, scope: !474)
!477 = distinct !{!477, !461, !478}
!478 = !DILocation(line: 40, column: 5, scope: !439)
!479 = !DILocation(line: 43, column: 1, scope: !439)
!480 = distinct !DISubprogram(name: "atof", scope: !481, file: !481, line: 25, type: !482, scopeLine: 26, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !484)
!481 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdlib-float.h", directory: "")
!482 = !DISubroutineType(types: !483)
!483 = !{!192, !190}
!484 = !{!485}
!485 = !DILocalVariable(name: "__nptr", arg: 1, scope: !480, file: !481, line: 25, type: !190)
!486 = !DILocation(line: 0, scope: !480)
!487 = !DILocation(line: 27, column: 10, scope: !480)
!488 = !DILocation(line: 27, column: 3, scope: !480)
!489 = distinct !DISubprogram(name: "strtoimax", scope: !490, file: !490, line: 324, type: !491, scopeLine: 326, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !497)
!490 = !DIFile(filename: "/usr/include/inttypes.h", directory: "")
!491 = !DISubroutineType(types: !492)
!492 = !{!493, !242, !496, !185}
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !494, line: 101, baseType: !495)
!494 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!495 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !294, line: 72, baseType: !214)
!496 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !186)
!497 = !{!498, !499, !500}
!498 = !DILocalVariable(name: "nptr", arg: 1, scope: !489, file: !490, line: 324, type: !242)
!499 = !DILocalVariable(name: "endptr", arg: 2, scope: !489, file: !490, line: 324, type: !496)
!500 = !DILocalVariable(name: "base", arg: 3, scope: !489, file: !490, line: 324, type: !185)
!501 = !DILocation(line: 0, scope: !489)
!502 = !DILocation(line: 327, column: 10, scope: !489)
!503 = !DILocation(line: 327, column: 3, scope: !489)
!504 = distinct !DISubprogram(name: "strtoumax", scope: !490, file: !490, line: 336, type: !505, scopeLine: 338, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !509)
!505 = !DISubroutineType(types: !506)
!506 = !{!507, !242, !496, !185}
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !494, line: 102, baseType: !508)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !294, line: 73, baseType: !222)
!509 = !{!510, !511, !512}
!510 = !DILocalVariable(name: "nptr", arg: 1, scope: !504, file: !490, line: 336, type: !242)
!511 = !DILocalVariable(name: "endptr", arg: 2, scope: !504, file: !490, line: 336, type: !496)
!512 = !DILocalVariable(name: "base", arg: 3, scope: !504, file: !490, line: 336, type: !185)
!513 = !DILocation(line: 0, scope: !504)
!514 = !DILocation(line: 339, column: 10, scope: !504)
!515 = !DILocation(line: 339, column: 3, scope: !504)
!516 = distinct !DISubprogram(name: "wcstoimax", scope: !490, file: !490, line: 348, type: !517, scopeLine: 350, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !526)
!517 = !DISubroutineType(types: !518)
!518 = !{!493, !519, !523, !185}
!519 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !522)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gwchar_t", file: !490, line: 34, baseType: !185)
!523 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !524)
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !525, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!526 = !{!527, !528, !529}
!527 = !DILocalVariable(name: "nptr", arg: 1, scope: !516, file: !490, line: 348, type: !519)
!528 = !DILocalVariable(name: "endptr", arg: 2, scope: !516, file: !490, line: 348, type: !523)
!529 = !DILocalVariable(name: "base", arg: 3, scope: !516, file: !490, line: 348, type: !185)
!530 = !DILocation(line: 0, scope: !516)
!531 = !DILocation(line: 351, column: 10, scope: !516)
!532 = !DILocation(line: 351, column: 3, scope: !516)
!533 = distinct !DISubprogram(name: "wcstoumax", scope: !490, file: !490, line: 362, type: !534, scopeLine: 364, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !536)
!534 = !DISubroutineType(types: !535)
!535 = !{!507, !519, !523, !185}
!536 = !{!537, !538, !539}
!537 = !DILocalVariable(name: "nptr", arg: 1, scope: !533, file: !490, line: 362, type: !519)
!538 = !DILocalVariable(name: "endptr", arg: 2, scope: !533, file: !490, line: 362, type: !523)
!539 = !DILocalVariable(name: "base", arg: 3, scope: !533, file: !490, line: 362, type: !185)
!540 = !DILocation(line: 0, scope: !533)
!541 = !DILocation(line: 365, column: 10, scope: !533)
!542 = !DILocation(line: 365, column: 3, scope: !533)
!543 = distinct !DISubprogram(name: "stat", scope: !544, file: !544, line: 453, type: !545, scopeLine: 454, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !584)
!544 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/stat.h", directory: "")
!545 = !DISubroutineType(types: !546)
!546 = !{!185, !190, !547}
!547 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !548, size: 64)
!548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !549, line: 46, size: 1152, elements: !550)
!549 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!550 = !{!551, !553, !555, !557, !559, !561, !563, !564, !565, !566, !568, !570, !578, !579, !580}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !548, file: !549, line: 48, baseType: !552, size: 64)
!552 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !294, line: 145, baseType: !222)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !548, file: !549, line: 53, baseType: !554, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !294, line: 148, baseType: !222)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !548, file: !549, line: 61, baseType: !556, size: 64, offset: 128)
!556 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !294, line: 151, baseType: !222)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !548, file: !549, line: 62, baseType: !558, size: 32, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !294, line: 150, baseType: !7)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !548, file: !549, line: 64, baseType: !560, size: 32, offset: 224)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !294, line: 146, baseType: !7)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !548, file: !549, line: 65, baseType: !562, size: 32, offset: 256)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !294, line: 147, baseType: !7)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !548, file: !549, line: 67, baseType: !185, size: 32, offset: 288)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !548, file: !549, line: 69, baseType: !552, size: 64, offset: 320)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !548, file: !549, line: 74, baseType: !293, size: 64, offset: 384)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !548, file: !549, line: 78, baseType: !567, size: 64, offset: 448)
!567 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !294, line: 174, baseType: !214)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !548, file: !549, line: 80, baseType: !569, size: 64, offset: 512)
!569 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !294, line: 179, baseType: !214)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !548, file: !549, line: 91, baseType: !571, size: 128, offset: 576)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !572, line: 10, size: 128, elements: !573)
!572 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!573 = !{!574, !576}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !571, file: !572, line: 12, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !294, line: 160, baseType: !214)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !571, file: !572, line: 16, baseType: !577, size: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !294, line: 196, baseType: !214)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !548, file: !549, line: 92, baseType: !571, size: 128, offset: 704)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !548, file: !549, line: 93, baseType: !571, size: 128, offset: 832)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !548, file: !549, line: 106, baseType: !581, size: 192, offset: 960)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !577, size: 192, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 3)
!584 = !{!585, !586}
!585 = !DILocalVariable(name: "__path", arg: 1, scope: !543, file: !544, line: 453, type: !190)
!586 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !543, file: !544, line: 453, type: !547)
!587 = !DILocation(line: 0, scope: !543)
!588 = !DILocation(line: 455, column: 10, scope: !543)
!589 = !DILocation(line: 455, column: 3, scope: !543)
!590 = distinct !DISubprogram(name: "lstat", scope: !544, file: !544, line: 460, type: !545, scopeLine: 461, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !591)
!591 = !{!592, !593}
!592 = !DILocalVariable(name: "__path", arg: 1, scope: !590, file: !544, line: 460, type: !190)
!593 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !590, file: !544, line: 460, type: !547)
!594 = !DILocation(line: 0, scope: !590)
!595 = !DILocation(line: 462, column: 10, scope: !590)
!596 = !DILocation(line: 462, column: 3, scope: !590)
!597 = distinct !DISubprogram(name: "fstat", scope: !544, file: !544, line: 467, type: !598, scopeLine: 468, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !600)
!598 = !DISubroutineType(types: !599)
!599 = !{!185, !185, !547}
!600 = !{!601, !602}
!601 = !DILocalVariable(name: "__fd", arg: 1, scope: !597, file: !544, line: 467, type: !185)
!602 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !597, file: !544, line: 467, type: !547)
!603 = !DILocation(line: 0, scope: !597)
!604 = !DILocation(line: 469, column: 10, scope: !597)
!605 = !DILocation(line: 469, column: 3, scope: !597)
!606 = distinct !DISubprogram(name: "fstatat", scope: !544, file: !544, line: 474, type: !607, scopeLine: 476, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !609)
!607 = !DISubroutineType(types: !608)
!608 = !{!185, !185, !190, !547, !185}
!609 = !{!610, !611, !612, !613}
!610 = !DILocalVariable(name: "__fd", arg: 1, scope: !606, file: !544, line: 474, type: !185)
!611 = !DILocalVariable(name: "__filename", arg: 2, scope: !606, file: !544, line: 474, type: !190)
!612 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !606, file: !544, line: 474, type: !547)
!613 = !DILocalVariable(name: "__flag", arg: 4, scope: !606, file: !544, line: 474, type: !185)
!614 = !DILocation(line: 0, scope: !606)
!615 = !DILocation(line: 477, column: 10, scope: !606)
!616 = !DILocation(line: 477, column: 3, scope: !606)
!617 = distinct !DISubprogram(name: "mknod", scope: !544, file: !544, line: 483, type: !618, scopeLine: 484, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !620)
!618 = !DISubroutineType(types: !619)
!619 = !{!185, !190, !558, !552}
!620 = !{!621, !622, !623}
!621 = !DILocalVariable(name: "__path", arg: 1, scope: !617, file: !544, line: 483, type: !190)
!622 = !DILocalVariable(name: "__mode", arg: 2, scope: !617, file: !544, line: 483, type: !558)
!623 = !DILocalVariable(name: "__dev", arg: 3, scope: !617, file: !544, line: 483, type: !552)
!624 = !DILocation(line: 0, scope: !617)
!625 = !DILocation(line: 485, column: 10, scope: !617)
!626 = !DILocation(line: 485, column: 3, scope: !617)
!627 = distinct !DISubprogram(name: "mknodat", scope: !544, file: !544, line: 491, type: !628, scopeLine: 493, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !630)
!628 = !DISubroutineType(types: !629)
!629 = !{!185, !185, !190, !558, !552}
!630 = !{!631, !632, !633, !634}
!631 = !DILocalVariable(name: "__fd", arg: 1, scope: !627, file: !544, line: 491, type: !185)
!632 = !DILocalVariable(name: "__path", arg: 2, scope: !627, file: !544, line: 491, type: !190)
!633 = !DILocalVariable(name: "__mode", arg: 3, scope: !627, file: !544, line: 491, type: !558)
!634 = !DILocalVariable(name: "__dev", arg: 4, scope: !627, file: !544, line: 491, type: !552)
!635 = !DILocation(line: 0, scope: !627)
!636 = !DILocation(line: 494, column: 10, scope: !627)
!637 = !DILocation(line: 494, column: 3, scope: !627)
!638 = distinct !DISubprogram(name: "stat64", scope: !544, file: !544, line: 502, type: !639, scopeLine: 503, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !661)
!639 = !DISubroutineType(types: !640)
!640 = !{!185, !190, !641}
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !642, size: 64)
!642 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !549, line: 119, size: 1152, elements: !643)
!643 = !{!644, !645, !647, !648, !649, !650, !651, !652, !653, !654, !655, !657, !658, !659, !660}
!644 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !642, file: !549, line: 121, baseType: !552, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !642, file: !549, line: 123, baseType: !646, size: 64, offset: 64)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !294, line: 149, baseType: !222)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !642, file: !549, line: 124, baseType: !556, size: 64, offset: 128)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !642, file: !549, line: 125, baseType: !558, size: 32, offset: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !642, file: !549, line: 132, baseType: !560, size: 32, offset: 224)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !642, file: !549, line: 133, baseType: !562, size: 32, offset: 256)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !642, file: !549, line: 135, baseType: !185, size: 32, offset: 288)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !642, file: !549, line: 136, baseType: !552, size: 64, offset: 320)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !642, file: !549, line: 137, baseType: !293, size: 64, offset: 384)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !642, file: !549, line: 143, baseType: !567, size: 64, offset: 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !642, file: !549, line: 144, baseType: !656, size: 64, offset: 512)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !294, line: 180, baseType: !214)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !642, file: !549, line: 152, baseType: !571, size: 128, offset: 576)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !642, file: !549, line: 153, baseType: !571, size: 128, offset: 704)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !642, file: !549, line: 154, baseType: !571, size: 128, offset: 832)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !642, file: !549, line: 164, baseType: !581, size: 192, offset: 960)
!661 = !{!662, !663}
!662 = !DILocalVariable(name: "__path", arg: 1, scope: !638, file: !544, line: 502, type: !190)
!663 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !638, file: !544, line: 502, type: !641)
!664 = !DILocation(line: 0, scope: !638)
!665 = !DILocation(line: 504, column: 10, scope: !638)
!666 = !DILocation(line: 504, column: 3, scope: !638)
!667 = distinct !DISubprogram(name: "lstat64", scope: !544, file: !544, line: 509, type: !639, scopeLine: 510, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !668)
!668 = !{!669, !670}
!669 = !DILocalVariable(name: "__path", arg: 1, scope: !667, file: !544, line: 509, type: !190)
!670 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !667, file: !544, line: 509, type: !641)
!671 = !DILocation(line: 0, scope: !667)
!672 = !DILocation(line: 511, column: 10, scope: !667)
!673 = !DILocation(line: 511, column: 3, scope: !667)
!674 = distinct !DISubprogram(name: "fstat64", scope: !544, file: !544, line: 516, type: !675, scopeLine: 517, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !677)
!675 = !DISubroutineType(types: !676)
!676 = !{!185, !185, !641}
!677 = !{!678, !679}
!678 = !DILocalVariable(name: "__fd", arg: 1, scope: !674, file: !544, line: 516, type: !185)
!679 = !DILocalVariable(name: "__statbuf", arg: 2, scope: !674, file: !544, line: 516, type: !641)
!680 = !DILocation(line: 0, scope: !674)
!681 = !DILocation(line: 518, column: 10, scope: !674)
!682 = !DILocation(line: 518, column: 3, scope: !674)
!683 = distinct !DISubprogram(name: "fstatat64", scope: !544, file: !544, line: 523, type: !684, scopeLine: 525, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !686)
!684 = !DISubroutineType(types: !685)
!685 = !{!185, !185, !190, !641, !185}
!686 = !{!687, !688, !689, !690}
!687 = !DILocalVariable(name: "__fd", arg: 1, scope: !683, file: !544, line: 523, type: !185)
!688 = !DILocalVariable(name: "__filename", arg: 2, scope: !683, file: !544, line: 523, type: !190)
!689 = !DILocalVariable(name: "__statbuf", arg: 3, scope: !683, file: !544, line: 523, type: !641)
!690 = !DILocalVariable(name: "__flag", arg: 4, scope: !683, file: !544, line: 523, type: !185)
!691 = !DILocation(line: 0, scope: !683)
!692 = !DILocation(line: 526, column: 10, scope: !683)
!693 = !DILocation(line: 526, column: 3, scope: !683)
!694 = distinct !DISubprogram(name: "timevar_init", scope: !3, file: !3, line: 236, type: !695, scopeLine: 237, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !260)
!695 = !DISubroutineType(types: !696)
!696 = !{null}
!697 = !DILocation(line: 238, column: 18, scope: !694)
!698 = !DILocation(line: 241, column: 3, scope: !694)
!699 = !DILocation(line: 34, column: 1, scope: !700)
!700 = !DILexicalBlockFile(scope: !694, file: !701, discriminator: 0)
!701 = !DIFile(filename: "./timevar.def", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!702 = !DILocation(line: 37, column: 1, scope: !700)
!703 = !DILocation(line: 40, column: 1, scope: !700)
!704 = !DILocation(line: 42, column: 1, scope: !700)
!705 = !DILocation(line: 43, column: 1, scope: !700)
!706 = !DILocation(line: 44, column: 1, scope: !700)
!707 = !DILocation(line: 45, column: 1, scope: !700)
!708 = !DILocation(line: 46, column: 1, scope: !700)
!709 = !DILocation(line: 47, column: 1, scope: !700)
!710 = !DILocation(line: 48, column: 1, scope: !700)
!711 = !DILocation(line: 49, column: 1, scope: !700)
!712 = !DILocation(line: 50, column: 1, scope: !700)
!713 = !DILocation(line: 51, column: 1, scope: !700)
!714 = !DILocation(line: 52, column: 1, scope: !700)
!715 = !DILocation(line: 53, column: 1, scope: !700)
!716 = !DILocation(line: 54, column: 1, scope: !700)
!717 = !DILocation(line: 55, column: 1, scope: !700)
!718 = !DILocation(line: 56, column: 1, scope: !700)
!719 = !DILocation(line: 57, column: 1, scope: !700)
!720 = !DILocation(line: 58, column: 1, scope: !700)
!721 = !DILocation(line: 59, column: 1, scope: !700)
!722 = !DILocation(line: 61, column: 1, scope: !700)
!723 = !DILocation(line: 63, column: 1, scope: !700)
!724 = !DILocation(line: 64, column: 1, scope: !700)
!725 = !DILocation(line: 65, column: 1, scope: !700)
!726 = !DILocation(line: 67, column: 1, scope: !700)
!727 = !DILocation(line: 68, column: 1, scope: !700)
!728 = !DILocation(line: 71, column: 1, scope: !700)
!729 = !DILocation(line: 72, column: 1, scope: !700)
!730 = !DILocation(line: 73, column: 1, scope: !700)
!731 = !DILocation(line: 74, column: 1, scope: !700)
!732 = !DILocation(line: 75, column: 1, scope: !700)
!733 = !DILocation(line: 76, column: 1, scope: !700)
!734 = !DILocation(line: 77, column: 1, scope: !700)
!735 = !DILocation(line: 78, column: 1, scope: !700)
!736 = !DILocation(line: 79, column: 1, scope: !700)
!737 = !DILocation(line: 80, column: 1, scope: !700)
!738 = !DILocation(line: 82, column: 1, scope: !700)
!739 = !DILocation(line: 83, column: 1, scope: !700)
!740 = !DILocation(line: 84, column: 1, scope: !700)
!741 = !DILocation(line: 85, column: 1, scope: !700)
!742 = !DILocation(line: 87, column: 1, scope: !700)
!743 = !DILocation(line: 88, column: 1, scope: !700)
!744 = !DILocation(line: 89, column: 1, scope: !700)
!745 = !DILocation(line: 90, column: 1, scope: !700)
!746 = !DILocation(line: 91, column: 1, scope: !700)
!747 = !DILocation(line: 92, column: 1, scope: !700)
!748 = !DILocation(line: 93, column: 1, scope: !700)
!749 = !DILocation(line: 94, column: 1, scope: !700)
!750 = !DILocation(line: 95, column: 1, scope: !700)
!751 = !DILocation(line: 96, column: 1, scope: !700)
!752 = !DILocation(line: 97, column: 1, scope: !700)
!753 = !DILocation(line: 98, column: 1, scope: !700)
!754 = !DILocation(line: 99, column: 1, scope: !700)
!755 = !DILocation(line: 100, column: 1, scope: !700)
!756 = !DILocation(line: 101, column: 1, scope: !700)
!757 = !DILocation(line: 102, column: 1, scope: !700)
!758 = !DILocation(line: 103, column: 1, scope: !700)
!759 = !DILocation(line: 104, column: 1, scope: !700)
!760 = !DILocation(line: 105, column: 1, scope: !700)
!761 = !DILocation(line: 106, column: 1, scope: !700)
!762 = !DILocation(line: 107, column: 1, scope: !700)
!763 = !DILocation(line: 108, column: 1, scope: !700)
!764 = !DILocation(line: 109, column: 1, scope: !700)
!765 = !DILocation(line: 110, column: 1, scope: !700)
!766 = !DILocation(line: 111, column: 1, scope: !700)
!767 = !DILocation(line: 112, column: 1, scope: !700)
!768 = !DILocation(line: 113, column: 1, scope: !700)
!769 = !DILocation(line: 114, column: 1, scope: !700)
!770 = !DILocation(line: 115, column: 1, scope: !700)
!771 = !DILocation(line: 116, column: 1, scope: !700)
!772 = !DILocation(line: 117, column: 1, scope: !700)
!773 = !DILocation(line: 118, column: 1, scope: !700)
!774 = !DILocation(line: 119, column: 1, scope: !700)
!775 = !DILocation(line: 120, column: 1, scope: !700)
!776 = !DILocation(line: 121, column: 1, scope: !700)
!777 = !DILocation(line: 122, column: 1, scope: !700)
!778 = !DILocation(line: 123, column: 1, scope: !700)
!779 = !DILocation(line: 124, column: 1, scope: !700)
!780 = !DILocation(line: 125, column: 1, scope: !700)
!781 = !DILocation(line: 126, column: 1, scope: !700)
!782 = !DILocation(line: 127, column: 1, scope: !700)
!783 = !DILocation(line: 128, column: 1, scope: !700)
!784 = !DILocation(line: 129, column: 1, scope: !700)
!785 = !DILocation(line: 130, column: 1, scope: !700)
!786 = !DILocation(line: 131, column: 1, scope: !700)
!787 = !DILocation(line: 132, column: 1, scope: !700)
!788 = !DILocation(line: 133, column: 1, scope: !700)
!789 = !DILocation(line: 134, column: 1, scope: !700)
!790 = !DILocation(line: 135, column: 1, scope: !700)
!791 = !DILocation(line: 136, column: 1, scope: !700)
!792 = !DILocation(line: 137, column: 1, scope: !700)
!793 = !DILocation(line: 138, column: 1, scope: !700)
!794 = !DILocation(line: 139, column: 1, scope: !700)
!795 = !DILocation(line: 140, column: 1, scope: !700)
!796 = !DILocation(line: 141, column: 1, scope: !700)
!797 = !DILocation(line: 142, column: 1, scope: !700)
!798 = !DILocation(line: 143, column: 1, scope: !700)
!799 = !DILocation(line: 144, column: 1, scope: !700)
!800 = !DILocation(line: 145, column: 1, scope: !700)
!801 = !DILocation(line: 146, column: 1, scope: !700)
!802 = !DILocation(line: 147, column: 1, scope: !700)
!803 = !DILocation(line: 148, column: 1, scope: !700)
!804 = !DILocation(line: 149, column: 1, scope: !700)
!805 = !DILocation(line: 150, column: 1, scope: !700)
!806 = !DILocation(line: 151, column: 1, scope: !700)
!807 = !DILocation(line: 152, column: 1, scope: !700)
!808 = !DILocation(line: 153, column: 1, scope: !700)
!809 = !DILocation(line: 154, column: 1, scope: !700)
!810 = !DILocation(line: 155, column: 1, scope: !700)
!811 = !DILocation(line: 156, column: 1, scope: !700)
!812 = !DILocation(line: 157, column: 1, scope: !700)
!813 = !DILocation(line: 158, column: 1, scope: !700)
!814 = !DILocation(line: 159, column: 1, scope: !700)
!815 = !DILocation(line: 160, column: 1, scope: !700)
!816 = !DILocation(line: 161, column: 1, scope: !700)
!817 = !DILocation(line: 162, column: 1, scope: !700)
!818 = !DILocation(line: 163, column: 1, scope: !700)
!819 = !DILocation(line: 164, column: 1, scope: !700)
!820 = !DILocation(line: 165, column: 1, scope: !700)
!821 = !DILocation(line: 166, column: 1, scope: !700)
!822 = !DILocation(line: 167, column: 1, scope: !700)
!823 = !DILocation(line: 168, column: 1, scope: !700)
!824 = !DILocation(line: 169, column: 1, scope: !700)
!825 = !DILocation(line: 170, column: 1, scope: !700)
!826 = !DILocation(line: 171, column: 1, scope: !700)
!827 = !DILocation(line: 172, column: 1, scope: !700)
!828 = !DILocation(line: 173, column: 1, scope: !700)
!829 = !DILocation(line: 174, column: 1, scope: !700)
!830 = !DILocation(line: 175, column: 1, scope: !700)
!831 = !DILocation(line: 176, column: 1, scope: !700)
!832 = !DILocation(line: 177, column: 1, scope: !700)
!833 = !DILocation(line: 178, column: 1, scope: !700)
!834 = !DILocation(line: 179, column: 1, scope: !700)
!835 = !DILocation(line: 180, column: 1, scope: !700)
!836 = !DILocation(line: 181, column: 1, scope: !700)
!837 = !DILocation(line: 182, column: 1, scope: !700)
!838 = !DILocation(line: 183, column: 1, scope: !700)
!839 = !DILocation(line: 184, column: 1, scope: !700)
!840 = !DILocation(line: 185, column: 1, scope: !700)
!841 = !DILocation(line: 186, column: 1, scope: !700)
!842 = !DILocation(line: 187, column: 1, scope: !700)
!843 = !DILocation(line: 188, column: 1, scope: !700)
!844 = !DILocation(line: 189, column: 1, scope: !700)
!845 = !DILocation(line: 190, column: 1, scope: !700)
!846 = !DILocation(line: 191, column: 1, scope: !700)
!847 = !DILocation(line: 192, column: 1, scope: !700)
!848 = !DILocation(line: 193, column: 1, scope: !700)
!849 = !DILocation(line: 194, column: 1, scope: !700)
!850 = !DILocation(line: 195, column: 1, scope: !700)
!851 = !DILocation(line: 196, column: 1, scope: !700)
!852 = !DILocation(line: 197, column: 1, scope: !700)
!853 = !DILocation(line: 198, column: 1, scope: !700)
!854 = !DILocation(line: 199, column: 1, scope: !700)
!855 = !DILocation(line: 200, column: 1, scope: !700)
!856 = !DILocation(line: 201, column: 1, scope: !700)
!857 = !DILocation(line: 202, column: 1, scope: !700)
!858 = !DILocation(line: 203, column: 1, scope: !700)
!859 = !DILocation(line: 204, column: 1, scope: !700)
!860 = !DILocation(line: 205, column: 1, scope: !700)
!861 = !DILocation(line: 206, column: 1, scope: !700)
!862 = !DILocation(line: 207, column: 1, scope: !700)
!863 = !DILocation(line: 208, column: 1, scope: !700)
!864 = !DILocation(line: 209, column: 1, scope: !700)
!865 = !DILocation(line: 210, column: 1, scope: !700)
!866 = !DILocation(line: 211, column: 1, scope: !700)
!867 = !DILocation(line: 212, column: 1, scope: !700)
!868 = !DILocation(line: 213, column: 1, scope: !700)
!869 = !DILocation(line: 214, column: 1, scope: !700)
!870 = !DILocation(line: 215, column: 1, scope: !700)
!871 = !DILocation(line: 218, column: 1, scope: !700)
!872 = !DILocation(line: 250, column: 19, scope: !873)
!873 = !DILexicalBlockFile(scope: !694, file: !3, discriminator: 0)
!874 = !DILocation(line: 250, column: 17, scope: !873)
!875 = !DILocation(line: 255, column: 1, scope: !873)
!876 = distinct !DISubprogram(name: "timevar_push_1", scope: !3, file: !3, line: 265, type: !877, scopeLine: 266, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{null, !212}
!879 = !{!880, !881, !882, !883}
!880 = !DILocalVariable(name: "timevar", arg: 1, scope: !876, file: !3, line: 265, type: !212)
!881 = !DILocalVariable(name: "tv", scope: !876, file: !3, line: 267, type: !197)
!882 = !DILocalVariable(name: "context", scope: !876, file: !3, line: 268, type: !193)
!883 = !DILocalVariable(name: "now", scope: !876, file: !3, line: 269, type: !201)
!884 = !DILocation(line: 0, scope: !876)
!885 = !DILocation(line: 267, column: 29, scope: !876)
!886 = !DILocation(line: 269, column: 3, scope: !876)
!887 = !DILocation(line: 272, column: 7, scope: !876)
!888 = !DILocation(line: 272, column: 12, scope: !876)
!889 = !DILocation(line: 275, column: 3, scope: !876)
!890 = !DILocation(line: 278, column: 3, scope: !876)
!891 = !DILocation(line: 282, column: 7, scope: !892)
!892 = distinct !DILexicalBlock(scope: !876, file: !3, line: 282, column: 7)
!893 = !DILocation(line: 282, column: 7, scope: !876)
!894 = !DILocation(line: 283, column: 33, scope: !892)
!895 = !DILocation(line: 283, column: 42, scope: !892)
!896 = !DILocation(line: 283, column: 5, scope: !892)
!897 = !DILocation(line: 287, column: 16, scope: !876)
!898 = !DILocation(line: 291, column: 7, scope: !899)
!899 = distinct !DILexicalBlock(scope: !876, file: !3, line: 291, column: 7)
!900 = !DILocation(line: 291, column: 30, scope: !899)
!901 = !DILocation(line: 291, column: 7, scope: !876)
!902 = !DILocation(line: 294, column: 56, scope: !903)
!903 = distinct !DILexicalBlock(scope: !899, file: !3, line: 292, column: 5)
!904 = !DILocation(line: 294, column: 30, scope: !903)
!905 = !DILocation(line: 295, column: 5, scope: !903)
!906 = !DILocation(line: 297, column: 15, scope: !899)
!907 = !DILocation(line: 0, scope: !899)
!908 = !DILocation(line: 300, column: 12, scope: !876)
!909 = !DILocation(line: 300, column: 20, scope: !876)
!910 = !DILocation(line: 301, column: 19, scope: !876)
!911 = !DILocation(line: 301, column: 12, scope: !876)
!912 = !DILocation(line: 301, column: 17, scope: !876)
!913 = !DILocation(line: 302, column: 9, scope: !876)
!914 = !DILocation(line: 303, column: 1, scope: !876)
!915 = distinct !DISubprogram(name: "get_time", scope: !3, file: !3, line: 191, type: !916, scopeLine: 192, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !919)
!916 = !DISubroutineType(types: !917)
!917 = !{null, !918}
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !201, size: 64)
!919 = !{!920, !921}
!920 = !DILocalVariable(name: "now", arg: 1, scope: !915, file: !3, line: 191, type: !918)
!921 = !DILocalVariable(name: "tms", scope: !922, file: !3, line: 203, type: !923)
!922 = distinct !DILexicalBlock(scope: !915, file: !3, line: 201, column: 3)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tms", file: !924, line: 32, size: 256, elements: !925)
!924 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/times.h", directory: "")
!925 = !{!926, !930, !931, !932}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !923, file: !924, line: 34, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "clock_t", file: !928, line: 7, baseType: !929)
!928 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/clock_t.h", directory: "")
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "__clock_t", file: !294, line: 156, baseType: !214)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !923, file: !924, line: 35, baseType: !927, size: 64, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !923, file: !924, line: 37, baseType: !927, size: 64, offset: 128)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !923, file: !924, line: 38, baseType: !927, size: 64, offset: 192)
!933 = !DILocation(line: 0, scope: !915)
!934 = !DILocation(line: 193, column: 8, scope: !915)
!935 = !DILocation(line: 193, column: 13, scope: !915)
!936 = !DILocation(line: 194, column: 8, scope: !915)
!937 = !DILocation(line: 194, column: 13, scope: !915)
!938 = !DILocation(line: 195, column: 8, scope: !915)
!939 = !DILocation(line: 195, column: 13, scope: !915)
!940 = !DILocation(line: 196, column: 18, scope: !915)
!941 = !DILocation(line: 196, column: 8, scope: !915)
!942 = !DILocation(line: 196, column: 16, scope: !915)
!943 = !DILocation(line: 198, column: 8, scope: !944)
!944 = distinct !DILexicalBlock(scope: !915, file: !3, line: 198, column: 7)
!945 = !DILocation(line: 198, column: 7, scope: !915)
!946 = !DILocation(line: 203, column: 5, scope: !922)
!947 = !DILocation(line: 0, scope: !922)
!948 = !DILocation(line: 204, column: 17, scope: !922)
!949 = !DILocation(line: 204, column: 33, scope: !922)
!950 = !DILocation(line: 204, column: 31, scope: !922)
!951 = !DILocation(line: 204, column: 15, scope: !922)
!952 = !DILocation(line: 205, column: 21, scope: !922)
!953 = !DILocation(line: 205, column: 17, scope: !922)
!954 = !DILocation(line: 205, column: 31, scope: !922)
!955 = !DILocation(line: 205, column: 15, scope: !922)
!956 = !DILocation(line: 206, column: 21, scope: !922)
!957 = !DILocation(line: 206, column: 17, scope: !922)
!958 = !DILocation(line: 206, column: 33, scope: !922)
!959 = !DILocation(line: 206, column: 31, scope: !922)
!960 = !DILocation(line: 206, column: 15, scope: !922)
!961 = !DILocation(line: 217, column: 3, scope: !915)
!962 = !DILocation(line: 218, column: 1, scope: !915)
!963 = distinct !DISubprogram(name: "timevar_accumulate", scope: !3, file: !3, line: 223, type: !964, scopeLine: 226, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !966)
!964 = !DISubroutineType(types: !965)
!965 = !{null, !918, !918, !918}
!966 = !{!967, !968, !969}
!967 = !DILocalVariable(name: "timer", arg: 1, scope: !963, file: !3, line: 223, type: !918)
!968 = !DILocalVariable(name: "start_time", arg: 2, scope: !963, file: !3, line: 224, type: !918)
!969 = !DILocalVariable(name: "stop_time", arg: 3, scope: !963, file: !3, line: 225, type: !918)
!970 = !DILocation(line: 0, scope: !963)
!971 = !DILocation(line: 227, column: 29, scope: !963)
!972 = !DILocation(line: 227, column: 48, scope: !963)
!973 = !DILocation(line: 227, column: 34, scope: !963)
!974 = !DILocation(line: 227, column: 10, scope: !963)
!975 = !DILocation(line: 227, column: 15, scope: !963)
!976 = !DILocation(line: 228, column: 28, scope: !963)
!977 = !DILocation(line: 228, column: 46, scope: !963)
!978 = !DILocation(line: 228, column: 32, scope: !963)
!979 = !DILocation(line: 228, column: 10, scope: !963)
!980 = !DILocation(line: 228, column: 14, scope: !963)
!981 = !DILocation(line: 229, column: 29, scope: !963)
!982 = !DILocation(line: 229, column: 48, scope: !963)
!983 = !DILocation(line: 229, column: 34, scope: !963)
!984 = !DILocation(line: 229, column: 10, scope: !963)
!985 = !DILocation(line: 229, column: 15, scope: !963)
!986 = !DILocation(line: 230, column: 32, scope: !963)
!987 = !DILocation(line: 230, column: 54, scope: !963)
!988 = !DILocation(line: 230, column: 40, scope: !963)
!989 = !DILocation(line: 230, column: 10, scope: !963)
!990 = !DILocation(line: 230, column: 18, scope: !963)
!991 = !DILocation(line: 231, column: 1, scope: !963)
!992 = distinct !DISubprogram(name: "timevar_pop_1", scope: !3, file: !3, line: 312, type: !877, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !993)
!993 = !{!994, !995, !996}
!994 = !DILocalVariable(name: "timevar", arg: 1, scope: !992, file: !3, line: 312, type: !212)
!995 = !DILocalVariable(name: "now", scope: !992, file: !3, line: 314, type: !201)
