; ModuleID = 'toplev.bc'
source_filename = "toplev.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!418 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!419 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!420 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !166, line: 1805, baseType: !7, size: 32, elements: !422)
!422 = !{!423, !424, !425, !426, !427}
!423 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!424 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!425 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!426 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!427 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!428 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !429, line: 104, baseType: !7, size: 32, elements: !430)
!429 = !DIFile(filename: "./pretty-print.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!430 = !{!431, !432, !433}
!431 = !DIEnumerator(name: "pp_none", value: 0, isUnsigned: true)
!432 = !DIEnumerator(name: "pp_before", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "pp_after", value: 2, isUnsigned: true)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !429, line: 46, baseType: !7, size: 32, elements: !435)
!435 = !{!436, !437, !438}
!436 = !DIEnumerator(name: "DIAGNOSTICS_SHOW_PREFIX_ONCE", value: 0, isUnsigned: true)
!437 = !DIEnumerator(name: "DIAGNOSTICS_SHOW_PREFIX_NEVER", value: 1, isUnsigned: true)
!438 = !DIEnumerator(name: "DIAGNOSTICS_SHOW_PREFIX_EVERY_LINE", value: 2, isUnsigned: true)
!439 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "graph_dump_types", file: !17, line: 287, baseType: !7, size: 32, elements: !440)
!440 = !{!441, !442}
!441 = !DIEnumerator(name: "no_graph", value: 0, isUnsigned: true)
!442 = !DIEnumerator(name: "vcg", value: 1, isUnsigned: true)
!443 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !444, line: 29, baseType: !7, size: 32, elements: !445)
!444 = !DIFile(filename: "./diagnostic.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!445 = !{!446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458}
!446 = !DIEnumerator(name: "DK_UNSPECIFIED", value: 0, isUnsigned: true)
!447 = !DIEnumerator(name: "DK_IGNORED", value: 1, isUnsigned: true)
!448 = !DIEnumerator(name: "DK_FATAL", value: 2, isUnsigned: true)
!449 = !DIEnumerator(name: "DK_ICE", value: 3, isUnsigned: true)
!450 = !DIEnumerator(name: "DK_ERROR", value: 4, isUnsigned: true)
!451 = !DIEnumerator(name: "DK_SORRY", value: 5, isUnsigned: true)
!452 = !DIEnumerator(name: "DK_WARNING", value: 6, isUnsigned: true)
!453 = !DIEnumerator(name: "DK_ANACHRONISM", value: 7, isUnsigned: true)
!454 = !DIEnumerator(name: "DK_NOTE", value: 8, isUnsigned: true)
!455 = !DIEnumerator(name: "DK_DEBUG", value: 9, isUnsigned: true)
!456 = !DIEnumerator(name: "DK_PEDWARN", value: 10, isUnsigned: true)
!457 = !DIEnumerator(name: "DK_PERMERROR", value: 11, isUnsigned: true)
!458 = !DIEnumerator(name: "DK_LAST_DIAGNOSTIC_KIND", value: 12, isUnsigned: true)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !460, line: 56, baseType: !7, size: 32, elements: !461)
!460 = !DIFile(filename: "./target.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!461 = !{!462, !463, !464, !465, !466}
!462 = !DIEnumerator(name: "SWITCH_TYPE_PASSED", value: 0, isUnsigned: true)
!463 = !DIEnumerator(name: "SWITCH_TYPE_ENABLED", value: 1, isUnsigned: true)
!464 = !DIEnumerator(name: "SWITCH_TYPE_DESCRIPTIVE", value: 2, isUnsigned: true)
!465 = !DIEnumerator(name: "SWITCH_TYPE_LINE_START", value: 3, isUnsigned: true)
!466 = !DIEnumerator(name: "SWITCH_TYPE_LINE_END", value: 4, isUnsigned: true)
!467 = !{!468, !469, !470, !471, !474, !475, !477, !478, !165, !479, !472, !1898, !1899, !1904, !604}
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!470 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !473)
!477 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!478 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!479 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !6, line: 56, baseType: !480)
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !166, line: 3371, size: 1792, elements: !482)
!482 = !{!483, !516, !522, !534, !553, !564, !569, !578, !584, !597, !609, !647, !1193, !1221, !1229, !1230, !1235, !1244, !1250, !1255, !1259, !1263, !1551, !1598, !1604, !1610, !1617, !1628, !1642, !1659, !1671, !1693, !1708, !1880}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !481, file: !166, line: 3372, baseType: !484, size: 64)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !166, line: 360, size: 64, elements: !485)
!485 = !{!486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !484, file: !166, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !484, file: !166, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !484, file: !166, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !484, file: !166, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !484, file: !166, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !484, file: !166, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !484, file: !166, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !484, file: !166, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !484, file: !166, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !484, file: !166, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !484, file: !166, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !484, file: !166, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !484, file: !166, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !484, file: !166, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !484, file: !166, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !484, file: !166, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !484, file: !166, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !484, file: !166, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !484, file: !166, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !484, file: !166, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !484, file: !166, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !484, file: !166, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !484, file: !166, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !484, file: !166, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !484, file: !166, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !484, file: !166, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !484, file: !166, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !484, file: !166, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !484, file: !166, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !484, file: !166, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !481, file: !166, line: 3373, baseType: !517, size: 192)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !166, line: 402, size: 192, elements: !518)
!518 = !{!519, !520, !521}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !517, file: !166, line: 403, baseType: !484, size: 64)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !517, file: !166, line: 404, baseType: !479, size: 64, offset: 64)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !517, file: !166, line: 405, baseType: !479, size: 64, offset: 128)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !481, file: !166, line: 3374, baseType: !523, size: 320)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !166, line: 1384, size: 320, elements: !524)
!524 = !{!525, !526}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !523, file: !166, line: 1385, baseType: !517, size: 192)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !523, file: !166, line: 1386, baseType: !527, size: 128, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !528, line: 58, baseType: !529)
!528 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!529 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !528, line: 54, size: 128, elements: !530)
!530 = !{!531, !532}
!531 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !529, file: !528, line: 56, baseType: !478, size: 64)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !529, file: !528, line: 57, baseType: !533, size: 64, offset: 64)
!533 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !481, file: !166, line: 3375, baseType: !535, size: 256)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !166, line: 1397, size: 256, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !535, file: !166, line: 1398, baseType: !517, size: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !535, file: !166, line: 1399, baseType: !539, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !541, line: 52, size: 256, elements: !542)
!541 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!542 = !{!543, !544, !545, !546, !547, !548, !549}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !540, file: !541, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !540, file: !541, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !540, file: !541, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !540, file: !541, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !540, file: !541, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !540, file: !541, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !540, file: !541, line: 62, baseType: !550, size: 192, offset: 64)
!550 = !DICompositeType(tag: DW_TAG_array_type, baseType: !478, size: 192, elements: !551)
!551 = !{!552}
!552 = !DISubrange(count: 3)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !481, file: !166, line: 3376, baseType: !554, size: 256)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !166, line: 1408, size: 256, elements: !555)
!555 = !{!556, !557}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !554, file: !166, line: 1409, baseType: !517, size: 192)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !554, file: !166, line: 1410, baseType: !558, size: 64, offset: 192)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !560, line: 27, size: 192, elements: !561)
!560 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !559, file: !560, line: 29, baseType: !527, size: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !559, file: !560, line: 30, baseType: !37, size: 32, offset: 128)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !481, file: !166, line: 3377, baseType: !565, size: 256)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !166, line: 1437, size: 256, elements: !566)
!566 = !{!567, !568}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !565, file: !166, line: 1438, baseType: !517, size: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !565, file: !166, line: 1439, baseType: !479, size: 64, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !481, file: !166, line: 3378, baseType: !570, size: 256)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !166, line: 1418, size: 256, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !570, file: !166, line: 1419, baseType: !517, size: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !570, file: !166, line: 1420, baseType: !470, size: 32, offset: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !570, file: !166, line: 1421, baseType: !575, size: 8, offset: 224)
!575 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 8, elements: !576)
!576 = !{!577}
!577 = !DISubrange(count: 1)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !481, file: !166, line: 3379, baseType: !579, size: 320)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !166, line: 1428, size: 320, elements: !580)
!580 = !{!581, !582, !583}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !579, file: !166, line: 1429, baseType: !517, size: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !579, file: !166, line: 1430, baseType: !479, size: 64, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !579, file: !166, line: 1431, baseType: !479, size: 64, offset: 256)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !481, file: !166, line: 3380, baseType: !585, size: 320)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !166, line: 1460, size: 320, elements: !586)
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !585, file: !166, line: 1461, baseType: !517, size: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !585, file: !166, line: 1462, baseType: !589, size: 128, offset: 192)
!589 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !590, line: 31, size: 128, elements: !591)
!590 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!591 = !{!592, !595, !596}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !589, file: !590, line: 32, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !469)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !589, file: !590, line: 33, baseType: !7, size: 32, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !589, file: !590, line: 34, baseType: !7, size: 32, offset: 96)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !481, file: !166, line: 3381, baseType: !598, size: 384)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !166, line: 2507, size: 384, elements: !599)
!599 = !{!600, !601, !606, !607, !608}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !598, file: !166, line: 2508, baseType: !517, size: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !598, file: !166, line: 2509, baseType: !602, size: 32, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !603, line: 58, baseType: !604)
!603 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !605, line: 44, baseType: !7)
!605 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!606 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !598, file: !166, line: 2510, baseType: !7, size: 32, offset: 224)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !598, file: !166, line: 2511, baseType: !479, size: 64, offset: 256)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !598, file: !166, line: 2512, baseType: !479, size: 64, offset: 320)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !481, file: !166, line: 3382, baseType: !610, size: 896)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !166, line: 2652, size: 896, elements: !611)
!611 = !{!612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !610, file: !166, line: 2653, baseType: !598, size: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !610, file: !166, line: 2654, baseType: !479, size: 64, offset: 384)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !610, file: !166, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !610, file: !166, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !610, file: !166, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !610, file: !166, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !610, file: !166, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !610, file: !166, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !610, file: !166, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !610, file: !166, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !610, file: !166, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !610, file: !166, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !610, file: !166, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !610, file: !166, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !610, file: !166, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !610, file: !166, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !610, file: !166, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !610, file: !166, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !610, file: !166, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !610, file: !166, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !610, file: !166, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !610, file: !166, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !610, file: !166, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !610, file: !166, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !610, file: !166, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !610, file: !166, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !610, file: !166, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !610, file: !166, line: 2703, baseType: !7, size: 32, offset: 512)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !610, file: !166, line: 2705, baseType: !479, size: 64, offset: 576)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !610, file: !166, line: 2706, baseType: !479, size: 64, offset: 640)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !610, file: !166, line: 2707, baseType: !479, size: 64, offset: 704)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !610, file: !166, line: 2708, baseType: !479, size: 64, offset: 768)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !610, file: !166, line: 2711, baseType: !645, size: 64, offset: 832)
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !166, line: 2711, flags: DIFlagFwdDecl)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !481, file: !166, line: 3383, baseType: !648, size: 960)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !166, line: 2756, size: 960, elements: !649)
!649 = !{!650, !651}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !648, file: !166, line: 2757, baseType: !610, size: 896)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !648, file: !166, line: 2758, baseType: !652, size: 64, offset: 896)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !6, line: 50, baseType: !653)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !655, line: 240, size: 384, elements: !656)
!655 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!656 = !{!657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667}
!657 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !654, file: !655, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !654, file: !655, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !654, file: !655, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !654, file: !655, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !654, file: !655, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !654, file: !655, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !654, file: !655, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !654, file: !655, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !654, file: !655, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !654, file: !655, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !654, file: !655, line: 321, baseType: !668, size: 320, offset: 64)
!668 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !655, line: 315, size: 320, elements: !669)
!669 = !{!670, !1126, !1128, !1191, !1192}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !668, file: !655, line: 316, baseType: !671, size: 64)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 64, elements: !576)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !655, line: 183, baseType: !673)
!673 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !655, line: 166, size: 64, elements: !674)
!674 = !{!675, !676, !677, !678, !679, !687, !688, !700, !703, !763, !764, !1103, !1116, !1123}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !673, file: !655, line: 168, baseType: !470, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !673, file: !655, line: 169, baseType: !7, size: 32)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !673, file: !655, line: 170, baseType: !475, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !673, file: !655, line: 171, baseType: !652, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !673, file: !655, line: 172, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !6, line: 53, baseType: !681)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !655, line: 359, size: 128, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !682, file: !655, line: 360, baseType: !470, size: 32)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !682, file: !655, line: 361, baseType: !686, size: 64, offset: 64)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !652, size: 64, elements: !576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !673, file: !655, line: 173, baseType: !37, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !673, file: !655, line: 174, baseType: !689, size: 32)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !655, line: 133, baseType: !690)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !655, line: 115, size: 32, elements: !691)
!691 = !{!692, !693, !694, !695, !696, !697, !698, !699}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !690, file: !655, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !690, file: !655, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !690, file: !655, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !690, file: !655, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !690, file: !655, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !690, file: !655, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !690, file: !655, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !690, file: !655, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !673, file: !655, line: 175, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !655, line: 175, flags: DIFlagFwdDecl)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !673, file: !655, line: 176, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !705, size: 64)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !706, line: 75, size: 256, elements: !707)
!706 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!707 = !{!708, !722, !723, !724}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !705, file: !706, line: 76, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !706, line: 68, baseType: !711)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !706, line: 63, size: 320, elements: !712)
!712 = !{!713, !715, !716, !717}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !706, line: 64, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !711, file: !706, line: 65, baseType: !714, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !711, file: !706, line: 66, baseType: !7, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !711, file: !706, line: 67, baseType: !718, size: 128, offset: 192)
!718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !719, size: 128, elements: !720)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !706, line: 29, baseType: !478)
!720 = !{!721}
!721 = !DISubrange(count: 2)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !705, file: !706, line: 77, baseType: !709, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !705, file: !706, line: 78, baseType: !7, size: 32, offset: 128)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !705, file: !706, line: 79, baseType: !725, size: 64, offset: 192)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !706, line: 49, baseType: !727)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !706, line: 45, size: 832, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !727, file: !706, line: 46, baseType: !714, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !727, file: !706, line: 47, baseType: !704, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !727, file: !706, line: 48, baseType: !732, size: 704, offset: 128)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !733, line: 164, size: 704, elements: !734)
!733 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!734 = !{!735, !736, !746, !747, !748, !749, !750, !751, !755, !759, !760, !761, !762}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !732, file: !733, line: 166, baseType: !533, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !732, file: !733, line: 167, baseType: !737, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !733, line: 157, size: 192, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !738, file: !733, line: 159, baseType: !472, size: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !738, file: !733, line: 160, baseType: !737, size: 64, offset: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !738, file: !733, line: 161, baseType: !743, size: 32, offset: 128)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !473, size: 32, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 4)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !732, file: !733, line: 168, baseType: !472, size: 64, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !732, file: !733, line: 169, baseType: !472, size: 64, offset: 192)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !732, file: !733, line: 170, baseType: !472, size: 64, offset: 256)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !732, file: !733, line: 171, baseType: !533, size: 64, offset: 320)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !732, file: !733, line: 172, baseType: !470, size: 32, offset: 384)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !732, file: !733, line: 176, baseType: !752, size: 64, offset: 448)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DISubroutineType(types: !754)
!754 = !{!737, !474, !533}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !732, file: !733, line: 177, baseType: !756, size: 64, offset: 512)
!756 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!757 = !DISubroutineType(types: !758)
!758 = !{null, !474, !737}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !732, file: !733, line: 178, baseType: !474, size: 64, offset: 576)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !732, file: !733, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !732, file: !733, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !732, file: !733, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !673, file: !655, line: 177, baseType: !479, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !673, file: !655, line: 178, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !381, line: 217, size: 832, elements: !767)
!767 = !{!768, !1015, !1016, !1017, !1073, !1077, !1078, !1079, !1097, !1098, !1099, !1100, !1101, !1102}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !766, file: !381, line: 219, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !770, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !381, line: 151, baseType: !771)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !381, line: 151, size: 128, elements: !772)
!772 = !{!773}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !771, file: !381, line: 151, baseType: !774, size: 128)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !381, line: 150, baseType: !775)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !381, line: 150, size: 128, elements: !776)
!776 = !{!777, !778, !779}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !775, file: !381, line: 150, baseType: !7, size: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !775, file: !381, line: 150, baseType: !7, size: 32, offset: 32)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !775, file: !381, line: 150, baseType: !780, size: 64, offset: 64)
!780 = !DICompositeType(tag: DW_TAG_array_type, baseType: !781, size: 64, elements: !576)
!781 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !6, line: 108, baseType: !782)
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !783, size: 64)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !381, line: 122, size: 512, elements: !784)
!784 = !{!785, !786, !787, !1007, !1008, !1009, !1010, !1011, !1012, !1013}
!785 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !783, file: !381, line: 124, baseType: !765, size: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !783, file: !381, line: 125, baseType: !765, size: 64, offset: 64)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !783, file: !381, line: 131, baseType: !788, size: 64, offset: 128)
!788 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !381, line: 128, size: 64, elements: !789)
!789 = !{!790, !1006}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !788, file: !381, line: 129, baseType: !791, size: 64)
!791 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !6, line: 66, baseType: !792)
!792 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !793, size: 64)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !794, line: 143, size: 192, elements: !795)
!794 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!795 = !{!796, !1004, !1005}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !793, file: !794, line: 145, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !6, line: 69, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !794, line: 136, size: 192, elements: !800)
!800 = !{!801, !1002, !1003}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !799, file: !794, line: 137, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !6, line: 58, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !794, line: 737, size: 768, elements: !805)
!805 = !{!806, !823, !857, !863, !868, !873, !880, !886, !892, !897, !911, !916, !922, !927, !937, !942, !960, !967, !974, !980, !985, !991, !997}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !804, file: !794, line: 738, baseType: !807, size: 256)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !794, line: 271, size: 256, elements: !808)
!808 = !{!809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !807, file: !794, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !807, file: !794, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !807, file: !794, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !807, file: !794, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !807, file: !794, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !807, file: !794, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !807, file: !794, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !807, file: !794, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !807, file: !794, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !807, file: !794, line: 312, baseType: !7, size: 32, offset: 32)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !807, file: !794, line: 316, baseType: !602, size: 32, offset: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !807, file: !794, line: 319, baseType: !7, size: 32, offset: 96)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !807, file: !794, line: 323, baseType: !765, size: 64, offset: 128)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !807, file: !794, line: 327, baseType: !479, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !804, file: !794, line: 739, baseType: !824, size: 448)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !794, line: 350, size: 448, elements: !825)
!825 = !{!826, !855}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !824, file: !794, line: 353, baseType: !827, size: 384)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !794, line: 333, size: 384, elements: !828)
!828 = !{!829, !830, !838}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !827, file: !794, line: 336, baseType: !807, size: 256)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !827, file: !794, line: 343, baseType: !831, size: 64, offset: 256)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !833, line: 37, size: 128, elements: !834)
!833 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!834 = !{!835, !836}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !832, file: !833, line: 39, baseType: !831, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !832, file: !833, line: 40, baseType: !837, size: 64, offset: 64)
!837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !827, file: !794, line: 344, baseType: !839, size: 64, offset: 320)
!839 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !833, line: 45, size: 320, elements: !841)
!841 = !{!842, !843}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !840, file: !833, line: 47, baseType: !839, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !840, file: !833, line: 48, baseType: !844, size: 256, offset: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !166, line: 1883, size: 256, elements: !845)
!845 = !{!846, !848, !849, !854}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !844, file: !166, line: 1884, baseType: !847, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !844, file: !166, line: 1885, baseType: !847, size: 64, offset: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !844, file: !166, line: 1891, baseType: !850, size: 64, offset: 128)
!850 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !844, file: !166, line: 1891, size: 64, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !850, file: !166, line: 1891, baseType: !802, size: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !850, file: !166, line: 1891, baseType: !479, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !844, file: !166, line: 1892, baseType: !837, size: 64, offset: 192)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !824, file: !794, line: 359, baseType: !856, size: 64, offset: 384)
!856 = !DICompositeType(tag: DW_TAG_array_type, baseType: !479, size: 64, elements: !576)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !804, file: !794, line: 740, baseType: !858, size: 512)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !794, line: 365, size: 512, elements: !859)
!859 = !{!860, !861, !862}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !858, file: !794, line: 368, baseType: !827, size: 384)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !858, file: !794, line: 373, baseType: !479, size: 64, offset: 384)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !858, file: !794, line: 374, baseType: !479, size: 64, offset: 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !804, file: !794, line: 741, baseType: !864, size: 576)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !794, line: 380, size: 576, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !864, file: !794, line: 383, baseType: !858, size: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !864, file: !794, line: 389, baseType: !856, size: 64, offset: 512)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !804, file: !794, line: 742, baseType: !869, size: 320)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !794, line: 395, size: 320, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !869, file: !794, line: 397, baseType: !807, size: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !869, file: !794, line: 400, baseType: !791, size: 64, offset: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !804, file: !794, line: 743, baseType: !874, size: 448)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !794, line: 406, size: 448, elements: !875)
!875 = !{!876, !877, !878, !879}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !874, file: !794, line: 408, baseType: !807, size: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !874, file: !794, line: 412, baseType: !479, size: 64, offset: 256)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !874, file: !794, line: 420, baseType: !479, size: 64, offset: 320)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !874, file: !794, line: 423, baseType: !791, size: 64, offset: 384)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !804, file: !794, line: 744, baseType: !881, size: 384)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !794, line: 429, size: 384, elements: !882)
!882 = !{!883, !884, !885}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !881, file: !794, line: 431, baseType: !807, size: 256)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !881, file: !794, line: 434, baseType: !479, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !881, file: !794, line: 437, baseType: !791, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !804, file: !794, line: 745, baseType: !887, size: 384)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !794, line: 443, size: 384, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !887, file: !794, line: 445, baseType: !807, size: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !887, file: !794, line: 449, baseType: !479, size: 64, offset: 256)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !887, file: !794, line: 453, baseType: !791, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !804, file: !794, line: 746, baseType: !893, size: 320)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !794, line: 459, size: 320, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !893, file: !794, line: 461, baseType: !807, size: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !893, file: !794, line: 464, baseType: !479, size: 64, offset: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !804, file: !794, line: 747, baseType: !898, size: 768)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !794, line: 469, size: 768, elements: !899)
!899 = !{!900, !901, !902, !903, !904}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !898, file: !794, line: 471, baseType: !807, size: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !898, file: !794, line: 474, baseType: !7, size: 32, offset: 256)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !898, file: !794, line: 475, baseType: !7, size: 32, offset: 288)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !898, file: !794, line: 478, baseType: !479, size: 64, offset: 320)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !898, file: !794, line: 481, baseType: !905, size: 384, offset: 384)
!905 = !DICompositeType(tag: DW_TAG_array_type, baseType: !906, size: 384, elements: !576)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !166, line: 1917, size: 384, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !906, file: !166, line: 1920, baseType: !844, size: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !906, file: !166, line: 1921, baseType: !479, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !906, file: !166, line: 1922, baseType: !602, size: 32, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !804, file: !794, line: 748, baseType: !912, size: 320)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !794, line: 487, size: 320, elements: !913)
!913 = !{!914, !915}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !912, file: !794, line: 490, baseType: !807, size: 256)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !912, file: !794, line: 494, baseType: !470, size: 32, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !804, file: !794, line: 749, baseType: !917, size: 384)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !794, line: 500, size: 384, elements: !918)
!918 = !{!919, !920, !921}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !917, file: !794, line: 502, baseType: !807, size: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !917, file: !794, line: 506, baseType: !791, size: 64, offset: 256)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !917, file: !794, line: 510, baseType: !791, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !804, file: !794, line: 750, baseType: !923, size: 320)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !794, line: 529, size: 320, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !923, file: !794, line: 531, baseType: !807, size: 256)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !923, file: !794, line: 540, baseType: !791, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !804, file: !794, line: 751, baseType: !928, size: 704)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !794, line: 546, size: 704, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !928, file: !794, line: 549, baseType: !858, size: 512)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !928, file: !794, line: 553, baseType: !475, size: 64, offset: 512)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !928, file: !794, line: 557, baseType: !469, size: 8, offset: 576)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !928, file: !794, line: 558, baseType: !469, size: 8, offset: 584)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !928, file: !794, line: 559, baseType: !469, size: 8, offset: 592)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !928, file: !794, line: 560, baseType: !469, size: 8, offset: 600)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !928, file: !794, line: 566, baseType: !856, size: 64, offset: 640)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !804, file: !794, line: 752, baseType: !938, size: 384)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !794, line: 571, size: 384, elements: !939)
!939 = !{!940, !941}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !938, file: !794, line: 573, baseType: !869, size: 320)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !938, file: !794, line: 577, baseType: !479, size: 64, offset: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !804, file: !794, line: 753, baseType: !943, size: 576)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !794, line: 600, size: 576, elements: !944)
!944 = !{!945, !946, !947, !950, !959}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !943, file: !794, line: 602, baseType: !869, size: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !943, file: !794, line: 605, baseType: !479, size: 64, offset: 320)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !943, file: !794, line: 609, baseType: !948, size: 64, offset: 384)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !949, line: 46, baseType: !478)
!949 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!950 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !943, file: !794, line: 612, baseType: !951, size: 64, offset: 448)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !794, line: 581, size: 320, elements: !953)
!953 = !{!954, !955, !956, !957, !958}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !952, file: !794, line: 583, baseType: !165, size: 32)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !952, file: !794, line: 586, baseType: !479, size: 64, offset: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !952, file: !794, line: 589, baseType: !479, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !952, file: !794, line: 592, baseType: !479, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !952, file: !794, line: 595, baseType: !479, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !943, file: !794, line: 616, baseType: !791, size: 64, offset: 512)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !804, file: !794, line: 754, baseType: !961, size: 512)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !794, line: 622, size: 512, elements: !962)
!962 = !{!963, !964, !965, !966}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !961, file: !794, line: 624, baseType: !869, size: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !961, file: !794, line: 628, baseType: !479, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !961, file: !794, line: 632, baseType: !479, size: 64, offset: 384)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !961, file: !794, line: 636, baseType: !479, size: 64, offset: 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !804, file: !794, line: 755, baseType: !968, size: 704)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !794, line: 642, size: 704, elements: !969)
!969 = !{!970, !971, !972, !973}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !968, file: !794, line: 644, baseType: !961, size: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !968, file: !794, line: 648, baseType: !479, size: 64, offset: 512)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !968, file: !794, line: 652, baseType: !479, size: 64, offset: 576)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !968, file: !794, line: 653, baseType: !479, size: 64, offset: 640)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !804, file: !794, line: 756, baseType: !975, size: 448)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !794, line: 663, size: 448, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !975, file: !794, line: 665, baseType: !869, size: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !975, file: !794, line: 668, baseType: !479, size: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !975, file: !794, line: 673, baseType: !479, size: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !804, file: !794, line: 757, baseType: !981, size: 384)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !794, line: 694, size: 384, elements: !982)
!982 = !{!983, !984}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !981, file: !794, line: 696, baseType: !869, size: 320)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !981, file: !794, line: 699, baseType: !479, size: 64, offset: 320)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !804, file: !794, line: 758, baseType: !986, size: 384)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !794, line: 681, size: 384, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !986, file: !794, line: 683, baseType: !807, size: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !986, file: !794, line: 686, baseType: !479, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !986, file: !794, line: 689, baseType: !479, size: 64, offset: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !804, file: !794, line: 759, baseType: !992, size: 384)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !794, line: 707, size: 384, elements: !993)
!993 = !{!994, !995, !996}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !992, file: !794, line: 709, baseType: !807, size: 256)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !992, file: !794, line: 712, baseType: !479, size: 64, offset: 256)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !992, file: !794, line: 712, baseType: !479, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !804, file: !794, line: 760, baseType: !998, size: 320)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !794, line: 718, size: 320, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !998, file: !794, line: 720, baseType: !807, size: 256)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !998, file: !794, line: 723, baseType: !479, size: 64, offset: 256)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !799, file: !794, line: 138, baseType: !798, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !799, file: !794, line: 139, baseType: !798, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !793, file: !794, line: 146, baseType: !797, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !793, file: !794, line: 152, baseType: !791, size: 64, offset: 128)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !788, file: !381, line: 130, baseType: !652, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !783, file: !381, line: 134, baseType: !474, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !783, file: !381, line: 137, baseType: !479, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !783, file: !381, line: 138, baseType: !602, size: 32, offset: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !783, file: !381, line: 142, baseType: !7, size: 32, offset: 352)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !783, file: !381, line: 144, baseType: !470, size: 32, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !783, file: !381, line: 145, baseType: !470, size: 32, offset: 416)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !783, file: !381, line: 146, baseType: !1014, size: 64, offset: 448)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !381, line: 119, baseType: !533)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !766, file: !381, line: 220, baseType: !769, size: 64, offset: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !766, file: !381, line: 223, baseType: !474, size: 64, offset: 128)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !766, file: !381, line: 226, baseType: !1018, size: 64, offset: 192)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !361, line: 100, size: 1216, elements: !1020)
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1030, !1031, !1032, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1053, !1054, !1055, !1063, !1071, !1072}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1019, file: !361, line: 102, baseType: !470, size: 32)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1019, file: !361, line: 105, baseType: !7, size: 32, offset: 32)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1019, file: !361, line: 108, baseType: !765, size: 64, offset: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1019, file: !361, line: 111, baseType: !765, size: 64, offset: 128)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1019, file: !361, line: 114, baseType: !1026, size: 64, offset: 192)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !361, line: 41, size: 64, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1026, file: !361, line: 42, baseType: !360, size: 32)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1026, file: !361, line: 43, baseType: !7, size: 32, offset: 32)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1019, file: !361, line: 117, baseType: !7, size: 32, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1019, file: !361, line: 120, baseType: !7, size: 32, offset: 288)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1019, file: !361, line: 123, baseType: !1033, size: 64, offset: 320)
!1033 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1034, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !361, line: 87, baseType: !1035)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !361, line: 87, size: 128, elements: !1036)
!1036 = !{!1037}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1035, file: !361, line: 87, baseType: !1038, size: 128)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !361, line: 85, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !361, line: 85, size: 128, elements: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1039, file: !361, line: 85, baseType: !7, size: 32)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1039, file: !361, line: 85, baseType: !7, size: 32, offset: 32)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1039, file: !361, line: 85, baseType: !1044, size: 64, offset: 64)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1045, size: 64, elements: !576)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !361, line: 84, baseType: !1018)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1019, file: !361, line: 126, baseType: !1018, size: 64, offset: 384)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1019, file: !361, line: 129, baseType: !1018, size: 64, offset: 448)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1019, file: !361, line: 132, baseType: !474, size: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1019, file: !361, line: 139, baseType: !479, size: 64, offset: 576)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1019, file: !361, line: 143, baseType: !527, size: 128, offset: 640)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1019, file: !361, line: 146, baseType: !527, size: 128, offset: 768)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1019, file: !361, line: 148, baseType: !469, size: 8, offset: 896)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1019, file: !361, line: 149, baseType: !469, size: 8, offset: 904)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1019, file: !361, line: 153, baseType: !369, size: 32, offset: 928)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1019, file: !361, line: 156, baseType: !1056, size: 64, offset: 960)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !361, line: 48, size: 320, elements: !1058)
!1058 = !{!1059, !1060, !1061, !1062}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1057, file: !361, line: 50, baseType: !802, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1057, file: !361, line: 59, baseType: !527, size: 128, offset: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1057, file: !361, line: 64, baseType: !469, size: 8, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1057, file: !361, line: 67, baseType: !1056, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1019, file: !361, line: 159, baseType: !1064, size: 64, offset: 1024)
!1064 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1065, size: 64)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !361, line: 72, size: 256, elements: !1066)
!1066 = !{!1067, !1068, !1069, !1070}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1065, file: !361, line: 74, baseType: !782, size: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1065, file: !361, line: 77, baseType: !1064, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1065, file: !361, line: 78, baseType: !1064, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1065, file: !361, line: 81, baseType: !1064, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1019, file: !361, line: 162, baseType: !469, size: 8, offset: 1088)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1019, file: !361, line: 166, baseType: !479, size: 64, offset: 1152)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !766, file: !381, line: 229, baseType: !1074, size: 128, offset: 256)
!1074 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1075, size: 128, elements: !720)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !381, line: 229, flags: DIFlagFwdDecl)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !766, file: !381, line: 232, baseType: !765, size: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !766, file: !381, line: 233, baseType: !765, size: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !766, file: !381, line: 238, baseType: !1080, size: 64, offset: 512)
!1080 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !381, line: 235, size: 64, elements: !1081)
!1081 = !{!1082, !1088}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1080, file: !381, line: 236, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !381, line: 273, size: 128, elements: !1085)
!1085 = !{!1086, !1087}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1084, file: !381, line: 275, baseType: !791, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1084, file: !381, line: 278, baseType: !791, size: 64, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1080, file: !381, line: 237, baseType: !1089, size: 64)
!1089 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1090, size: 64)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !381, line: 259, size: 320, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1090, file: !381, line: 261, baseType: !652, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1090, file: !381, line: 262, baseType: !652, size: 64, offset: 64)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1090, file: !381, line: 266, baseType: !652, size: 64, offset: 128)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1090, file: !381, line: 267, baseType: !652, size: 64, offset: 192)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1090, file: !381, line: 270, baseType: !470, size: 32, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !766, file: !381, line: 241, baseType: !1014, size: 64, offset: 576)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !766, file: !381, line: 244, baseType: !470, size: 32, offset: 640)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !766, file: !381, line: 247, baseType: !470, size: 32, offset: 672)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !766, file: !381, line: 250, baseType: !470, size: 32, offset: 704)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !766, file: !381, line: 253, baseType: !470, size: 32, offset: 736)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !766, file: !381, line: 256, baseType: !470, size: 32, offset: 768)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !673, file: !655, line: 179, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !655, line: 150, baseType: !1106)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !655, line: 142, size: 320, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1114, !1115}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1106, file: !655, line: 144, baseType: !479, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1106, file: !655, line: 145, baseType: !652, size: 64, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1106, file: !655, line: 146, baseType: !652, size: 64, offset: 128)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1106, file: !655, line: 147, baseType: !1112, size: 32, offset: 192)
!1112 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1113, line: 31, baseType: !470)
!1113 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1106, file: !655, line: 148, baseType: !7, size: 32, offset: 224)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1106, file: !655, line: 149, baseType: !469, size: 8, offset: 256)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !673, file: !655, line: 180, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1118, size: 64)
!1118 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !655, line: 162, baseType: !1119)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !655, line: 159, size: 128, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1119, file: !655, line: 160, baseType: !479, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1119, file: !655, line: 161, baseType: !533, size: 64, offset: 64)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !673, file: !655, line: 181, baseType: !1124, size: 64)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !655, line: 181, flags: DIFlagFwdDecl)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !668, file: !655, line: 317, baseType: !1127, size: 64)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !533, size: 64, elements: !576)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !668, file: !655, line: 318, baseType: !1129, size: 320)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !655, line: 188, size: 320, elements: !1130)
!1130 = !{!1131, !1133, !1190}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1129, file: !655, line: 190, baseType: !1132, size: 192)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 192, elements: !551)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1129, file: !655, line: 193, baseType: !1134, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1135, size: 64)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !655, line: 206, size: 320, elements: !1136)
!1136 = !{!1137, !1175, !1176, !1177, !1189}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1135, file: !655, line: 208, baseType: !1138, size: 64)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !6, line: 62, baseType: !1140)
!1140 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1141, line: 538, size: 256, elements: !1142)
!1141 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1142 = !{!1143, !1147, !1153, !1166}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1140, file: !1141, line: 539, baseType: !1144, size: 32)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1141, line: 482, size: 32, elements: !1145)
!1145 = !{!1146}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1144, file: !1141, line: 484, baseType: !7, size: 32)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1140, file: !1141, line: 540, baseType: !1148, size: 192)
!1148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1141, line: 488, size: 192, elements: !1149)
!1149 = !{!1150, !1151, !1152}
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1148, file: !1141, line: 489, baseType: !1144, size: 32)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1148, file: !1141, line: 492, baseType: !475, size: 64, offset: 64)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1148, file: !1141, line: 496, baseType: !479, size: 64, offset: 128)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1140, file: !1141, line: 541, baseType: !1154, size: 256)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1141, line: 504, size: 256, elements: !1155)
!1155 = !{!1156, !1157, !1164, !1165}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1154, file: !1141, line: 505, baseType: !1144, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1154, file: !1141, line: 509, baseType: !1158, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1141, line: 501, baseType: !1159)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DISubroutineType(types: !1161)
!1161 = !{null, !1162}
!1162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1163, size: 64)
!1163 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1154, file: !1141, line: 510, baseType: !1162, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1154, file: !1141, line: 513, baseType: !1138, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1140, file: !1141, line: 542, baseType: !1167, size: 128)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1141, line: 530, size: 128, elements: !1168)
!1168 = !{!1169, !1170}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !1141, line: 531, baseType: !1144, size: 32)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1167, file: !1141, line: 534, baseType: !1171, size: 64, offset: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1141, line: 525, baseType: !1172)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1173, size: 64)
!1173 = !DISubroutineType(types: !1174)
!1174 = !{!469, !479, !475, !478, !478}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1135, file: !655, line: 211, baseType: !7, size: 32, offset: 64)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1135, file: !655, line: 214, baseType: !533, size: 64, offset: 128)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1135, file: !655, line: 224, baseType: !1178, size: 64, offset: 192)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !655, line: 202, baseType: !1180)
!1180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !655, line: 202, size: 128, elements: !1181)
!1181 = !{!1182}
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1180, file: !655, line: 202, baseType: !1183, size: 128)
!1183 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !655, line: 200, baseType: !1184)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !655, line: 200, size: 128, elements: !1185)
!1185 = !{!1186, !1187, !1188}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1184, file: !655, line: 200, baseType: !7, size: 32)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1184, file: !655, line: 200, baseType: !7, size: 32, offset: 32)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1184, file: !655, line: 200, baseType: !686, size: 64, offset: 64)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1135, file: !655, line: 234, baseType: !1178, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1129, file: !655, line: 197, baseType: !533, size: 64, offset: 256)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !668, file: !655, line: 319, baseType: !540, size: 256)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !668, file: !655, line: 320, baseType: !559, size: 192)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !481, file: !166, line: 3384, baseType: !1194, size: 1472)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !166, line: 3114, size: 1472, elements: !1195)
!1195 = !{!1196, !1217, !1218, !1219, !1220}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1194, file: !166, line: 3115, baseType: !1197, size: 1216)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !166, line: 2984, size: 1216, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214, !1215, !1216}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1197, file: !166, line: 2985, baseType: !648, size: 960)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1197, file: !166, line: 2986, baseType: !479, size: 64, offset: 960)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1197, file: !166, line: 2987, baseType: !479, size: 64, offset: 1024)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1197, file: !166, line: 2988, baseType: !479, size: 64, offset: 1088)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1197, file: !166, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1197, file: !166, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1197, file: !166, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1197, file: !166, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1197, file: !166, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1197, file: !166, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1197, file: !166, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1197, file: !166, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1197, file: !166, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1197, file: !166, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1197, file: !166, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1197, file: !166, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1197, file: !166, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1197, file: !166, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1194, file: !166, line: 3117, baseType: !479, size: 64, offset: 1216)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1194, file: !166, line: 3119, baseType: !479, size: 64, offset: 1280)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1194, file: !166, line: 3121, baseType: !479, size: 64, offset: 1344)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1194, file: !166, line: 3123, baseType: !479, size: 64, offset: 1408)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !481, file: !166, line: 3385, baseType: !1222, size: 1088)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !166, line: 2874, size: 1088, elements: !1223)
!1223 = !{!1224, !1225, !1226}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1222, file: !166, line: 2875, baseType: !648, size: 960)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1222, file: !166, line: 2876, baseType: !652, size: 64, offset: 960)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1222, file: !166, line: 2877, baseType: !1227, size: 64, offset: 1024)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !166, line: 2856, flags: DIFlagFwdDecl)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !481, file: !166, line: 3386, baseType: !1197, size: 1216)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !481, file: !166, line: 3387, baseType: !1231, size: 1280)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !166, line: 3093, size: 1280, elements: !1232)
!1232 = !{!1233, !1234}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1231, file: !166, line: 3094, baseType: !1197, size: 1216)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1231, file: !166, line: 3095, baseType: !1227, size: 64, offset: 1216)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !481, file: !166, line: 3388, baseType: !1236, size: 1216)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !166, line: 2824, size: 1216, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1242, !1243}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1236, file: !166, line: 2825, baseType: !610, size: 896)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1236, file: !166, line: 2827, baseType: !479, size: 64, offset: 896)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1236, file: !166, line: 2828, baseType: !479, size: 64, offset: 960)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1236, file: !166, line: 2829, baseType: !479, size: 64, offset: 1024)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1236, file: !166, line: 2830, baseType: !479, size: 64, offset: 1088)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1236, file: !166, line: 2831, baseType: !479, size: 64, offset: 1152)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !481, file: !166, line: 3389, baseType: !1245, size: 1024)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !166, line: 2850, size: 1024, elements: !1246)
!1246 = !{!1247, !1248, !1249}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1245, file: !166, line: 2851, baseType: !648, size: 960)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1245, file: !166, line: 2852, baseType: !470, size: 32, offset: 960)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1245, file: !166, line: 2853, baseType: !470, size: 32, offset: 992)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !481, file: !166, line: 3390, baseType: !1251, size: 1024)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !166, line: 2857, size: 1024, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1251, file: !166, line: 2858, baseType: !648, size: 960)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1251, file: !166, line: 2859, baseType: !1227, size: 64, offset: 960)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !481, file: !166, line: 3391, baseType: !1256, size: 960)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !166, line: 2862, size: 960, elements: !1257)
!1257 = !{!1258}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1256, file: !166, line: 2863, baseType: !648, size: 960)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !481, file: !166, line: 3392, baseType: !1260, size: 1472)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !166, line: 3304, size: 1472, elements: !1261)
!1261 = !{!1262}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1260, file: !166, line: 3305, baseType: !1194, size: 1472)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !481, file: !166, line: 3393, baseType: !1264, size: 1792)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !166, line: 3248, size: 1792, elements: !1265)
!1265 = !{!1266, !1267, !1530, !1531, !1532, !1533, !1534, !1535, !1536, !1537, !1538, !1539, !1540, !1541, !1542, !1543, !1544, !1545, !1546, !1547, !1548, !1549, !1550}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1264, file: !166, line: 3249, baseType: !1194, size: 1472)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1264, file: !166, line: 3251, baseType: !1268, size: 64, offset: 1472)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1270, line: 463, size: 1152, elements: !1271)
!1270 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
