; ModuleID = 'tracer.bc'
source_filename = "tracer.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.simple_bitmap_def = type { i8*, i32, i32, [1 x i64] }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!499 = !DIEnumerator(name: "TRY_FINALLY_EXPR", value: 131, isUnsigned: true)
!500 = !DIEnumerator(name: "DECL_EXPR", value: 132, isUnsigned: true)
!501 = !DIEnumerator(name: "LABEL_EXPR", value: 133, isUnsigned: true)
!502 = !DIEnumerator(name: "GOTO_EXPR", value: 134, isUnsigned: true)
!503 = !DIEnumerator(name: "RETURN_EXPR", value: 135, isUnsigned: true)
!504 = !DIEnumerator(name: "EXIT_EXPR", value: 136, isUnsigned: true)
!505 = !DIEnumerator(name: "LOOP_EXPR", value: 137, isUnsigned: true)
!506 = !DIEnumerator(name: "SWITCH_EXPR", value: 138, isUnsigned: true)
!507 = !DIEnumerator(name: "CASE_LABEL_EXPR", value: 139, isUnsigned: true)
!508 = !DIEnumerator(name: "ASM_EXPR", value: 140, isUnsigned: true)
!509 = !DIEnumerator(name: "SSA_NAME", value: 141, isUnsigned: true)
!510 = !DIEnumerator(name: "CATCH_EXPR", value: 142, isUnsigned: true)
!511 = !DIEnumerator(name: "EH_FILTER_EXPR", value: 143, isUnsigned: true)
!512 = !DIEnumerator(name: "SCEV_KNOWN", value: 144, isUnsigned: true)
!513 = !DIEnumerator(name: "SCEV_NOT_KNOWN", value: 145, isUnsigned: true)
!514 = !DIEnumerator(name: "POLYNOMIAL_CHREC", value: 146, isUnsigned: true)
!515 = !DIEnumerator(name: "STATEMENT_LIST", value: 147, isUnsigned: true)
!516 = !DIEnumerator(name: "ASSERT_EXPR", value: 148, isUnsigned: true)
!517 = !DIEnumerator(name: "TREE_BINFO", value: 149, isUnsigned: true)
!518 = !DIEnumerator(name: "WITH_SIZE_EXPR", value: 150, isUnsigned: true)
!519 = !DIEnumerator(name: "REALIGN_LOAD_EXPR", value: 151, isUnsigned: true)
!520 = !DIEnumerator(name: "TARGET_MEM_REF", value: 152, isUnsigned: true)
!521 = !DIEnumerator(name: "OMP_PARALLEL", value: 153, isUnsigned: true)
!522 = !DIEnumerator(name: "OMP_TASK", value: 154, isUnsigned: true)
!523 = !DIEnumerator(name: "OMP_FOR", value: 155, isUnsigned: true)
!524 = !DIEnumerator(name: "OMP_SECTIONS", value: 156, isUnsigned: true)
!525 = !DIEnumerator(name: "OMP_SINGLE", value: 157, isUnsigned: true)
!526 = !DIEnumerator(name: "OMP_SECTION", value: 158, isUnsigned: true)
!527 = !DIEnumerator(name: "OMP_MASTER", value: 159, isUnsigned: true)
!528 = !DIEnumerator(name: "OMP_ORDERED", value: 160, isUnsigned: true)
!529 = !DIEnumerator(name: "OMP_CRITICAL", value: 161, isUnsigned: true)
!530 = !DIEnumerator(name: "OMP_ATOMIC", value: 162, isUnsigned: true)
!531 = !DIEnumerator(name: "OMP_CLAUSE", value: 163, isUnsigned: true)
!532 = !DIEnumerator(name: "REDUC_MAX_EXPR", value: 164, isUnsigned: true)
!533 = !DIEnumerator(name: "REDUC_MIN_EXPR", value: 165, isUnsigned: true)
!534 = !DIEnumerator(name: "REDUC_PLUS_EXPR", value: 166, isUnsigned: true)
!535 = !DIEnumerator(name: "DOT_PROD_EXPR", value: 167, isUnsigned: true)
!536 = !DIEnumerator(name: "WIDEN_SUM_EXPR", value: 168, isUnsigned: true)
!537 = !DIEnumerator(name: "WIDEN_MULT_EXPR", value: 169, isUnsigned: true)
!538 = !DIEnumerator(name: "VEC_LSHIFT_EXPR", value: 170, isUnsigned: true)
!539 = !DIEnumerator(name: "VEC_RSHIFT_EXPR", value: 171, isUnsigned: true)
!540 = !DIEnumerator(name: "VEC_WIDEN_MULT_HI_EXPR", value: 172, isUnsigned: true)
!541 = !DIEnumerator(name: "VEC_WIDEN_MULT_LO_EXPR", value: 173, isUnsigned: true)
!542 = !DIEnumerator(name: "VEC_UNPACK_HI_EXPR", value: 174, isUnsigned: true)
!543 = !DIEnumerator(name: "VEC_UNPACK_LO_EXPR", value: 175, isUnsigned: true)
!544 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_HI_EXPR", value: 176, isUnsigned: true)
!545 = !DIEnumerator(name: "VEC_UNPACK_FLOAT_LO_EXPR", value: 177, isUnsigned: true)
!546 = !DIEnumerator(name: "VEC_PACK_TRUNC_EXPR", value: 178, isUnsigned: true)
!547 = !DIEnumerator(name: "VEC_PACK_SAT_EXPR", value: 179, isUnsigned: true)
!548 = !DIEnumerator(name: "VEC_PACK_FIX_TRUNC_EXPR", value: 180, isUnsigned: true)
!549 = !DIEnumerator(name: "VEC_EXTRACT_EVEN_EXPR", value: 181, isUnsigned: true)
!550 = !DIEnumerator(name: "VEC_EXTRACT_ODD_EXPR", value: 182, isUnsigned: true)
!551 = !DIEnumerator(name: "VEC_INTERLEAVE_HIGH_EXPR", value: 183, isUnsigned: true)
!552 = !DIEnumerator(name: "VEC_INTERLEAVE_LOW_EXPR", value: 184, isUnsigned: true)
!553 = !DIEnumerator(name: "PREDICT_EXPR", value: 185, isUnsigned: true)
!554 = !DIEnumerator(name: "OPTIMIZATION_NODE", value: 186, isUnsigned: true)
!555 = !DIEnumerator(name: "TARGET_OPTION_NODE", value: 187, isUnsigned: true)
!556 = !DIEnumerator(name: "LAST_AND_UNUSED_TREE_CODE", value: 188, isUnsigned: true)
!557 = !DIEnumerator(name: "C_MAYBE_CONST_EXPR", value: 189, isUnsigned: true)
!558 = !DIEnumerator(name: "EXCESS_PRECISION_EXPR", value: 190, isUnsigned: true)
!559 = !DIEnumerator(name: "MAX_TREE_CODES", value: 191, isUnsigned: true)
!560 = !{!561, !562, !563, !564, !567, !568, !570, !586, !1914, !587, !7, !704}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!563 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibnode_t", file: !572, line: 74, baseType: !573)
!572 = !DIFile(filename: "./include/fibheap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fibnode", file: !572, line: 59, size: 448, elements: !575)
!575 = !{!576, !577, !578, !579, !580, !583, !584, !585}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !574, file: !572, line: 61, baseType: !573, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "child", scope: !574, file: !572, line: 62, baseType: !573, size: 64, offset: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !574, file: !572, line: 63, baseType: !573, size: 64, offset: 128)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !574, file: !572, line: 64, baseType: !573, size: 64, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !574, file: !572, line: 65, baseType: !581, size: 64, offset: 256)
!581 = !DIDerivedType(tag: DW_TAG_typedef, name: "fibheapkey_t", file: !572, line: 50, baseType: !582)
!582 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !574, file: !572, line: 66, baseType: !567, size: 64, offset: 320)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "degree", scope: !574, file: !572, line: 71, baseType: !7, size: 31, offset: 384, flags: DIFlagBitField, extraData: i64 384)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !574, file: !572, line: 72, baseType: !7, size: 1, offset: 415, flags: DIFlagBitField, extraData: i64 384)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !588, line: 111, baseType: !589)
!588 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !591)
!591 = !{!592, !1879, !1880, !1881, !1884, !1888, !1889, !1890, !1908, !1909, !1910, !1911, !1912, !1913}
!592 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !590, file: !318, line: 219, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !595)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !596)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !595, file: !318, line: 151, baseType: !598, size: 128)
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !599)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !600)
!600 = !{!601, !602, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !599, file: !318, line: 150, baseType: !7, size: 32)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !599, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !599, file: !318, line: 150, baseType: !604, size: 64, offset: 64)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !605, size: 64, elements: !748)
!605 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !588, line: 108, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !608)
!608 = !{!609, !610, !611, !1871, !1872, !1873, !1874, !1875, !1876, !1877}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !607, file: !318, line: 124, baseType: !589, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !607, file: !318, line: 125, baseType: !589, size: 64, offset: 64)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !607, file: !318, line: 131, baseType: !612, size: 64, offset: 128)
!612 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !613)
!613 = !{!614, !1870}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !612, file: !318, line: 129, baseType: !615, size: 64)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !588, line: 66, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !618, line: 143, size: 192, elements: !619)
!618 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!619 = !{!620, !1868, !1869}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !617, file: !618, line: 145, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !588, line: 69, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !618, line: 136, size: 192, elements: !624)
!624 = !{!625, !1866, !1867}
!625 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !623, file: !618, line: 137, baseType: !626, size: 64)
!626 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !588, line: 58, baseType: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !618, line: 737, size: 768, elements: !629)
!629 = !{!630, !1713, !1723, !1729, !1734, !1739, !1746, !1752, !1758, !1763, !1777, !1782, !1788, !1793, !1803, !1808, !1824, !1831, !1838, !1844, !1849, !1855, !1861}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !628, file: !618, line: 738, baseType: !631, size: 256)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !618, line: 271, size: 256, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !648, !649, !650}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !631, file: !618, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !631, file: !618, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !631, file: !618, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !631, file: !618, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !631, file: !618, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !631, file: !618, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !631, file: !618, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !631, file: !618, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !631, file: !618, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !631, file: !618, line: 312, baseType: !7, size: 32, offset: 32)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !631, file: !618, line: 316, baseType: !644, size: 32, offset: 64)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !645, line: 58, baseType: !646)
!645 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !647, line: 44, baseType: !7)
!647 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!648 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !631, file: !618, line: 319, baseType: !7, size: 32, offset: 96)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !631, file: !618, line: 323, baseType: !589, size: 64, offset: 128)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !631, file: !618, line: 327, baseType: !651, size: 64, offset: 192)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !588, line: 56, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !654)
!654 = !{!655, !688, !694, !706, !725, !736, !741, !750, !756, !769, !777, !815, !1023, !1051, !1068, !1069, !1074, !1083, !1089, !1094, !1098, !1102, !1364, !1411, !1417, !1423, !1430, !1443, !1457, !1474, !1486, !1508, !1523, !1695}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !653, file: !334, line: 3372, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !657)
!657 = !{!658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !656, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !656, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !656, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !656, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !656, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !656, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !656, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !656, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !656, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !656, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !656, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !656, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !656, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !656, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !656, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !656, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !656, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !656, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !656, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !656, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !656, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !656, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !656, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !656, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !656, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !656, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !656, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !656, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !656, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !656, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !653, file: !334, line: 3373, baseType: !689, size: 192)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !690)
!690 = !{!691, !692, !693}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !689, file: !334, line: 403, baseType: !656, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !689, file: !334, line: 404, baseType: !651, size: 64, offset: 64)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !689, file: !334, line: 405, baseType: !651, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !653, file: !334, line: 3374, baseType: !695, size: 320)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !696)
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !695, file: !334, line: 1385, baseType: !689, size: 192)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !695, file: !334, line: 1386, baseType: !699, size: 128, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !700, line: 58, baseType: !701)
!700 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!701 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !700, line: 54, size: 128, elements: !702)
!702 = !{!703, !705}
!703 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !701, file: !700, line: 56, baseType: !704, size: 64)
!704 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !701, file: !700, line: 57, baseType: !582, size: 64, offset: 64)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !653, file: !334, line: 3375, baseType: !707, size: 256)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !707, file: !334, line: 1398, baseType: !689, size: 192)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !707, file: !334, line: 1399, baseType: !711, size: 64, offset: 192)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !713, line: 52, size: 256, elements: !714)
!713 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!714 = !{!715, !716, !717, !718, !719, !720, !721}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !712, file: !713, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !712, file: !713, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !712, file: !713, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !712, file: !713, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !712, file: !713, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !712, file: !713, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !712, file: !713, line: 62, baseType: !722, size: 192, offset: 64)
!722 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 192, elements: !723)
!723 = !{!724}
!724 = !DISubrange(count: 3)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !653, file: !334, line: 3376, baseType: !726, size: 256)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !727)
!727 = !{!728, !729}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !726, file: !334, line: 1409, baseType: !689, size: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !726, file: !334, line: 1410, baseType: !730, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !732, line: 27, size: 192, elements: !733)
!732 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !731, file: !732, line: 29, baseType: !699, size: 128)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !731, file: !732, line: 30, baseType: !189, size: 32, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !653, file: !334, line: 3377, baseType: !737, size: 256)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !737, file: !334, line: 1438, baseType: !689, size: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !737, file: !334, line: 1439, baseType: !651, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !653, file: !334, line: 3378, baseType: !742, size: 256)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !743)
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !742, file: !334, line: 1419, baseType: !689, size: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !742, file: !334, line: 1420, baseType: !563, size: 32, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !742, file: !334, line: 1421, baseType: !747, size: 8, offset: 224)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 8, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 1)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !653, file: !334, line: 3379, baseType: !751, size: 320)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !751, file: !334, line: 1429, baseType: !689, size: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !751, file: !334, line: 1430, baseType: !651, size: 64, offset: 192)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !751, file: !334, line: 1431, baseType: !651, size: 64, offset: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !653, file: !334, line: 3380, baseType: !757, size: 320)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !758)
!758 = !{!759, !760}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !757, file: !334, line: 1461, baseType: !689, size: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !757, file: !334, line: 1462, baseType: !761, size: 128, offset: 192)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !762, line: 31, size: 128, elements: !763)
!762 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!763 = !{!764, !767, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !761, file: !762, line: 32, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !766, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !562)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !761, file: !762, line: 33, baseType: !7, size: 32, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !761, file: !762, line: 34, baseType: !7, size: 32, offset: 96)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !653, file: !334, line: 3381, baseType: !770, size: 384)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !771)
!771 = !{!772, !773, !774, !775, !776}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !770, file: !334, line: 2508, baseType: !689, size: 192)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !770, file: !334, line: 2509, baseType: !644, size: 32, offset: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !770, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !770, file: !334, line: 2511, baseType: !651, size: 64, offset: 256)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !770, file: !334, line: 2512, baseType: !651, size: 64, offset: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !653, file: !334, line: 3382, baseType: !778, size: 896)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !779)
!779 = !{!780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !778, file: !334, line: 2653, baseType: !770, size: 384)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !778, file: !334, line: 2654, baseType: !651, size: 64, offset: 384)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !778, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !778, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !778, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !778, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !778, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !778, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !778, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !778, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !778, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !778, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !778, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !778, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !778, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !778, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !778, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !778, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !778, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !778, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !778, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !778, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !778, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !778, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !778, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !778, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !778, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !778, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !778, file: !334, line: 2705, baseType: !651, size: 64, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !778, file: !334, line: 2706, baseType: !651, size: 64, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !778, file: !334, line: 2707, baseType: !651, size: 64, offset: 704)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !778, file: !334, line: 2708, baseType: !651, size: 64, offset: 768)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !778, file: !334, line: 2711, baseType: !813, size: 64, offset: 832)
!813 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!814 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !653, file: !334, line: 3383, baseType: !816, size: 960)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !817)
!817 = !{!818, !819}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !334, line: 2757, baseType: !778, size: 896)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !816, file: !334, line: 2758, baseType: !820, size: 64, offset: 896)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !588, line: 50, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !823, line: 240, size: 384, elements: !824)
!823 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!824 = !{!825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !822, file: !823, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !822, file: !823, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !822, file: !823, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !822, file: !823, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !822, file: !823, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !822, file: !823, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !822, file: !823, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !822, file: !823, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !822, file: !823, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !822, file: !823, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !822, file: !823, line: 321, baseType: !836, size: 320, offset: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !823, line: 315, size: 320, elements: !837)
!837 = !{!838, !956, !958, !1021, !1022}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !836, file: !823, line: 316, baseType: !839, size: 64)
!839 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 64, elements: !748)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !823, line: 183, baseType: !841)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !823, line: 166, size: 64, elements: !842)
!842 = !{!843, !844, !845, !846, !847, !855, !856, !868, !871, !931, !932, !933, !946, !953}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !841, file: !823, line: 168, baseType: !563, size: 32)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !841, file: !823, line: 169, baseType: !7, size: 32)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !841, file: !823, line: 170, baseType: !568, size: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !841, file: !823, line: 171, baseType: !820, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !841, file: !823, line: 172, baseType: !848, size: 64)
!848 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !588, line: 53, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !823, line: 359, size: 128, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !850, file: !823, line: 360, baseType: !563, size: 32)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !850, file: !823, line: 361, baseType: !854, size: 64, offset: 64)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !820, size: 64, elements: !748)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !841, file: !823, line: 173, baseType: !189, size: 32)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !841, file: !823, line: 174, baseType: !857, size: 32)
!857 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !823, line: 133, baseType: !858)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !823, line: 115, size: 32, elements: !859)
!859 = !{!860, !861, !862, !863, !864, !865, !866, !867}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !858, file: !823, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !858, file: !823, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !858, file: !823, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !858, file: !823, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !858, file: !823, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !858, file: !823, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !858, file: !823, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !858, file: !823, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !841, file: !823, line: 175, baseType: !869, size: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !823, line: 175, flags: DIFlagFwdDecl)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !841, file: !823, line: 176, baseType: !872, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !874, line: 75, size: 256, elements: !875)
!874 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!875 = !{!876, !890, !891, !892}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !873, file: !874, line: 76, baseType: !877, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !874, line: 68, baseType: !879)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !874, line: 63, size: 320, elements: !880)
!880 = !{!881, !883, !884, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !879, file: !874, line: 64, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !879, file: !874, line: 65, baseType: !882, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !879, file: !874, line: 66, baseType: !7, size: 32, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !879, file: !874, line: 67, baseType: !886, size: 128, offset: 192)
!886 = !DICompositeType(tag: DW_TAG_array_type, baseType: !887, size: 128, elements: !888)
!887 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !874, line: 29, baseType: !704)
!888 = !{!889}
!889 = !DISubrange(count: 2)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !873, file: !874, line: 77, baseType: !877, size: 64, offset: 64)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !873, file: !874, line: 78, baseType: !7, size: 32, offset: 128)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !873, file: !874, line: 79, baseType: !893, size: 64, offset: 192)
!893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!894 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !874, line: 49, baseType: !895)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !874, line: 45, size: 832, elements: !896)
!896 = !{!897, !898, !899}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !895, file: !874, line: 46, baseType: !882, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !895, file: !874, line: 47, baseType: !872, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !895, file: !874, line: 48, baseType: !900, size: 704, offset: 128)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !901, line: 164, size: 704, elements: !902)
!901 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!902 = !{!903, !904, !914, !915, !916, !917, !918, !919, !923, !927, !928, !929, !930}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !900, file: !901, line: 166, baseType: !582, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !900, file: !901, line: 167, baseType: !905, size: 64, offset: 64)
!905 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !906, size: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !901, line: 157, size: 192, elements: !907)
!907 = !{!908, !909, !910}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !906, file: !901, line: 159, baseType: !565, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !906, file: !901, line: 160, baseType: !905, size: 64, offset: 64)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !906, file: !901, line: 161, baseType: !911, size: 32, offset: 128)
!911 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 32, elements: !912)
!912 = !{!913}
!913 = !DISubrange(count: 4)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !900, file: !901, line: 168, baseType: !565, size: 64, offset: 128)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !900, file: !901, line: 169, baseType: !565, size: 64, offset: 192)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !900, file: !901, line: 170, baseType: !565, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !900, file: !901, line: 171, baseType: !582, size: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !900, file: !901, line: 172, baseType: !563, size: 32, offset: 384)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !900, file: !901, line: 176, baseType: !920, size: 64, offset: 448)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = !DISubroutineType(types: !922)
!922 = !{!905, !567, !582}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !900, file: !901, line: 177, baseType: !924, size: 64, offset: 512)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DISubroutineType(types: !926)
!926 = !{null, !567, !905}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !900, file: !901, line: 178, baseType: !567, size: 64, offset: 576)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !900, file: !901, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !900, file: !901, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !900, file: !901, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !841, file: !823, line: 177, baseType: !651, size: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !841, file: !823, line: 178, baseType: !589, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !841, file: !823, line: 179, baseType: !934, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !823, line: 150, baseType: !936)
!936 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !823, line: 142, size: 320, elements: !937)
!937 = !{!938, !939, !940, !941, !944, !945}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !936, file: !823, line: 144, baseType: !651, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !936, file: !823, line: 145, baseType: !820, size: 64, offset: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !936, file: !823, line: 146, baseType: !820, size: 64, offset: 128)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !936, file: !823, line: 147, baseType: !942, size: 32, offset: 192)
!942 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !943, line: 31, baseType: !563)
!943 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!944 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !936, file: !823, line: 148, baseType: !7, size: 32, offset: 224)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !936, file: !823, line: 149, baseType: !562, size: 8, offset: 256)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !841, file: !823, line: 180, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !823, line: 162, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !823, line: 159, size: 128, elements: !950)
!950 = !{!951, !952}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !949, file: !823, line: 160, baseType: !651, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !949, file: !823, line: 161, baseType: !582, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !841, file: !823, line: 181, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !823, line: 181, flags: DIFlagFwdDecl)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !836, file: !823, line: 317, baseType: !957, size: 64)
!957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !582, size: 64, elements: !748)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !836, file: !823, line: 318, baseType: !959, size: 320)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !823, line: 188, size: 320, elements: !960)
!960 = !{!961, !963, !1020}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !959, file: !823, line: 190, baseType: !962, size: 192)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !840, size: 192, elements: !723)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !959, file: !823, line: 193, baseType: !964, size: 64, offset: 192)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !823, line: 206, size: 320, elements: !966)
!966 = !{!967, !1005, !1006, !1007, !1019}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !965, file: !823, line: 208, baseType: !968, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !588, line: 62, baseType: !970)
!970 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !971, line: 538, size: 256, elements: !972)
!971 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!972 = !{!973, !977, !983, !996}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !970, file: !971, line: 539, baseType: !974, size: 32)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !971, line: 482, size: 32, elements: !975)
!975 = !{!976}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !974, file: !971, line: 484, baseType: !7, size: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !970, file: !971, line: 540, baseType: !978, size: 192)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !971, line: 488, size: 192, elements: !979)
!979 = !{!980, !981, !982}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !978, file: !971, line: 489, baseType: !974, size: 32)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !978, file: !971, line: 492, baseType: !568, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !978, file: !971, line: 496, baseType: !651, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !970, file: !971, line: 541, baseType: !984, size: 256)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !971, line: 504, size: 256, elements: !985)
!985 = !{!986, !987, !994, !995}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !971, line: 505, baseType: !974, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !984, file: !971, line: 509, baseType: !988, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !971, line: 501, baseType: !989)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = !DISubroutineType(types: !991)
!991 = !{null, !992}
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !984, file: !971, line: 510, baseType: !992, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !971, line: 513, baseType: !968, size: 64, offset: 192)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !970, file: !971, line: 542, baseType: !997, size: 128)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !971, line: 530, size: 128, elements: !998)
!998 = !{!999, !1000}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !997, file: !971, line: 531, baseType: !974, size: 32)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !997, file: !971, line: 534, baseType: !1001, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !971, line: 525, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!562, !651, !568, !704, !704}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !965, file: !823, line: 211, baseType: !7, size: 32, offset: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !965, file: !823, line: 214, baseType: !582, size: 64, offset: 128)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !965, file: !823, line: 224, baseType: !1008, size: 64, offset: 192)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !823, line: 202, baseType: !1010)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !823, line: 202, size: 128, elements: !1011)
!1011 = !{!1012}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1010, file: !823, line: 202, baseType: !1013, size: 128)
!1013 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !823, line: 200, baseType: !1014)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !823, line: 200, size: 128, elements: !1015)
!1015 = !{!1016, !1017, !1018}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1014, file: !823, line: 200, baseType: !7, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1014, file: !823, line: 200, baseType: !7, size: 32, offset: 32)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1014, file: !823, line: 200, baseType: !854, size: 64, offset: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !965, file: !823, line: 234, baseType: !1008, size: 64, offset: 256)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !959, file: !823, line: 197, baseType: !582, size: 64, offset: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !836, file: !823, line: 319, baseType: !712, size: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !836, file: !823, line: 320, baseType: !731, size: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !653, file: !334, line: 3384, baseType: !1024, size: 1472)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1025)
!1025 = !{!1026, !1047, !1048, !1049, !1050}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1024, file: !334, line: 3115, baseType: !1027, size: 1216)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1028)
!1028 = !{!1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1027, file: !334, line: 2985, baseType: !816, size: 960)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1027, file: !334, line: 2986, baseType: !651, size: 64, offset: 960)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1027, file: !334, line: 2987, baseType: !651, size: 64, offset: 1024)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1027, file: !334, line: 2988, baseType: !651, size: 64, offset: 1088)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1027, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1027, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1027, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1027, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1027, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1027, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1027, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1027, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1027, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1027, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1027, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1027, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1027, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1027, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1024, file: !334, line: 3117, baseType: !651, size: 64, offset: 1216)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1024, file: !334, line: 3119, baseType: !651, size: 64, offset: 1280)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1024, file: !334, line: 3121, baseType: !651, size: 64, offset: 1344)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1024, file: !334, line: 3123, baseType: !651, size: 64, offset: 1408)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !653, file: !334, line: 3385, baseType: !1052, size: 1088)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1053)
!1053 = !{!1054, !1055, !1056}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1052, file: !334, line: 2875, baseType: !816, size: 960)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1052, file: !334, line: 2876, baseType: !820, size: 64, offset: 960)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1052, file: !334, line: 2877, baseType: !1057, size: 64, offset: 1024)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1059, line: 172, size: 128, elements: !1060)
!1059 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1060 = !{!1061, !1062, !1063, !1064, !1065, !1066, !1067}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1058, file: !1059, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1058, file: !1059, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1058, file: !1059, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1058, file: !1059, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1058, file: !1059, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1058, file: !1059, line: 195, baseType: !7, size: 32, offset: 32)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1058, file: !1059, line: 199, baseType: !651, size: 64, offset: 64)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !653, file: !334, line: 3386, baseType: !1027, size: 1216)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !653, file: !334, line: 3387, baseType: !1070, size: 1280)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1070, file: !334, line: 3094, baseType: !1027, size: 1216)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1070, file: !334, line: 3095, baseType: !1057, size: 64, offset: 1216)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !653, file: !334, line: 3388, baseType: !1075, size: 1216)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081, !1082}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1075, file: !334, line: 2825, baseType: !778, size: 896)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1075, file: !334, line: 2827, baseType: !651, size: 64, offset: 896)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1075, file: !334, line: 2828, baseType: !651, size: 64, offset: 960)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1075, file: !334, line: 2829, baseType: !651, size: 64, offset: 1024)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1075, file: !334, line: 2830, baseType: !651, size: 64, offset: 1088)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1075, file: !334, line: 2831, baseType: !651, size: 64, offset: 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !653, file: !334, line: 3389, baseType: !1084, size: 1024)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1084, file: !334, line: 2851, baseType: !816, size: 960)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1084, file: !334, line: 2852, baseType: !563, size: 32, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1084, file: !334, line: 2853, baseType: !563, size: 32, offset: 992)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !653, file: !334, line: 3390, baseType: !1090, size: 1024)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !334, line: 2858, baseType: !816, size: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1090, file: !334, line: 2859, baseType: !1057, size: 64, offset: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !653, file: !334, line: 3391, baseType: !1095, size: 960)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1096)
!1096 = !{!1097}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !334, line: 2863, baseType: !816, size: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !653, file: !334, line: 3392, baseType: !1099, size: 1472)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1100)
!1100 = !{!1101}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1099, file: !334, line: 3305, baseType: !1024, size: 1472)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !653, file: !334, line: 3393, baseType: !1103, size: 1792)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1104)
!1104 = !{!1105, !1106, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358, !1359, !1360, !1361, !1362, !1363}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1103, file: !334, line: 3249, baseType: !1024, size: 1472)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1103, file: !334, line: 3251, baseType: !1107, size: 64, offset: 1472)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1109, line: 463, size: 1152, elements: !1110)
!1109 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1110 = !{!1111, !1114, !1144, !1145, !1284, !1287, !1288, !1289, !1290, !1291, !1292, !1316, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1108, file: !1109, line: 464, baseType: !1112, size: 64)
!1112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1113, size: 64)
!1113 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1109, line: 464, flags: DIFlagFwdDecl)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1108, file: !1109, line: 467, baseType: !1115, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1117)
!1117 = !{!1118, !1119, !1120, !1133, !1134, !1135, !1136, !1137, !1138, !1140, !1142, !1143}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1116, file: !318, line: 377, baseType: !587, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1116, file: !318, line: 378, baseType: !587, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1116, file: !318, line: 381, baseType: !1121, size: 64, offset: 128)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1124)
!1124 = !{!1125}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1123, file: !318, line: 282, baseType: !1126, size: 128)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1127, file: !318, line: 281, baseType: !7, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1127, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1127, file: !318, line: 281, baseType: !1132, size: 64, offset: 64)
!1132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !587, size: 64, elements: !748)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1116, file: !318, line: 384, baseType: !563, size: 32, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1116, file: !318, line: 387, baseType: !563, size: 32, offset: 224)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1116, file: !318, line: 390, baseType: !563, size: 32, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1116, file: !318, line: 394, baseType: !1121, size: 64, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1116, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1116, file: !318, line: 399, baseType: !1139, size: 64, offset: 416)
!1139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !888)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1116, file: !318, line: 402, baseType: !1141, size: 64, offset: 480)
!1141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !888)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1116, file: !318, line: 406, baseType: !563, size: 32, offset: 544)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1116, file: !318, line: 409, baseType: !563, size: 32, offset: 576)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1108, file: !1109, line: 470, baseType: !616, size: 64, offset: 128)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1108, file: !1109, line: 473, baseType: !1146, size: 64, offset: 192)
!1146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1147, size: 64)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1059, line: 39, size: 1152, elements: !1148)
!1148 = !{!1149, !1199, !1212, !1225, !1226, !1238, !1239, !1243, !1244, !1245, !1246, !1247}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1147, file: !1059, line: 41, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1151, line: 144, baseType: !1152)
!1151 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1153, size: 64)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1151, line: 100, size: 896, elements: !1154)
!1154 = !{!1155, !1161, !1166, !1171, !1173, !1176, !1177, !1178, !1179, !1180, !1185, !1187, !1188, !1193, !1198}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1153, file: !1151, line: 102, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1151, line: 52, baseType: !1157)
!1157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1158, size: 64)
!1158 = !DISubroutineType(types: !1159)
!1159 = !{!1160, !992}
!1160 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1151, line: 47, baseType: !7)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1153, file: !1151, line: 105, baseType: !1162, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1151, line: 59, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!563, !992, !992}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1153, file: !1151, line: 108, baseType: !1167, size: 64, offset: 128)
!1167 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1151, line: 63, baseType: !1168)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1169, size: 64)
!1169 = !DISubroutineType(types: !1170)
!1170 = !{null, !567}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1153, file: !1151, line: 111, baseType: !1172, size: 64, offset: 192)
!1172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1153, file: !1151, line: 114, baseType: !1174, size: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1175, line: 46, baseType: !704)
!1175 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1153, file: !1151, line: 117, baseType: !1174, size: 64, offset: 320)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1153, file: !1151, line: 120, baseType: !1174, size: 64, offset: 384)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1153, file: !1151, line: 124, baseType: !7, size: 32, offset: 448)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1153, file: !1151, line: 128, baseType: !7, size: 32, offset: 480)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1153, file: !1151, line: 131, baseType: !1181, size: 64, offset: 512)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1151, line: 75, baseType: !1182)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = !DISubroutineType(types: !1184)
!1184 = !{!567, !1174, !1174}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1153, file: !1151, line: 132, baseType: !1186, size: 64, offset: 576)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1151, line: 78, baseType: !1168)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1153, file: !1151, line: 135, baseType: !567, size: 64, offset: 640)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1153, file: !1151, line: 136, baseType: !1189, size: 64, offset: 704)
!1189 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1151, line: 82, baseType: !1190)
!1190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1191, size: 64)
!1191 = !DISubroutineType(types: !1192)
!1192 = !{!567, !567, !1174, !1174}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1153, file: !1151, line: 137, baseType: !1194, size: 64, offset: 768)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1151, line: 83, baseType: !1195)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = !DISubroutineType(types: !1197)
!1197 = !{null, !567, !567}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1153, file: !1151, line: 141, baseType: !7, size: 32, offset: 832)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1147, file: !1059, line: 48, baseType: !1200, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !618, line: 35, baseType: !1202)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !618, line: 35, size: 128, elements: !1203)
!1203 = !{!1204}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1202, file: !618, line: 35, baseType: !1205, size: 128)
!1205 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !618, line: 33, baseType: !1206)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !618, line: 33, size: 128, elements: !1207)
!1207 = !{!1208, !1209, !1210}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1206, file: !618, line: 33, baseType: !7, size: 32)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1206, file: !618, line: 33, baseType: !7, size: 32, offset: 32)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1206, file: !618, line: 33, baseType: !1211, size: 64, offset: 64)
!1211 = !DICompositeType(tag: DW_TAG_array_type, baseType: !626, size: 64, elements: !748)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1147, file: !1059, line: 51, baseType: !1213, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1216)
!1216 = !{!1217}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1215, file: !334, line: 183, baseType: !1218, size: 128)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1219)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1220)
!1220 = !{!1221, !1222, !1223}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1219, file: !334, line: 182, baseType: !7, size: 32)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1219, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1219, file: !334, line: 182, baseType: !1224, size: 64, offset: 64)
!1224 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 64, elements: !748)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1147, file: !1059, line: 54, baseType: !651, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1147, file: !1059, line: 57, baseType: !1227, size: 128, offset: 256)
!1227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1228, line: 31, size: 128, elements: !1229)
!1228 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1229 = !{!1230, !1231, !1232, !1233, !1234, !1235, !1236}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1227, file: !1228, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1227, file: !1228, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1227, file: !1228, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1227, file: !1228, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1227, file: !1228, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1227, file: !1228, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1227, file: !1228, line: 56, baseType: !1237, size: 64, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !588, line: 47, baseType: !872)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1147, file: !1059, line: 60, baseType: !1227, size: 128, offset: 384)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1147, file: !1059, line: 64, baseType: !1240, size: 64, offset: 512)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1242, line: 33, flags: DIFlagFwdDecl)
!1242 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1147, file: !1059, line: 67, baseType: !651, size: 64, offset: 576)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1147, file: !1059, line: 73, baseType: !1150, size: 64, offset: 640)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1147, file: !1059, line: 77, baseType: !1237, size: 64, offset: 704)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1147, file: !1059, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1147, file: !1059, line: 82, baseType: !1248, size: 320, offset: 832)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1249, line: 62, size: 320, elements: !1250)
!1249 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1250 = !{!1251, !1257, !1258, !1259, !1260, !1267}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1248, file: !1249, line: 63, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1249, line: 56, size: 128, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1253, file: !1249, line: 57, baseType: !1252, size: 64)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1253, file: !1249, line: 58, baseType: !747, size: 8, offset: 64)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1248, file: !1249, line: 64, baseType: !7, size: 32, offset: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1248, file: !1249, line: 66, baseType: !7, size: 32, offset: 96)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1248, file: !1249, line: 68, baseType: !562, size: 8, offset: 128)
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1248, file: !1249, line: 70, baseType: !1261, size: 64, offset: 192)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1249, line: 37, size: 128, elements: !1263)
!1263 = !{!1264, !1265}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1262, file: !1249, line: 39, baseType: !1261, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1262, file: !1249, line: 40, baseType: !1266, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1248, file: !1249, line: 71, baseType: !1268, size: 64, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1249, line: 45, size: 320, elements: !1270)
!1270 = !{!1271, !1272}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1269, file: !1249, line: 47, baseType: !1268, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1269, file: !1249, line: 48, baseType: !1273, size: 256, offset: 64)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1274)
!1274 = !{!1275, !1277, !1278, !1283}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1273, file: !334, line: 1884, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1273, file: !334, line: 1885, baseType: !1276, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1273, file: !334, line: 1891, baseType: !1279, size: 64, offset: 128)
!1279 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1273, file: !334, line: 1891, size: 64, elements: !1280)
!1280 = !{!1281, !1282}
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1279, file: !334, line: 1891, baseType: !626, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1279, file: !334, line: 1891, baseType: !651, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1273, file: !334, line: 1892, baseType: !1266, size: 64, offset: 192)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1108, file: !1109, line: 476, baseType: !1285, size: 64, offset: 256)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1109, line: 476, flags: DIFlagFwdDecl)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1108, file: !1109, line: 479, baseType: !1150, size: 64, offset: 320)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1108, file: !1109, line: 484, baseType: !651, size: 64, offset: 384)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1108, file: !1109, line: 488, baseType: !651, size: 64, offset: 448)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1108, file: !1109, line: 493, baseType: !651, size: 64, offset: 512)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1108, file: !1109, line: 496, baseType: !651, size: 64, offset: 576)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1108, file: !1109, line: 501, baseType: !1293, size: 64, offset: 640)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1295)
!1295 = !{!1296, !1299, !1300, !1301, !1302, !1304, !1305, !1310, !1311, !1312, !1313, !1314, !1315}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1294, file: !329, line: 2356, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1294, file: !329, line: 2357, baseType: !568, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1294, file: !329, line: 2358, baseType: !563, size: 32, offset: 128)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1294, file: !329, line: 2359, baseType: !563, size: 32, offset: 160)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1294, file: !329, line: 2360, baseType: !1303, size: 128, offset: 192)
!1303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !563, size: 128, elements: !912)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1294, file: !329, line: 2364, baseType: !563, size: 32, offset: 320)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1294, file: !329, line: 2367, baseType: !1306, size: 128, offset: 384)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1307)
!1307 = !{!1308, !1309}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1306, file: !329, line: 2351, baseType: !820, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1306, file: !329, line: 2352, baseType: !582, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1294, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1294, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1294, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1294, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1294, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1294, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1108, file: !1109, line: 504, baseType: !1317, size: 64, offset: 704)
!1317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1318 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1109, line: 504, flags: DIFlagFwdDecl)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1108, file: !1109, line: 507, baseType: !1150, size: 64, offset: 768)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1108, file: !1109, line: 510, baseType: !563, size: 32, offset: 832)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1108, file: !1109, line: 513, baseType: !563, size: 32, offset: 864)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1108, file: !1109, line: 516, baseType: !644, size: 32, offset: 896)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1108, file: !1109, line: 519, baseType: !644, size: 32, offset: 928)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1108, file: !1109, line: 522, baseType: !7, size: 32, offset: 960)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1108, file: !1109, line: 523, baseType: !7, size: 32, offset: 992)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1108, file: !1109, line: 528, baseType: !568, size: 64, offset: 1024)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1108, file: !1109, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1108, file: !1109, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1108, file: !1109, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1108, file: !1109, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1108, file: !1109, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1108, file: !1109, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1108, file: !1109, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1108, file: !1109, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1108, file: !1109, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1108, file: !1109, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1108, file: !1109, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1108, file: !1109, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
