; ModuleID = 'tree-nrv.bc'
source_filename = "tree-nrv.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }

!569 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!570 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!571 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!572 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!573 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!574 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!575 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!576 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!577 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!578 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!579 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!580 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!581 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!582 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!583 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!584 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!585 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!586 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!587 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!588 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!589 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!590 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!591 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!592 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!593 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!594 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!598 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!599 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !561, line: 727, baseType: !7, size: 32, elements: !600)
!600 = !{!601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624}
!601 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!602 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!603 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!604 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!605 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!606 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!607 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!608 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!609 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!610 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!611 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!612 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!613 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!614 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!615 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!616 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!624 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!625 = !{!626, !627, !628, !629, !632, !633, !317, !635, !1930, !817, !1229, !630, !1932, !1951}
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!628 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !631)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !561, line: 737, size: 768, elements: !637)
!637 = !{!638, !1777, !1787, !1793, !1798, !1803, !1810, !1816, !1822, !1827, !1841, !1846, !1852, !1857, !1867, !1872, !1888, !1895, !1902, !1908, !1913, !1919, !1925}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !636, file: !561, line: 738, baseType: !639, size: 256)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !561, line: 271, size: 256, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !656, !657, !1776}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !639, file: !561, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !639, file: !561, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !639, file: !561, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !639, file: !561, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !639, file: !561, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !639, file: !561, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !639, file: !561, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !639, file: !561, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !639, file: !561, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !639, file: !561, line: 312, baseType: !7, size: 32, offset: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !639, file: !561, line: 316, baseType: !652, size: 32, offset: 64)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !653, line: 58, baseType: !654)
!653 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !655, line: 44, baseType: !7)
!655 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!656 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !639, file: !561, line: 319, baseType: !7, size: 32, offset: 96)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !639, file: !561, line: 323, baseType: !658, size: 64, offset: 128)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !513, line: 217, size: 832, elements: !660)
!660 = !{!661, !1741, !1742, !1743, !1746, !1750, !1751, !1752, !1770, !1771, !1772, !1773, !1774, !1775}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !659, file: !513, line: 219, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !513, line: 151, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !513, line: 151, size: 128, elements: !665)
!665 = !{!666}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !664, file: !513, line: 151, baseType: !667, size: 128)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !513, line: 150, baseType: !668)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !513, line: 150, size: 128, elements: !669)
!669 = !{!670, !671, !672}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !668, file: !513, line: 150, baseType: !7, size: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !668, file: !513, line: 150, baseType: !7, size: 32, offset: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !668, file: !513, line: 150, baseType: !673, size: 64, offset: 64)
!673 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 64, elements: !736)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !675, line: 108, baseType: !676)
!675 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !513, line: 122, size: 512, elements: !678)
!678 = !{!679, !680, !681, !1733, !1734, !1735, !1736, !1737, !1738, !1739}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !677, file: !513, line: 124, baseType: !658, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !677, file: !513, line: 125, baseType: !658, size: 64, offset: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !677, file: !513, line: 131, baseType: !682, size: 64, offset: 128)
!682 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !513, line: 128, size: 64, elements: !683)
!683 = !{!684, !700}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !682, file: !513, line: 129, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !675, line: 66, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !561, line: 143, size: 192, elements: !688)
!688 = !{!689, !698, !699}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !687, file: !561, line: 145, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !675, line: 69, baseType: !691)
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !561, line: 136, size: 192, elements: !693)
!693 = !{!694, !696, !697}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !692, file: !561, line: 137, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !675, line: 58, baseType: !635)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !692, file: !561, line: 138, baseType: !691, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !561, line: 139, baseType: !691, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !687, file: !561, line: 146, baseType: !690, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !687, file: !561, line: 152, baseType: !685, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !682, file: !513, line: 130, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !675, line: 50, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !704, line: 240, size: 384, elements: !705)
!704 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!705 = !{!706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !703, file: !704, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !703, file: !704, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !703, file: !704, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !703, file: !704, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !703, file: !704, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !703, file: !704, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !703, file: !704, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !703, file: !704, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !703, file: !704, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !703, file: !704, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !703, file: !704, line: 321, baseType: !717, size: 320, offset: 64)
!717 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !704, line: 315, size: 320, elements: !718)
!718 = !{!719, !1700, !1702, !1731, !1732}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !717, file: !704, line: 316, baseType: !720, size: 64)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !721, size: 64, elements: !736)
!721 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !704, line: 183, baseType: !722)
!722 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !704, line: 166, size: 64, elements: !723)
!723 = !{!724, !725, !726, !727, !728, !738, !739, !751, !754, !816, !1678, !1679, !1690, !1697}
!724 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !722, file: !704, line: 168, baseType: !628, size: 32)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !722, file: !704, line: 169, baseType: !7, size: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !722, file: !704, line: 170, baseType: !633, size: 64)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !722, file: !704, line: 171, baseType: !701, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !722, file: !704, line: 172, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !675, line: 53, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !704, line: 359, size: 128, elements: !732)
!732 = !{!733, !734}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !731, file: !704, line: 360, baseType: !628, size: 32)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !731, file: !704, line: 361, baseType: !735, size: 64, offset: 64)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 64, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 1)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !722, file: !704, line: 173, baseType: !189, size: 32)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !722, file: !704, line: 174, baseType: !740, size: 32)
!740 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !704, line: 133, baseType: !741)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !704, line: 115, size: 32, elements: !742)
!742 = !{!743, !744, !745, !746, !747, !748, !749, !750}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !741, file: !704, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !741, file: !704, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !741, file: !704, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !741, file: !704, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !741, file: !704, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !741, file: !704, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !741, file: !704, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !741, file: !704, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !722, file: !704, line: 175, baseType: !752, size: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !704, line: 175, flags: DIFlagFwdDecl)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !722, file: !704, line: 176, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !757, line: 75, size: 256, elements: !758)
!757 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!758 = !{!759, !774, !775, !776}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !756, file: !757, line: 76, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !757, line: 68, baseType: !762)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !757, line: 63, size: 320, elements: !763)
!763 = !{!764, !766, !767, !768}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !762, file: !757, line: 64, baseType: !765, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !762, file: !757, line: 65, baseType: !765, size: 64, offset: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !762, file: !757, line: 66, baseType: !7, size: 32, offset: 128)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !762, file: !757, line: 67, baseType: !769, size: 128, offset: 192)
!769 = !DICompositeType(tag: DW_TAG_array_type, baseType: !770, size: 128, elements: !772)
!770 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !757, line: 29, baseType: !771)
!771 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!772 = !{!773}
!773 = !DISubrange(count: 2)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !756, file: !757, line: 77, baseType: !760, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !756, file: !757, line: 78, baseType: !7, size: 32, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !756, file: !757, line: 79, baseType: !777, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !757, line: 49, baseType: !779)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !757, line: 45, size: 832, elements: !780)
!780 = !{!781, !782, !783}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !779, file: !757, line: 46, baseType: !765, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !779, file: !757, line: 47, baseType: !755, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !779, file: !757, line: 48, baseType: !784, size: 704, offset: 128)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !785, line: 164, size: 704, elements: !786)
!785 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!786 = !{!787, !789, !799, !800, !801, !802, !803, !804, !808, !812, !813, !814, !815}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !784, file: !785, line: 166, baseType: !788, size: 64)
!788 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !784, file: !785, line: 167, baseType: !790, size: 64, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !785, line: 157, size: 192, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !791, file: !785, line: 159, baseType: !630, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !791, file: !785, line: 160, baseType: !790, size: 64, offset: 64)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !791, file: !785, line: 161, baseType: !796, size: 32, offset: 128)
!796 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 32, elements: !797)
!797 = !{!798}
!798 = !DISubrange(count: 4)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !784, file: !785, line: 168, baseType: !630, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !784, file: !785, line: 169, baseType: !630, size: 64, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !784, file: !785, line: 170, baseType: !630, size: 64, offset: 256)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !784, file: !785, line: 171, baseType: !788, size: 64, offset: 320)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !784, file: !785, line: 172, baseType: !628, size: 32, offset: 384)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !784, file: !785, line: 176, baseType: !805, size: 64, offset: 448)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DISubroutineType(types: !807)
!807 = !{!790, !632, !788}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !784, file: !785, line: 177, baseType: !809, size: 64, offset: 512)
!809 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !810, size: 64)
!810 = !DISubroutineType(types: !811)
!811 = !{null, !632, !790}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !784, file: !785, line: 178, baseType: !632, size: 64, offset: 576)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !784, file: !785, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !784, file: !785, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !784, file: !785, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !722, file: !704, line: 177, baseType: !817, size: 64)
!817 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !675, line: 56, baseType: !818)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !318, line: 3371, size: 1792, elements: !820)
!820 = !{!821, !854, !860, !871, !890, !901, !906, !913, !919, !932, !940, !978, !983, !1011, !1028, !1029, !1034, !1043, !1049, !1054, !1058, !1062, !1327, !1376, !1382, !1388, !1395, !1408, !1422, !1439, !1451, !1473, !1488, !1660}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !819, file: !318, line: 3372, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !318, line: 360, size: 64, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !822, file: !318, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !822, file: !318, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !822, file: !318, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !822, file: !318, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !822, file: !318, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !822, file: !318, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !822, file: !318, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !822, file: !318, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !822, file: !318, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !822, file: !318, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !822, file: !318, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !822, file: !318, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !822, file: !318, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !822, file: !318, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !822, file: !318, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !822, file: !318, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !822, file: !318, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !822, file: !318, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !822, file: !318, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !822, file: !318, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !822, file: !318, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !822, file: !318, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !822, file: !318, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !822, file: !318, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !822, file: !318, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !822, file: !318, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !822, file: !318, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !822, file: !318, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !822, file: !318, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !822, file: !318, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !318, line: 3373, baseType: !855, size: 192)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !318, line: 402, size: 192, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !855, file: !318, line: 403, baseType: !822, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !855, file: !318, line: 404, baseType: !817, size: 64, offset: 64)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !855, file: !318, line: 405, baseType: !817, size: 64, offset: 128)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !819, file: !318, line: 3374, baseType: !861, size: 320)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !318, line: 1384, size: 320, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !861, file: !318, line: 1385, baseType: !855, size: 192)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !861, file: !318, line: 1386, baseType: !865, size: 128, offset: 192)
!865 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !866, line: 58, baseType: !867)
!866 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !866, line: 54, size: 128, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !867, file: !866, line: 56, baseType: !771, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !867, file: !866, line: 57, baseType: !788, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !819, file: !318, line: 3375, baseType: !872, size: 256)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !318, line: 1397, size: 256, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !872, file: !318, line: 1398, baseType: !855, size: 192)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !872, file: !318, line: 1399, baseType: !876, size: 64, offset: 192)
!876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !877, size: 64)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !878, line: 52, size: 256, elements: !879)
!878 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!879 = !{!880, !881, !882, !883, !884, !885, !886}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !877, file: !878, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !877, file: !878, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !877, file: !878, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !877, file: !878, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !877, file: !878, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !877, file: !878, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !877, file: !878, line: 62, baseType: !887, size: 192, offset: 64)
!887 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 192, elements: !888)
!888 = !{!889}
!889 = !DISubrange(count: 3)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !819, file: !318, line: 3376, baseType: !891, size: 256)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !318, line: 1408, size: 256, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !891, file: !318, line: 1409, baseType: !855, size: 192)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !891, file: !318, line: 1410, baseType: !895, size: 64, offset: 192)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !897, line: 27, size: 192, elements: !898)
!897 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !896, file: !897, line: 29, baseType: !865, size: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !896, file: !897, line: 30, baseType: !189, size: 32, offset: 128)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !819, file: !318, line: 3377, baseType: !902, size: 256)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !318, line: 1437, size: 256, elements: !903)
!903 = !{!904, !905}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !318, line: 1438, baseType: !855, size: 192)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !902, file: !318, line: 1439, baseType: !817, size: 64, offset: 192)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !819, file: !318, line: 3378, baseType: !907, size: 256)
!907 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !318, line: 1418, size: 256, elements: !908)
!908 = !{!909, !910, !911}
!909 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !907, file: !318, line: 1419, baseType: !855, size: 192)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !907, file: !318, line: 1420, baseType: !628, size: 32, offset: 192)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !907, file: !318, line: 1421, baseType: !912, size: 8, offset: 224)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !631, size: 8, elements: !736)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !819, file: !318, line: 3379, baseType: !914, size: 320)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !318, line: 1428, size: 320, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !914, file: !318, line: 1429, baseType: !855, size: 192)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !914, file: !318, line: 1430, baseType: !817, size: 64, offset: 192)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !914, file: !318, line: 1431, baseType: !817, size: 64, offset: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !819, file: !318, line: 3380, baseType: !920, size: 320)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !318, line: 1460, size: 320, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !920, file: !318, line: 1461, baseType: !855, size: 192)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !920, file: !318, line: 1462, baseType: !924, size: 128, offset: 192)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !925, line: 31, size: 128, elements: !926)
!925 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!926 = !{!927, !930, !931}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !924, file: !925, line: 32, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !627)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !924, file: !925, line: 33, baseType: !7, size: 32, offset: 64)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !924, file: !925, line: 34, baseType: !7, size: 32, offset: 96)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !819, file: !318, line: 3381, baseType: !933, size: 384)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !318, line: 2507, size: 384, elements: !934)
!934 = !{!935, !936, !937, !938, !939}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !933, file: !318, line: 2508, baseType: !855, size: 192)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !933, file: !318, line: 2509, baseType: !652, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !933, file: !318, line: 2510, baseType: !7, size: 32, offset: 224)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !933, file: !318, line: 2511, baseType: !817, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !933, file: !318, line: 2512, baseType: !817, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !819, file: !318, line: 3382, baseType: !941, size: 896)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !318, line: 2652, size: 896, elements: !942)
!942 = !{!943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972, !973, !974, !975}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !941, file: !318, line: 2653, baseType: !933, size: 384)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !941, file: !318, line: 2654, baseType: !817, size: 64, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !941, file: !318, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !941, file: !318, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !941, file: !318, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !941, file: !318, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !941, file: !318, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !941, file: !318, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !941, file: !318, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !941, file: !318, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !941, file: !318, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !941, file: !318, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !941, file: !318, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !941, file: !318, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !941, file: !318, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !941, file: !318, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !941, file: !318, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !941, file: !318, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !941, file: !318, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !941, file: !318, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !941, file: !318, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !941, file: !318, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !941, file: !318, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !941, file: !318, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !941, file: !318, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !941, file: !318, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !941, file: !318, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !941, file: !318, line: 2703, baseType: !7, size: 32, offset: 512)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !941, file: !318, line: 2705, baseType: !817, size: 64, offset: 576)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !941, file: !318, line: 2706, baseType: !817, size: 64, offset: 640)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !941, file: !318, line: 2707, baseType: !817, size: 64, offset: 704)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !941, file: !318, line: 2708, baseType: !817, size: 64, offset: 768)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !941, file: !318, line: 2711, baseType: !976, size: 64, offset: 832)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !318, line: 2711, flags: DIFlagFwdDecl)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !819, file: !318, line: 3383, baseType: !979, size: 960)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !318, line: 2756, size: 960, elements: !980)
!980 = !{!981, !982}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !979, file: !318, line: 2757, baseType: !941, size: 896)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !979, file: !318, line: 2758, baseType: !701, size: 64, offset: 896)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !819, file: !318, line: 3384, baseType: !984, size: 1472)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !318, line: 3114, size: 1472, elements: !985)
!985 = !{!986, !1007, !1008, !1009, !1010}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !984, file: !318, line: 3115, baseType: !987, size: 1216)
!987 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !318, line: 2984, size: 1216, elements: !988)
!988 = !{!989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004, !1005, !1006}
!989 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !987, file: !318, line: 2985, baseType: !979, size: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !987, file: !318, line: 2986, baseType: !817, size: 64, offset: 960)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !987, file: !318, line: 2987, baseType: !817, size: 64, offset: 1024)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !987, file: !318, line: 2988, baseType: !817, size: 64, offset: 1088)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !987, file: !318, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !987, file: !318, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !987, file: !318, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !987, file: !318, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !987, file: !318, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !987, file: !318, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !987, file: !318, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !987, file: !318, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !987, file: !318, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !987, file: !318, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !987, file: !318, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !987, file: !318, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !987, file: !318, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !987, file: !318, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !984, file: !318, line: 3117, baseType: !817, size: 64, offset: 1216)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !984, file: !318, line: 3119, baseType: !817, size: 64, offset: 1280)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !984, file: !318, line: 3121, baseType: !817, size: 64, offset: 1344)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !984, file: !318, line: 3123, baseType: !817, size: 64, offset: 1408)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !819, file: !318, line: 3385, baseType: !1012, size: 1088)
!1012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !318, line: 2874, size: 1088, elements: !1013)
!1013 = !{!1014, !1015, !1016}
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1012, file: !318, line: 2875, baseType: !979, size: 960)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1012, file: !318, line: 2876, baseType: !701, size: 64, offset: 960)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1012, file: !318, line: 2877, baseType: !1017, size: 64, offset: 1024)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1019, line: 172, size: 128, elements: !1020)
!1019 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1020 = !{!1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1018, file: !1019, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1018, file: !1019, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1018, file: !1019, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1018, file: !1019, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1018, file: !1019, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1018, file: !1019, line: 195, baseType: !7, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1018, file: !1019, line: 199, baseType: !817, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !819, file: !318, line: 3386, baseType: !987, size: 1216)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !819, file: !318, line: 3387, baseType: !1030, size: 1280)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !318, line: 3093, size: 1280, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1030, file: !318, line: 3094, baseType: !987, size: 1216)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1030, file: !318, line: 3095, baseType: !1017, size: 64, offset: 1216)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !819, file: !318, line: 3388, baseType: !1035, size: 1216)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !318, line: 2824, size: 1216, elements: !1036)
!1036 = !{!1037, !1038, !1039, !1040, !1041, !1042}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1035, file: !318, line: 2825, baseType: !941, size: 896)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1035, file: !318, line: 2827, baseType: !817, size: 64, offset: 896)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1035, file: !318, line: 2828, baseType: !817, size: 64, offset: 960)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1035, file: !318, line: 2829, baseType: !817, size: 64, offset: 1024)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1035, file: !318, line: 2830, baseType: !817, size: 64, offset: 1088)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1035, file: !318, line: 2831, baseType: !817, size: 64, offset: 1152)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !819, file: !318, line: 3389, baseType: !1044, size: 1024)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !318, line: 2850, size: 1024, elements: !1045)
!1045 = !{!1046, !1047, !1048}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1044, file: !318, line: 2851, baseType: !979, size: 960)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1044, file: !318, line: 2852, baseType: !628, size: 32, offset: 960)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1044, file: !318, line: 2853, baseType: !628, size: 32, offset: 992)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !819, file: !318, line: 3390, baseType: !1050, size: 1024)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !318, line: 2857, size: 1024, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1050, file: !318, line: 2858, baseType: !979, size: 960)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1050, file: !318, line: 2859, baseType: !1017, size: 64, offset: 960)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !819, file: !318, line: 3391, baseType: !1055, size: 960)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !318, line: 2862, size: 960, elements: !1056)
!1056 = !{!1057}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1055, file: !318, line: 2863, baseType: !979, size: 960)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !819, file: !318, line: 3392, baseType: !1059, size: 1472)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !318, line: 3304, size: 1472, elements: !1060)
!1060 = !{!1061}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1059, file: !318, line: 3305, baseType: !984, size: 1472)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !819, file: !318, line: 3393, baseType: !1063, size: 1792)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !318, line: 3248, size: 1792, elements: !1064)
!1064 = !{!1065, !1066, !1306, !1307, !1308, !1309, !1310, !1311, !1312, !1313, !1314, !1315, !1316, !1317, !1318, !1319, !1320, !1321, !1322, !1323, !1324, !1325, !1326}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1063, file: !318, line: 3249, baseType: !984, size: 1472)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1063, file: !318, line: 3251, baseType: !1067, size: 64, offset: 1472)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1069, line: 463, size: 1152, elements: !1070)
!1069 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1070 = !{!1071, !1074, !1105, !1106, !1247, !1250, !1251, !1252, !1253, !1254, !1255, !1279, !1282, !1283, !1284, !1285, !1286, !1287, !1288, !1289, !1290, !1291, !1292, !1293, !1294, !1295, !1296, !1297, !1298, !1299, !1300, !1301, !1302, !1303, !1304, !1305}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1068, file: !1069, line: 464, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1069, line: 464, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1068, file: !1069, line: 467, baseType: !1075, size: 64, offset: 64)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !513, line: 374, size: 640, elements: !1077)
!1077 = !{!1078, !1080, !1081, !1094, !1095, !1096, !1097, !1098, !1099, !1101, !1103, !1104}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1076, file: !513, line: 377, baseType: !1079, size: 64)
!1079 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !675, line: 111, baseType: !658)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1076, file: !513, line: 378, baseType: !1079, size: 64, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1076, file: !513, line: 381, baseType: !1082, size: 64, offset: 128)
!1082 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1083, size: 64)
!1083 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !513, line: 282, baseType: !1084)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !513, line: 282, size: 128, elements: !1085)
!1085 = !{!1086}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1084, file: !513, line: 282, baseType: !1087, size: 128)
!1087 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !513, line: 281, baseType: !1088)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !513, line: 281, size: 128, elements: !1089)
!1089 = !{!1090, !1091, !1092}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1088, file: !513, line: 281, baseType: !7, size: 32)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1088, file: !513, line: 281, baseType: !7, size: 32, offset: 32)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1088, file: !513, line: 281, baseType: !1093, size: 64, offset: 64)
!1093 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 64, elements: !736)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1076, file: !513, line: 384, baseType: !628, size: 32, offset: 192)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1076, file: !513, line: 387, baseType: !628, size: 32, offset: 224)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1076, file: !513, line: 390, baseType: !628, size: 32, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1076, file: !513, line: 394, baseType: !1082, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1076, file: !513, line: 396, baseType: !512, size: 32, offset: 384)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1076, file: !513, line: 399, baseType: !1100, size: 64, offset: 416)
!1100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 64, elements: !772)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1076, file: !513, line: 402, baseType: !1102, size: 64, offset: 480)
!1102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !772)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1076, file: !513, line: 406, baseType: !628, size: 32, offset: 544)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1076, file: !513, line: 409, baseType: !628, size: 32, offset: 576)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1068, file: !1069, line: 470, baseType: !686, size: 64, offset: 128)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1068, file: !1069, line: 473, baseType: !1107, size: 64, offset: 192)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1019, line: 39, size: 1152, elements: !1109)
!1109 = !{!1110, !1162, !1175, !1188, !1189, !1201, !1202, !1206, !1207, !1208, !1209, !1210}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1108, file: !1019, line: 41, baseType: !1111, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1112, line: 144, baseType: !1113)
!1112 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1114, size: 64)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1112, line: 100, size: 896, elements: !1115)
!1115 = !{!1116, !1124, !1129, !1134, !1136, !1139, !1140, !1141, !1142, !1143, !1148, !1150, !1151, !1156, !1161}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1114, file: !1112, line: 102, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1112, line: 52, baseType: !1118)
!1118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1119, size: 64)
!1119 = !DISubroutineType(types: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1112, line: 47, baseType: !7)
!1122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1123, size: 64)
!1123 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1114, file: !1112, line: 105, baseType: !1125, size: 64, offset: 64)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1112, line: 59, baseType: !1126)
!1126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1127, size: 64)
!1127 = !DISubroutineType(types: !1128)
!1128 = !{!628, !1122, !1122}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1114, file: !1112, line: 108, baseType: !1130, size: 64, offset: 128)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1112, line: 63, baseType: !1131)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DISubroutineType(types: !1133)
!1133 = !{null, !632}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1114, file: !1112, line: 111, baseType: !1135, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1114, file: !1112, line: 114, baseType: !1137, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1138, line: 46, baseType: !771)
!1138 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1114, file: !1112, line: 117, baseType: !1137, size: 64, offset: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1114, file: !1112, line: 120, baseType: !1137, size: 64, offset: 384)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1114, file: !1112, line: 124, baseType: !7, size: 32, offset: 448)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1114, file: !1112, line: 128, baseType: !7, size: 32, offset: 480)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1114, file: !1112, line: 131, baseType: !1144, size: 64, offset: 512)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1112, line: 75, baseType: !1145)
!1145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1146, size: 64)
!1146 = !DISubroutineType(types: !1147)
!1147 = !{!632, !1137, !1137}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1114, file: !1112, line: 132, baseType: !1149, size: 64, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1112, line: 78, baseType: !1131)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1114, file: !1112, line: 135, baseType: !632, size: 64, offset: 640)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1114, file: !1112, line: 136, baseType: !1152, size: 64, offset: 704)
!1152 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1112, line: 82, baseType: !1153)
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DISubroutineType(types: !1155)
!1155 = !{!632, !632, !1137, !1137}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1114, file: !1112, line: 137, baseType: !1157, size: 64, offset: 768)
!1157 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1112, line: 83, baseType: !1158)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = !DISubroutineType(types: !1160)
!1160 = !{null, !632, !632}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1114, file: !1112, line: 141, baseType: !7, size: 32, offset: 832)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1108, file: !1019, line: 48, baseType: !1163, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !561, line: 35, baseType: !1165)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !561, line: 35, size: 128, elements: !1166)
!1166 = !{!1167}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1165, file: !561, line: 35, baseType: !1168, size: 128)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !561, line: 33, baseType: !1169)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !561, line: 33, size: 128, elements: !1170)
!1170 = !{!1171, !1172, !1173}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1169, file: !561, line: 33, baseType: !7, size: 32)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1169, file: !561, line: 33, baseType: !7, size: 32, offset: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1169, file: !561, line: 33, baseType: !1174, size: 64, offset: 64)
!1174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !695, size: 64, elements: !736)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1108, file: !1019, line: 51, baseType: !1176, size: 64, offset: 128)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !318, line: 183, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !318, line: 183, size: 128, elements: !1179)
!1179 = !{!1180}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1178, file: !318, line: 183, baseType: !1181, size: 128)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !318, line: 182, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !318, line: 182, size: 128, elements: !1183)
!1183 = !{!1184, !1185, !1186}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1182, file: !318, line: 182, baseType: !7, size: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1182, file: !318, line: 182, baseType: !7, size: 32, offset: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1182, file: !318, line: 182, baseType: !1187, size: 64, offset: 64)
!1187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !817, size: 64, elements: !736)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1108, file: !1019, line: 54, baseType: !817, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1108, file: !1019, line: 57, baseType: !1190, size: 128, offset: 256)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1191, line: 31, size: 128, elements: !1192)
!1191 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1192 = !{!1193, !1194, !1195, !1196, !1197, !1198, !1199}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1190, file: !1191, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1190, file: !1191, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1190, file: !1191, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1190, file: !1191, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1190, file: !1191, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1190, file: !1191, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1190, file: !1191, line: 56, baseType: !1200, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !675, line: 47, baseType: !755)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1108, file: !1019, line: 60, baseType: !1190, size: 128, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1108, file: !1019, line: 64, baseType: !1203, size: 64, offset: 512)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1205, line: 33, flags: DIFlagFwdDecl)
!1205 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1108, file: !1019, line: 67, baseType: !817, size: 64, offset: 576)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1108, file: !1019, line: 73, baseType: !1111, size: 64, offset: 640)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1108, file: !1019, line: 77, baseType: !1200, size: 64, offset: 704)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1108, file: !1019, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1108, file: !1019, line: 82, baseType: !1211, size: 320, offset: 832)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1212, line: 62, size: 320, elements: !1213)
!1212 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1213 = !{!1214, !1220, !1221, !1222, !1223, !1230}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1211, file: !1212, line: 63, baseType: !1215, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1216, size: 64)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1212, line: 56, size: 128, elements: !1217)
!1217 = !{!1218, !1219}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1216, file: !1212, line: 57, baseType: !1215, size: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1216, file: !1212, line: 58, baseType: !912, size: 8, offset: 64)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1211, file: !1212, line: 64, baseType: !7, size: 32, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1211, file: !1212, line: 66, baseType: !7, size: 32, offset: 96)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1211, file: !1212, line: 68, baseType: !627, size: 8, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1211, file: !1212, line: 70, baseType: !1224, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1212, line: 37, size: 128, elements: !1226)
!1226 = !{!1227, !1228}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1225, file: !1212, line: 39, baseType: !1224, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1225, file: !1212, line: 40, baseType: !1229, size: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1211, file: !1212, line: 71, baseType: !1231, size: 64, offset: 256)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1212, line: 45, size: 320, elements: !1233)
!1233 = !{!1234, !1235}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1232, file: !1212, line: 47, baseType: !1231, size: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1232, file: !1212, line: 48, baseType: !1236, size: 256, offset: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !318, line: 1883, size: 256, elements: !1237)
!1237 = !{!1238, !1240, !1241, !1246}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1236, file: !318, line: 1884, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1236, file: !318, line: 1885, baseType: !1239, size: 64, offset: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1236, file: !318, line: 1891, baseType: !1242, size: 64, offset: 128)
!1242 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1236, file: !318, line: 1891, size: 64, elements: !1243)
!1243 = !{!1244, !1245}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1242, file: !318, line: 1891, baseType: !695, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1242, file: !318, line: 1891, baseType: !817, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1236, file: !318, line: 1892, baseType: !1229, size: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1068, file: !1069, line: 476, baseType: !1248, size: 64, offset: 256)
!1248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1249, size: 64)
!1249 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1069, line: 476, flags: DIFlagFwdDecl)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1068, file: !1069, line: 479, baseType: !1111, size: 64, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1068, file: !1069, line: 484, baseType: !817, size: 64, offset: 384)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1068, file: !1069, line: 488, baseType: !817, size: 64, offset: 448)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1068, file: !1069, line: 493, baseType: !817, size: 64, offset: 512)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1068, file: !1069, line: 496, baseType: !817, size: 64, offset: 576)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1068, file: !1069, line: 501, baseType: !1256, size: 64, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1257, size: 64)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !524, line: 2355, size: 576, elements: !1258)
!1258 = !{!1259, !1262, !1263, !1264, !1265, !1267, !1268, !1273, !1274, !1275, !1276, !1277, !1278}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1257, file: !524, line: 2356, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !524, line: 2356, flags: DIFlagFwdDecl)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1257, file: !524, line: 2357, baseType: !633, size: 64, offset: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1257, file: !524, line: 2358, baseType: !628, size: 32, offset: 128)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1257, file: !524, line: 2359, baseType: !628, size: 32, offset: 160)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1257, file: !524, line: 2360, baseType: !1266, size: 128, offset: 192)
!1266 = !DICompositeType(tag: DW_TAG_array_type, baseType: !628, size: 128, elements: !797)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1257, file: !524, line: 2364, baseType: !628, size: 32, offset: 320)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1257, file: !524, line: 2367, baseType: !1269, size: 128, offset: 384)
!1269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !524, line: 2349, size: 128, elements: !1270)
!1270 = !{!1271, !1272}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1269, file: !524, line: 2351, baseType: !701, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1269, file: !524, line: 2352, baseType: !788, size: 64, offset: 64)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1257, file: !524, line: 2371, baseType: !523, size: 32, offset: 512)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1257, file: !524, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1257, file: !524, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1257, file: !524, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1257, file: !524, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1257, file: !524, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1068, file: !1069, line: 504, baseType: !1280, size: 64, offset: 704)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1069, line: 504, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1068, file: !1069, line: 507, baseType: !1111, size: 64, offset: 768)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1068, file: !1069, line: 510, baseType: !628, size: 32, offset: 832)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1068, file: !1069, line: 513, baseType: !628, size: 32, offset: 864)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1068, file: !1069, line: 516, baseType: !652, size: 32, offset: 896)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1068, file: !1069, line: 519, baseType: !652, size: 32, offset: 928)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1068, file: !1069, line: 522, baseType: !7, size: 32, offset: 960)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1068, file: !1069, line: 523, baseType: !7, size: 32, offset: 992)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1068, file: !1069, line: 528, baseType: !633, size: 64, offset: 1024)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1068, file: !1069, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1068, file: !1069, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1068, file: !1069, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1068, file: !1069, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1068, file: !1069, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1068, file: !1069, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1068, file: !1069, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1068, file: !1069, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1068, file: !1069, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1068, file: !1069, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1068, file: !1069, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1068, file: !1069, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1068, file: !1069, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1068, file: !1069, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1068, file: !1069, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1068, file: !1069, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1063, file: !318, line: 3254, baseType: !817, size: 64, offset: 1536)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1063, file: !318, line: 3257, baseType: !817, size: 64, offset: 1600)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1063, file: !318, line: 3258, baseType: !817, size: 64, offset: 1664)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1063, file: !318, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1063, file: !318, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1063, file: !318, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1063, file: !318, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1063, file: !318, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1063, file: !318, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1063, file: !318, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1063, file: !318, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1063, file: !318, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1063, file: !318, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1063, file: !318, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1063, file: !318, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1063, file: !318, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1063, file: !318, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1063, file: !318, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1063, file: !318, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1063, file: !318, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1063, file: !318, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !819, file: !318, line: 3394, baseType: !1328, size: 1344)
!1328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !318, line: 2279, size: 1344, elements: !1329)
!1329 = !{!1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1355, !1356, !1357, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373}
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1328, file: !318, line: 2280, baseType: !855, size: 192)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1328, file: !318, line: 2281, baseType: !817, size: 64, offset: 192)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1328, file: !318, line: 2282, baseType: !817, size: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1328, file: !318, line: 2283, baseType: !817, size: 64, offset: 320)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1328, file: !318, line: 2284, baseType: !817, size: 64, offset: 384)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1328, file: !318, line: 2285, baseType: !7, size: 32, offset: 448)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !1328, file: !318, line: 2287, baseType: !7, size: 10, offset: 480, flags: DIFlagBitField, extraData: i64 480)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "no_force_blk_flag", scope: !1328, file: !318, line: 2288, baseType: !7, size: 1, offset: 490, flags: DIFlagBitField, extraData: i64 480)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "needs_constructing_flag", scope: !1328, file: !318, line: 2289, baseType: !7, size: 1, offset: 491, flags: DIFlagBitField, extraData: i64 480)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "transparent_aggr_flag", scope: !1328, file: !318, line: 2290, baseType: !7, size: 1, offset: 492, flags: DIFlagBitField, extraData: i64 480)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "restrict_flag", scope: !1328, file: !318, line: 2291, baseType: !7, size: 1, offset: 493, flags: DIFlagBitField, extraData: i64 480)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "contains_placeholder_bits", scope: !1328, file: !318, line: 2292, baseType: !7, size: 2, offset: 494, flags: DIFlagBitField, extraData: i64 480)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1328, file: !318, line: 2294, baseType: !7, size: 8, offset: 496, flags: DIFlagBitField, extraData: i64 480)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "string_flag", scope: !1328, file: !318, line: 2296, baseType: !7, size: 1, offset: 504, flags: DIFlagBitField, extraData: i64 480)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1328, file: !318, line: 2297, baseType: !7, size: 1, offset: 505, flags: DIFlagBitField, extraData: i64 480)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1328, file: !318, line: 2298, baseType: !7, size: 1, offset: 506, flags: DIFlagBitField, extraData: i64 480)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1328, file: !318, line: 2299, baseType: !7, size: 1, offset: 507, flags: DIFlagBitField, extraData: i64 480)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1328, file: !318, line: 2300, baseType: !7, size: 1, offset: 508, flags: DIFlagBitField, extraData: i64 480)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1328, file: !318, line: 2301, baseType: !7, size: 1, offset: 509, flags: DIFlagBitField, extraData: i64 480)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1328, file: !318, line: 2302, baseType: !7, size: 1, offset: 510, flags: DIFlagBitField, extraData: i64 480)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1328, file: !318, line: 2303, baseType: !7, size: 1, offset: 511, flags: DIFlagBitField, extraData: i64 480)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1328, file: !318, line: 2305, baseType: !7, size: 32, offset: 512)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "alias_set", scope: !1328, file: !318, line: 2306, baseType: !1353, size: 32, offset: 544)
!1353 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1354, line: 31, baseType: !628)
!1354 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "pointer_to", scope: !1328, file: !318, line: 2307, baseType: !817, size: 64, offset: 576)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "reference_to", scope: !1328, file: !318, line: 2308, baseType: !817, size: 64, offset: 640)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "symtab", scope: !1328, file: !318, line: 2314, baseType: !1358, size: 64, offset: 704)
!1358 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_type_symtab", file: !318, line: 2309, size: 64, elements: !1359)
!1359 = !{!1360, !1361, !1362}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "address", scope: !1358, file: !318, line: 2310, baseType: !628, size: 32)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !1358, file: !318, line: 2311, baseType: !633, size: 64)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "die", scope: !1358, file: !318, line: 2312, baseType: !1363, size: 64)
!1363 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1364, size: 64)
!1364 = !DICompositeType(tag: DW_TAG_structure_type, name: "die_struct", file: !318, line: 2277, flags: DIFlagFwdDecl)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1328, file: !318, line: 2315, baseType: !817, size: 64, offset: 768)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "minval", scope: !1328, file: !318, line: 2316, baseType: !817, size: 64, offset: 832)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "maxval", scope: !1328, file: !318, line: 2317, baseType: !817, size: 64, offset: 896)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "next_variant", scope: !1328, file: !318, line: 2318, baseType: !817, size: 64, offset: 960)
