; ModuleID = 'tree-ssa-address.bc'
source_filename = "tree-ssa-address.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!466 = !DIEnumerator(name: "GEU", value: 86, isUnsigned: true)
!467 = !DIEnumerator(name: "GTU", value: 87, isUnsigned: true)
!468 = !DIEnumerator(name: "LEU", value: 88, isUnsigned: true)
!469 = !DIEnumerator(name: "LTU", value: 89, isUnsigned: true)
!470 = !DIEnumerator(name: "UNORDERED", value: 90, isUnsigned: true)
!471 = !DIEnumerator(name: "ORDERED", value: 91, isUnsigned: true)
!472 = !DIEnumerator(name: "UNEQ", value: 92, isUnsigned: true)
!473 = !DIEnumerator(name: "UNGE", value: 93, isUnsigned: true)
!474 = !DIEnumerator(name: "UNGT", value: 94, isUnsigned: true)
!475 = !DIEnumerator(name: "UNLE", value: 95, isUnsigned: true)
!476 = !DIEnumerator(name: "UNLT", value: 96, isUnsigned: true)
!477 = !DIEnumerator(name: "LTGT", value: 97, isUnsigned: true)
!478 = !DIEnumerator(name: "SIGN_EXTEND", value: 98, isUnsigned: true)
!479 = !DIEnumerator(name: "ZERO_EXTEND", value: 99, isUnsigned: true)
!480 = !DIEnumerator(name: "TRUNCATE", value: 100, isUnsigned: true)
!481 = !DIEnumerator(name: "FLOAT_EXTEND", value: 101, isUnsigned: true)
!482 = !DIEnumerator(name: "FLOAT_TRUNCATE", value: 102, isUnsigned: true)
!483 = !DIEnumerator(name: "FLOAT", value: 103, isUnsigned: true)
!484 = !DIEnumerator(name: "FIX", value: 104, isUnsigned: true)
!485 = !DIEnumerator(name: "UNSIGNED_FLOAT", value: 105, isUnsigned: true)
!486 = !DIEnumerator(name: "UNSIGNED_FIX", value: 106, isUnsigned: true)
!487 = !DIEnumerator(name: "FRACT_CONVERT", value: 107, isUnsigned: true)
!488 = !DIEnumerator(name: "UNSIGNED_FRACT_CONVERT", value: 108, isUnsigned: true)
!489 = !DIEnumerator(name: "SAT_FRACT", value: 109, isUnsigned: true)
!490 = !DIEnumerator(name: "UNSIGNED_SAT_FRACT", value: 110, isUnsigned: true)
!491 = !DIEnumerator(name: "ABS", value: 111, isUnsigned: true)
!492 = !DIEnumerator(name: "SQRT", value: 112, isUnsigned: true)
!493 = !DIEnumerator(name: "BSWAP", value: 113, isUnsigned: true)
!494 = !DIEnumerator(name: "FFS", value: 114, isUnsigned: true)
!495 = !DIEnumerator(name: "CLZ", value: 115, isUnsigned: true)
!496 = !DIEnumerator(name: "CTZ", value: 116, isUnsigned: true)
!497 = !DIEnumerator(name: "POPCOUNT", value: 117, isUnsigned: true)
!498 = !DIEnumerator(name: "PARITY", value: 118, isUnsigned: true)
!499 = !DIEnumerator(name: "SIGN_EXTRACT", value: 119, isUnsigned: true)
!500 = !DIEnumerator(name: "ZERO_EXTRACT", value: 120, isUnsigned: true)
!501 = !DIEnumerator(name: "HIGH", value: 121, isUnsigned: true)
!502 = !DIEnumerator(name: "LO_SUM", value: 122, isUnsigned: true)
!503 = !DIEnumerator(name: "VEC_MERGE", value: 123, isUnsigned: true)
!504 = !DIEnumerator(name: "VEC_SELECT", value: 124, isUnsigned: true)
!505 = !DIEnumerator(name: "VEC_CONCAT", value: 125, isUnsigned: true)
!506 = !DIEnumerator(name: "VEC_DUPLICATE", value: 126, isUnsigned: true)
!507 = !DIEnumerator(name: "SS_PLUS", value: 127, isUnsigned: true)
!508 = !DIEnumerator(name: "US_PLUS", value: 128, isUnsigned: true)
!509 = !DIEnumerator(name: "SS_MINUS", value: 129, isUnsigned: true)
!510 = !DIEnumerator(name: "SS_NEG", value: 130, isUnsigned: true)
!511 = !DIEnumerator(name: "US_NEG", value: 131, isUnsigned: true)
!512 = !DIEnumerator(name: "SS_ABS", value: 132, isUnsigned: true)
!513 = !DIEnumerator(name: "SS_ASHIFT", value: 133, isUnsigned: true)
!514 = !DIEnumerator(name: "US_ASHIFT", value: 134, isUnsigned: true)
!515 = !DIEnumerator(name: "US_MINUS", value: 135, isUnsigned: true)
!516 = !DIEnumerator(name: "SS_TRUNCATE", value: 136, isUnsigned: true)
!517 = !DIEnumerator(name: "US_TRUNCATE", value: 137, isUnsigned: true)
!518 = !DIEnumerator(name: "VAR_LOCATION", value: 138, isUnsigned: true)
!519 = !DIEnumerator(name: "LAST_AND_UNUSED_RTX_CODE", value: 139, isUnsigned: true)
!520 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "expand_modifier", file: !521, line: 52, baseType: !7, size: 32, elements: !522)
!521 = !DIFile(filename: "./expr.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!522 = !{!523, !524, !525, !526, !527, !528, !529}
!523 = !DIEnumerator(name: "EXPAND_NORMAL", value: 0, isUnsigned: true)
!524 = !DIEnumerator(name: "EXPAND_STACK_PARM", value: 1, isUnsigned: true)
!525 = !DIEnumerator(name: "EXPAND_SUM", value: 2, isUnsigned: true)
!526 = !DIEnumerator(name: "EXPAND_CONST_ADDRESS", value: 3, isUnsigned: true)
!527 = !DIEnumerator(name: "EXPAND_INITIALIZER", value: 4, isUnsigned: true)
!528 = !DIEnumerator(name: "EXPAND_WRITE", value: 5, isUnsigned: true)
!529 = !DIEnumerator(name: "EXPAND_MEMORY", value: 6, isUnsigned: true)
!530 = !{!531, !532, !533, !534, !537, !538, !540, !656, !778, !134, !1867, !1106, !7, !1885, !377, !610}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!533 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !536)
!540 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !541, line: 50, baseType: !542)
!541 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!542 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !543, size: 64)
!543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !378, line: 240, size: 384, elements: !544)
!544 = !{!545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !543, file: !378, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !543, file: !378, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !543, file: !378, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !543, file: !378, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !543, file: !378, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !543, file: !378, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !543, file: !378, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !543, file: !378, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !543, file: !378, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !543, file: !378, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !543, file: !378, line: 321, baseType: !556, size: 320, offset: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !378, line: 315, size: 320, elements: !557)
!557 = !{!558, !1802, !1804, !1865, !1866}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !556, file: !378, line: 316, baseType: !559, size: 64)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 64, elements: !575)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !378, line: 183, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !378, line: 166, size: 64, elements: !562)
!562 = !{!563, !564, !565, !566, !567, !577, !578, !590, !593, !655, !1780, !1781, !1792, !1799}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !561, file: !378, line: 168, baseType: !533, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !561, file: !378, line: 169, baseType: !7, size: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !561, file: !378, line: 170, baseType: !538, size: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !561, file: !378, line: 171, baseType: !540, size: 64)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !561, file: !378, line: 172, baseType: !568, size: 64)
!568 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !541, line: 53, baseType: !569)
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !378, line: 359, size: 128, elements: !571)
!571 = !{!572, !573}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !570, file: !378, line: 360, baseType: !533, size: 32)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !570, file: !378, line: 361, baseType: !574, size: 64, offset: 64)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !540, size: 64, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 1)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !561, file: !378, line: 173, baseType: !5, size: 32)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !561, file: !378, line: 174, baseType: !579, size: 32)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !378, line: 133, baseType: !580)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !378, line: 115, size: 32, elements: !581)
!581 = !{!582, !583, !584, !585, !586, !587, !588, !589}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !580, file: !378, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !580, file: !378, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !580, file: !378, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !580, file: !378, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !580, file: !378, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !580, file: !378, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !580, file: !378, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !580, file: !378, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !561, file: !378, line: 175, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !378, line: 175, flags: DIFlagFwdDecl)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !561, file: !378, line: 176, baseType: !594, size: 64)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !595, size: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !596, line: 75, size: 256, elements: !597)
!596 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!597 = !{!598, !613, !614, !615}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !595, file: !596, line: 76, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !596, line: 68, baseType: !601)
!601 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !596, line: 63, size: 320, elements: !602)
!602 = !{!603, !605, !606, !607}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !601, file: !596, line: 64, baseType: !604, size: 64)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !601, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !601, file: !596, line: 65, baseType: !604, size: 64, offset: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !601, file: !596, line: 66, baseType: !7, size: 32, offset: 128)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !601, file: !596, line: 67, baseType: !608, size: 128, offset: 192)
!608 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 128, elements: !611)
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !596, line: 29, baseType: !610)
!610 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!611 = !{!612}
!612 = !DISubrange(count: 2)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !595, file: !596, line: 77, baseType: !599, size: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !595, file: !596, line: 78, baseType: !7, size: 32, offset: 128)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !595, file: !596, line: 79, baseType: !616, size: 64, offset: 192)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !596, line: 49, baseType: !618)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !596, line: 45, size: 832, elements: !619)
!619 = !{!620, !621, !622}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !618, file: !596, line: 46, baseType: !604, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !618, file: !596, line: 47, baseType: !594, size: 64, offset: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !618, file: !596, line: 48, baseType: !623, size: 704, offset: 128)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !624, line: 164, size: 704, elements: !625)
!624 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!625 = !{!626, !628, !638, !639, !640, !641, !642, !643, !647, !651, !652, !653, !654}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !623, file: !624, line: 166, baseType: !627, size: 64)
!627 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !623, file: !624, line: 167, baseType: !629, size: 64, offset: 64)
!629 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !630, size: 64)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !624, line: 157, size: 192, elements: !631)
!631 = !{!632, !633, !634}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !630, file: !624, line: 159, baseType: !535, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !630, file: !624, line: 160, baseType: !629, size: 64, offset: 64)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !630, file: !624, line: 161, baseType: !635, size: 32, offset: 128)
!635 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 32, elements: !636)
!636 = !{!637}
!637 = !DISubrange(count: 4)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !623, file: !624, line: 168, baseType: !535, size: 64, offset: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !623, file: !624, line: 169, baseType: !535, size: 64, offset: 192)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !623, file: !624, line: 170, baseType: !535, size: 64, offset: 256)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !623, file: !624, line: 171, baseType: !627, size: 64, offset: 320)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !623, file: !624, line: 172, baseType: !533, size: 32, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !623, file: !624, line: 176, baseType: !644, size: 64, offset: 448)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DISubroutineType(types: !646)
!646 = !{!629, !537, !627}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !623, file: !624, line: 177, baseType: !648, size: 64, offset: 512)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DISubroutineType(types: !650)
!650 = !{null, !537, !629}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !623, file: !624, line: 178, baseType: !537, size: 64, offset: 576)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !623, file: !624, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !623, file: !624, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !623, file: !624, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !561, file: !378, line: 177, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !541, line: 56, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !659)
!659 = !{!660, !693, !699, !710, !729, !740, !745, !752, !758, !771, !783, !821, !826, !854, !871, !872, !877, !886, !892, !897, !901, !905, !1429, !1478, !1484, !1490, !1497, !1510, !1524, !1541, !1553, !1575, !1590, !1762}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !135, line: 3372, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !661, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !661, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !661, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !661, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !661, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !661, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !661, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !661, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !661, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !661, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !661, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !661, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !661, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !661, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !661, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !661, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !661, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !661, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !661, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !661, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !661, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !661, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !661, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !661, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !661, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !661, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !661, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !661, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !661, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !661, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !658, file: !135, line: 3373, baseType: !694, size: 192)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !694, file: !135, line: 403, baseType: !661, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !694, file: !135, line: 404, baseType: !656, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !135, line: 405, baseType: !656, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !658, file: !135, line: 3374, baseType: !700, size: 320)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !700, file: !135, line: 1385, baseType: !694, size: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !700, file: !135, line: 1386, baseType: !704, size: 128, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !705, line: 58, baseType: !706)
!705 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !705, line: 54, size: 128, elements: !707)
!707 = !{!708, !709}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !706, file: !705, line: 56, baseType: !610, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !706, file: !705, line: 57, baseType: !627, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !658, file: !135, line: 3375, baseType: !711, size: 256)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !711, file: !135, line: 1398, baseType: !694, size: 192)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !711, file: !135, line: 1399, baseType: !715, size: 64, offset: 192)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !717, line: 52, size: 256, elements: !718)
!717 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!718 = !{!719, !720, !721, !722, !723, !724, !725}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !716, file: !717, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !716, file: !717, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !716, file: !717, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !716, file: !717, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !716, file: !717, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !716, file: !717, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !716, file: !717, line: 62, baseType: !726, size: 192, offset: 64)
!726 = !DICompositeType(tag: DW_TAG_array_type, baseType: !610, size: 192, elements: !727)
!727 = !{!728}
!728 = !DISubrange(count: 3)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !658, file: !135, line: 3376, baseType: !730, size: 256)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !731)
!731 = !{!732, !733}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !730, file: !135, line: 1409, baseType: !694, size: 192)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !730, file: !135, line: 1410, baseType: !734, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !736, line: 27, size: 192, elements: !737)
!736 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!737 = !{!738, !739}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !735, file: !736, line: 29, baseType: !704, size: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !735, file: !736, line: 30, baseType: !5, size: 32, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !658, file: !135, line: 3377, baseType: !741, size: 256)
!741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !742)
!742 = !{!743, !744}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !741, file: !135, line: 1438, baseType: !694, size: 192)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !741, file: !135, line: 1439, baseType: !656, size: 64, offset: 192)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !658, file: !135, line: 3378, baseType: !746, size: 256)
!746 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !747)
!747 = !{!748, !749, !750}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !746, file: !135, line: 1419, baseType: !694, size: 192)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !746, file: !135, line: 1420, baseType: !533, size: 32, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !746, file: !135, line: 1421, baseType: !751, size: 8, offset: 224)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !536, size: 8, elements: !575)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !658, file: !135, line: 3379, baseType: !753, size: 320)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !135, line: 1429, baseType: !694, size: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !753, file: !135, line: 1430, baseType: !656, size: 64, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !753, file: !135, line: 1431, baseType: !656, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !658, file: !135, line: 3380, baseType: !759, size: 320)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !759, file: !135, line: 1461, baseType: !694, size: 192)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !759, file: !135, line: 1462, baseType: !763, size: 128, offset: 192)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !764, line: 31, size: 128, elements: !765)
!764 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!765 = !{!766, !769, !770}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !763, file: !764, line: 32, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !532)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !763, file: !764, line: 33, baseType: !7, size: 32, offset: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !763, file: !764, line: 34, baseType: !7, size: 32, offset: 96)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !658, file: !135, line: 3381, baseType: !772, size: 384)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !773)
!773 = !{!774, !775, !780, !781, !782}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !772, file: !135, line: 2508, baseType: !694, size: 192)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !772, file: !135, line: 2509, baseType: !776, size: 32, offset: 192)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !777, line: 58, baseType: !778)
!777 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!778 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !779, line: 44, baseType: !7)
!779 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!780 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !772, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !772, file: !135, line: 2511, baseType: !656, size: 64, offset: 256)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !772, file: !135, line: 2512, baseType: !656, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !658, file: !135, line: 3382, baseType: !784, size: 896)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !785)
!785 = !{!786, !787, !788, !789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !135, line: 2653, baseType: !772, size: 384)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !784, file: !135, line: 2654, baseType: !656, size: 64, offset: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !784, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !784, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !784, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !784, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !784, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !784, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !784, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !784, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !784, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !784, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !784, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !784, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !784, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !784, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !784, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !784, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !784, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !784, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !784, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !784, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !784, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !784, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !784, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !784, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !784, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !784, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !784, file: !135, line: 2705, baseType: !656, size: 64, offset: 576)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !784, file: !135, line: 2706, baseType: !656, size: 64, offset: 640)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !784, file: !135, line: 2707, baseType: !656, size: 64, offset: 704)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !784, file: !135, line: 2708, baseType: !656, size: 64, offset: 768)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !784, file: !135, line: 2711, baseType: !819, size: 64, offset: 832)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !658, file: !135, line: 3383, baseType: !822, size: 960)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !823)
!823 = !{!824, !825}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !822, file: !135, line: 2757, baseType: !784, size: 896)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !822, file: !135, line: 2758, baseType: !540, size: 64, offset: 896)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !658, file: !135, line: 3384, baseType: !827, size: 1472)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !828)
!828 = !{!829, !850, !851, !852, !853}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !827, file: !135, line: 3115, baseType: !830, size: 1216)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !830, file: !135, line: 2985, baseType: !822, size: 960)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !830, file: !135, line: 2986, baseType: !656, size: 64, offset: 960)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !830, file: !135, line: 2987, baseType: !656, size: 64, offset: 1024)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !830, file: !135, line: 2988, baseType: !656, size: 64, offset: 1088)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !830, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !830, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !830, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !830, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !830, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !830, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !830, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !830, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !830, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !830, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !830, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !830, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !830, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !830, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !827, file: !135, line: 3117, baseType: !656, size: 64, offset: 1216)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !827, file: !135, line: 3119, baseType: !656, size: 64, offset: 1280)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !827, file: !135, line: 3121, baseType: !656, size: 64, offset: 1344)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !827, file: !135, line: 3123, baseType: !656, size: 64, offset: 1408)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !658, file: !135, line: 3385, baseType: !855, size: 1088)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !135, line: 2875, baseType: !822, size: 960)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !855, file: !135, line: 2876, baseType: !540, size: 64, offset: 960)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !855, file: !135, line: 2877, baseType: !860, size: 64, offset: 1024)
!860 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !861, size: 64)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !862, line: 172, size: 128, elements: !863)
!862 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!863 = !{!864, !865, !866, !867, !868, !869, !870}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !861, file: !862, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !861, file: !862, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !861, file: !862, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !861, file: !862, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !861, file: !862, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !861, file: !862, line: 195, baseType: !7, size: 32, offset: 32)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !861, file: !862, line: 199, baseType: !656, size: 64, offset: 64)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !658, file: !135, line: 3386, baseType: !830, size: 1216)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !658, file: !135, line: 3387, baseType: !873, size: 1280)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !873, file: !135, line: 3094, baseType: !830, size: 1216)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !873, file: !135, line: 3095, baseType: !860, size: 64, offset: 1216)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !658, file: !135, line: 3388, baseType: !878, size: 1216)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !879)
!879 = !{!880, !881, !882, !883, !884, !885}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !878, file: !135, line: 2825, baseType: !784, size: 896)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !878, file: !135, line: 2827, baseType: !656, size: 64, offset: 896)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !878, file: !135, line: 2828, baseType: !656, size: 64, offset: 960)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !878, file: !135, line: 2829, baseType: !656, size: 64, offset: 1024)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !878, file: !135, line: 2830, baseType: !656, size: 64, offset: 1088)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !878, file: !135, line: 2831, baseType: !656, size: 64, offset: 1152)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !658, file: !135, line: 3389, baseType: !887, size: 1024)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !888)
!888 = !{!889, !890, !891}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !135, line: 2851, baseType: !822, size: 960)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !887, file: !135, line: 2852, baseType: !533, size: 32, offset: 960)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !887, file: !135, line: 2853, baseType: !533, size: 32, offset: 992)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !658, file: !135, line: 3390, baseType: !893, size: 1024)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !893, file: !135, line: 2858, baseType: !822, size: 960)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !893, file: !135, line: 2859, baseType: !860, size: 64, offset: 960)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !658, file: !135, line: 3391, baseType: !898, size: 960)
!898 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !899)
!899 = !{!900}
!900 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !898, file: !135, line: 2863, baseType: !822, size: 960)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !658, file: !135, line: 3392, baseType: !902, size: 1472)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !903)
!903 = !{!904}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !902, file: !135, line: 3305, baseType: !827, size: 1472)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !658, file: !135, line: 3393, baseType: !906, size: 1792)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !907)
!907 = !{!908, !909, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !906, file: !135, line: 3249, baseType: !827, size: 1472)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !906, file: !135, line: 3251, baseType: !910, size: 64, offset: 1472)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !912, line: 463, size: 1152, elements: !913)
!912 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!913 = !{!914, !917, !1233, !1234, !1349, !1352, !1353, !1354, !1355, !1356, !1357, !1381, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !911, file: !912, line: 464, baseType: !915, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !912, line: 464, flags: DIFlagFwdDecl)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !911, file: !912, line: 467, baseType: !918, size: 64, offset: 64)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !920)
!920 = !{!921, !1208, !1209, !1222, !1223, !1224, !1225, !1226, !1227, !1229, !1231, !1232}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !919, file: !330, line: 377, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !541, line: 111, baseType: !923)
!923 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !924, size: 64)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !925)
!925 = !{!926, !1173, !1174, !1175, !1178, !1182, !1183, !1184, !1202, !1203, !1204, !1205, !1206, !1207}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !924, file: !330, line: 219, baseType: !927, size: 64)
!927 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !929)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !930)
!930 = !{!931}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !929, file: !330, line: 151, baseType: !932, size: 128)
!932 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !933)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !933, file: !330, line: 150, baseType: !7, size: 32)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !933, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !933, file: !330, line: 150, baseType: !938, size: 64, offset: 64)
!938 = !DICompositeType(tag: DW_TAG_array_type, baseType: !939, size: 64, elements: !575)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !541, line: 108, baseType: !940)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !942)
!942 = !{!943, !944, !945, !1165, !1166, !1167, !1168, !1169, !1170, !1171}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !941, file: !330, line: 124, baseType: !923, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !941, file: !330, line: 125, baseType: !923, size: 64, offset: 64)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !941, file: !330, line: 131, baseType: !946, size: 64, offset: 128)
!946 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !947)
!947 = !{!948, !1164}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !946, file: !330, line: 129, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !541, line: 66, baseType: !950)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !951, size: 64)
!951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !952, line: 143, size: 192, elements: !953)
!952 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!953 = !{!954, !1162, !1163}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !951, file: !952, line: 145, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !541, line: 69, baseType: !956)
!956 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !957, size: 64)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !952, line: 136, size: 192, elements: !958)
!958 = !{!959, !1160, !1161}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !957, file: !952, line: 137, baseType: !960, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !541, line: 58, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !952, line: 737, size: 768, elements: !963)
!963 = !{!964, !981, !1015, !1021, !1026, !1031, !1038, !1044, !1050, !1055, !1069, !1074, !1080, !1085, !1095, !1100, !1118, !1125, !1132, !1138, !1143, !1149, !1155}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !962, file: !952, line: 738, baseType: !965, size: 256)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !952, line: 271, size: 256, elements: !966)
!966 = !{!967, !968, !969, !970, !971, !972, !973, !974, !975, !976, !977, !978, !979, !980}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !965, file: !952, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !965, file: !952, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !965, file: !952, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !965, file: !952, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !965, file: !952, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !965, file: !952, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !965, file: !952, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !965, file: !952, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !965, file: !952, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !965, file: !952, line: 312, baseType: !7, size: 32, offset: 32)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !965, file: !952, line: 316, baseType: !776, size: 32, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !965, file: !952, line: 319, baseType: !7, size: 32, offset: 96)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !965, file: !952, line: 323, baseType: !923, size: 64, offset: 128)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !965, file: !952, line: 327, baseType: !656, size: 64, offset: 192)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !962, file: !952, line: 739, baseType: !982, size: 448)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !952, line: 350, size: 448, elements: !983)
!983 = !{!984, !1013}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !982, file: !952, line: 353, baseType: !985, size: 384)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !952, line: 333, size: 384, elements: !986)
!986 = !{!987, !988, !996}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !985, file: !952, line: 336, baseType: !965, size: 256)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !985, file: !952, line: 343, baseType: !989, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !990, size: 64)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !991, line: 37, size: 128, elements: !992)
!991 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!992 = !{!993, !994}
!993 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !990, file: !991, line: 39, baseType: !989, size: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !990, file: !991, line: 40, baseType: !995, size: 64, offset: 64)
!995 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !985, file: !952, line: 344, baseType: !997, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !991, line: 45, size: 320, elements: !999)
!999 = !{!1000, !1001}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !998, file: !991, line: 47, baseType: !997, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !998, file: !991, line: 48, baseType: !1002, size: 256, offset: 64)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1003)
!1003 = !{!1004, !1006, !1007, !1012}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1002, file: !135, line: 1884, baseType: !1005, size: 64)
!1005 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1002, file: !135, line: 1885, baseType: !1005, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1002, file: !135, line: 1891, baseType: !1008, size: 64, offset: 128)
!1008 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1002, file: !135, line: 1891, size: 64, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1008, file: !135, line: 1891, baseType: !960, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1008, file: !135, line: 1891, baseType: !656, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1002, file: !135, line: 1892, baseType: !995, size: 64, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !982, file: !952, line: 359, baseType: !1014, size: 64, offset: 384)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 64, elements: !575)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !962, file: !952, line: 740, baseType: !1016, size: 512)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !952, line: 365, size: 512, elements: !1017)
!1017 = !{!1018, !1019, !1020}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1016, file: !952, line: 368, baseType: !985, size: 384)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1016, file: !952, line: 373, baseType: !656, size: 64, offset: 384)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1016, file: !952, line: 374, baseType: !656, size: 64, offset: 448)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !962, file: !952, line: 741, baseType: !1022, size: 576)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !952, line: 380, size: 576, elements: !1023)
!1023 = !{!1024, !1025}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1022, file: !952, line: 383, baseType: !1016, size: 512)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1022, file: !952, line: 389, baseType: !1014, size: 64, offset: 512)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !962, file: !952, line: 742, baseType: !1027, size: 320)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !952, line: 395, size: 320, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1027, file: !952, line: 397, baseType: !965, size: 256)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1027, file: !952, line: 400, baseType: !949, size: 64, offset: 256)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !962, file: !952, line: 743, baseType: !1032, size: 448)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !952, line: 406, size: 448, elements: !1033)
!1033 = !{!1034, !1035, !1036, !1037}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1032, file: !952, line: 408, baseType: !965, size: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1032, file: !952, line: 412, baseType: !656, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1032, file: !952, line: 420, baseType: !656, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1032, file: !952, line: 423, baseType: !949, size: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !962, file: !952, line: 744, baseType: !1039, size: 384)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !952, line: 429, size: 384, elements: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1039, file: !952, line: 431, baseType: !965, size: 256)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1039, file: !952, line: 434, baseType: !656, size: 64, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1039, file: !952, line: 437, baseType: !949, size: 64, offset: 320)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !962, file: !952, line: 745, baseType: !1045, size: 384)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !952, line: 443, size: 384, elements: !1046)
!1046 = !{!1047, !1048, !1049}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1045, file: !952, line: 445, baseType: !965, size: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1045, file: !952, line: 449, baseType: !656, size: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1045, file: !952, line: 453, baseType: !949, size: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !962, file: !952, line: 746, baseType: !1051, size: 320)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !952, line: 459, size: 320, elements: !1052)
!1052 = !{!1053, !1054}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1051, file: !952, line: 461, baseType: !965, size: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1051, file: !952, line: 464, baseType: !656, size: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !962, file: !952, line: 747, baseType: !1056, size: 768)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !952, line: 469, size: 768, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061, !1062}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1056, file: !952, line: 471, baseType: !965, size: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1056, file: !952, line: 474, baseType: !7, size: 32, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1056, file: !952, line: 475, baseType: !7, size: 32, offset: 288)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1056, file: !952, line: 478, baseType: !656, size: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1056, file: !952, line: 481, baseType: !1063, size: 384, offset: 384)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1064, size: 384, elements: !575)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1065)
!1065 = !{!1066, !1067, !1068}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1064, file: !135, line: 1920, baseType: !1002, size: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1064, file: !135, line: 1921, baseType: !656, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1064, file: !135, line: 1922, baseType: !776, size: 32, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !962, file: !952, line: 748, baseType: !1070, size: 320)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !952, line: 487, size: 320, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1070, file: !952, line: 490, baseType: !965, size: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1070, file: !952, line: 494, baseType: !533, size: 32, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !962, file: !952, line: 749, baseType: !1075, size: 384)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !952, line: 500, size: 384, elements: !1076)
!1076 = !{!1077, !1078, !1079}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1075, file: !952, line: 502, baseType: !965, size: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1075, file: !952, line: 506, baseType: !949, size: 64, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1075, file: !952, line: 510, baseType: !949, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !962, file: !952, line: 750, baseType: !1081, size: 320)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !952, line: 529, size: 320, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1081, file: !952, line: 531, baseType: !965, size: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1081, file: !952, line: 540, baseType: !949, size: 64, offset: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !962, file: !952, line: 751, baseType: !1086, size: 704)
!1086 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !952, line: 546, size: 704, elements: !1087)
!1087 = !{!1088, !1089, !1090, !1091, !1092, !1093, !1094}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1086, file: !952, line: 549, baseType: !1016, size: 512)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1086, file: !952, line: 553, baseType: !538, size: 64, offset: 512)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1086, file: !952, line: 557, baseType: !532, size: 8, offset: 576)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1086, file: !952, line: 558, baseType: !532, size: 8, offset: 584)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1086, file: !952, line: 559, baseType: !532, size: 8, offset: 592)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1086, file: !952, line: 560, baseType: !532, size: 8, offset: 600)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1086, file: !952, line: 566, baseType: !1014, size: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !962, file: !952, line: 752, baseType: !1096, size: 384)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !952, line: 571, size: 384, elements: !1097)
!1097 = !{!1098, !1099}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1096, file: !952, line: 573, baseType: !1027, size: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1096, file: !952, line: 577, baseType: !656, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !962, file: !952, line: 753, baseType: !1101, size: 576)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !952, line: 600, size: 576, elements: !1102)
!1102 = !{!1103, !1104, !1105, !1108, !1117}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1101, file: !952, line: 602, baseType: !1027, size: 320)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1101, file: !952, line: 605, baseType: !656, size: 64, offset: 320)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1101, file: !952, line: 609, baseType: !1106, size: 64, offset: 384)
!1106 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1107, line: 46, baseType: !610)
!1107 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1101, file: !952, line: 612, baseType: !1109, size: 64, offset: 448)
!1109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1110, size: 64)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !952, line: 581, size: 320, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1116}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1110, file: !952, line: 583, baseType: !134, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1110, file: !952, line: 586, baseType: !656, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1110, file: !952, line: 589, baseType: !656, size: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1110, file: !952, line: 592, baseType: !656, size: 64, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1110, file: !952, line: 595, baseType: !656, size: 64, offset: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1101, file: !952, line: 616, baseType: !949, size: 64, offset: 512)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !962, file: !952, line: 754, baseType: !1119, size: 512)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !952, line: 622, size: 512, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1124}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1119, file: !952, line: 624, baseType: !1027, size: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1119, file: !952, line: 628, baseType: !656, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1119, file: !952, line: 632, baseType: !656, size: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1119, file: !952, line: 636, baseType: !656, size: 64, offset: 448)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !962, file: !952, line: 755, baseType: !1126, size: 704)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !952, line: 642, size: 704, elements: !1127)
!1127 = !{!1128, !1129, !1130, !1131}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1126, file: !952, line: 644, baseType: !1119, size: 512)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1126, file: !952, line: 648, baseType: !656, size: 64, offset: 512)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1126, file: !952, line: 652, baseType: !656, size: 64, offset: 576)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1126, file: !952, line: 653, baseType: !656, size: 64, offset: 640)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !962, file: !952, line: 756, baseType: !1133, size: 448)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !952, line: 663, size: 448, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1133, file: !952, line: 665, baseType: !1027, size: 320)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1133, file: !952, line: 668, baseType: !656, size: 64, offset: 320)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1133, file: !952, line: 673, baseType: !656, size: 64, offset: 384)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !962, file: !952, line: 757, baseType: !1139, size: 384)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !952, line: 694, size: 384, elements: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1139, file: !952, line: 696, baseType: !1027, size: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1139, file: !952, line: 699, baseType: !656, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !962, file: !952, line: 758, baseType: !1144, size: 384)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !952, line: 681, size: 384, elements: !1145)
!1145 = !{!1146, !1147, !1148}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1144, file: !952, line: 683, baseType: !965, size: 256)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1144, file: !952, line: 686, baseType: !656, size: 64, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1144, file: !952, line: 689, baseType: !656, size: 64, offset: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !962, file: !952, line: 759, baseType: !1150, size: 384)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !952, line: 707, size: 384, elements: !1151)
!1151 = !{!1152, !1153, !1154}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1150, file: !952, line: 709, baseType: !965, size: 256)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1150, file: !952, line: 712, baseType: !656, size: 64, offset: 256)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1150, file: !952, line: 712, baseType: !656, size: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !962, file: !952, line: 760, baseType: !1156, size: 320)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !952, line: 718, size: 320, elements: !1157)
!1157 = !{!1158, !1159}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1156, file: !952, line: 720, baseType: !965, size: 256)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1156, file: !952, line: 723, baseType: !656, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !957, file: !952, line: 138, baseType: !956, size: 64, offset: 64)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !957, file: !952, line: 139, baseType: !956, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !951, file: !952, line: 146, baseType: !955, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !951, file: !952, line: 152, baseType: !949, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !946, file: !330, line: 130, baseType: !540, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !941, file: !330, line: 134, baseType: !537, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !941, file: !330, line: 137, baseType: !656, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !941, file: !330, line: 138, baseType: !776, size: 32, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !941, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !941, file: !330, line: 144, baseType: !533, size: 32, offset: 384)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !941, file: !330, line: 145, baseType: !533, size: 32, offset: 416)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !941, file: !330, line: 146, baseType: !1172, size: 64, offset: 448)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !627)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !924, file: !330, line: 220, baseType: !927, size: 64, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !924, file: !330, line: 223, baseType: !537, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !924, file: !330, line: 226, baseType: !1176, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !924, file: !330, line: 229, baseType: !1179, size: 128, offset: 256)
!1179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1180, size: 128, elements: !611)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !924, file: !330, line: 232, baseType: !923, size: 64, offset: 384)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !924, file: !330, line: 233, baseType: !923, size: 64, offset: 448)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !924, file: !330, line: 238, baseType: !1185, size: 64, offset: 512)
!1185 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1186)
!1186 = !{!1187, !1193}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1185, file: !330, line: 236, baseType: !1188, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1189, size: 64)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1190)
!1190 = !{!1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1189, file: !330, line: 275, baseType: !949, size: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1189, file: !330, line: 278, baseType: !949, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1185, file: !330, line: 237, baseType: !1194, size: 64)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1195, file: !330, line: 261, baseType: !540, size: 64)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1195, file: !330, line: 262, baseType: !540, size: 64, offset: 64)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1195, file: !330, line: 266, baseType: !540, size: 64, offset: 128)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1195, file: !330, line: 267, baseType: !540, size: 64, offset: 192)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1195, file: !330, line: 270, baseType: !533, size: 32, offset: 256)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !924, file: !330, line: 241, baseType: !1172, size: 64, offset: 576)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !924, file: !330, line: 244, baseType: !533, size: 32, offset: 640)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !924, file: !330, line: 247, baseType: !533, size: 32, offset: 672)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !924, file: !330, line: 250, baseType: !533, size: 32, offset: 704)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !924, file: !330, line: 253, baseType: !533, size: 32, offset: 736)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !924, file: !330, line: 256, baseType: !533, size: 32, offset: 768)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !919, file: !330, line: 378, baseType: !922, size: 64, offset: 64)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !919, file: !330, line: 381, baseType: !1210, size: 64, offset: 128)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1212, file: !330, line: 282, baseType: !1215, size: 128)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1216, file: !330, line: 281, baseType: !7, size: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1216, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1216, file: !330, line: 281, baseType: !1221, size: 64, offset: 64)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !922, size: 64, elements: !575)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !919, file: !330, line: 384, baseType: !533, size: 32, offset: 192)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !919, file: !330, line: 387, baseType: !533, size: 32, offset: 224)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !919, file: !330, line: 390, baseType: !533, size: 32, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !919, file: !330, line: 394, baseType: !1210, size: 64, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !919, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !919, file: !330, line: 399, baseType: !1228, size: 64, offset: 416)
!1228 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !611)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !919, file: !330, line: 402, baseType: !1230, size: 64, offset: 480)
!1230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !611)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !919, file: !330, line: 406, baseType: !533, size: 32, offset: 544)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !919, file: !330, line: 409, baseType: !533, size: 32, offset: 576)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !911, file: !912, line: 470, baseType: !950, size: 64, offset: 128)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !911, file: !912, line: 473, baseType: !1235, size: 64, offset: 192)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !862, line: 39, size: 1152, elements: !1237)
!1237 = !{!1238, !1288, !1301, !1313, !1314, !1326, !1327, !1331, !1332, !1333, !1334, !1335}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1236, file: !862, line: 41, baseType: !1239, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1240, line: 144, baseType: !1241)
!1240 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1240, line: 100, size: 896, elements: !1243)
!1243 = !{!1244, !1252, !1257, !1262, !1264, !1265, !1266, !1267, !1268, !1269, !1274, !1276, !1277, !1282, !1287}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1242, file: !1240, line: 102, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1240, line: 52, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1240, line: 47, baseType: !7)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1242, file: !1240, line: 105, baseType: !1253, size: 64, offset: 64)
!1253 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1240, line: 59, baseType: !1254)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = !DISubroutineType(types: !1256)
!1256 = !{!533, !1250, !1250}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1242, file: !1240, line: 108, baseType: !1258, size: 64, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1240, line: 63, baseType: !1259)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DISubroutineType(types: !1261)
!1261 = !{null, !537}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1242, file: !1240, line: 111, baseType: !1263, size: 64, offset: 192)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !537, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1242, file: !1240, line: 114, baseType: !1106, size: 64, offset: 256)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1242, file: !1240, line: 117, baseType: !1106, size: 64, offset: 320)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1242, file: !1240, line: 120, baseType: !1106, size: 64, offset: 384)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1242, file: !1240, line: 124, baseType: !7, size: 32, offset: 448)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1242, file: !1240, line: 128, baseType: !7, size: 32, offset: 480)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1242, file: !1240, line: 131, baseType: !1270, size: 64, offset: 512)
!1270 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1240, line: 75, baseType: !1271)
!1271 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1272, size: 64)
!1272 = !DISubroutineType(types: !1273)
!1273 = !{!537, !1106, !1106}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1242, file: !1240, line: 132, baseType: !1275, size: 64, offset: 576)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1240, line: 78, baseType: !1259)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1242, file: !1240, line: 135, baseType: !537, size: 64, offset: 640)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1242, file: !1240, line: 136, baseType: !1278, size: 64, offset: 704)
!1278 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1240, line: 82, baseType: !1279)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DISubroutineType(types: !1281)
!1281 = !{!537, !537, !1106, !1106}
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1242, file: !1240, line: 137, baseType: !1283, size: 64, offset: 768)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1240, line: 83, baseType: !1284)
!1284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1285, size: 64)
!1285 = !DISubroutineType(types: !1286)
!1286 = !{null, !537, !537}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1242, file: !1240, line: 141, baseType: !7, size: 32, offset: 832)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1236, file: !862, line: 48, baseType: !1289, size: 64, offset: 64)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !952, line: 35, baseType: !1291)
!1291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !952, line: 35, size: 128, elements: !1292)
!1292 = !{!1293}
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1291, file: !952, line: 35, baseType: !1294, size: 128)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !952, line: 33, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !952, line: 33, size: 128, elements: !1296)
!1296 = !{!1297, !1298, !1299}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1295, file: !952, line: 33, baseType: !7, size: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1295, file: !952, line: 33, baseType: !7, size: 32, offset: 32)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1295, file: !952, line: 33, baseType: !1300, size: 64, offset: 64)
!1300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 64, elements: !575)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1236, file: !862, line: 51, baseType: !1302, size: 64, offset: 128)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !135, line: 183, baseType: !1304)
!1304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !135, line: 183, size: 128, elements: !1305)
!1305 = !{!1306}
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1304, file: !135, line: 183, baseType: !1307, size: 128)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !135, line: 182, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !135, line: 182, size: 128, elements: !1309)
!1309 = !{!1310, !1311, !1312}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1308, file: !135, line: 182, baseType: !7, size: 32)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1308, file: !135, line: 182, baseType: !7, size: 32, offset: 32)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1308, file: !135, line: 182, baseType: !1014, size: 64, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1236, file: !862, line: 54, baseType: !656, size: 64, offset: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1236, file: !862, line: 57, baseType: !1315, size: 128, offset: 256)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1316, line: 31, size: 128, elements: !1317)
!1316 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1317 = !{!1318, !1319, !1320, !1321, !1322, !1323, !1324}
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1315, file: !1316, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1315, file: !1316, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1315, file: !1316, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1315, file: !1316, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1315, file: !1316, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1315, file: !1316, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
