; ModuleID = 'tree-ssa-alias.bc'
source_filename = "tree-ssa-alias.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

!397 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!398 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!399 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!400 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!401 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!402 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!403 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!404 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!405 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!406 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!407 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!408 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!409 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!410 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!411 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!412 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!413 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!414 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!415 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!416 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !378, line: 80, baseType: !7, size: 32, elements: !417)
!417 = !{!418, !419, !420, !421}
!418 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!422 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !378, line: 727, baseType: !7, size: 32, elements: !423)
!423 = !{!424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447}
!424 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!425 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!426 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!427 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!428 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!429 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!430 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!431 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!432 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!433 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!434 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!435 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!436 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!447 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!448 = !{!449, !450, !451, !452, !455, !456, !134, !458, !1478, !1300, !512, !416, !783, !1753, !817, !453}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!451 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !457, size: 64)
!457 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !459, line: 56, baseType: !460)
!459 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !462)
!462 = !{!463, !496, !502, !515, !534, !545, !550, !559, !565, !578, !590, !628, !1086, !1114, !1131, !1132, !1137, !1146, !1152, !1157, !1161, !1165, !1404, !1451, !1457, !1463, !1470, !1483, !1497, !1514, !1526, !1548, !1563, !1735}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !461, file: !135, line: 3372, baseType: !464, size: 64)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !465)
!465 = !{!466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !464, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !464, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !464, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !464, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !464, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !464, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !464, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !464, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !464, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !464, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !464, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !464, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !464, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !464, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !464, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !464, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !464, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !464, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !464, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !464, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !464, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !464, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !464, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !464, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !464, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !464, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !464, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !464, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !464, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !464, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !461, file: !135, line: 3373, baseType: !497, size: 192)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !498)
!498 = !{!499, !500, !501}
!499 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !497, file: !135, line: 403, baseType: !464, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !497, file: !135, line: 404, baseType: !458, size: 64, offset: 64)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !497, file: !135, line: 405, baseType: !458, size: 64, offset: 128)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !461, file: !135, line: 3374, baseType: !503, size: 320)
!503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !504)
!504 = !{!505, !506}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !503, file: !135, line: 1385, baseType: !497, size: 192)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !503, file: !135, line: 1386, baseType: !507, size: 128, offset: 192)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !508, line: 58, baseType: !509)
!508 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !508, line: 54, size: 128, elements: !510)
!510 = !{!511, !513}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !509, file: !508, line: 56, baseType: !512, size: 64)
!512 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !509, file: !508, line: 57, baseType: !514, size: 64, offset: 64)
!514 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !461, file: !135, line: 3375, baseType: !516, size: 256)
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !516, file: !135, line: 1398, baseType: !497, size: 192)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !516, file: !135, line: 1399, baseType: !520, size: 64, offset: 192)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !522, line: 52, size: 256, elements: !523)
!522 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!523 = !{!524, !525, !526, !527, !528, !529, !530}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !521, file: !522, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !521, file: !522, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !521, file: !522, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !521, file: !522, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !521, file: !522, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !521, file: !522, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !521, file: !522, line: 62, baseType: !531, size: 192, offset: 64)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !512, size: 192, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 3)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !461, file: !135, line: 3376, baseType: !535, size: 256)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !535, file: !135, line: 1409, baseType: !497, size: 192)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !535, file: !135, line: 1410, baseType: !539, size: 64, offset: 192)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !541, line: 27, size: 192, elements: !542)
!541 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !540, file: !541, line: 29, baseType: !507, size: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !540, file: !541, line: 30, baseType: !5, size: 32, offset: 128)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !461, file: !135, line: 3377, baseType: !546, size: 256)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !547)
!547 = !{!548, !549}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !546, file: !135, line: 1438, baseType: !497, size: 192)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !546, file: !135, line: 1439, baseType: !458, size: 64, offset: 192)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !461, file: !135, line: 3378, baseType: !551, size: 256)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !552)
!552 = !{!553, !554, !555}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !551, file: !135, line: 1419, baseType: !497, size: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !551, file: !135, line: 1420, baseType: !451, size: 32, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !551, file: !135, line: 1421, baseType: !556, size: 8, offset: 224)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 8, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 1)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !461, file: !135, line: 3379, baseType: !560, size: 320)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !561)
!561 = !{!562, !563, !564}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !135, line: 1429, baseType: !497, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !560, file: !135, line: 1430, baseType: !458, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !560, file: !135, line: 1431, baseType: !458, size: 64, offset: 256)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !461, file: !135, line: 3380, baseType: !566, size: 320)
!566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !567)
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !566, file: !135, line: 1461, baseType: !497, size: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !566, file: !135, line: 1462, baseType: !570, size: 128, offset: 192)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !571, line: 31, size: 128, elements: !572)
!571 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!572 = !{!573, !576, !577}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !570, file: !571, line: 32, baseType: !574, size: 64)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !575, size: 64)
!575 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !450)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !570, file: !571, line: 33, baseType: !7, size: 32, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !570, file: !571, line: 34, baseType: !7, size: 32, offset: 96)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !461, file: !135, line: 3381, baseType: !579, size: 384)
!579 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !580)
!580 = !{!581, !582, !587, !588, !589}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !579, file: !135, line: 2508, baseType: !497, size: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !579, file: !135, line: 2509, baseType: !583, size: 32, offset: 192)
!583 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !584, line: 58, baseType: !585)
!584 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!585 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !586, line: 44, baseType: !7)
!586 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!587 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !579, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !579, file: !135, line: 2511, baseType: !458, size: 64, offset: 256)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !579, file: !135, line: 2512, baseType: !458, size: 64, offset: 320)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !461, file: !135, line: 3382, baseType: !591, size: 896)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !592)
!592 = !{!593, !594, !595, !596, !597, !598, !599, !600, !601, !602, !603, !604, !605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !591, file: !135, line: 2653, baseType: !579, size: 384)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !591, file: !135, line: 2654, baseType: !458, size: 64, offset: 384)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !591, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !591, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !591, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !591, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !591, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !591, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !591, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !591, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !591, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !591, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !591, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !591, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !591, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !591, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !591, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !591, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !591, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !591, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !591, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !591, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !591, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !591, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !591, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !591, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !591, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !591, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !591, file: !135, line: 2705, baseType: !458, size: 64, offset: 576)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !591, file: !135, line: 2706, baseType: !458, size: 64, offset: 640)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !591, file: !135, line: 2707, baseType: !458, size: 64, offset: 704)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !591, file: !135, line: 2708, baseType: !458, size: 64, offset: 768)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !591, file: !135, line: 2711, baseType: !626, size: 64, offset: 832)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !461, file: !135, line: 3383, baseType: !629, size: 960)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !630)
!630 = !{!631, !632}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !629, file: !135, line: 2757, baseType: !591, size: 896)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !629, file: !135, line: 2758, baseType: !633, size: 64, offset: 896)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !459, line: 50, baseType: !634)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !636, line: 240, size: 384, elements: !637)
!636 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!637 = !{!638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !635, file: !636, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !635, file: !636, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !635, file: !636, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !635, file: !636, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !635, file: !636, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !635, file: !636, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !635, file: !636, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !635, file: !636, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !635, file: !636, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !635, file: !636, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !635, file: !636, line: 321, baseType: !649, size: 320, offset: 64)
!649 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !636, line: 315, size: 320, elements: !650)
!650 = !{!651, !1053, !1055, !1084, !1085}
!651 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !649, file: !636, line: 316, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 64, elements: !557)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !636, line: 183, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !636, line: 166, size: 64, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !668, !669, !681, !684, !744, !745, !1030, !1043, !1050}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !654, file: !636, line: 168, baseType: !451, size: 32)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !654, file: !636, line: 169, baseType: !7, size: 32)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !654, file: !636, line: 170, baseType: !456, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !654, file: !636, line: 171, baseType: !633, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !654, file: !636, line: 172, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !459, line: 53, baseType: !662)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !636, line: 359, size: 128, elements: !664)
!664 = !{!665, !666}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !663, file: !636, line: 360, baseType: !451, size: 32)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !663, file: !636, line: 361, baseType: !667, size: 64, offset: 64)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !633, size: 64, elements: !557)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !654, file: !636, line: 173, baseType: !5, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !654, file: !636, line: 174, baseType: !670, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !636, line: 133, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !636, line: 115, size: 32, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !678, !679, !680}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !671, file: !636, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !671, file: !636, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !671, file: !636, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !671, file: !636, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !671, file: !636, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !671, file: !636, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !671, file: !636, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !671, file: !636, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !654, file: !636, line: 175, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !636, line: 175, flags: DIFlagFwdDecl)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !654, file: !636, line: 176, baseType: !685, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !687, line: 75, size: 256, elements: !688)
!687 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!688 = !{!689, !703, !704, !705}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !686, file: !687, line: 76, baseType: !690, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !691, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !687, line: 68, baseType: !692)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !687, line: 63, size: 320, elements: !693)
!693 = !{!694, !696, !697, !698}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !692, file: !687, line: 64, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !692, file: !687, line: 65, baseType: !695, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !692, file: !687, line: 66, baseType: !7, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !692, file: !687, line: 67, baseType: !699, size: 128, offset: 192)
!699 = !DICompositeType(tag: DW_TAG_array_type, baseType: !700, size: 128, elements: !701)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !687, line: 29, baseType: !512)
!701 = !{!702}
!702 = !DISubrange(count: 2)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !686, file: !687, line: 77, baseType: !690, size: 64, offset: 64)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !686, file: !687, line: 78, baseType: !7, size: 32, offset: 128)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !686, file: !687, line: 79, baseType: !706, size: 64, offset: 192)
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !687, line: 49, baseType: !708)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !687, line: 45, size: 832, elements: !709)
!709 = !{!710, !711, !712}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !708, file: !687, line: 46, baseType: !695, size: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !708, file: !687, line: 47, baseType: !685, size: 64, offset: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !708, file: !687, line: 48, baseType: !713, size: 704, offset: 128)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !714, line: 164, size: 704, elements: !715)
!714 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!715 = !{!716, !717, !727, !728, !729, !730, !731, !732, !736, !740, !741, !742, !743}
!716 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !713, file: !714, line: 166, baseType: !514, size: 64)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !713, file: !714, line: 167, baseType: !718, size: 64, offset: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !714, line: 157, size: 192, elements: !720)
!720 = !{!721, !722, !723}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !719, file: !714, line: 159, baseType: !453, size: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !719, file: !714, line: 160, baseType: !718, size: 64, offset: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !719, file: !714, line: 161, baseType: !724, size: 32, offset: 128)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !454, size: 32, elements: !725)
!725 = !{!726}
!726 = !DISubrange(count: 4)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !713, file: !714, line: 168, baseType: !453, size: 64, offset: 128)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !713, file: !714, line: 169, baseType: !453, size: 64, offset: 192)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !713, file: !714, line: 170, baseType: !453, size: 64, offset: 256)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !713, file: !714, line: 171, baseType: !514, size: 64, offset: 320)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !713, file: !714, line: 172, baseType: !451, size: 32, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !713, file: !714, line: 176, baseType: !733, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = !DISubroutineType(types: !735)
!735 = !{!718, !455, !514}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !713, file: !714, line: 177, baseType: !737, size: 64, offset: 512)
!737 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !738, size: 64)
!738 = !DISubroutineType(types: !739)
!739 = !{null, !455, !718}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !713, file: !714, line: 178, baseType: !455, size: 64, offset: 576)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !713, file: !714, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !713, file: !714, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !713, file: !714, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !654, file: !636, line: 177, baseType: !458, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !654, file: !636, line: 178, baseType: !746, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !747, size: 64)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !748)
!748 = !{!749, !995, !996, !997, !1000, !1004, !1005, !1006, !1024, !1025, !1026, !1027, !1028, !1029}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !747, file: !330, line: 219, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !752)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !753)
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !752, file: !330, line: 151, baseType: !755, size: 128)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !756, file: !330, line: 150, baseType: !7, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !756, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !756, file: !330, line: 150, baseType: !761, size: 64, offset: 64)
!761 = !DICompositeType(tag: DW_TAG_array_type, baseType: !762, size: 64, elements: !557)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !459, line: 108, baseType: !763)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !765)
!765 = !{!766, !767, !768, !987, !988, !989, !990, !991, !992, !993}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !764, file: !330, line: 124, baseType: !746, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !764, file: !330, line: 125, baseType: !746, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !764, file: !330, line: 131, baseType: !769, size: 64, offset: 128)
!769 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !770)
!770 = !{!771, !986}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !769, file: !330, line: 129, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !459, line: 66, baseType: !773)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !378, line: 143, size: 192, elements: !775)
!775 = !{!776, !984, !985}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !774, file: !378, line: 145, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !459, line: 69, baseType: !778)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !779, size: 64)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !378, line: 136, size: 192, elements: !780)
!780 = !{!781, !982, !983}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !779, file: !378, line: 137, baseType: !782, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !459, line: 58, baseType: !783)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !784, size: 64)
!784 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !378, line: 737, size: 768, elements: !785)
!785 = !{!786, !803, !837, !843, !848, !853, !860, !866, !872, !877, !891, !896, !902, !907, !917, !922, !940, !947, !954, !960, !965, !971, !977}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !784, file: !378, line: 738, baseType: !787, size: 256)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !378, line: 271, size: 256, elements: !788)
!788 = !{!789, !790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !787, file: !378, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !787, file: !378, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !787, file: !378, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !787, file: !378, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !787, file: !378, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !787, file: !378, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !787, file: !378, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !787, file: !378, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !787, file: !378, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !787, file: !378, line: 312, baseType: !7, size: 32, offset: 32)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !787, file: !378, line: 316, baseType: !583, size: 32, offset: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !787, file: !378, line: 319, baseType: !7, size: 32, offset: 96)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !787, file: !378, line: 323, baseType: !746, size: 64, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !787, file: !378, line: 327, baseType: !458, size: 64, offset: 192)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !784, file: !378, line: 739, baseType: !804, size: 448)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !378, line: 350, size: 448, elements: !805)
!805 = !{!806, !835}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !804, file: !378, line: 353, baseType: !807, size: 384)
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !378, line: 333, size: 384, elements: !808)
!808 = !{!809, !810, !818}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !807, file: !378, line: 336, baseType: !787, size: 256)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !807, file: !378, line: 343, baseType: !811, size: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !813, line: 37, size: 128, elements: !814)
!813 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!814 = !{!815, !816}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !812, file: !813, line: 39, baseType: !811, size: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !812, file: !813, line: 40, baseType: !817, size: 64, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !458, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !807, file: !378, line: 344, baseType: !819, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !820, size: 64)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !813, line: 45, size: 320, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !820, file: !813, line: 47, baseType: !819, size: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !820, file: !813, line: 48, baseType: !824, size: 256, offset: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !825)
!825 = !{!826, !828, !829, !834}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !824, file: !135, line: 1884, baseType: !827, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !824, file: !135, line: 1885, baseType: !827, size: 64, offset: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !824, file: !135, line: 1891, baseType: !830, size: 64, offset: 128)
!830 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !824, file: !135, line: 1891, size: 64, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !830, file: !135, line: 1891, baseType: !782, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !830, file: !135, line: 1891, baseType: !458, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !824, file: !135, line: 1892, baseType: !817, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !804, file: !378, line: 359, baseType: !836, size: 64, offset: 384)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !458, size: 64, elements: !557)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !784, file: !378, line: 740, baseType: !838, size: 512)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !378, line: 365, size: 512, elements: !839)
!839 = !{!840, !841, !842}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !838, file: !378, line: 368, baseType: !807, size: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !838, file: !378, line: 373, baseType: !458, size: 64, offset: 384)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !838, file: !378, line: 374, baseType: !458, size: 64, offset: 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !784, file: !378, line: 741, baseType: !844, size: 576)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !378, line: 380, size: 576, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !844, file: !378, line: 383, baseType: !838, size: 512)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !844, file: !378, line: 389, baseType: !836, size: 64, offset: 512)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !784, file: !378, line: 742, baseType: !849, size: 320)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !378, line: 395, size: 320, elements: !850)
!850 = !{!851, !852}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !849, file: !378, line: 397, baseType: !787, size: 256)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !849, file: !378, line: 400, baseType: !772, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !784, file: !378, line: 743, baseType: !854, size: 448)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !378, line: 406, size: 448, elements: !855)
!855 = !{!856, !857, !858, !859}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !854, file: !378, line: 408, baseType: !787, size: 256)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !854, file: !378, line: 412, baseType: !458, size: 64, offset: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !854, file: !378, line: 420, baseType: !458, size: 64, offset: 320)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !854, file: !378, line: 423, baseType: !772, size: 64, offset: 384)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !784, file: !378, line: 744, baseType: !861, size: 384)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !378, line: 429, size: 384, elements: !862)
!862 = !{!863, !864, !865}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !861, file: !378, line: 431, baseType: !787, size: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !861, file: !378, line: 434, baseType: !458, size: 64, offset: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !861, file: !378, line: 437, baseType: !772, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !784, file: !378, line: 745, baseType: !867, size: 384)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !378, line: 443, size: 384, elements: !868)
!868 = !{!869, !870, !871}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !867, file: !378, line: 445, baseType: !787, size: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !867, file: !378, line: 449, baseType: !458, size: 64, offset: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !867, file: !378, line: 453, baseType: !772, size: 64, offset: 320)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !784, file: !378, line: 746, baseType: !873, size: 320)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !378, line: 459, size: 320, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !873, file: !378, line: 461, baseType: !787, size: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !873, file: !378, line: 464, baseType: !458, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !784, file: !378, line: 747, baseType: !878, size: 768)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !378, line: 469, size: 768, elements: !879)
!879 = !{!880, !881, !882, !883, !884}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !878, file: !378, line: 471, baseType: !787, size: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !878, file: !378, line: 474, baseType: !7, size: 32, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !878, file: !378, line: 475, baseType: !7, size: 32, offset: 288)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !878, file: !378, line: 478, baseType: !458, size: 64, offset: 320)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !878, file: !378, line: 481, baseType: !885, size: 384, offset: 384)
!885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !886, size: 384, elements: !557)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !887)
!887 = !{!888, !889, !890}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !886, file: !135, line: 1920, baseType: !824, size: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !886, file: !135, line: 1921, baseType: !458, size: 64, offset: 256)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !886, file: !135, line: 1922, baseType: !583, size: 32, offset: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !784, file: !378, line: 748, baseType: !892, size: 320)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !378, line: 487, size: 320, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !892, file: !378, line: 490, baseType: !787, size: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !892, file: !378, line: 494, baseType: !451, size: 32, offset: 256)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !784, file: !378, line: 749, baseType: !897, size: 384)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !378, line: 500, size: 384, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !897, file: !378, line: 502, baseType: !787, size: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !897, file: !378, line: 506, baseType: !772, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !897, file: !378, line: 510, baseType: !772, size: 64, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !784, file: !378, line: 750, baseType: !903, size: 320)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !378, line: 529, size: 320, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !378, line: 531, baseType: !787, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !903, file: !378, line: 540, baseType: !772, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !784, file: !378, line: 751, baseType: !908, size: 704)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !378, line: 546, size: 704, elements: !909)
!909 = !{!910, !911, !912, !913, !914, !915, !916}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !908, file: !378, line: 549, baseType: !838, size: 512)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !908, file: !378, line: 553, baseType: !456, size: 64, offset: 512)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !908, file: !378, line: 557, baseType: !450, size: 8, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !908, file: !378, line: 558, baseType: !450, size: 8, offset: 584)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !908, file: !378, line: 559, baseType: !450, size: 8, offset: 592)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !908, file: !378, line: 560, baseType: !450, size: 8, offset: 600)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !908, file: !378, line: 566, baseType: !836, size: 64, offset: 640)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !784, file: !378, line: 752, baseType: !918, size: 384)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !378, line: 571, size: 384, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !918, file: !378, line: 573, baseType: !849, size: 320)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !918, file: !378, line: 577, baseType: !458, size: 64, offset: 320)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !784, file: !378, line: 753, baseType: !923, size: 576)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !378, line: 600, size: 576, elements: !924)
!924 = !{!925, !926, !927, !930, !939}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !923, file: !378, line: 602, baseType: !849, size: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !923, file: !378, line: 605, baseType: !458, size: 64, offset: 320)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !923, file: !378, line: 609, baseType: !928, size: 64, offset: 384)
!928 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !929, line: 46, baseType: !512)
!929 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!930 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !923, file: !378, line: 612, baseType: !931, size: 64, offset: 448)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !378, line: 581, size: 320, elements: !933)
!933 = !{!934, !935, !936, !937, !938}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !932, file: !378, line: 583, baseType: !134, size: 32)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !932, file: !378, line: 586, baseType: !458, size: 64, offset: 64)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !932, file: !378, line: 589, baseType: !458, size: 64, offset: 128)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !932, file: !378, line: 592, baseType: !458, size: 64, offset: 192)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !932, file: !378, line: 595, baseType: !458, size: 64, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !923, file: !378, line: 616, baseType: !772, size: 64, offset: 512)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !784, file: !378, line: 754, baseType: !941, size: 512)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !378, line: 622, size: 512, elements: !942)
!942 = !{!943, !944, !945, !946}
!943 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !941, file: !378, line: 624, baseType: !849, size: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !941, file: !378, line: 628, baseType: !458, size: 64, offset: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !941, file: !378, line: 632, baseType: !458, size: 64, offset: 384)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !941, file: !378, line: 636, baseType: !458, size: 64, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !784, file: !378, line: 755, baseType: !948, size: 704)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !378, line: 642, size: 704, elements: !949)
!949 = !{!950, !951, !952, !953}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !948, file: !378, line: 644, baseType: !941, size: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !948, file: !378, line: 648, baseType: !458, size: 64, offset: 512)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !948, file: !378, line: 652, baseType: !458, size: 64, offset: 576)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !948, file: !378, line: 653, baseType: !458, size: 64, offset: 640)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !784, file: !378, line: 756, baseType: !955, size: 448)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !378, line: 663, size: 448, elements: !956)
!956 = !{!957, !958, !959}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !955, file: !378, line: 665, baseType: !849, size: 320)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !955, file: !378, line: 668, baseType: !458, size: 64, offset: 320)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !955, file: !378, line: 673, baseType: !458, size: 64, offset: 384)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !784, file: !378, line: 757, baseType: !961, size: 384)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !378, line: 694, size: 384, elements: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !961, file: !378, line: 696, baseType: !849, size: 320)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !961, file: !378, line: 699, baseType: !458, size: 64, offset: 320)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !784, file: !378, line: 758, baseType: !966, size: 384)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !378, line: 681, size: 384, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !966, file: !378, line: 683, baseType: !787, size: 256)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !966, file: !378, line: 686, baseType: !458, size: 64, offset: 256)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !966, file: !378, line: 689, baseType: !458, size: 64, offset: 320)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !784, file: !378, line: 759, baseType: !972, size: 384)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !378, line: 707, size: 384, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !972, file: !378, line: 709, baseType: !787, size: 256)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !972, file: !378, line: 712, baseType: !458, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !972, file: !378, line: 712, baseType: !458, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !784, file: !378, line: 760, baseType: !978, size: 320)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !378, line: 718, size: 320, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !978, file: !378, line: 720, baseType: !787, size: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !978, file: !378, line: 723, baseType: !458, size: 64, offset: 256)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !779, file: !378, line: 138, baseType: !778, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !779, file: !378, line: 139, baseType: !778, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !774, file: !378, line: 146, baseType: !777, size: 64, offset: 64)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !774, file: !378, line: 152, baseType: !772, size: 64, offset: 128)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !769, file: !330, line: 130, baseType: !633, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !764, file: !330, line: 134, baseType: !455, size: 64, offset: 192)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !764, file: !330, line: 137, baseType: !458, size: 64, offset: 256)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !764, file: !330, line: 138, baseType: !583, size: 32, offset: 320)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !764, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !330, line: 144, baseType: !451, size: 32, offset: 384)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !764, file: !330, line: 145, baseType: !451, size: 32, offset: 416)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !764, file: !330, line: 146, baseType: !994, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !514)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !747, file: !330, line: 220, baseType: !750, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !747, file: !330, line: 223, baseType: !455, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !747, file: !330, line: 226, baseType: !998, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !747, file: !330, line: 229, baseType: !1001, size: 128, offset: 256)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 128, elements: !701)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !747, file: !330, line: 232, baseType: !746, size: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !747, file: !330, line: 233, baseType: !746, size: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !747, file: !330, line: 238, baseType: !1007, size: 64, offset: 512)
!1007 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1008)
!1008 = !{!1009, !1015}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1007, file: !330, line: 236, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1011, file: !330, line: 275, baseType: !772, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1011, file: !330, line: 278, baseType: !772, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1007, file: !330, line: 237, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1017, file: !330, line: 261, baseType: !633, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1017, file: !330, line: 262, baseType: !633, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1017, file: !330, line: 266, baseType: !633, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1017, file: !330, line: 267, baseType: !633, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1017, file: !330, line: 270, baseType: !451, size: 32, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !747, file: !330, line: 241, baseType: !994, size: 64, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !747, file: !330, line: 244, baseType: !451, size: 32, offset: 640)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !747, file: !330, line: 247, baseType: !451, size: 32, offset: 672)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !747, file: !330, line: 250, baseType: !451, size: 32, offset: 704)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !747, file: !330, line: 253, baseType: !451, size: 32, offset: 736)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !747, file: !330, line: 256, baseType: !451, size: 32, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !654, file: !636, line: 179, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !636, line: 150, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !636, line: 142, size: 320, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1041, !1042}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1033, file: !636, line: 144, baseType: !458, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1033, file: !636, line: 145, baseType: !633, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1033, file: !636, line: 146, baseType: !633, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1033, file: !636, line: 147, baseType: !1039, size: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1040, line: 31, baseType: !451)
!1040 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1033, file: !636, line: 148, baseType: !7, size: 32, offset: 224)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1033, file: !636, line: 149, baseType: !450, size: 8, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !654, file: !636, line: 180, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !636, line: 162, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !636, line: 159, size: 128, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1046, file: !636, line: 160, baseType: !458, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1046, file: !636, line: 161, baseType: !514, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !654, file: !636, line: 181, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !636, line: 181, flags: DIFlagFwdDecl)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !649, file: !636, line: 317, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !514, size: 64, elements: !557)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !649, file: !636, line: 318, baseType: !1056, size: 320)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !636, line: 188, size: 320, elements: !1057)
!1057 = !{!1058, !1060, !1083}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1056, file: !636, line: 190, baseType: !1059, size: 192)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !653, size: 192, elements: !532)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1056, file: !636, line: 193, baseType: !1061, size: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !636, line: 206, size: 320, elements: !1063)
!1063 = !{!1064, !1068, !1069, !1070, !1082}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1062, file: !636, line: 208, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !459, line: 62, baseType: !1067)
!1067 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !459, line: 61, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1062, file: !636, line: 211, baseType: !7, size: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1062, file: !636, line: 214, baseType: !514, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1062, file: !636, line: 224, baseType: !1071, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !636, line: 202, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !636, line: 202, size: 128, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1073, file: !636, line: 202, baseType: !1076, size: 128)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !636, line: 200, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !636, line: 200, size: 128, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1077, file: !636, line: 200, baseType: !7, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1077, file: !636, line: 200, baseType: !7, size: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1077, file: !636, line: 200, baseType: !667, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1062, file: !636, line: 234, baseType: !1071, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1056, file: !636, line: 197, baseType: !514, size: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !649, file: !636, line: 319, baseType: !521, size: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !649, file: !636, line: 320, baseType: !540, size: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !461, file: !135, line: 3384, baseType: !1087, size: 1472)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1088)
!1088 = !{!1089, !1110, !1111, !1112, !1113}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !135, line: 3115, baseType: !1090, size: 1216)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !135, line: 2985, baseType: !629, size: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1090, file: !135, line: 2986, baseType: !458, size: 64, offset: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1090, file: !135, line: 2987, baseType: !458, size: 64, offset: 1024)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1090, file: !135, line: 2988, baseType: !458, size: 64, offset: 1088)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1090, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1090, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1090, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1090, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1090, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1090, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1090, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1090, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1090, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1090, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1090, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1090, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1090, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1090, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1087, file: !135, line: 3117, baseType: !458, size: 64, offset: 1216)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1087, file: !135, line: 3119, baseType: !458, size: 64, offset: 1280)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1087, file: !135, line: 3121, baseType: !458, size: 64, offset: 1344)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1087, file: !135, line: 3123, baseType: !458, size: 64, offset: 1408)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !461, file: !135, line: 3385, baseType: !1115, size: 1088)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1116)
!1116 = !{!1117, !1118, !1119}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !135, line: 2875, baseType: !629, size: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1115, file: !135, line: 2876, baseType: !633, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1115, file: !135, line: 2877, baseType: !1120, size: 64, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1122, line: 172, size: 128, elements: !1123)
!1122 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1123 = !{!1124, !1125, !1126, !1127, !1128, !1129, !1130}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1121, file: !1122, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1121, file: !1122, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1121, file: !1122, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1121, file: !1122, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1121, file: !1122, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1121, file: !1122, line: 195, baseType: !7, size: 32, offset: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1121, file: !1122, line: 199, baseType: !458, size: 64, offset: 64)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !461, file: !135, line: 3386, baseType: !1090, size: 1216)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !461, file: !135, line: 3387, baseType: !1133, size: 1280)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !135, line: 3094, baseType: !1090, size: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1133, file: !135, line: 3095, baseType: !1120, size: 64, offset: 1216)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !461, file: !135, line: 3388, baseType: !1138, size: 1216)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1144, !1145}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !135, line: 2825, baseType: !591, size: 896)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1138, file: !135, line: 2827, baseType: !458, size: 64, offset: 896)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1138, file: !135, line: 2828, baseType: !458, size: 64, offset: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1138, file: !135, line: 2829, baseType: !458, size: 64, offset: 1024)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1138, file: !135, line: 2830, baseType: !458, size: 64, offset: 1088)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1138, file: !135, line: 2831, baseType: !458, size: 64, offset: 1152)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !461, file: !135, line: 3389, baseType: !1147, size: 1024)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1148)
!1148 = !{!1149, !1150, !1151}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1147, file: !135, line: 2851, baseType: !629, size: 960)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1147, file: !135, line: 2852, baseType: !451, size: 32, offset: 960)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1147, file: !135, line: 2853, baseType: !451, size: 32, offset: 992)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !461, file: !135, line: 3390, baseType: !1153, size: 1024)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1154)
!1154 = !{!1155, !1156}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1153, file: !135, line: 2858, baseType: !629, size: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1153, file: !135, line: 2859, baseType: !1120, size: 64, offset: 960)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !461, file: !135, line: 3391, baseType: !1158, size: 960)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1159)
!1159 = !{!1160}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1158, file: !135, line: 2863, baseType: !629, size: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !461, file: !135, line: 3392, baseType: !1162, size: 1472)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1163)
!1163 = !{!1164}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1162, file: !135, line: 3305, baseType: !1087, size: 1472)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !461, file: !135, line: 3393, baseType: !1166, size: 1792)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1167)
!1167 = !{!1168, !1169, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1166, file: !135, line: 3249, baseType: !1087, size: 1472)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1166, file: !135, line: 3251, baseType: !1170, size: 64, offset: 1472)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1172, line: 463, size: 1152, elements: !1173)
!1172 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1173 = !{!1174, !1177, !1208, !1209, !1324, !1327, !1328, !1329, !1330, !1331, !1332, !1356, !1359, !1360, !1361, !1362, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1171, file: !1172, line: 464, baseType: !1175, size: 64)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1172, line: 464, flags: DIFlagFwdDecl)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1171, file: !1172, line: 467, baseType: !1178, size: 64, offset: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1179, size: 64)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1180)
!1180 = !{!1181, !1183, !1184, !1197, !1198, !1199, !1200, !1201, !1202, !1204, !1206, !1207}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1179, file: !330, line: 377, baseType: !1182, size: 64)
!1182 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !459, line: 111, baseType: !746)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1179, file: !330, line: 378, baseType: !1182, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1179, file: !330, line: 381, baseType: !1185, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1187)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1188)
!1188 = !{!1189}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1187, file: !330, line: 282, baseType: !1190, size: 128)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1191, file: !330, line: 281, baseType: !7, size: 32)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1191, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1191, file: !330, line: 281, baseType: !1196, size: 64, offset: 64)
!1196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1182, size: 64, elements: !557)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1179, file: !330, line: 384, baseType: !451, size: 32, offset: 192)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1179, file: !330, line: 387, baseType: !451, size: 32, offset: 224)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1179, file: !330, line: 390, baseType: !451, size: 32, offset: 256)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1179, file: !330, line: 394, baseType: !1185, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1179, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1179, file: !330, line: 399, baseType: !1203, size: 64, offset: 416)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !701)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1179, file: !330, line: 402, baseType: !1205, size: 64, offset: 480)
!1205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !701)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1179, file: !330, line: 406, baseType: !451, size: 32, offset: 544)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1179, file: !330, line: 409, baseType: !451, size: 32, offset: 576)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1171, file: !1172, line: 470, baseType: !773, size: 64, offset: 128)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1171, file: !1172, line: 473, baseType: !1210, size: 64, offset: 192)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1122, line: 39, size: 1152, elements: !1212)
!1212 = !{!1213, !1263, !1276, !1288, !1289, !1301, !1302, !1306, !1307, !1308, !1309, !1310}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1211, file: !1122, line: 41, baseType: !1214, size: 64)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1215, line: 144, baseType: !1216)
!1215 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1215, line: 100, size: 896, elements: !1218)
!1218 = !{!1219, !1227, !1232, !1237, !1239, !1240, !1241, !1242, !1243, !1244, !1249, !1251, !1252, !1257, !1262}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1217, file: !1215, line: 102, baseType: !1220, size: 64)
!1220 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1215, line: 52, baseType: !1221)
!1221 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1222, size: 64)
!1222 = !DISubroutineType(types: !1223)
!1223 = !{!1224, !1225}
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1215, line: 47, baseType: !7)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1217, file: !1215, line: 105, baseType: !1228, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1215, line: 59, baseType: !1229)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DISubroutineType(types: !1231)
!1231 = !{!451, !1225, !1225}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1217, file: !1215, line: 108, baseType: !1233, size: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1215, line: 63, baseType: !1234)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = !DISubroutineType(types: !1236)
!1236 = !{null, !455}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1217, file: !1215, line: 111, baseType: !1238, size: 64, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1217, file: !1215, line: 114, baseType: !928, size: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1217, file: !1215, line: 117, baseType: !928, size: 64, offset: 320)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1217, file: !1215, line: 120, baseType: !928, size: 64, offset: 384)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1217, file: !1215, line: 124, baseType: !7, size: 32, offset: 448)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1217, file: !1215, line: 128, baseType: !7, size: 32, offset: 480)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1217, file: !1215, line: 131, baseType: !1245, size: 64, offset: 512)
!1245 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1215, line: 75, baseType: !1246)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DISubroutineType(types: !1248)
!1248 = !{!455, !928, !928}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1217, file: !1215, line: 132, baseType: !1250, size: 64, offset: 576)
