; ModuleID = 'tree-ssa-ter.bc'
source_filename = "tree-ssa-ter.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!279 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!280 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!281 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!282 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!283 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!284 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!285 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!286 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!287 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!288 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!289 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!290 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!291 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!292 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !255, line: 727, baseType: !5, size: 32, elements: !294)
!294 = !{!295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318}
!295 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!297 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!298 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!299 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!300 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!301 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!302 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!303 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!304 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!305 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!306 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!307 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!308 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!309 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!310 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!311 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!312 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!313 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!314 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!315 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!316 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!317 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!318 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !255, line: 80, baseType: !5, size: 32, elements: !320)
!320 = !{!321, !322, !323, !324}
!321 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!322 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!323 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!324 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!325 = !{!326, !327, !328, !329, !332, !333, !335, !1546, !362, !3, !381, !1554, !675, !1557, !708, !330, !319, !1033}
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!327 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!328 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !331, size: 64)
!331 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !334, size: 64)
!334 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !331)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "temp_expr_table_d", file: !1, line: 158, size: 576, elements: !337)
!337 = !{!338, !1545, !1547, !1548, !1549, !1550, !1551, !1552, !1553}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "map", scope: !336, file: !1, line: 160, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "var_map", file: !340, line: 77, baseType: !341)
!340 = !DIFile(filename: "./tree-ssa-live.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_var_map", file: !340, line: 54, size: 448, elements: !343)
!343 = !{!344, !361, !363, !364, !365, !366, !367, !368}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "var_partition", scope: !342, file: !340, line: 57, baseType: !345, size: 64)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "partition", file: !346, line: 65, baseType: !347)
!346 = !DIFile(filename: "./include/partition.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partition_def", file: !346, line: 59, size: 256, elements: !349)
!349 = !{!350, !351}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "num_elements", scope: !348, file: !346, line: 62, baseType: !328, size: 32)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !348, file: !346, line: 64, baseType: !352, size: 192, offset: 64)
!352 = !DICompositeType(tag: DW_TAG_array_type, baseType: !353, size: 192, elements: !359)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "partition_elem", file: !346, line: 46, size: 192, elements: !354)
!354 = !{!355, !356, !358}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "class_element", scope: !353, file: !346, line: 50, baseType: !328, size: 32)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !353, file: !346, line: 53, baseType: !357, size: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !353, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "class_count", scope: !353, file: !346, line: 56, baseType: !5, size: 32, offset: 128)
!359 = !{!360}
!360 = !DISubrange(count: 1)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "partition_to_view", scope: !342, file: !340, line: 60, baseType: !362, size: 64, offset: 64)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "view_to_partition", scope: !342, file: !340, line: 61, baseType: !362, size: 64, offset: 128)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "num_partitions", scope: !342, file: !340, line: 64, baseType: !5, size: 32, offset: 192)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "partition_size", scope: !342, file: !340, line: 67, baseType: !5, size: 32, offset: 224)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "num_basevars", scope: !342, file: !340, line: 70, baseType: !328, size: 32, offset: 256)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "partition_to_base_index", scope: !342, file: !340, line: 73, baseType: !362, size: 64, offset: 320)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "basevars", scope: !342, file: !340, line: 76, baseType: !369, size: 64, offset: 384)
!369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !370, size: 64)
!370 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_heap", file: !4, line: 184, baseType: !371)
!371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_heap", file: !4, line: 184, size: 128, elements: !372)
!372 = !{!373}
!373 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !371, file: !4, line: 184, baseType: !374, size: 128)
!374 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !4, line: 182, baseType: !375)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !4, line: 182, size: 128, elements: !376)
!376 = !{!377, !378, !379}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !375, file: !4, line: 182, baseType: !5, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !375, file: !4, line: 182, baseType: !5, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !375, file: !4, line: 182, baseType: !380, size: 64, offset: 64)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !381, size: 64, elements: !359)
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !382, line: 56, baseType: !383)
!382 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !4, line: 3371, size: 1792, elements: !385)
!385 = !{!386, !419, !425, !438, !445, !452, !457, !464, !470, !483, !495, !533, !541, !569, !586, !587, !592, !601, !607, !612, !616, !620, !1194, !1243, !1249, !1255, !1262, !1275, !1289, !1306, !1318, !1340, !1355, !1527}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !384, file: !4, line: 3372, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !4, line: 360, size: 64, elements: !388)
!388 = !{!389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417, !418}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !387, file: !4, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !387, file: !4, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !387, file: !4, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !387, file: !4, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !387, file: !4, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !387, file: !4, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !387, file: !4, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !387, file: !4, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !387, file: !4, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !387, file: !4, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !387, file: !4, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !387, file: !4, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !387, file: !4, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !387, file: !4, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !387, file: !4, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !387, file: !4, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !387, file: !4, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !387, file: !4, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !387, file: !4, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !387, file: !4, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !387, file: !4, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !387, file: !4, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !387, file: !4, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !387, file: !4, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !387, file: !4, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !387, file: !4, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !387, file: !4, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !387, file: !4, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !387, file: !4, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !387, file: !4, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !384, file: !4, line: 3373, baseType: !420, size: 192)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !4, line: 402, size: 192, elements: !421)
!421 = !{!422, !423, !424}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !420, file: !4, line: 403, baseType: !387, size: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !420, file: !4, line: 404, baseType: !381, size: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !420, file: !4, line: 405, baseType: !381, size: 64, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !384, file: !4, line: 3374, baseType: !426, size: 320)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !4, line: 1384, size: 320, elements: !427)
!427 = !{!428, !429}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !426, file: !4, line: 1385, baseType: !420, size: 192)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !426, file: !4, line: 1386, baseType: !430, size: 128, offset: 192)
!430 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !431, line: 58, baseType: !432)
!431 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !431, line: 54, size: 128, elements: !433)
!433 = !{!434, !436}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !432, file: !431, line: 56, baseType: !435, size: 64)
!435 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !432, file: !431, line: 57, baseType: !437, size: 64, offset: 64)
!437 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !384, file: !4, line: 3375, baseType: !439, size: 256)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !4, line: 1397, size: 256, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !439, file: !4, line: 1398, baseType: !420, size: 192)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !439, file: !4, line: 1399, baseType: !443, size: 64, offset: 192)
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !444, size: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !4, line: 1392, flags: DIFlagFwdDecl)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !384, file: !4, line: 3376, baseType: !446, size: 256)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !4, line: 1408, size: 256, elements: !447)
!447 = !{!448, !449}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !446, file: !4, line: 1409, baseType: !420, size: 192)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !446, file: !4, line: 1410, baseType: !450, size: 64, offset: 192)
!450 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !451, size: 64)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !4, line: 1403, flags: DIFlagFwdDecl)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !384, file: !4, line: 3377, baseType: !453, size: 256)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !4, line: 1437, size: 256, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !453, file: !4, line: 1438, baseType: !420, size: 192)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !453, file: !4, line: 1439, baseType: !381, size: 64, offset: 192)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !384, file: !4, line: 3378, baseType: !458, size: 256)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !4, line: 1418, size: 256, elements: !459)
!459 = !{!460, !461, !462}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !458, file: !4, line: 1419, baseType: !420, size: 192)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !458, file: !4, line: 1420, baseType: !328, size: 32, offset: 192)
!462 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !458, file: !4, line: 1421, baseType: !463, size: 8, offset: 224)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 8, elements: !359)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !384, file: !4, line: 3379, baseType: !465, size: 320)
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !4, line: 1428, size: 320, elements: !466)
!466 = !{!467, !468, !469}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !465, file: !4, line: 1429, baseType: !420, size: 192)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !465, file: !4, line: 1430, baseType: !381, size: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !465, file: !4, line: 1431, baseType: !381, size: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !384, file: !4, line: 3380, baseType: !471, size: 320)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !4, line: 1460, size: 320, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !471, file: !4, line: 1461, baseType: !420, size: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !471, file: !4, line: 1462, baseType: !475, size: 128, offset: 192)
!475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !476, line: 31, size: 128, elements: !477)
!476 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!477 = !{!478, !481, !482}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !475, file: !476, line: 32, baseType: !479, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !480, size: 64)
!480 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !327)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !475, file: !476, line: 33, baseType: !5, size: 32, offset: 64)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !475, file: !476, line: 34, baseType: !5, size: 32, offset: 96)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !384, file: !4, line: 3381, baseType: !484, size: 384)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !4, line: 2507, size: 384, elements: !485)
!485 = !{!486, !487, !492, !493, !494}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !484, file: !4, line: 2508, baseType: !420, size: 192)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !484, file: !4, line: 2509, baseType: !488, size: 32, offset: 192)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !489, line: 58, baseType: !490)
!489 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !491, line: 44, baseType: !5)
!491 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!492 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !484, file: !4, line: 2510, baseType: !5, size: 32, offset: 224)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !484, file: !4, line: 2511, baseType: !381, size: 64, offset: 256)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !484, file: !4, line: 2512, baseType: !381, size: 64, offset: 320)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !384, file: !4, line: 3382, baseType: !496, size: 896)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !4, line: 2652, size: 896, elements: !497)
!497 = !{!498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !496, file: !4, line: 2653, baseType: !484, size: 384)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !496, file: !4, line: 2654, baseType: !381, size: 64, offset: 384)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !496, file: !4, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !496, file: !4, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !496, file: !4, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !496, file: !4, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !496, file: !4, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !496, file: !4, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !496, file: !4, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !496, file: !4, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !496, file: !4, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !496, file: !4, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !496, file: !4, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !496, file: !4, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !496, file: !4, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !496, file: !4, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !496, file: !4, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !496, file: !4, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !496, file: !4, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !496, file: !4, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !496, file: !4, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !496, file: !4, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !496, file: !4, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !496, file: !4, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !496, file: !4, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !496, file: !4, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !496, file: !4, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !496, file: !4, line: 2703, baseType: !5, size: 32, offset: 512)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !496, file: !4, line: 2705, baseType: !381, size: 64, offset: 576)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !496, file: !4, line: 2706, baseType: !381, size: 64, offset: 640)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !496, file: !4, line: 2707, baseType: !381, size: 64, offset: 704)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !496, file: !4, line: 2708, baseType: !381, size: 64, offset: 768)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !496, file: !4, line: 2711, baseType: !531, size: 64, offset: 832)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !4, line: 2711, flags: DIFlagFwdDecl)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !384, file: !4, line: 3383, baseType: !534, size: 960)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !4, line: 2756, size: 960, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !534, file: !4, line: 2757, baseType: !496, size: 896)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !534, file: !4, line: 2758, baseType: !538, size: 64, offset: 896)
!538 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !382, line: 50, baseType: !539)
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !540, size: 64)
!540 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !382, line: 49, flags: DIFlagFwdDecl)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !384, file: !4, line: 3384, baseType: !542, size: 1472)
!542 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !4, line: 3114, size: 1472, elements: !543)
!543 = !{!544, !565, !566, !567, !568}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !542, file: !4, line: 3115, baseType: !545, size: 1216)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !4, line: 2984, size: 1216, elements: !546)
!546 = !{!547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !545, file: !4, line: 2985, baseType: !534, size: 960)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !545, file: !4, line: 2986, baseType: !381, size: 64, offset: 960)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !545, file: !4, line: 2987, baseType: !381, size: 64, offset: 1024)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !545, file: !4, line: 2988, baseType: !381, size: 64, offset: 1088)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !545, file: !4, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !545, file: !4, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !545, file: !4, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !545, file: !4, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !545, file: !4, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !545, file: !4, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !545, file: !4, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !545, file: !4, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !545, file: !4, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !545, file: !4, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !545, file: !4, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !545, file: !4, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !545, file: !4, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !545, file: !4, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !542, file: !4, line: 3117, baseType: !381, size: 64, offset: 1216)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !542, file: !4, line: 3119, baseType: !381, size: 64, offset: 1280)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !542, file: !4, line: 3121, baseType: !381, size: 64, offset: 1344)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !542, file: !4, line: 3123, baseType: !381, size: 64, offset: 1408)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !384, file: !4, line: 3385, baseType: !570, size: 1088)
!570 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !4, line: 2874, size: 1088, elements: !571)
!571 = !{!572, !573, !574}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !570, file: !4, line: 2875, baseType: !534, size: 960)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !570, file: !4, line: 2876, baseType: !538, size: 64, offset: 960)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !570, file: !4, line: 2877, baseType: !575, size: 64, offset: 1024)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !577, line: 172, size: 128, elements: !578)
!577 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!578 = !{!579, !580, !581, !582, !583, !584, !585}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !576, file: !577, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !576, file: !577, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !576, file: !577, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !576, file: !577, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !576, file: !577, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !576, file: !577, line: 195, baseType: !5, size: 32, offset: 32)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !576, file: !577, line: 199, baseType: !381, size: 64, offset: 64)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !384, file: !4, line: 3386, baseType: !545, size: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !384, file: !4, line: 3387, baseType: !588, size: 1280)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !4, line: 3093, size: 1280, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !588, file: !4, line: 3094, baseType: !545, size: 1216)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !588, file: !4, line: 3095, baseType: !575, size: 64, offset: 1216)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !384, file: !4, line: 3388, baseType: !593, size: 1216)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !4, line: 2824, size: 1216, elements: !594)
!594 = !{!595, !596, !597, !598, !599, !600}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !593, file: !4, line: 2825, baseType: !496, size: 896)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !593, file: !4, line: 2827, baseType: !381, size: 64, offset: 896)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !593, file: !4, line: 2828, baseType: !381, size: 64, offset: 960)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !593, file: !4, line: 2829, baseType: !381, size: 64, offset: 1024)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !593, file: !4, line: 2830, baseType: !381, size: 64, offset: 1088)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !593, file: !4, line: 2831, baseType: !381, size: 64, offset: 1152)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !384, file: !4, line: 3389, baseType: !602, size: 1024)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !4, line: 2850, size: 1024, elements: !603)
!603 = !{!604, !605, !606}
!604 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !602, file: !4, line: 2851, baseType: !534, size: 960)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !602, file: !4, line: 2852, baseType: !328, size: 32, offset: 960)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !602, file: !4, line: 2853, baseType: !328, size: 32, offset: 992)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !384, file: !4, line: 3390, baseType: !608, size: 1024)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !4, line: 2857, size: 1024, elements: !609)
!609 = !{!610, !611}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !4, line: 2858, baseType: !534, size: 960)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !608, file: !4, line: 2859, baseType: !575, size: 64, offset: 960)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !384, file: !4, line: 3391, baseType: !613, size: 960)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !4, line: 2862, size: 960, elements: !614)
!614 = !{!615}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !613, file: !4, line: 2863, baseType: !534, size: 960)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !384, file: !4, line: 3392, baseType: !617, size: 1472)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !4, line: 3304, size: 1472, elements: !618)
!618 = !{!619}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !617, file: !4, line: 3305, baseType: !542, size: 1472)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !384, file: !4, line: 3393, baseType: !621, size: 1792)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !4, line: 3248, size: 1792, elements: !622)
!622 = !{!623, !624, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186, !1187, !1188, !1189, !1190, !1191, !1192, !1193}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !621, file: !4, line: 3249, baseType: !542, size: 1472)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !621, file: !4, line: 3251, baseType: !625, size: 64, offset: 1472)
!625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !626, size: 64)
!626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !627, line: 463, size: 1152, elements: !628)
!627 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!628 = !{!629, !632, !947, !948, !1114, !1117, !1118, !1119, !1120, !1121, !1122, !1146, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165, !1166, !1167, !1168, !1169, !1170, !1171, !1172}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !626, file: !627, line: 464, baseType: !630, size: 64)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !627, line: 464, flags: DIFlagFwdDecl)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !626, file: !627, line: 467, baseType: !633, size: 64, offset: 64)
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !200, line: 374, size: 640, elements: !635)
!635 = !{!636, !922, !923, !936, !937, !938, !939, !940, !941, !943, !945, !946}
!636 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !634, file: !200, line: 377, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !382, line: 111, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !200, line: 217, size: 832, elements: !640)
!640 = !{!641, !885, !886, !887, !890, !896, !897, !898, !916, !917, !918, !919, !920, !921}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !639, file: !200, line: 219, baseType: !642, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !643, size: 64)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !200, line: 151, baseType: !644)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !200, line: 151, size: 128, elements: !645)
!645 = !{!646}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !644, file: !200, line: 151, baseType: !647, size: 128)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !200, line: 150, baseType: !648)
!648 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !200, line: 150, size: 128, elements: !649)
!649 = !{!650, !651, !652}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !648, file: !200, line: 150, baseType: !5, size: 32)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !648, file: !200, line: 150, baseType: !5, size: 32, offset: 32)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !648, file: !200, line: 150, baseType: !653, size: 64, offset: 64)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !654, size: 64, elements: !359)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !382, line: 108, baseType: !655)
!655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !656, size: 64)
!656 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !200, line: 122, size: 512, elements: !657)
!657 = !{!658, !659, !660, !877, !878, !879, !880, !881, !882, !883}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !656, file: !200, line: 124, baseType: !638, size: 64)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !656, file: !200, line: 125, baseType: !638, size: 64, offset: 64)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !656, file: !200, line: 131, baseType: !661, size: 64, offset: 128)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !200, line: 128, size: 64, elements: !662)
!662 = !{!663, !876}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !661, file: !200, line: 129, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !382, line: 66, baseType: !665)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !255, line: 143, size: 192, elements: !667)
!667 = !{!668, !874, !875}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !666, file: !255, line: 145, baseType: !669, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !382, line: 69, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !255, line: 136, size: 192, elements: !672)
!672 = !{!673, !872, !873}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !671, file: !255, line: 137, baseType: !674, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !382, line: 58, baseType: !675)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !255, line: 737, size: 768, elements: !677)
!677 = !{!678, !695, !727, !733, !738, !743, !750, !756, !762, !767, !781, !786, !792, !797, !807, !812, !830, !837, !844, !850, !855, !861, !867}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !676, file: !255, line: 738, baseType: !679, size: 256)
!679 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !255, line: 271, size: 256, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !679, file: !255, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !679, file: !255, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !679, file: !255, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !679, file: !255, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !679, file: !255, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !679, file: !255, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !679, file: !255, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !679, file: !255, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !679, file: !255, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !679, file: !255, line: 312, baseType: !5, size: 32, offset: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !679, file: !255, line: 316, baseType: !488, size: 32, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !679, file: !255, line: 319, baseType: !5, size: 32, offset: 96)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !679, file: !255, line: 323, baseType: !638, size: 64, offset: 128)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !679, file: !255, line: 327, baseType: !381, size: 64, offset: 192)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !676, file: !255, line: 739, baseType: !696, size: 448)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !255, line: 350, size: 448, elements: !697)
!697 = !{!698, !726}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !696, file: !255, line: 353, baseType: !699, size: 384)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !255, line: 333, size: 384, elements: !700)
!700 = !{!701, !702, !709}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !699, file: !255, line: 336, baseType: !679, size: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !699, file: !255, line: 343, baseType: !703, size: 64, offset: 256)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !248, line: 37, size: 128, elements: !705)
!705 = !{!706, !707}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !704, file: !248, line: 39, baseType: !703, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !704, file: !248, line: 40, baseType: !708, size: 64, offset: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !699, file: !255, line: 344, baseType: !710, size: 64, offset: 320)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !248, line: 45, size: 320, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !711, file: !248, line: 47, baseType: !710, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !711, file: !248, line: 48, baseType: !715, size: 256, offset: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !4, line: 1883, size: 256, elements: !716)
!716 = !{!717, !719, !720, !725}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !715, file: !4, line: 1884, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !715, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !715, file: !4, line: 1885, baseType: !718, size: 64, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !715, file: !4, line: 1891, baseType: !721, size: 64, offset: 128)
!721 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !715, file: !4, line: 1891, size: 64, elements: !722)
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !721, file: !4, line: 1891, baseType: !674, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !721, file: !4, line: 1891, baseType: !381, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !715, file: !4, line: 1892, baseType: !708, size: 64, offset: 192)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !696, file: !255, line: 359, baseType: !380, size: 64, offset: 384)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !676, file: !255, line: 740, baseType: !728, size: 512)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !255, line: 365, size: 512, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !728, file: !255, line: 368, baseType: !699, size: 384)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !728, file: !255, line: 373, baseType: !381, size: 64, offset: 384)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !728, file: !255, line: 374, baseType: !381, size: 64, offset: 448)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !676, file: !255, line: 741, baseType: !734, size: 576)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !255, line: 380, size: 576, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !734, file: !255, line: 383, baseType: !728, size: 512)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !734, file: !255, line: 389, baseType: !380, size: 64, offset: 512)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !676, file: !255, line: 742, baseType: !739, size: 320)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !255, line: 395, size: 320, elements: !740)
!740 = !{!741, !742}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !739, file: !255, line: 397, baseType: !679, size: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !739, file: !255, line: 400, baseType: !664, size: 64, offset: 256)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !676, file: !255, line: 743, baseType: !744, size: 448)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !255, line: 406, size: 448, elements: !745)
!745 = !{!746, !747, !748, !749}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !744, file: !255, line: 408, baseType: !679, size: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !744, file: !255, line: 412, baseType: !381, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !744, file: !255, line: 420, baseType: !381, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !744, file: !255, line: 423, baseType: !664, size: 64, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !676, file: !255, line: 744, baseType: !751, size: 384)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !255, line: 429, size: 384, elements: !752)
!752 = !{!753, !754, !755}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !751, file: !255, line: 431, baseType: !679, size: 256)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !751, file: !255, line: 434, baseType: !381, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !751, file: !255, line: 437, baseType: !664, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !676, file: !255, line: 745, baseType: !757, size: 384)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !255, line: 443, size: 384, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !757, file: !255, line: 445, baseType: !679, size: 256)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !757, file: !255, line: 449, baseType: !381, size: 64, offset: 256)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !757, file: !255, line: 453, baseType: !664, size: 64, offset: 320)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !676, file: !255, line: 746, baseType: !763, size: 320)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !255, line: 459, size: 320, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !763, file: !255, line: 461, baseType: !679, size: 256)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !763, file: !255, line: 464, baseType: !381, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !676, file: !255, line: 747, baseType: !768, size: 768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !255, line: 469, size: 768, elements: !769)
!769 = !{!770, !771, !772, !773, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !768, file: !255, line: 471, baseType: !679, size: 256)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !768, file: !255, line: 474, baseType: !5, size: 32, offset: 256)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !768, file: !255, line: 475, baseType: !5, size: 32, offset: 288)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !768, file: !255, line: 478, baseType: !381, size: 64, offset: 320)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !768, file: !255, line: 481, baseType: !775, size: 384, offset: 384)
!775 = !DICompositeType(tag: DW_TAG_array_type, baseType: !776, size: 384, elements: !359)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !4, line: 1917, size: 384, elements: !777)
!777 = !{!778, !779, !780}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !776, file: !4, line: 1920, baseType: !715, size: 256)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !776, file: !4, line: 1921, baseType: !381, size: 64, offset: 256)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !776, file: !4, line: 1922, baseType: !488, size: 32, offset: 320)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !676, file: !255, line: 748, baseType: !782, size: 320)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !255, line: 487, size: 320, elements: !783)
!783 = !{!784, !785}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !782, file: !255, line: 490, baseType: !679, size: 256)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !782, file: !255, line: 494, baseType: !328, size: 32, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !676, file: !255, line: 749, baseType: !787, size: 384)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !255, line: 500, size: 384, elements: !788)
!788 = !{!789, !790, !791}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !787, file: !255, line: 502, baseType: !679, size: 256)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !787, file: !255, line: 506, baseType: !664, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !787, file: !255, line: 510, baseType: !664, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !676, file: !255, line: 750, baseType: !793, size: 320)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !255, line: 529, size: 320, elements: !794)
!794 = !{!795, !796}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !793, file: !255, line: 531, baseType: !679, size: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !793, file: !255, line: 540, baseType: !664, size: 64, offset: 256)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !676, file: !255, line: 751, baseType: !798, size: 704)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !255, line: 546, size: 704, elements: !799)
!799 = !{!800, !801, !802, !803, !804, !805, !806}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !798, file: !255, line: 549, baseType: !728, size: 512)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !798, file: !255, line: 553, baseType: !333, size: 64, offset: 512)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !798, file: !255, line: 557, baseType: !327, size: 8, offset: 576)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !798, file: !255, line: 558, baseType: !327, size: 8, offset: 584)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !798, file: !255, line: 559, baseType: !327, size: 8, offset: 592)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !798, file: !255, line: 560, baseType: !327, size: 8, offset: 600)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !798, file: !255, line: 566, baseType: !380, size: 64, offset: 640)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !676, file: !255, line: 752, baseType: !808, size: 384)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !255, line: 571, size: 384, elements: !809)
!809 = !{!810, !811}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !808, file: !255, line: 573, baseType: !739, size: 320)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !808, file: !255, line: 577, baseType: !381, size: 64, offset: 320)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !676, file: !255, line: 753, baseType: !813, size: 576)
!813 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !255, line: 600, size: 576, elements: !814)
!814 = !{!815, !816, !817, !820, !829}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !813, file: !255, line: 602, baseType: !739, size: 320)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !813, file: !255, line: 605, baseType: !381, size: 64, offset: 320)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !813, file: !255, line: 609, baseType: !818, size: 64, offset: 384)
!818 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !819, line: 46, baseType: !435)
!819 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!820 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !813, file: !255, line: 612, baseType: !821, size: 64, offset: 448)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !255, line: 581, size: 320, elements: !823)
!823 = !{!824, !825, !826, !827, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !822, file: !255, line: 583, baseType: !3, size: 32)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !822, file: !255, line: 586, baseType: !381, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !822, file: !255, line: 589, baseType: !381, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !822, file: !255, line: 592, baseType: !381, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !822, file: !255, line: 595, baseType: !381, size: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !813, file: !255, line: 616, baseType: !664, size: 64, offset: 512)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !676, file: !255, line: 754, baseType: !831, size: 512)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !255, line: 622, size: 512, elements: !832)
!832 = !{!833, !834, !835, !836}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !831, file: !255, line: 624, baseType: !739, size: 320)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !831, file: !255, line: 628, baseType: !381, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !831, file: !255, line: 632, baseType: !381, size: 64, offset: 384)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !831, file: !255, line: 636, baseType: !381, size: 64, offset: 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !676, file: !255, line: 755, baseType: !838, size: 704)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !255, line: 642, size: 704, elements: !839)
!839 = !{!840, !841, !842, !843}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !838, file: !255, line: 644, baseType: !831, size: 512)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !838, file: !255, line: 648, baseType: !381, size: 64, offset: 512)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !838, file: !255, line: 652, baseType: !381, size: 64, offset: 576)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !838, file: !255, line: 653, baseType: !381, size: 64, offset: 640)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !676, file: !255, line: 756, baseType: !845, size: 448)
!845 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !255, line: 663, size: 448, elements: !846)
!846 = !{!847, !848, !849}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !845, file: !255, line: 665, baseType: !739, size: 320)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !845, file: !255, line: 668, baseType: !381, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !845, file: !255, line: 673, baseType: !381, size: 64, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !676, file: !255, line: 757, baseType: !851, size: 384)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !255, line: 694, size: 384, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !851, file: !255, line: 696, baseType: !739, size: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !851, file: !255, line: 699, baseType: !381, size: 64, offset: 320)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !676, file: !255, line: 758, baseType: !856, size: 384)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !255, line: 681, size: 384, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !856, file: !255, line: 683, baseType: !679, size: 256)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !856, file: !255, line: 686, baseType: !381, size: 64, offset: 256)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !856, file: !255, line: 689, baseType: !381, size: 64, offset: 320)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !676, file: !255, line: 759, baseType: !862, size: 384)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !255, line: 707, size: 384, elements: !863)
!863 = !{!864, !865, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !862, file: !255, line: 709, baseType: !679, size: 256)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !862, file: !255, line: 712, baseType: !381, size: 64, offset: 256)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !862, file: !255, line: 712, baseType: !381, size: 64, offset: 320)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !676, file: !255, line: 760, baseType: !868, size: 320)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !255, line: 718, size: 320, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !868, file: !255, line: 720, baseType: !679, size: 256)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !868, file: !255, line: 723, baseType: !381, size: 64, offset: 256)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !671, file: !255, line: 138, baseType: !670, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !671, file: !255, line: 139, baseType: !670, size: 64, offset: 128)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !666, file: !255, line: 146, baseType: !669, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !666, file: !255, line: 152, baseType: !664, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !661, file: !200, line: 130, baseType: !538, size: 64)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !656, file: !200, line: 134, baseType: !332, size: 64, offset: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !656, file: !200, line: 137, baseType: !381, size: 64, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !656, file: !200, line: 138, baseType: !488, size: 32, offset: 320)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !656, file: !200, line: 142, baseType: !5, size: 32, offset: 352)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !656, file: !200, line: 144, baseType: !328, size: 32, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !656, file: !200, line: 145, baseType: !328, size: 32, offset: 416)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !656, file: !200, line: 146, baseType: !884, size: 64, offset: 448)
!884 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !200, line: 119, baseType: !437)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !639, file: !200, line: 220, baseType: !642, size: 64, offset: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !639, file: !200, line: 223, baseType: !332, size: 64, offset: 128)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !639, file: !200, line: 226, baseType: !888, size: 64, offset: 192)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !200, line: 185, flags: DIFlagFwdDecl)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !639, file: !200, line: 229, baseType: !891, size: 128, offset: 256)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !892, size: 128, elements: !894)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !200, line: 229, flags: DIFlagFwdDecl)
!894 = !{!895}
!895 = !DISubrange(count: 2)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !639, file: !200, line: 232, baseType: !638, size: 64, offset: 384)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !639, file: !200, line: 233, baseType: !638, size: 64, offset: 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !639, file: !200, line: 238, baseType: !899, size: 64, offset: 512)
!899 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !200, line: 235, size: 64, elements: !900)
!900 = !{!901, !907}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !899, file: !200, line: 236, baseType: !902, size: 64)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !903, size: 64)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !200, line: 273, size: 128, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !903, file: !200, line: 275, baseType: !664, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !903, file: !200, line: 278, baseType: !664, size: 64, offset: 64)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !899, file: !200, line: 237, baseType: !908, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !200, line: 259, size: 320, elements: !910)
!910 = !{!911, !912, !913, !914, !915}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !909, file: !200, line: 261, baseType: !538, size: 64)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !909, file: !200, line: 262, baseType: !538, size: 64, offset: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !909, file: !200, line: 266, baseType: !538, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !909, file: !200, line: 267, baseType: !538, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !909, file: !200, line: 270, baseType: !328, size: 32, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !639, file: !200, line: 241, baseType: !884, size: 64, offset: 576)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !639, file: !200, line: 244, baseType: !328, size: 32, offset: 640)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !639, file: !200, line: 247, baseType: !328, size: 32, offset: 672)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !639, file: !200, line: 250, baseType: !328, size: 32, offset: 704)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !639, file: !200, line: 253, baseType: !328, size: 32, offset: 736)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !639, file: !200, line: 256, baseType: !328, size: 32, offset: 768)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !634, file: !200, line: 378, baseType: !637, size: 64, offset: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !634, file: !200, line: 381, baseType: !924, size: 64, offset: 128)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !200, line: 282, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !200, line: 282, size: 128, elements: !927)
!927 = !{!928}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !926, file: !200, line: 282, baseType: !929, size: 128)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !200, line: 281, baseType: !930)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !200, line: 281, size: 128, elements: !931)
!931 = !{!932, !933, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !930, file: !200, line: 281, baseType: !5, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !930, file: !200, line: 281, baseType: !5, size: 32, offset: 32)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !930, file: !200, line: 281, baseType: !935, size: 64, offset: 64)
!935 = !DICompositeType(tag: DW_TAG_array_type, baseType: !637, size: 64, elements: !359)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !634, file: !200, line: 384, baseType: !328, size: 32, offset: 192)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !634, file: !200, line: 387, baseType: !328, size: 32, offset: 224)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !634, file: !200, line: 390, baseType: !328, size: 32, offset: 256)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !634, file: !200, line: 394, baseType: !924, size: 64, offset: 320)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !634, file: !200, line: 396, baseType: !199, size: 32, offset: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !634, file: !200, line: 399, baseType: !942, size: 64, offset: 416)
!942 = !DICompositeType(tag: DW_TAG_array_type, baseType: !205, size: 64, elements: !894)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !634, file: !200, line: 402, baseType: !944, size: 64, offset: 480)
!944 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !894)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !634, file: !200, line: 406, baseType: !328, size: 32, offset: 544)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !634, file: !200, line: 409, baseType: !328, size: 32, offset: 576)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !626, file: !627, line: 470, baseType: !665, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !626, file: !627, line: 473, baseType: !949, size: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !577, line: 39, size: 1152, elements: !951)
!951 = !{!952, !1002, !1015, !1021, !1022, !1091, !1092, !1096, !1097, !1098, !1099, !1100}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !950, file: !577, line: 41, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !954, line: 144, baseType: !955)
!954 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !954, line: 100, size: 896, elements: !957)
!957 = !{!958, !966, !971, !976, !978, !979, !980, !981, !982, !983, !988, !990, !991, !996, !1001}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !956, file: !954, line: 102, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !954, line: 52, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DISubroutineType(types: !962)
!962 = !{!963, !964}
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !954, line: 47, baseType: !5)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !956, file: !954, line: 105, baseType: !967, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !954, line: 59, baseType: !968)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !969, size: 64)
!969 = !DISubroutineType(types: !970)
!970 = !{!328, !964, !964}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !956, file: !954, line: 108, baseType: !972, size: 64, offset: 128)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !954, line: 63, baseType: !973)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DISubroutineType(types: !975)
!975 = !{null, !332}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !956, file: !954, line: 111, baseType: !977, size: 64, offset: 192)
!977 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !956, file: !954, line: 114, baseType: !818, size: 64, offset: 256)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !956, file: !954, line: 117, baseType: !818, size: 64, offset: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !956, file: !954, line: 120, baseType: !818, size: 64, offset: 384)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !956, file: !954, line: 124, baseType: !5, size: 32, offset: 448)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !956, file: !954, line: 128, baseType: !5, size: 32, offset: 480)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !956, file: !954, line: 131, baseType: !984, size: 64, offset: 512)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !954, line: 75, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = !DISubroutineType(types: !987)
!987 = !{!332, !818, !818}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !956, file: !954, line: 132, baseType: !989, size: 64, offset: 576)
!989 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !954, line: 78, baseType: !973)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !956, file: !954, line: 135, baseType: !332, size: 64, offset: 640)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !956, file: !954, line: 136, baseType: !992, size: 64, offset: 704)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !954, line: 82, baseType: !993)
!993 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !994, size: 64)
!994 = !DISubroutineType(types: !995)
!995 = !{!332, !332, !818, !818}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !956, file: !954, line: 137, baseType: !997, size: 64, offset: 768)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !954, line: 83, baseType: !998)
!998 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !999, size: 64)
!999 = !DISubroutineType(types: !1000)
!1000 = !{null, !332, !332}
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !956, file: !954, line: 141, baseType: !5, size: 32, offset: 832)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !950, file: !577, line: 48, baseType: !1003, size: 64, offset: 64)
!1003 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1004, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !255, line: 35, baseType: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !255, line: 35, size: 128, elements: !1006)
!1006 = !{!1007}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1005, file: !255, line: 35, baseType: !1008, size: 128)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !255, line: 33, baseType: !1009)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !255, line: 33, size: 128, elements: !1010)
!1010 = !{!1011, !1012, !1013}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1009, file: !255, line: 33, baseType: !5, size: 32)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1009, file: !255, line: 33, baseType: !5, size: 32, offset: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1009, file: !255, line: 33, baseType: !1014, size: 64, offset: 64)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !674, size: 64, elements: !359)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !950, file: !577, line: 51, baseType: !1016, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !4, line: 183, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !4, line: 183, size: 128, elements: !1019)
!1019 = !{!1020}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1018, file: !4, line: 183, baseType: !374, size: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !950, file: !577, line: 54, baseType: !381, size: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !950, file: !577, line: 57, baseType: !1023, size: 128, offset: 256)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1024, line: 31, size: 128, elements: !1025)
!1024 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1023, file: !1024, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1023, file: !1024, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1023, file: !1024, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1023, file: !1024, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1023, file: !1024, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1023, file: !1024, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1023, file: !1024, line: 56, baseType: !1033, size: 64, offset: 64)
!1033 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !382, line: 47, baseType: !1034)
!1034 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1035, size: 64)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1036, line: 75, size: 256, elements: !1037)
!1036 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1037 = !{!1038, !1050, !1051, !1052}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1035, file: !1036, line: 76, baseType: !1039, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1040, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1036, line: 68, baseType: !1041)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1036, line: 63, size: 320, elements: !1042)
!1042 = !{!1043, !1045, !1046, !1047}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1041, file: !1036, line: 64, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1041, file: !1036, line: 65, baseType: !1044, size: 64, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1041, file: !1036, line: 66, baseType: !5, size: 32, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1041, file: !1036, line: 67, baseType: !1048, size: 128, offset: 192)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 128, elements: !894)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1036, line: 29, baseType: !435)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1035, file: !1036, line: 77, baseType: !1039, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1035, file: !1036, line: 78, baseType: !5, size: 32, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1035, file: !1036, line: 79, baseType: !1053, size: 64, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1036, line: 49, baseType: !1055)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1036, line: 45, size: 832, elements: !1056)
!1056 = !{!1057, !1058, !1059}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1055, file: !1036, line: 46, baseType: !1044, size: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1055, file: !1036, line: 47, baseType: !1034, size: 64, offset: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1055, file: !1036, line: 48, baseType: !1060, size: 704, offset: 128)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1061, line: 164, size: 704, elements: !1062)
!1061 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1062 = !{!1063, !1064, !1074, !1075, !1076, !1077, !1078, !1079, !1083, !1087, !1088, !1089, !1090}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1060, file: !1061, line: 166, baseType: !437, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1060, file: !1061, line: 167, baseType: !1065, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1061, line: 157, size: 192, elements: !1067)
!1067 = !{!1068, !1069, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1066, file: !1061, line: 159, baseType: !330, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1066, file: !1061, line: 160, baseType: !1065, size: 64, offset: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1066, file: !1061, line: 161, baseType: !1071, size: 32, offset: 128)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !331, size: 32, elements: !1072)
!1072 = !{!1073}
!1073 = !DISubrange(count: 4)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1060, file: !1061, line: 168, baseType: !330, size: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1060, file: !1061, line: 169, baseType: !330, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1060, file: !1061, line: 170, baseType: !330, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1060, file: !1061, line: 171, baseType: !437, size: 64, offset: 320)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1060, file: !1061, line: 172, baseType: !328, size: 32, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1060, file: !1061, line: 176, baseType: !1080, size: 64, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = !DISubroutineType(types: !1082)
!1082 = !{!1065, !332, !437}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1060, file: !1061, line: 177, baseType: !1084, size: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1085, size: 64)
!1085 = !DISubroutineType(types: !1086)
!1086 = !{null, !332, !1065}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1060, file: !1061, line: 178, baseType: !332, size: 64, offset: 576)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1060, file: !1061, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1060, file: !1061, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1060, file: !1061, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !950, file: !577, line: 60, baseType: !1023, size: 128, offset: 384)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !950, file: !577, line: 64, baseType: !1093, size: 64, offset: 512)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1095, line: 33, flags: DIFlagFwdDecl)
!1095 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !950, file: !577, line: 67, baseType: !381, size: 64, offset: 576)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !950, file: !577, line: 73, baseType: !953, size: 64, offset: 640)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !950, file: !577, line: 77, baseType: !1033, size: 64, offset: 704)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !950, file: !577, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !950, file: !577, line: 82, baseType: !1101, size: 320, offset: 832)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !248, line: 62, size: 320, elements: !1102)
!1102 = !{!1103, !1109, !1110, !1111, !1112, !1113}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1101, file: !248, line: 63, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1105, size: 64)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !248, line: 56, size: 128, elements: !1106)
!1106 = !{!1107, !1108}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1105, file: !248, line: 57, baseType: !1104, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1105, file: !248, line: 58, baseType: !463, size: 8, offset: 64)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1101, file: !248, line: 64, baseType: !5, size: 32, offset: 64)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1101, file: !248, line: 66, baseType: !5, size: 32, offset: 96)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1101, file: !248, line: 68, baseType: !327, size: 8, offset: 128)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1101, file: !248, line: 70, baseType: !703, size: 64, offset: 192)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1101, file: !248, line: 71, baseType: !710, size: 64, offset: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !626, file: !627, line: 476, baseType: !1115, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !627, line: 476, flags: DIFlagFwdDecl)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !626, file: !627, line: 479, baseType: !953, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !626, file: !627, line: 484, baseType: !381, size: 64, offset: 384)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !626, file: !627, line: 488, baseType: !381, size: 64, offset: 448)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !626, file: !627, line: 493, baseType: !381, size: 64, offset: 512)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !626, file: !627, line: 496, baseType: !381, size: 64, offset: 576)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !626, file: !627, line: 501, baseType: !1123, size: 64, offset: 640)
!1123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1124, size: 64)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !211, line: 2355, size: 576, elements: !1125)
!1125 = !{!1126, !1129, !1130, !1131, !1132, !1134, !1135, !1140, !1141, !1142, !1143, !1144, !1145}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1124, file: !211, line: 2356, baseType: !1127, size: 64)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !211, line: 2356, flags: DIFlagFwdDecl)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1124, file: !211, line: 2357, baseType: !333, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1124, file: !211, line: 2358, baseType: !328, size: 32, offset: 128)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1124, file: !211, line: 2359, baseType: !328, size: 32, offset: 160)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1124, file: !211, line: 2360, baseType: !1133, size: 128, offset: 192)
!1133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !328, size: 128, elements: !1072)
