; ModuleID = 'tree-ssa-ccp.bc'
source_filename = "tree-ssa-ccp.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!1362 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ORDERED_DYNAMIC_NEXT", value: 675, isUnsigned: true)
!1363 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ORDERED_GUIDED_NEXT", value: 676, isUnsigned: true)
!1364 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ORDERED_RUNTIME_NEXT", value: 677, isUnsigned: true)
!1365 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_STATIC_START", value: 678, isUnsigned: true)
!1366 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_START", value: 679, isUnsigned: true)
!1367 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_START", value: 680, isUnsigned: true)
!1368 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_START", value: 681, isUnsigned: true)
!1369 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_START", value: 682, isUnsigned: true)
!1370 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_START", value: 683, isUnsigned: true)
!1371 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_START", value: 684, isUnsigned: true)
!1372 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_START", value: 685, isUnsigned: true)
!1373 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_STATIC_NEXT", value: 686, isUnsigned: true)
!1374 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_DYNAMIC_NEXT", value: 687, isUnsigned: true)
!1375 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_GUIDED_NEXT", value: 688, isUnsigned: true)
!1376 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_RUNTIME_NEXT", value: 689, isUnsigned: true)
!1377 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_STATIC_NEXT", value: 690, isUnsigned: true)
!1378 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_DYNAMIC_NEXT", value: 691, isUnsigned: true)
!1379 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_GUIDED_NEXT", value: 692, isUnsigned: true)
!1380 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_ULL_ORDERED_RUNTIME_NEXT", value: 693, isUnsigned: true)
!1381 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_STATIC_START", value: 694, isUnsigned: true)
!1382 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_DYNAMIC_START", value: 695, isUnsigned: true)
!1383 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_GUIDED_START", value: 696, isUnsigned: true)
!1384 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_LOOP_RUNTIME_START", value: 697, isUnsigned: true)
!1385 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END", value: 698, isUnsigned: true)
!1386 = !DIEnumerator(name: "BUILT_IN_GOMP_LOOP_END_NOWAIT", value: 699, isUnsigned: true)
!1387 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_START", value: 700, isUnsigned: true)
!1388 = !DIEnumerator(name: "BUILT_IN_GOMP_ORDERED_END", value: 701, isUnsigned: true)
!1389 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_START", value: 702, isUnsigned: true)
!1390 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_END", value: 703, isUnsigned: true)
!1391 = !DIEnumerator(name: "BUILT_IN_GOMP_TASK", value: 704, isUnsigned: true)
!1392 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_START", value: 705, isUnsigned: true)
!1393 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_NEXT", value: 706, isUnsigned: true)
!1394 = !DIEnumerator(name: "BUILT_IN_GOMP_PARALLEL_SECTIONS_START", value: 707, isUnsigned: true)
!1395 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END", value: 708, isUnsigned: true)
!1396 = !DIEnumerator(name: "BUILT_IN_GOMP_SECTIONS_END_NOWAIT", value: 709, isUnsigned: true)
!1397 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_START", value: 710, isUnsigned: true)
!1398 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_START", value: 711, isUnsigned: true)
!1399 = !DIEnumerator(name: "BUILT_IN_GOMP_SINGLE_COPY_END", value: 712, isUnsigned: true)
!1400 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MIN", value: 713, isUnsigned: true)
!1401 = !DIEnumerator(name: "BUILT_IN_COMPLEX_MUL_MAX", value: 716, isUnsigned: true)
!1402 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MIN", value: 717, isUnsigned: true)
!1403 = !DIEnumerator(name: "BUILT_IN_COMPLEX_DIV_MAX", value: 720, isUnsigned: true)
!1404 = !DIEnumerator(name: "END_BUILTINS", value: 721, isUnsigned: true)
!1405 = !{!1406, !1407, !1408, !1409, !1412, !1413, !134, !1415, !2741, !1542, !1456, !377, !2743, !1740, !2744, !1773, !1410, !5, !2746, !7, !1469, !679, !2288}
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1408 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1411, size: 64)
!1411 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1411)
!1415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1416, size: 64)
!1416 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !1417)
!1417 = !{!1418, !1451, !1459, !1472, !1491, !1502, !1507, !1516, !1522, !1535, !1547, !1585, !2076, !2104, !2121, !2122, !2127, !2136, !2142, !2147, !2151, !2155, !2392, !2439, !2445, !2451, !2458, !2471, !2485, !2502, !2514, !2536, !2551, !2723}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1416, file: !135, line: 3372, baseType: !1419, size: 64)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !1420)
!1420 = !{!1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1419, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1419, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1419, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1419, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1419, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1419, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1419, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1419, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1419, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1419, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1419, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1419, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1419, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1419, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1419, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1419, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1419, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1419, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1419, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1419, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1419, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1419, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1419, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1419, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1419, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1419, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1419, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1419, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1419, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1419, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1416, file: !135, line: 3373, baseType: !1452, size: 192)
!1452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !1453)
!1453 = !{!1454, !1455, !1458}
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1452, file: !135, line: 403, baseType: !1419, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1452, file: !135, line: 404, baseType: !1456, size: 64, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1457, line: 56, baseType: !1415)
!1457 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1452, file: !135, line: 405, baseType: !1456, size: 64, offset: 128)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1416, file: !135, line: 3374, baseType: !1460, size: 320)
!1460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !1461)
!1461 = !{!1462, !1463}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1460, file: !135, line: 1385, baseType: !1452, size: 192)
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1460, file: !135, line: 1386, baseType: !1464, size: 128, offset: 192)
!1464 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1465, line: 58, baseType: !1466)
!1465 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1466 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1465, line: 54, size: 128, elements: !1467)
!1467 = !{!1468, !1470}
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1466, file: !1465, line: 56, baseType: !1469, size: 64)
!1469 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1466, file: !1465, line: 57, baseType: !1471, size: 64, offset: 64)
!1471 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1416, file: !135, line: 3375, baseType: !1473, size: 256)
!1473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !1474)
!1474 = !{!1475, !1476}
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1473, file: !135, line: 1398, baseType: !1452, size: 192)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1473, file: !135, line: 1399, baseType: !1477, size: 64, offset: 192)
!1477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1478, size: 64)
!1478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1479, line: 52, size: 256, elements: !1480)
!1479 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1480 = !{!1481, !1482, !1483, !1484, !1485, !1486, !1487}
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1478, file: !1479, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1478, file: !1479, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1478, file: !1479, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1478, file: !1479, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1478, file: !1479, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1478, file: !1479, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1478, file: !1479, line: 62, baseType: !1488, size: 192, offset: 64)
!1488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1469, size: 192, elements: !1489)
!1489 = !{!1490}
!1490 = !DISubrange(count: 3)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1416, file: !135, line: 3376, baseType: !1492, size: 256)
!1492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !1493)
!1493 = !{!1494, !1495}
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1492, file: !135, line: 1409, baseType: !1452, size: 192)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1492, file: !135, line: 1410, baseType: !1496, size: 64, offset: 192)
!1496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1497, size: 64)
!1497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1498, line: 27, size: 192, elements: !1499)
!1498 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1499 = !{!1500, !1501}
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1497, file: !1498, line: 29, baseType: !1464, size: 128)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1497, file: !1498, line: 30, baseType: !5, size: 32, offset: 128)
!1502 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1416, file: !135, line: 3377, baseType: !1503, size: 256)
!1503 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !1504)
!1504 = !{!1505, !1506}
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1503, file: !135, line: 1438, baseType: !1452, size: 192)
!1506 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1503, file: !135, line: 1439, baseType: !1456, size: 64, offset: 192)
!1507 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1416, file: !135, line: 3378, baseType: !1508, size: 256)
!1508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !1509)
!1509 = !{!1510, !1511, !1512}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1508, file: !135, line: 1419, baseType: !1452, size: 192)
!1511 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1508, file: !135, line: 1420, baseType: !1408, size: 32, offset: 192)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1508, file: !135, line: 1421, baseType: !1513, size: 8, offset: 224)
!1513 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1411, size: 8, elements: !1514)
!1514 = !{!1515}
!1515 = !DISubrange(count: 1)
!1516 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1416, file: !135, line: 3379, baseType: !1517, size: 320)
!1517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !1518)
!1518 = !{!1519, !1520, !1521}
!1519 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1517, file: !135, line: 1429, baseType: !1452, size: 192)
!1520 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1517, file: !135, line: 1430, baseType: !1456, size: 64, offset: 192)
!1521 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1517, file: !135, line: 1431, baseType: !1456, size: 64, offset: 256)
!1522 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1416, file: !135, line: 3380, baseType: !1523, size: 320)
!1523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !1524)
!1524 = !{!1525, !1526}
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1523, file: !135, line: 1461, baseType: !1452, size: 192)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1523, file: !135, line: 1462, baseType: !1527, size: 128, offset: 192)
!1527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1528, line: 31, size: 128, elements: !1529)
!1528 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1529 = !{!1530, !1533, !1534}
!1530 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1527, file: !1528, line: 32, baseType: !1531, size: 64)
!1531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1532, size: 64)
!1532 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1407)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1527, file: !1528, line: 33, baseType: !7, size: 32, offset: 64)
!1534 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1527, file: !1528, line: 34, baseType: !7, size: 32, offset: 96)
!1535 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1416, file: !135, line: 3381, baseType: !1536, size: 384)
!1536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !1537)
!1537 = !{!1538, !1539, !1544, !1545, !1546}
!1538 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1536, file: !135, line: 2508, baseType: !1452, size: 192)
!1539 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1536, file: !135, line: 2509, baseType: !1540, size: 32, offset: 192)
!1540 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1541, line: 58, baseType: !1542)
!1541 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1542 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1543, line: 44, baseType: !7)
!1543 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1536, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!1545 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1536, file: !135, line: 2511, baseType: !1456, size: 64, offset: 256)
!1546 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1536, file: !135, line: 2512, baseType: !1456, size: 64, offset: 320)
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1416, file: !135, line: 3382, baseType: !1548, size: 896)
!1548 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !1549)
!1549 = !{!1550, !1551, !1552, !1553, !1554, !1555, !1556, !1557, !1558, !1559, !1560, !1561, !1562, !1563, !1564, !1565, !1566, !1567, !1568, !1569, !1570, !1571, !1572, !1573, !1574, !1575, !1576, !1577, !1578, !1579, !1580, !1581, !1582}
!1550 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1548, file: !135, line: 2653, baseType: !1536, size: 384)
!1551 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1548, file: !135, line: 2654, baseType: !1456, size: 64, offset: 384)
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1548, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1548, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1548, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1555 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1548, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1556 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1548, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1557 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1548, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1548, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1559 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1548, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1560 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1548, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1548, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1548, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1548, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1548, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1565 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1548, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1566 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1548, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1548, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1548, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1569 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1548, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1570 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1548, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1571 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1548, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1548, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1573 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1548, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1574 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1548, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1548, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1548, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1548, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!1578 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1548, file: !135, line: 2705, baseType: !1456, size: 64, offset: 576)
!1579 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1548, file: !135, line: 2706, baseType: !1456, size: 64, offset: 640)
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1548, file: !135, line: 2707, baseType: !1456, size: 64, offset: 704)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1548, file: !135, line: 2708, baseType: !1456, size: 64, offset: 768)
!1582 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1548, file: !135, line: 2711, baseType: !1583, size: 64, offset: 832)
!1583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1584, size: 64)
!1584 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!1585 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1416, file: !135, line: 3383, baseType: !1586, size: 960)
!1586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !1587)
!1587 = !{!1588, !1589}
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1586, file: !135, line: 2757, baseType: !1548, size: 896)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1586, file: !135, line: 2758, baseType: !1590, size: 64, offset: 896)
!1590 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1457, line: 50, baseType: !1591)
!1591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1592, size: 64)
!1592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1593, line: 240, size: 384, elements: !1594)
!1593 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1594 = !{!1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605}
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1592, file: !1593, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1592, file: !1593, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !1592, file: !1593, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !1592, file: !1593, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !1592, file: !1593, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !1592, file: !1593, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !1592, file: !1593, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1592, file: !1593, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !1592, file: !1593, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !1592, file: !1593, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1592, file: !1593, line: 321, baseType: !1606, size: 320, offset: 64)
!1606 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1593, line: 315, size: 320, elements: !1607)
!1607 = !{!1608, !2009, !2011, !2074, !2075}
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1606, file: !1593, line: 316, baseType: !1609, size: 64)
!1609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1610, size: 64, elements: !1514)
!1610 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1593, line: 183, baseType: !1611)
!1611 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1593, line: 166, size: 64, elements: !1612)
!1612 = !{!1613, !1614, !1615, !1616, !1617, !1625, !1626, !1638, !1641, !1701, !1702, !1986, !1999, !2006}
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1611, file: !1593, line: 168, baseType: !1408, size: 32)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1611, file: !1593, line: 169, baseType: !7, size: 32)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1611, file: !1593, line: 170, baseType: !1413, size: 64)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1611, file: !1593, line: 171, baseType: !1590, size: 64)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1611, file: !1593, line: 172, baseType: !1618, size: 64)
!1618 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !1457, line: 53, baseType: !1619)
!1619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1620, size: 64)
!1620 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1593, line: 359, size: 128, elements: !1621)
!1621 = !{!1622, !1623}
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1620, file: !1593, line: 360, baseType: !1408, size: 32)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1620, file: !1593, line: 361, baseType: !1624, size: 64, offset: 64)
!1624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1590, size: 64, elements: !1514)
!1625 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1611, file: !1593, line: 173, baseType: !5, size: 32)
!1626 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1611, file: !1593, line: 174, baseType: !1627, size: 32)
!1627 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1593, line: 133, baseType: !1628)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1593, line: 115, size: 32, elements: !1629)
!1629 = !{!1630, !1631, !1632, !1633, !1634, !1635, !1636, !1637}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1628, file: !1593, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1628, file: !1593, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1632 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1628, file: !1593, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1633 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1628, file: !1593, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1634 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1628, file: !1593, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1628, file: !1593, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1636 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1628, file: !1593, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1637 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1628, file: !1593, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1611, file: !1593, line: 175, baseType: !1639, size: 64)
!1639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1640, size: 64)
!1640 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1593, line: 175, flags: DIFlagFwdDecl)
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1611, file: !1593, line: 176, baseType: !1642, size: 64)
!1642 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1643, size: 64)
!1643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1644, line: 75, size: 256, elements: !1645)
!1644 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1645 = !{!1646, !1660, !1661, !1662}
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1643, file: !1644, line: 76, baseType: !1647, size: 64)
!1647 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1648, size: 64)
!1648 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1644, line: 68, baseType: !1649)
!1649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1644, line: 63, size: 320, elements: !1650)
!1650 = !{!1651, !1653, !1654, !1655}
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1649, file: !1644, line: 64, baseType: !1652, size: 64)
!1652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1649, size: 64)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1649, file: !1644, line: 65, baseType: !1652, size: 64, offset: 64)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1649, file: !1644, line: 66, baseType: !7, size: 32, offset: 128)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1649, file: !1644, line: 67, baseType: !1656, size: 128, offset: 192)
!1656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1657, size: 128, elements: !1658)
!1657 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1644, line: 29, baseType: !1469)
!1658 = !{!1659}
!1659 = !DISubrange(count: 2)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1643, file: !1644, line: 77, baseType: !1647, size: 64, offset: 64)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1643, file: !1644, line: 78, baseType: !7, size: 32, offset: 128)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1643, file: !1644, line: 79, baseType: !1663, size: 64, offset: 192)
!1663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1664, size: 64)
!1664 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1644, line: 49, baseType: !1665)
!1665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1644, line: 45, size: 832, elements: !1666)
!1666 = !{!1667, !1668, !1669}
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1665, file: !1644, line: 46, baseType: !1652, size: 64)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1665, file: !1644, line: 47, baseType: !1642, size: 64, offset: 64)
!1669 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1665, file: !1644, line: 48, baseType: !1670, size: 704, offset: 128)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1671, line: 164, size: 704, elements: !1672)
!1671 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1672 = !{!1673, !1674, !1684, !1685, !1686, !1687, !1688, !1689, !1693, !1697, !1698, !1699, !1700}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1670, file: !1671, line: 166, baseType: !1471, size: 64)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1670, file: !1671, line: 167, baseType: !1675, size: 64, offset: 64)
!1675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1676, size: 64)
!1676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1671, line: 157, size: 192, elements: !1677)
!1677 = !{!1678, !1679, !1680}
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1676, file: !1671, line: 159, baseType: !1410, size: 64)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1676, file: !1671, line: 160, baseType: !1675, size: 64, offset: 64)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1676, file: !1671, line: 161, baseType: !1681, size: 32, offset: 128)
!1681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1411, size: 32, elements: !1682)
!1682 = !{!1683}
!1683 = !DISubrange(count: 4)
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1670, file: !1671, line: 168, baseType: !1410, size: 64, offset: 128)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1670, file: !1671, line: 169, baseType: !1410, size: 64, offset: 192)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1670, file: !1671, line: 170, baseType: !1410, size: 64, offset: 256)
!1687 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1670, file: !1671, line: 171, baseType: !1471, size: 64, offset: 320)
!1688 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1670, file: !1671, line: 172, baseType: !1408, size: 32, offset: 384)
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1670, file: !1671, line: 176, baseType: !1690, size: 64, offset: 448)
!1690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1691, size: 64)
!1691 = !DISubroutineType(types: !1692)
!1692 = !{!1675, !1412, !1471}
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1670, file: !1671, line: 177, baseType: !1694, size: 64, offset: 512)
!1694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1695, size: 64)
!1695 = !DISubroutineType(types: !1696)
!1696 = !{null, !1412, !1675}
!1697 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1670, file: !1671, line: 178, baseType: !1412, size: 64, offset: 576)
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1670, file: !1671, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1670, file: !1671, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1670, file: !1671, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1611, file: !1593, line: 177, baseType: !1456, size: 64)
!1702 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1611, file: !1593, line: 178, baseType: !1703, size: 64)
!1703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1704, size: 64)
!1704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !1705)
!1705 = !{!1706, !1951, !1952, !1953, !1956, !1960, !1961, !1962, !1980, !1981, !1982, !1983, !1984, !1985}
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1704, file: !330, line: 219, baseType: !1707, size: 64)
!1707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1708, size: 64)
!1708 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !1709)
!1709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !1710)
!1710 = !{!1711}
!1711 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1709, file: !330, line: 151, baseType: !1712, size: 128)
!1712 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !1713)
!1713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !1714)
!1714 = !{!1715, !1716, !1717}
!1715 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1713, file: !330, line: 150, baseType: !7, size: 32)
!1716 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1713, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1713, file: !330, line: 150, baseType: !1718, size: 64, offset: 64)
!1718 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1719, size: 64, elements: !1514)
!1719 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1457, line: 108, baseType: !1720)
!1720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1721, size: 64)
!1721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !1722)
!1722 = !{!1723, !1724, !1725, !1943, !1944, !1945, !1946, !1947, !1948, !1949}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1721, file: !330, line: 124, baseType: !1703, size: 64)
!1724 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1721, file: !330, line: 125, baseType: !1703, size: 64, offset: 64)
!1725 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1721, file: !330, line: 131, baseType: !1726, size: 64, offset: 128)
!1726 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !1727)
!1727 = !{!1728, !1942}
!1728 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1726, file: !330, line: 129, baseType: !1729, size: 64)
!1729 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1457, line: 66, baseType: !1730)
!1730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1731, size: 64)
!1731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !583, line: 143, size: 192, elements: !1732)
!1732 = !{!1733, !1940, !1941}
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1731, file: !583, line: 145, baseType: !1734, size: 64)
!1734 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1457, line: 69, baseType: !1735)
!1735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1736, size: 64)
!1736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !583, line: 136, size: 192, elements: !1737)
!1737 = !{!1738, !1938, !1939}
!1738 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1736, file: !583, line: 137, baseType: !1739, size: 64)
!1739 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1457, line: 58, baseType: !1740)
!1740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1741, size: 64)
!1741 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !583, line: 737, size: 768, elements: !1742)
!1742 = !{!1743, !1760, !1793, !1799, !1804, !1809, !1816, !1822, !1828, !1833, !1847, !1852, !1858, !1863, !1873, !1878, !1896, !1903, !1910, !1916, !1921, !1927, !1933}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1741, file: !583, line: 738, baseType: !1744, size: 256)
!1744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !583, line: 271, size: 256, elements: !1745)
!1745 = !{!1746, !1747, !1748, !1749, !1750, !1751, !1752, !1753, !1754, !1755, !1756, !1757, !1758, !1759}
!1746 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1744, file: !583, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1744, file: !583, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1744, file: !583, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1744, file: !583, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1744, file: !583, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1744, file: !583, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1744, file: !583, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1744, file: !583, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1754 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1744, file: !583, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1755 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1744, file: !583, line: 312, baseType: !7, size: 32, offset: 32)
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1744, file: !583, line: 316, baseType: !1540, size: 32, offset: 64)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1744, file: !583, line: 319, baseType: !7, size: 32, offset: 96)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1744, file: !583, line: 323, baseType: !1703, size: 64, offset: 128)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1744, file: !583, line: 327, baseType: !1456, size: 64, offset: 192)
!1760 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1741, file: !583, line: 739, baseType: !1761, size: 448)
!1761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !583, line: 350, size: 448, elements: !1762)
!1762 = !{!1763, !1791}
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1761, file: !583, line: 353, baseType: !1764, size: 384)
!1764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !583, line: 333, size: 384, elements: !1765)
!1765 = !{!1766, !1767, !1774}
!1766 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1764, file: !583, line: 336, baseType: !1744, size: 256)
!1767 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1764, file: !583, line: 343, baseType: !1768, size: 64, offset: 256)
!1768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1769, size: 64)
!1769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !648, line: 37, size: 128, elements: !1770)
!1770 = !{!1771, !1772}
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1769, file: !648, line: 39, baseType: !1768, size: 64)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1769, file: !648, line: 40, baseType: !1773, size: 64, offset: 64)
!1773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1764, file: !583, line: 344, baseType: !1775, size: 64, offset: 320)
!1775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1776, size: 64)
!1776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !648, line: 45, size: 320, elements: !1777)
!1777 = !{!1778, !1779}
!1778 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1776, file: !648, line: 47, baseType: !1775, size: 64)
!1779 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1776, file: !648, line: 48, baseType: !1780, size: 256, offset: 64)
!1780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1781)
!1781 = !{!1782, !1784, !1785, !1790}
!1782 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1780, file: !135, line: 1884, baseType: !1783, size: 64)
!1783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1780, size: 64)
!1784 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1780, file: !135, line: 1885, baseType: !1783, size: 64, offset: 64)
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1780, file: !135, line: 1891, baseType: !1786, size: 64, offset: 128)
!1786 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1780, file: !135, line: 1891, size: 64, elements: !1787)
!1787 = !{!1788, !1789}
!1788 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1786, file: !135, line: 1891, baseType: !1739, size: 64)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1786, file: !135, line: 1891, baseType: !1456, size: 64)
!1790 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1780, file: !135, line: 1892, baseType: !1773, size: 64, offset: 192)
!1791 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1761, file: !583, line: 359, baseType: !1792, size: 64, offset: 384)
!1792 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1456, size: 64, elements: !1514)
!1793 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1741, file: !583, line: 740, baseType: !1794, size: 512)
!1794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !583, line: 365, size: 512, elements: !1795)
!1795 = !{!1796, !1797, !1798}
!1796 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1794, file: !583, line: 368, baseType: !1764, size: 384)
!1797 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1794, file: !583, line: 373, baseType: !1456, size: 64, offset: 384)
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1794, file: !583, line: 374, baseType: !1456, size: 64, offset: 448)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1741, file: !583, line: 741, baseType: !1800, size: 576)
!1800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !583, line: 380, size: 576, elements: !1801)
!1801 = !{!1802, !1803}
!1802 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1800, file: !583, line: 383, baseType: !1794, size: 512)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1800, file: !583, line: 389, baseType: !1792, size: 64, offset: 512)
!1804 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1741, file: !583, line: 742, baseType: !1805, size: 320)
!1805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !583, line: 395, size: 320, elements: !1806)
!1806 = !{!1807, !1808}
!1807 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1805, file: !583, line: 397, baseType: !1744, size: 256)
!1808 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1805, file: !583, line: 400, baseType: !1729, size: 64, offset: 256)
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1741, file: !583, line: 743, baseType: !1810, size: 448)
!1810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !583, line: 406, size: 448, elements: !1811)
!1811 = !{!1812, !1813, !1814, !1815}
!1812 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1810, file: !583, line: 408, baseType: !1744, size: 256)
!1813 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1810, file: !583, line: 412, baseType: !1456, size: 64, offset: 256)
!1814 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1810, file: !583, line: 420, baseType: !1456, size: 64, offset: 320)
!1815 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1810, file: !583, line: 423, baseType: !1729, size: 64, offset: 384)
!1816 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1741, file: !583, line: 744, baseType: !1817, size: 384)
!1817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !583, line: 429, size: 384, elements: !1818)
!1818 = !{!1819, !1820, !1821}
!1819 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1817, file: !583, line: 431, baseType: !1744, size: 256)
!1820 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1817, file: !583, line: 434, baseType: !1456, size: 64, offset: 256)
!1821 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1817, file: !583, line: 437, baseType: !1729, size: 64, offset: 320)
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1741, file: !583, line: 745, baseType: !1823, size: 384)
!1823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !583, line: 443, size: 384, elements: !1824)
!1824 = !{!1825, !1826, !1827}
!1825 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1823, file: !583, line: 445, baseType: !1744, size: 256)
!1826 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1823, file: !583, line: 449, baseType: !1456, size: 64, offset: 256)
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1823, file: !583, line: 453, baseType: !1729, size: 64, offset: 320)
!1828 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1741, file: !583, line: 746, baseType: !1829, size: 320)
!1829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !583, line: 459, size: 320, elements: !1830)
!1830 = !{!1831, !1832}
!1831 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1829, file: !583, line: 461, baseType: !1744, size: 256)
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1829, file: !583, line: 464, baseType: !1456, size: 64, offset: 256)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1741, file: !583, line: 747, baseType: !1834, size: 768)
!1834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !583, line: 469, size: 768, elements: !1835)
!1835 = !{!1836, !1837, !1838, !1839, !1840}
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1834, file: !583, line: 471, baseType: !1744, size: 256)
!1837 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1834, file: !583, line: 474, baseType: !7, size: 32, offset: 256)
!1838 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1834, file: !583, line: 475, baseType: !7, size: 32, offset: 288)
!1839 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1834, file: !583, line: 478, baseType: !1456, size: 64, offset: 320)
!1840 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1834, file: !583, line: 481, baseType: !1841, size: 384, offset: 384)
!1841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1842, size: 384, elements: !1514)
!1842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1843)
!1843 = !{!1844, !1845, !1846}
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1842, file: !135, line: 1920, baseType: !1780, size: 256)
!1845 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1842, file: !135, line: 1921, baseType: !1456, size: 64, offset: 256)
!1846 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1842, file: !135, line: 1922, baseType: !1540, size: 32, offset: 320)
!1847 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1741, file: !583, line: 748, baseType: !1848, size: 320)
!1848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !583, line: 487, size: 320, elements: !1849)
!1849 = !{!1850, !1851}
!1850 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1848, file: !583, line: 490, baseType: !1744, size: 256)
!1851 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1848, file: !583, line: 494, baseType: !1408, size: 32, offset: 256)
!1852 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1741, file: !583, line: 749, baseType: !1853, size: 384)
!1853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !583, line: 500, size: 384, elements: !1854)
!1854 = !{!1855, !1856, !1857}
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1853, file: !583, line: 502, baseType: !1744, size: 256)
!1856 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1853, file: !583, line: 506, baseType: !1729, size: 64, offset: 256)
!1857 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1853, file: !583, line: 510, baseType: !1729, size: 64, offset: 320)
!1858 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1741, file: !583, line: 750, baseType: !1859, size: 320)
!1859 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !583, line: 529, size: 320, elements: !1860)
!1860 = !{!1861, !1862}
!1861 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1859, file: !583, line: 531, baseType: !1744, size: 256)
!1862 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1859, file: !583, line: 540, baseType: !1729, size: 64, offset: 256)
!1863 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1741, file: !583, line: 751, baseType: !1864, size: 704)
!1864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !583, line: 546, size: 704, elements: !1865)
!1865 = !{!1866, !1867, !1868, !1869, !1870, !1871, !1872}
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1864, file: !583, line: 549, baseType: !1794, size: 512)
!1867 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1864, file: !583, line: 553, baseType: !1413, size: 64, offset: 512)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1864, file: !583, line: 557, baseType: !1407, size: 8, offset: 576)
!1869 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1864, file: !583, line: 558, baseType: !1407, size: 8, offset: 584)
!1870 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1864, file: !583, line: 559, baseType: !1407, size: 8, offset: 592)
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1864, file: !583, line: 560, baseType: !1407, size: 8, offset: 600)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1864, file: !583, line: 566, baseType: !1792, size: 64, offset: 640)
!1873 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1741, file: !583, line: 752, baseType: !1874, size: 384)
!1874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !583, line: 571, size: 384, elements: !1875)
!1875 = !{!1876, !1877}
!1876 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1874, file: !583, line: 573, baseType: !1805, size: 320)
!1877 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1874, file: !583, line: 577, baseType: !1456, size: 64, offset: 320)
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1741, file: !583, line: 753, baseType: !1879, size: 576)
!1879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !583, line: 600, size: 576, elements: !1880)
!1880 = !{!1881, !1882, !1883, !1886, !1895}
!1881 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1879, file: !583, line: 602, baseType: !1805, size: 320)
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1879, file: !583, line: 605, baseType: !1456, size: 64, offset: 320)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1879, file: !583, line: 609, baseType: !1884, size: 64, offset: 384)
!1884 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1885, line: 46, baseType: !1469)
!1885 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1886 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1879, file: !583, line: 612, baseType: !1887, size: 64, offset: 448)
!1887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1888, size: 64)
!1888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !583, line: 581, size: 320, elements: !1889)
!1889 = !{!1890, !1891, !1892, !1893, !1894}
!1890 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1888, file: !583, line: 583, baseType: !134, size: 32)
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1888, file: !583, line: 586, baseType: !1456, size: 64, offset: 64)
!1892 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1888, file: !583, line: 589, baseType: !1456, size: 64, offset: 128)
!1893 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1888, file: !583, line: 592, baseType: !1456, size: 64, offset: 192)
!1894 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1888, file: !583, line: 595, baseType: !1456, size: 64, offset: 256)
!1895 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1879, file: !583, line: 616, baseType: !1729, size: 64, offset: 512)
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1741, file: !583, line: 754, baseType: !1897, size: 512)
!1897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !583, line: 622, size: 512, elements: !1898)
!1898 = !{!1899, !1900, !1901, !1902}
!1899 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1897, file: !583, line: 624, baseType: !1805, size: 320)
!1900 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1897, file: !583, line: 628, baseType: !1456, size: 64, offset: 320)
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1897, file: !583, line: 632, baseType: !1456, size: 64, offset: 384)
!1902 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1897, file: !583, line: 636, baseType: !1456, size: 64, offset: 448)
!1903 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1741, file: !583, line: 755, baseType: !1904, size: 704)
!1904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !583, line: 642, size: 704, elements: !1905)
!1905 = !{!1906, !1907, !1908, !1909}
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1904, file: !583, line: 644, baseType: !1897, size: 512)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1904, file: !583, line: 648, baseType: !1456, size: 64, offset: 512)
!1908 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1904, file: !583, line: 652, baseType: !1456, size: 64, offset: 576)
!1909 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1904, file: !583, line: 653, baseType: !1456, size: 64, offset: 640)
!1910 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1741, file: !583, line: 756, baseType: !1911, size: 448)
!1911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !583, line: 663, size: 448, elements: !1912)
!1912 = !{!1913, !1914, !1915}
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1911, file: !583, line: 665, baseType: !1805, size: 320)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1911, file: !583, line: 668, baseType: !1456, size: 64, offset: 320)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1911, file: !583, line: 673, baseType: !1456, size: 64, offset: 384)
!1916 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1741, file: !583, line: 757, baseType: !1917, size: 384)
!1917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !583, line: 694, size: 384, elements: !1918)
!1918 = !{!1919, !1920}
!1919 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1917, file: !583, line: 696, baseType: !1805, size: 320)
!1920 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1917, file: !583, line: 699, baseType: !1456, size: 64, offset: 320)
!1921 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1741, file: !583, line: 758, baseType: !1922, size: 384)
!1922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !583, line: 681, size: 384, elements: !1923)
!1923 = !{!1924, !1925, !1926}
!1924 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1922, file: !583, line: 683, baseType: !1744, size: 256)
!1925 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1922, file: !583, line: 686, baseType: !1456, size: 64, offset: 256)
!1926 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1922, file: !583, line: 689, baseType: !1456, size: 64, offset: 320)
!1927 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1741, file: !583, line: 759, baseType: !1928, size: 384)
!1928 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !583, line: 707, size: 384, elements: !1929)
!1929 = !{!1930, !1931, !1932}
!1930 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1928, file: !583, line: 709, baseType: !1744, size: 256)
!1931 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1928, file: !583, line: 712, baseType: !1456, size: 64, offset: 256)
!1932 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1928, file: !583, line: 712, baseType: !1456, size: 64, offset: 320)
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1741, file: !583, line: 760, baseType: !1934, size: 320)
!1934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !583, line: 718, size: 320, elements: !1935)
!1935 = !{!1936, !1937}
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1934, file: !583, line: 720, baseType: !1744, size: 256)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1934, file: !583, line: 723, baseType: !1456, size: 64, offset: 256)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1736, file: !583, line: 138, baseType: !1735, size: 64, offset: 64)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1736, file: !583, line: 139, baseType: !1735, size: 64, offset: 128)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1731, file: !583, line: 146, baseType: !1734, size: 64, offset: 64)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1731, file: !583, line: 152, baseType: !1729, size: 64, offset: 128)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1726, file: !330, line: 130, baseType: !1590, size: 64)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1721, file: !330, line: 134, baseType: !1412, size: 64, offset: 192)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1721, file: !330, line: 137, baseType: !1456, size: 64, offset: 256)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1721, file: !330, line: 138, baseType: !1540, size: 32, offset: 320)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1721, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1721, file: !330, line: 144, baseType: !1408, size: 32, offset: 384)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1721, file: !330, line: 145, baseType: !1408, size: 32, offset: 416)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1721, file: !330, line: 146, baseType: !1950, size: 64, offset: 448)
!1950 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !1471)
!1951 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1704, file: !330, line: 220, baseType: !1707, size: 64, offset: 64)
!1952 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1704, file: !330, line: 223, baseType: !1412, size: 64, offset: 128)
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1704, file: !330, line: 226, baseType: !1954, size: 64, offset: 192)
!1954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1955, size: 64)
!1955 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1704, file: !330, line: 229, baseType: !1957, size: 128, offset: 256)
!1957 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1958, size: 128, elements: !1658)
!1958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1959, size: 64)
!1959 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1960 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1704, file: !330, line: 232, baseType: !1703, size: 64, offset: 384)
!1961 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1704, file: !330, line: 233, baseType: !1703, size: 64, offset: 448)
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1704, file: !330, line: 238, baseType: !1963, size: 64, offset: 512)
!1963 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1964)
!1964 = !{!1965, !1971}
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1963, file: !330, line: 236, baseType: !1966, size: 64)
!1966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1967, size: 64)
!1967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1968)
!1968 = !{!1969, !1970}
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1967, file: !330, line: 275, baseType: !1729, size: 64)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1967, file: !330, line: 278, baseType: !1729, size: 64, offset: 64)
!1971 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1963, file: !330, line: 237, baseType: !1972, size: 64)
!1972 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1973, size: 64)
!1973 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1974)
!1974 = !{!1975, !1976, !1977, !1978, !1979}
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1973, file: !330, line: 261, baseType: !1590, size: 64)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1973, file: !330, line: 262, baseType: !1590, size: 64, offset: 64)
!1977 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1973, file: !330, line: 266, baseType: !1590, size: 64, offset: 128)
!1978 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1973, file: !330, line: 267, baseType: !1590, size: 64, offset: 192)
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1973, file: !330, line: 270, baseType: !1408, size: 32, offset: 256)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1704, file: !330, line: 241, baseType: !1950, size: 64, offset: 576)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1704, file: !330, line: 244, baseType: !1408, size: 32, offset: 640)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1704, file: !330, line: 247, baseType: !1408, size: 32, offset: 672)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1704, file: !330, line: 250, baseType: !1408, size: 32, offset: 704)
!1984 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1704, file: !330, line: 253, baseType: !1408, size: 32, offset: 736)
!1985 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1704, file: !330, line: 256, baseType: !1408, size: 32, offset: 768)
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1611, file: !1593, line: 179, baseType: !1987, size: 64)
!1987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1988, size: 64)
!1988 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !1593, line: 150, baseType: !1989)
!1989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !1593, line: 142, size: 320, elements: !1990)
!1990 = !{!1991, !1992, !1993, !1994, !1997, !1998}
!1991 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1989, file: !1593, line: 144, baseType: !1456, size: 64)
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1989, file: !1593, line: 145, baseType: !1590, size: 64, offset: 64)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1989, file: !1593, line: 146, baseType: !1590, size: 64, offset: 128)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1989, file: !1593, line: 147, baseType: !1995, size: 32, offset: 192)
!1995 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1996, line: 31, baseType: !1408)
!1996 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1989, file: !1593, line: 148, baseType: !7, size: 32, offset: 224)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1989, file: !1593, line: 149, baseType: !1407, size: 8, offset: 256)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1611, file: !1593, line: 180, baseType: !2000, size: 64)
!2000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2001, size: 64)
!2001 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !1593, line: 162, baseType: !2002)
!2002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !1593, line: 159, size: 128, elements: !2003)
!2003 = !{!2004, !2005}
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2002, file: !1593, line: 160, baseType: !1456, size: 64)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2002, file: !1593, line: 161, baseType: !1471, size: 64, offset: 64)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1611, file: !1593, line: 181, baseType: !2007, size: 64)
!2007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2008, size: 64)
!2008 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !1593, line: 181, flags: DIFlagFwdDecl)
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !1606, file: !1593, line: 317, baseType: !2010, size: 64)
!2010 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1471, size: 64, elements: !1514)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !1606, file: !1593, line: 318, baseType: !2012, size: 320)
!2012 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !1593, line: 188, size: 320, elements: !2013)
!2013 = !{!2014, !2016, !2073}
!2014 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2012, file: !1593, line: 190, baseType: !2015, size: 192)
!2015 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1610, size: 192, elements: !1489)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2012, file: !1593, line: 193, baseType: !2017, size: 64, offset: 192)
!2017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2018, size: 64)
!2018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !1593, line: 206, size: 320, elements: !2019)
!2019 = !{!2020, !2058, !2059, !2060, !2072}
!2020 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2018, file: !1593, line: 208, baseType: !2021, size: 64)
!2021 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2022, size: 64)
!2022 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !1457, line: 62, baseType: !2023)
!2023 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2024, line: 538, size: 256, elements: !2025)
!2024 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2025 = !{!2026, !2030, !2036, !2049}
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2023, file: !2024, line: 539, baseType: !2027, size: 32)
!2027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !2024, line: 482, size: 32, elements: !2028)
!2028 = !{!2029}
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2027, file: !2024, line: 484, baseType: !7, size: 32)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !2023, file: !2024, line: 540, baseType: !2031, size: 192)
!2031 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !2024, line: 488, size: 192, elements: !2032)
!2032 = !{!2033, !2034, !2035}
!2033 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2031, file: !2024, line: 489, baseType: !2027, size: 32)
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2031, file: !2024, line: 492, baseType: !1413, size: 64, offset: 64)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2031, file: !2024, line: 496, baseType: !1456, size: 64, offset: 128)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !2023, file: !2024, line: 541, baseType: !2037, size: 256)
!2037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !2024, line: 504, size: 256, elements: !2038)
!2038 = !{!2039, !2040, !2047, !2048}
!2039 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2037, file: !2024, line: 505, baseType: !2027, size: 32)
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2037, file: !2024, line: 509, baseType: !2041, size: 64, offset: 64)
!2041 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !2024, line: 501, baseType: !2042)
!2042 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2043, size: 64)
!2043 = !DISubroutineType(types: !2044)
!2044 = !{null, !2045}
!2045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2046, size: 64)
!2046 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2037, file: !2024, line: 510, baseType: !2045, size: 64, offset: 128)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2037, file: !2024, line: 513, baseType: !2021, size: 64, offset: 192)
!2049 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !2023, file: !2024, line: 542, baseType: !2050, size: 128)
!2050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !2024, line: 530, size: 128, elements: !2051)
!2051 = !{!2052, !2053}
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2050, file: !2024, line: 531, baseType: !2027, size: 32)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !2050, file: !2024, line: 534, baseType: !2054, size: 64, offset: 64)
!2054 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !2024, line: 525, baseType: !2055)
!2055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2056, size: 64)
!2056 = !DISubroutineType(types: !2057)
!2057 = !{!1407, !1456, !1413, !1469, !1469}
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2018, file: !1593, line: 211, baseType: !7, size: 32, offset: 64)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2018, file: !1593, line: 214, baseType: !1471, size: 64, offset: 128)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2018, file: !1593, line: 224, baseType: !2061, size: 64, offset: 192)
!2061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2062, size: 64)
!2062 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !1593, line: 202, baseType: !2063)
!2063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !1593, line: 202, size: 128, elements: !2064)
!2064 = !{!2065}
!2065 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2063, file: !1593, line: 202, baseType: !2066, size: 128)
!2066 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !1593, line: 200, baseType: !2067)
!2067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !1593, line: 200, size: 128, elements: !2068)
!2068 = !{!2069, !2070, !2071}
!2069 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2067, file: !1593, line: 200, baseType: !7, size: 32)
!2070 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2067, file: !1593, line: 200, baseType: !7, size: 32, offset: 32)
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2067, file: !1593, line: 200, baseType: !1624, size: 64, offset: 64)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2018, file: !1593, line: 234, baseType: !2061, size: 64, offset: 256)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2012, file: !1593, line: 197, baseType: !1471, size: 64, offset: 256)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !1606, file: !1593, line: 319, baseType: !1478, size: 256)
!2075 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !1606, file: !1593, line: 320, baseType: !1497, size: 192)
!2076 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1416, file: !135, line: 3384, baseType: !2077, size: 1472)
!2077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !2078)
!2078 = !{!2079, !2100, !2101, !2102, !2103}
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2077, file: !135, line: 3115, baseType: !2080, size: 1216)
!2080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !2081)
!2081 = !{!2082, !2083, !2084, !2085, !2086, !2087, !2088, !2089, !2090, !2091, !2092, !2093, !2094, !2095, !2096, !2097, !2098, !2099}
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2080, file: !135, line: 2985, baseType: !1586, size: 960)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2080, file: !135, line: 2986, baseType: !1456, size: 64, offset: 960)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2080, file: !135, line: 2987, baseType: !1456, size: 64, offset: 1024)
!2085 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2080, file: !135, line: 2988, baseType: !1456, size: 64, offset: 1088)
!2086 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2080, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2080, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2080, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2080, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2080, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2080, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2092 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2080, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2093 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2080, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2080, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2080, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2080, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2080, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2080, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2099 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2080, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2100 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2077, file: !135, line: 3117, baseType: !1456, size: 64, offset: 1216)
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2077, file: !135, line: 3119, baseType: !1456, size: 64, offset: 1280)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2077, file: !135, line: 3121, baseType: !1456, size: 64, offset: 1344)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2077, file: !135, line: 3123, baseType: !1456, size: 64, offset: 1408)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1416, file: !135, line: 3385, baseType: !2105, size: 1088)
!2105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !2106)
!2106 = !{!2107, !2108, !2109}
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2105, file: !135, line: 2875, baseType: !1586, size: 960)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2105, file: !135, line: 2876, baseType: !1590, size: 64, offset: 960)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2105, file: !135, line: 2877, baseType: !2110, size: 64, offset: 1024)
!2110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2111, size: 64)
!2111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2112, line: 172, size: 128, elements: !2113)
!2112 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2113 = !{!2114, !2115, !2116, !2117, !2118, !2119, !2120}
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2111, file: !2112, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2111, file: !2112, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2116 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2111, file: !2112, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2117 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2111, file: !2112, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2111, file: !2112, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2111, file: !2112, line: 195, baseType: !7, size: 32, offset: 32)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2111, file: !2112, line: 199, baseType: !1456, size: 64, offset: 64)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1416, file: !135, line: 3386, baseType: !2080, size: 1216)
!2122 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1416, file: !135, line: 3387, baseType: !2123, size: 1280)
!2123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !2124)
!2124 = !{!2125, !2126}
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2123, file: !135, line: 3094, baseType: !2080, size: 1216)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2123, file: !135, line: 3095, baseType: !2110, size: 64, offset: 1216)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1416, file: !135, line: 3388, baseType: !2128, size: 1216)
!2128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !2129)
!2129 = !{!2130, !2131, !2132, !2133, !2134, !2135}
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2128, file: !135, line: 2825, baseType: !1548, size: 896)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2128, file: !135, line: 2827, baseType: !1456, size: 64, offset: 896)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2128, file: !135, line: 2828, baseType: !1456, size: 64, offset: 960)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2128, file: !135, line: 2829, baseType: !1456, size: 64, offset: 1024)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2128, file: !135, line: 2830, baseType: !1456, size: 64, offset: 1088)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2128, file: !135, line: 2831, baseType: !1456, size: 64, offset: 1152)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1416, file: !135, line: 3389, baseType: !2137, size: 1024)
!2137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !2138)
!2138 = !{!2139, !2140, !2141}
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2137, file: !135, line: 2851, baseType: !1586, size: 960)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2137, file: !135, line: 2852, baseType: !1408, size: 32, offset: 960)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2137, file: !135, line: 2853, baseType: !1408, size: 32, offset: 992)
!2142 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1416, file: !135, line: 3390, baseType: !2143, size: 1024)
!2143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !2144)
!2144 = !{!2145, !2146}
!2145 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2143, file: !135, line: 2858, baseType: !1586, size: 960)
!2146 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2143, file: !135, line: 2859, baseType: !2110, size: 64, offset: 960)
!2147 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1416, file: !135, line: 3391, baseType: !2148, size: 960)
!2148 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !2149)
!2149 = !{!2150}
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2148, file: !135, line: 2863, baseType: !1586, size: 960)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1416, file: !135, line: 3392, baseType: !2152, size: 1472)
!2152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !2153)
!2153 = !{!2154}
!2154 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2152, file: !135, line: 3305, baseType: !2077, size: 1472)
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1416, file: !135, line: 3393, baseType: !2156, size: 1792)
!2156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !2157)
!2157 = !{!2158, !2159, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391}
!2158 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2156, file: !135, line: 3249, baseType: !2077, size: 1472)
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2156, file: !135, line: 3251, baseType: !2160, size: 64, offset: 1472)
!2160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2161, size: 64)
!2161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2162, line: 463, size: 1152, elements: !2163)
!2162 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2163 = !{!2164, !2167, !2198, !2199, !2312, !2315, !2316, !2317, !2318, !2319, !2320, !2344, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370}
!2164 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2161, file: !2162, line: 464, baseType: !2165, size: 64)
!2165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2166, size: 64)
!2166 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2162, line: 464, flags: DIFlagFwdDecl)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2161, file: !2162, line: 467, baseType: !2168, size: 64, offset: 64)
!2168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2169, size: 64)
!2169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !2170)
!2170 = !{!2171, !2173, !2174, !2187, !2188, !2189, !2190, !2191, !2192, !2194, !2196, !2197}
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2169, file: !330, line: 377, baseType: !2172, size: 64)
!2172 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1457, line: 111, baseType: !1703)
!2173 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2169, file: !330, line: 378, baseType: !2172, size: 64, offset: 64)
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2169, file: !330, line: 381, baseType: !2175, size: 64, offset: 128)
!2175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2176, size: 64)
!2176 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !2177)
!2177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !2178)
!2178 = !{!2179}
!2179 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2177, file: !330, line: 282, baseType: !2180, size: 128)
!2180 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !2181)
!2181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !2182)
!2182 = !{!2183, !2184, !2185}
