; ModuleID = 'tree-ssa-dom.bc'
source_filename = "tree-ssa-dom.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.opt_stats_d = type { i64, i64, i64, i64, i64 }
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%struct.VEC_expr_hash_elt_t_heap = type { %struct.VEC_expr_hash_elt_t_base }
%struct.VEC_expr_hash_elt_t_base = type { i32, i32, [1 x %struct.expr_hash_elt*] }
%struct.expr_hash_elt = type { %union.tree_node*, %struct.hashable_expr, %union.gimple_statement_d*, i32, %struct.expr_hash_elt* }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }

!630 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!631 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!632 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!633 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!634 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!635 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!636 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!637 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!638 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!639 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!640 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !580, line: 727, baseType: !7, size: 32, elements: !641)
!641 = !{!642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!642 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!644 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!645 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!646 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!647 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!648 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!649 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!650 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!651 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!652 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!653 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!654 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!655 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!656 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!657 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!658 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!659 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!660 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!661 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!662 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!663 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!664 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!665 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!666 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !667, line: 119, baseType: !7, size: 32, elements: !668)
!667 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!668 = !{!669, !670, !671, !672}
!669 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!670 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!671 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!672 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!673 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !580, line: 80, baseType: !7, size: 32, elements: !674)
!674 = !{!675, !676, !677, !678}
!675 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!676 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!677 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!678 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!679 = !{!680, !681, !682, !683, !686, !687, !317, !689, !752, !757, !2111, !2112, !2125, !7, !2130, !618, !189, !1053, !684, !1020, !2142, !673, !2144, !881, !2136, !1019, !724}
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!682 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !685)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !690, line: 47, baseType: !691)
!690 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !693, line: 75, size: 256, elements: !694)
!693 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!694 = !{!695, !710, !711, !712}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !692, file: !693, line: 76, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !693, line: 68, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !693, line: 63, size: 320, elements: !699)
!699 = !{!700, !702, !703, !704}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !698, file: !693, line: 64, baseType: !701, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !698, file: !693, line: 65, baseType: !701, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !698, file: !693, line: 66, baseType: !7, size: 32, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !698, file: !693, line: 67, baseType: !705, size: 128, offset: 192)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 128, elements: !708)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !693, line: 29, baseType: !707)
!707 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!708 = !{!709}
!709 = !DISubrange(count: 2)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !692, file: !693, line: 77, baseType: !696, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !692, file: !693, line: 78, baseType: !7, size: 32, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !692, file: !693, line: 79, baseType: !713, size: 64, offset: 192)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !693, line: 49, baseType: !715)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !693, line: 45, size: 832, elements: !716)
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !715, file: !693, line: 46, baseType: !701, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !715, file: !693, line: 47, baseType: !691, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !715, file: !693, line: 48, baseType: !720, size: 704, offset: 128)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !721, line: 164, size: 704, elements: !722)
!721 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !{!723, !725, !735, !736, !737, !738, !739, !740, !744, !748, !749, !750, !751}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !720, file: !721, line: 166, baseType: !724, size: 64)
!724 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !720, file: !721, line: 167, baseType: !726, size: 64, offset: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !721, line: 157, size: 192, elements: !728)
!728 = !{!729, !730, !731}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !727, file: !721, line: 159, baseType: !684, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !727, file: !721, line: 160, baseType: !726, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !727, file: !721, line: 161, baseType: !732, size: 32, offset: 128)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 32, elements: !733)
!733 = !{!734}
!734 = !DISubrange(count: 4)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !720, file: !721, line: 168, baseType: !684, size: 64, offset: 128)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !720, file: !721, line: 169, baseType: !684, size: 64, offset: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !720, file: !721, line: 170, baseType: !684, size: 64, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !720, file: !721, line: 171, baseType: !724, size: 64, offset: 320)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !720, file: !721, line: 172, baseType: !682, size: 32, offset: 384)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !720, file: !721, line: 176, baseType: !741, size: 64, offset: 448)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = !DISubroutineType(types: !743)
!743 = !{!726, !686, !724}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !720, file: !721, line: 177, baseType: !745, size: 64, offset: 512)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{null, !686, !726}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !720, file: !721, line: 178, baseType: !686, size: 64, offset: 576)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !720, file: !721, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !720, file: !721, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !720, file: !721, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !754)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "expr_hash_elt", file: !3, line: 132, size: 640, elements: !755)
!755 = !{!756, !2078, !2108, !2109, !2110}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !754, file: !3, line: 135, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !690, line: 56, baseType: !758)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !318, line: 3371, size: 1792, elements: !760)
!760 = !{!761, !794, !800, !811, !830, !841, !846, !855, !861, !874, !886, !924, !1409, !1437, !1454, !1455, !1460, !1469, !1475, !1480, !1484, !1488, !1729, !1776, !1782, !1788, !1795, !1808, !1822, !1839, !1851, !1873, !1888, !2060}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !759, file: !318, line: 3372, baseType: !762, size: 64)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !318, line: 360, size: 64, elements: !763)
!763 = !{!764, !765, !766, !767, !768, !769, !770, !771, !772, !773, !774, !775, !776, !777, !778, !779, !780, !781, !782, !783, !784, !785, !786, !787, !788, !789, !790, !791, !792, !793}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !762, file: !318, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !762, file: !318, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !762, file: !318, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !762, file: !318, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !762, file: !318, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !762, file: !318, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !762, file: !318, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !762, file: !318, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !762, file: !318, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !762, file: !318, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !762, file: !318, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !762, file: !318, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !762, file: !318, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !762, file: !318, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !762, file: !318, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !762, file: !318, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !762, file: !318, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !762, file: !318, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !762, file: !318, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !762, file: !318, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !762, file: !318, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !762, file: !318, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !762, file: !318, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !762, file: !318, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !762, file: !318, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !762, file: !318, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !762, file: !318, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !762, file: !318, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !762, file: !318, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !762, file: !318, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !759, file: !318, line: 3373, baseType: !795, size: 192)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !318, line: 402, size: 192, elements: !796)
!796 = !{!797, !798, !799}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !795, file: !318, line: 403, baseType: !762, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !795, file: !318, line: 404, baseType: !757, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !795, file: !318, line: 405, baseType: !757, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !759, file: !318, line: 3374, baseType: !801, size: 320)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !318, line: 1384, size: 320, elements: !802)
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !801, file: !318, line: 1385, baseType: !795, size: 192)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !801, file: !318, line: 1386, baseType: !805, size: 128, offset: 192)
!805 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !806, line: 58, baseType: !807)
!806 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!807 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !806, line: 54, size: 128, elements: !808)
!808 = !{!809, !810}
!809 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !807, file: !806, line: 56, baseType: !707, size: 64)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !807, file: !806, line: 57, baseType: !724, size: 64, offset: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !759, file: !318, line: 3375, baseType: !812, size: 256)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !318, line: 1397, size: 256, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !812, file: !318, line: 1398, baseType: !795, size: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !812, file: !318, line: 1399, baseType: !816, size: 64, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !818, line: 52, size: 256, elements: !819)
!818 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!819 = !{!820, !821, !822, !823, !824, !825, !826}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !817, file: !818, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !817, file: !818, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !817, file: !818, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !817, file: !818, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !817, file: !818, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !817, file: !818, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !817, file: !818, line: 62, baseType: !827, size: 192, offset: 64)
!827 = !DICompositeType(tag: DW_TAG_array_type, baseType: !707, size: 192, elements: !828)
!828 = !{!829}
!829 = !DISubrange(count: 3)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !759, file: !318, line: 3376, baseType: !831, size: 256)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !318, line: 1408, size: 256, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !831, file: !318, line: 1409, baseType: !795, size: 192)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !831, file: !318, line: 1410, baseType: !835, size: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !837, line: 27, size: 192, elements: !838)
!837 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !836, file: !837, line: 29, baseType: !805, size: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !836, file: !837, line: 30, baseType: !189, size: 32, offset: 128)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !759, file: !318, line: 3377, baseType: !842, size: 256)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !318, line: 1437, size: 256, elements: !843)
!843 = !{!844, !845}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !842, file: !318, line: 1438, baseType: !795, size: 192)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !842, file: !318, line: 1439, baseType: !757, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !759, file: !318, line: 3378, baseType: !847, size: 256)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !318, line: 1418, size: 256, elements: !848)
!848 = !{!849, !850, !851}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !318, line: 1419, baseType: !795, size: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !847, file: !318, line: 1420, baseType: !682, size: 32, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !847, file: !318, line: 1421, baseType: !852, size: 8, offset: 224)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 8, elements: !853)
!853 = !{!854}
!854 = !DISubrange(count: 1)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !759, file: !318, line: 3379, baseType: !856, size: 320)
!856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !318, line: 1428, size: 320, elements: !857)
!857 = !{!858, !859, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !856, file: !318, line: 1429, baseType: !795, size: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !856, file: !318, line: 1430, baseType: !757, size: 64, offset: 192)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !856, file: !318, line: 1431, baseType: !757, size: 64, offset: 256)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !759, file: !318, line: 3380, baseType: !862, size: 320)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !318, line: 1460, size: 320, elements: !863)
!863 = !{!864, !865}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !862, file: !318, line: 1461, baseType: !795, size: 192)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !862, file: !318, line: 1462, baseType: !866, size: 128, offset: 192)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !867, line: 31, size: 128, elements: !868)
!867 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!868 = !{!869, !872, !873}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !866, file: !867, line: 32, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !681)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !866, file: !867, line: 33, baseType: !7, size: 32, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !866, file: !867, line: 34, baseType: !7, size: 32, offset: 96)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !759, file: !318, line: 3381, baseType: !875, size: 384)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !318, line: 2507, size: 384, elements: !876)
!876 = !{!877, !878, !883, !884, !885}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !875, file: !318, line: 2508, baseType: !795, size: 192)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !875, file: !318, line: 2509, baseType: !879, size: 32, offset: 192)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !880, line: 58, baseType: !881)
!880 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!881 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !882, line: 44, baseType: !7)
!882 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!883 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !875, file: !318, line: 2510, baseType: !7, size: 32, offset: 224)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !875, file: !318, line: 2511, baseType: !757, size: 64, offset: 256)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !875, file: !318, line: 2512, baseType: !757, size: 64, offset: 320)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !759, file: !318, line: 3382, baseType: !887, size: 896)
!887 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !318, line: 2652, size: 896, elements: !888)
!888 = !{!889, !890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912, !913, !914, !915, !916, !917, !918, !919, !920, !921}
!889 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !887, file: !318, line: 2653, baseType: !875, size: 384)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !887, file: !318, line: 2654, baseType: !757, size: 64, offset: 384)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !887, file: !318, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !887, file: !318, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !887, file: !318, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !887, file: !318, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !887, file: !318, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !887, file: !318, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !887, file: !318, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !887, file: !318, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !887, file: !318, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !887, file: !318, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !887, file: !318, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !887, file: !318, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !887, file: !318, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !887, file: !318, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !887, file: !318, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !887, file: !318, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !887, file: !318, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !887, file: !318, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !887, file: !318, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !887, file: !318, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !887, file: !318, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !887, file: !318, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !887, file: !318, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !887, file: !318, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !887, file: !318, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !887, file: !318, line: 2703, baseType: !7, size: 32, offset: 512)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !887, file: !318, line: 2705, baseType: !757, size: 64, offset: 576)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !887, file: !318, line: 2706, baseType: !757, size: 64, offset: 640)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !887, file: !318, line: 2707, baseType: !757, size: 64, offset: 704)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !887, file: !318, line: 2708, baseType: !757, size: 64, offset: 768)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !887, file: !318, line: 2711, baseType: !922, size: 64, offset: 832)
!922 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !923, size: 64)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !318, line: 2711, flags: DIFlagFwdDecl)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !759, file: !318, line: 3383, baseType: !925, size: 960)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !318, line: 2756, size: 960, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !925, file: !318, line: 2757, baseType: !887, size: 896)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !925, file: !318, line: 2758, baseType: !929, size: 64, offset: 896)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !690, line: 50, baseType: !930)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !932, line: 240, size: 384, elements: !933)
!932 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!933 = !{!934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !931, file: !932, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !931, file: !932, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !931, file: !932, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !931, file: !932, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !931, file: !932, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !931, file: !932, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !931, file: !932, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !931, file: !932, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !931, file: !932, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !931, file: !932, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !931, file: !932, line: 321, baseType: !945, size: 320, offset: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !932, line: 315, size: 320, elements: !946)
!946 = !{!947, !1342, !1344, !1407, !1408}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !945, file: !932, line: 316, baseType: !948, size: 64)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 64, elements: !853)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !932, line: 183, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !932, line: 166, size: 64, elements: !951)
!951 = !{!952, !953, !954, !955, !956, !964, !965, !977, !980, !981, !982, !1319, !1332, !1339}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !950, file: !932, line: 168, baseType: !682, size: 32)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !950, file: !932, line: 169, baseType: !7, size: 32)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !950, file: !932, line: 170, baseType: !687, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !950, file: !932, line: 171, baseType: !929, size: 64)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !950, file: !932, line: 172, baseType: !957, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !690, line: 53, baseType: !958)
!958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !959, size: 64)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !932, line: 359, size: 128, elements: !960)
!960 = !{!961, !962}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !959, file: !932, line: 360, baseType: !682, size: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !959, file: !932, line: 361, baseType: !963, size: 64, offset: 64)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 64, elements: !853)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !950, file: !932, line: 173, baseType: !189, size: 32)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !950, file: !932, line: 174, baseType: !966, size: 32)
!966 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !932, line: 133, baseType: !967)
!967 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !932, line: 115, size: 32, elements: !968)
!968 = !{!969, !970, !971, !972, !973, !974, !975, !976}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !967, file: !932, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !967, file: !932, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !967, file: !932, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !967, file: !932, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !967, file: !932, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !967, file: !932, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !967, file: !932, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !967, file: !932, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !950, file: !932, line: 175, baseType: !978, size: 64)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !932, line: 175, flags: DIFlagFwdDecl)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !950, file: !932, line: 176, baseType: !691, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !950, file: !932, line: 177, baseType: !757, size: 64)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !950, file: !932, line: 178, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !526, line: 217, size: 832, elements: !985)
!985 = !{!986, !1231, !1232, !1233, !1289, !1293, !1294, !1295, !1313, !1314, !1315, !1316, !1317, !1318}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !984, file: !526, line: 219, baseType: !987, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !988, size: 64)
!988 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !526, line: 151, baseType: !989)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !526, line: 151, size: 128, elements: !990)
!990 = !{!991}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !989, file: !526, line: 151, baseType: !992, size: 128)
!992 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !526, line: 150, baseType: !993)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !526, line: 150, size: 128, elements: !994)
!994 = !{!995, !996, !997}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !993, file: !526, line: 150, baseType: !7, size: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !993, file: !526, line: 150, baseType: !7, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !993, file: !526, line: 150, baseType: !998, size: 64, offset: 64)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !999, size: 64, elements: !853)
!999 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !690, line: 108, baseType: !1000)
!1000 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1001, size: 64)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !526, line: 122, size: 512, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1223, !1224, !1225, !1226, !1227, !1228, !1229}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1001, file: !526, line: 124, baseType: !983, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1001, file: !526, line: 125, baseType: !983, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1001, file: !526, line: 131, baseType: !1006, size: 64, offset: 128)
!1006 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !526, line: 128, size: 64, elements: !1007)
!1007 = !{!1008, !1222}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1006, file: !526, line: 129, baseType: !1009, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !690, line: 66, baseType: !1010)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !580, line: 143, size: 192, elements: !1012)
!1012 = !{!1013, !1220, !1221}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1011, file: !580, line: 145, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !690, line: 69, baseType: !1015)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !580, line: 136, size: 192, elements: !1017)
!1017 = !{!1018, !1218, !1219}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1016, file: !580, line: 137, baseType: !1019, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !690, line: 58, baseType: !1020)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !580, line: 737, size: 768, elements: !1022)
!1022 = !{!1023, !1040, !1073, !1079, !1084, !1089, !1096, !1102, !1108, !1113, !1127, !1132, !1138, !1143, !1153, !1158, !1176, !1183, !1190, !1196, !1201, !1207, !1213}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1021, file: !580, line: 738, baseType: !1024, size: 256)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !580, line: 271, size: 256, elements: !1025)
!1025 = !{!1026, !1027, !1028, !1029, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1039}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1024, file: !580, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1024, file: !580, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1024, file: !580, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1024, file: !580, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1024, file: !580, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1024, file: !580, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1024, file: !580, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1024, file: !580, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1024, file: !580, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1024, file: !580, line: 312, baseType: !7, size: 32, offset: 32)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1024, file: !580, line: 316, baseType: !879, size: 32, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1024, file: !580, line: 319, baseType: !7, size: 32, offset: 96)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1024, file: !580, line: 323, baseType: !983, size: 64, offset: 128)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1024, file: !580, line: 327, baseType: !757, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1021, file: !580, line: 739, baseType: !1041, size: 448)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !580, line: 350, size: 448, elements: !1042)
!1042 = !{!1043, !1071}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1041, file: !580, line: 353, baseType: !1044, size: 384)
!1044 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !580, line: 333, size: 384, elements: !1045)
!1045 = !{!1046, !1047, !1054}
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1044, file: !580, line: 336, baseType: !1024, size: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1044, file: !580, line: 343, baseType: !1048, size: 64, offset: 256)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !667, line: 37, size: 128, elements: !1050)
!1050 = !{!1051, !1052}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1049, file: !667, line: 39, baseType: !1048, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1049, file: !667, line: 40, baseType: !1053, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !757, size: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1044, file: !580, line: 344, baseType: !1055, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !667, line: 45, size: 320, elements: !1057)
!1057 = !{!1058, !1059}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1056, file: !667, line: 47, baseType: !1055, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1056, file: !667, line: 48, baseType: !1060, size: 256, offset: 64)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !318, line: 1883, size: 256, elements: !1061)
!1061 = !{!1062, !1064, !1065, !1070}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1060, file: !318, line: 1884, baseType: !1063, size: 64)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1060, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1060, file: !318, line: 1885, baseType: !1063, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1060, file: !318, line: 1891, baseType: !1066, size: 64, offset: 128)
!1066 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1060, file: !318, line: 1891, size: 64, elements: !1067)
!1067 = !{!1068, !1069}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1066, file: !318, line: 1891, baseType: !1019, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1066, file: !318, line: 1891, baseType: !757, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1060, file: !318, line: 1892, baseType: !1053, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1041, file: !580, line: 359, baseType: !1072, size: 64, offset: 384)
!1072 = !DICompositeType(tag: DW_TAG_array_type, baseType: !757, size: 64, elements: !853)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1021, file: !580, line: 740, baseType: !1074, size: 512)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !580, line: 365, size: 512, elements: !1075)
!1075 = !{!1076, !1077, !1078}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1074, file: !580, line: 368, baseType: !1044, size: 384)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1074, file: !580, line: 373, baseType: !757, size: 64, offset: 384)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1074, file: !580, line: 374, baseType: !757, size: 64, offset: 448)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1021, file: !580, line: 741, baseType: !1080, size: 576)
!1080 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !580, line: 380, size: 576, elements: !1081)
!1081 = !{!1082, !1083}
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1080, file: !580, line: 383, baseType: !1074, size: 512)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1080, file: !580, line: 389, baseType: !1072, size: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1021, file: !580, line: 742, baseType: !1085, size: 320)
!1085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !580, line: 395, size: 320, elements: !1086)
!1086 = !{!1087, !1088}
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1085, file: !580, line: 397, baseType: !1024, size: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1085, file: !580, line: 400, baseType: !1009, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1021, file: !580, line: 743, baseType: !1090, size: 448)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !580, line: 406, size: 448, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1090, file: !580, line: 408, baseType: !1024, size: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1090, file: !580, line: 412, baseType: !757, size: 64, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1090, file: !580, line: 420, baseType: !757, size: 64, offset: 320)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1090, file: !580, line: 423, baseType: !1009, size: 64, offset: 384)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1021, file: !580, line: 744, baseType: !1097, size: 384)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !580, line: 429, size: 384, elements: !1098)
!1098 = !{!1099, !1100, !1101}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1097, file: !580, line: 431, baseType: !1024, size: 256)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1097, file: !580, line: 434, baseType: !757, size: 64, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1097, file: !580, line: 437, baseType: !1009, size: 64, offset: 320)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1021, file: !580, line: 745, baseType: !1103, size: 384)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !580, line: 443, size: 384, elements: !1104)
!1104 = !{!1105, !1106, !1107}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1103, file: !580, line: 445, baseType: !1024, size: 256)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1103, file: !580, line: 449, baseType: !757, size: 64, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1103, file: !580, line: 453, baseType: !1009, size: 64, offset: 320)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1021, file: !580, line: 746, baseType: !1109, size: 320)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !580, line: 459, size: 320, elements: !1110)
!1110 = !{!1111, !1112}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1109, file: !580, line: 461, baseType: !1024, size: 256)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1109, file: !580, line: 464, baseType: !757, size: 64, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1021, file: !580, line: 747, baseType: !1114, size: 768)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !580, line: 469, size: 768, elements: !1115)
!1115 = !{!1116, !1117, !1118, !1119, !1120}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1114, file: !580, line: 471, baseType: !1024, size: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1114, file: !580, line: 474, baseType: !7, size: 32, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1114, file: !580, line: 475, baseType: !7, size: 32, offset: 288)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1114, file: !580, line: 478, baseType: !757, size: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1114, file: !580, line: 481, baseType: !1121, size: 384, offset: 384)
!1121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1122, size: 384, elements: !853)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !318, line: 1917, size: 384, elements: !1123)
!1123 = !{!1124, !1125, !1126}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1122, file: !318, line: 1920, baseType: !1060, size: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1122, file: !318, line: 1921, baseType: !757, size: 64, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1122, file: !318, line: 1922, baseType: !879, size: 32, offset: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1021, file: !580, line: 748, baseType: !1128, size: 320)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !580, line: 487, size: 320, elements: !1129)
!1129 = !{!1130, !1131}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1128, file: !580, line: 490, baseType: !1024, size: 256)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1128, file: !580, line: 494, baseType: !682, size: 32, offset: 256)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1021, file: !580, line: 749, baseType: !1133, size: 384)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !580, line: 500, size: 384, elements: !1134)
!1134 = !{!1135, !1136, !1137}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1133, file: !580, line: 502, baseType: !1024, size: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1133, file: !580, line: 506, baseType: !1009, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1133, file: !580, line: 510, baseType: !1009, size: 64, offset: 320)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1021, file: !580, line: 750, baseType: !1139, size: 320)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !580, line: 529, size: 320, elements: !1140)
!1140 = !{!1141, !1142}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1139, file: !580, line: 531, baseType: !1024, size: 256)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1139, file: !580, line: 540, baseType: !1009, size: 64, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1021, file: !580, line: 751, baseType: !1144, size: 704)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !580, line: 546, size: 704, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149, !1150, !1151, !1152}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1144, file: !580, line: 549, baseType: !1074, size: 512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1144, file: !580, line: 553, baseType: !687, size: 64, offset: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1144, file: !580, line: 557, baseType: !681, size: 8, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1144, file: !580, line: 558, baseType: !681, size: 8, offset: 584)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1144, file: !580, line: 559, baseType: !681, size: 8, offset: 592)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1144, file: !580, line: 560, baseType: !681, size: 8, offset: 600)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1144, file: !580, line: 566, baseType: !1072, size: 64, offset: 640)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1021, file: !580, line: 752, baseType: !1154, size: 384)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !580, line: 571, size: 384, elements: !1155)
!1155 = !{!1156, !1157}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1154, file: !580, line: 573, baseType: !1085, size: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1154, file: !580, line: 577, baseType: !757, size: 64, offset: 320)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1021, file: !580, line: 753, baseType: !1159, size: 576)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !580, line: 600, size: 576, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1166, !1175}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1159, file: !580, line: 602, baseType: !1085, size: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1159, file: !580, line: 605, baseType: !757, size: 64, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1159, file: !580, line: 609, baseType: !1164, size: 64, offset: 384)
!1164 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1165, line: 46, baseType: !707)
!1165 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1159, file: !580, line: 612, baseType: !1167, size: 64, offset: 448)
!1167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1168, size: 64)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !580, line: 581, size: 320, elements: !1169)
!1169 = !{!1170, !1171, !1172, !1173, !1174}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1168, file: !580, line: 583, baseType: !317, size: 32)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1168, file: !580, line: 586, baseType: !757, size: 64, offset: 64)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1168, file: !580, line: 589, baseType: !757, size: 64, offset: 128)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1168, file: !580, line: 592, baseType: !757, size: 64, offset: 192)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1168, file: !580, line: 595, baseType: !757, size: 64, offset: 256)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1159, file: !580, line: 616, baseType: !1009, size: 64, offset: 512)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1021, file: !580, line: 754, baseType: !1177, size: 512)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !580, line: 622, size: 512, elements: !1178)
!1178 = !{!1179, !1180, !1181, !1182}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1177, file: !580, line: 624, baseType: !1085, size: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1177, file: !580, line: 628, baseType: !757, size: 64, offset: 320)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1177, file: !580, line: 632, baseType: !757, size: 64, offset: 384)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1177, file: !580, line: 636, baseType: !757, size: 64, offset: 448)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1021, file: !580, line: 755, baseType: !1184, size: 704)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !580, line: 642, size: 704, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1189}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1184, file: !580, line: 644, baseType: !1177, size: 512)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1184, file: !580, line: 648, baseType: !757, size: 64, offset: 512)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1184, file: !580, line: 652, baseType: !757, size: 64, offset: 576)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1184, file: !580, line: 653, baseType: !757, size: 64, offset: 640)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1021, file: !580, line: 756, baseType: !1191, size: 448)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !580, line: 663, size: 448, elements: !1192)
!1192 = !{!1193, !1194, !1195}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1191, file: !580, line: 665, baseType: !1085, size: 320)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1191, file: !580, line: 668, baseType: !757, size: 64, offset: 320)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1191, file: !580, line: 673, baseType: !757, size: 64, offset: 384)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1021, file: !580, line: 757, baseType: !1197, size: 384)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !580, line: 694, size: 384, elements: !1198)
!1198 = !{!1199, !1200}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1197, file: !580, line: 696, baseType: !1085, size: 320)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1197, file: !580, line: 699, baseType: !757, size: 64, offset: 320)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1021, file: !580, line: 758, baseType: !1202, size: 384)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !580, line: 681, size: 384, elements: !1203)
!1203 = !{!1204, !1205, !1206}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1202, file: !580, line: 683, baseType: !1024, size: 256)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1202, file: !580, line: 686, baseType: !757, size: 64, offset: 256)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1202, file: !580, line: 689, baseType: !757, size: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1021, file: !580, line: 759, baseType: !1208, size: 384)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !580, line: 707, size: 384, elements: !1209)
!1209 = !{!1210, !1211, !1212}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1208, file: !580, line: 709, baseType: !1024, size: 256)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1208, file: !580, line: 712, baseType: !757, size: 64, offset: 256)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1208, file: !580, line: 712, baseType: !757, size: 64, offset: 320)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1021, file: !580, line: 760, baseType: !1214, size: 320)
!1214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !580, line: 718, size: 320, elements: !1215)
!1215 = !{!1216, !1217}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1214, file: !580, line: 720, baseType: !1024, size: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1214, file: !580, line: 723, baseType: !757, size: 64, offset: 256)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1016, file: !580, line: 138, baseType: !1015, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !580, line: 139, baseType: !1015, size: 64, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1011, file: !580, line: 146, baseType: !1014, size: 64, offset: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1011, file: !580, line: 152, baseType: !1009, size: 64, offset: 128)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1006, file: !526, line: 130, baseType: !929, size: 64)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1001, file: !526, line: 134, baseType: !686, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1001, file: !526, line: 137, baseType: !757, size: 64, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1001, file: !526, line: 138, baseType: !879, size: 32, offset: 320)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1001, file: !526, line: 142, baseType: !7, size: 32, offset: 352)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1001, file: !526, line: 144, baseType: !682, size: 32, offset: 384)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1001, file: !526, line: 145, baseType: !682, size: 32, offset: 416)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1001, file: !526, line: 146, baseType: !1230, size: 64, offset: 448)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !526, line: 119, baseType: !724)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !984, file: !526, line: 220, baseType: !987, size: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !984, file: !526, line: 223, baseType: !686, size: 64, offset: 128)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !984, file: !526, line: 226, baseType: !1234, size: 64, offset: 192)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !513, line: 100, size: 1216, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240, !1241, !1246, !1247, !1248, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1279, !1287, !1288}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1235, file: !513, line: 102, baseType: !682, size: 32)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1235, file: !513, line: 105, baseType: !7, size: 32, offset: 32)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1235, file: !513, line: 108, baseType: !983, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1235, file: !513, line: 111, baseType: !983, size: 64, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1235, file: !513, line: 114, baseType: !1242, size: 64, offset: 192)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !513, line: 41, size: 64, elements: !1243)
!1243 = !{!1244, !1245}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1242, file: !513, line: 42, baseType: !512, size: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1242, file: !513, line: 43, baseType: !7, size: 32, offset: 32)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1235, file: !513, line: 117, baseType: !7, size: 32, offset: 256)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1235, file: !513, line: 120, baseType: !7, size: 32, offset: 288)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1235, file: !513, line: 123, baseType: !1249, size: 64, offset: 320)
!1249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1250, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !513, line: 87, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !513, line: 87, size: 128, elements: !1252)
!1252 = !{!1253}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1251, file: !513, line: 87, baseType: !1254, size: 128)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !513, line: 85, baseType: !1255)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !513, line: 85, size: 128, elements: !1256)
!1256 = !{!1257, !1258, !1259}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1255, file: !513, line: 85, baseType: !7, size: 32)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1255, file: !513, line: 85, baseType: !7, size: 32, offset: 32)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1255, file: !513, line: 85, baseType: !1260, size: 64, offset: 64)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1261, size: 64, elements: !853)
!1261 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !513, line: 84, baseType: !1234)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1235, file: !513, line: 126, baseType: !1234, size: 64, offset: 384)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1235, file: !513, line: 129, baseType: !1234, size: 64, offset: 448)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1235, file: !513, line: 132, baseType: !686, size: 64, offset: 512)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1235, file: !513, line: 139, baseType: !757, size: 64, offset: 576)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1235, file: !513, line: 143, baseType: !805, size: 128, offset: 640)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1235, file: !513, line: 146, baseType: !805, size: 128, offset: 768)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1235, file: !513, line: 148, baseType: !681, size: 8, offset: 896)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1235, file: !513, line: 149, baseType: !681, size: 8, offset: 904)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1235, file: !513, line: 153, baseType: !521, size: 32, offset: 928)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1235, file: !513, line: 156, baseType: !1272, size: 64, offset: 960)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !513, line: 48, size: 320, elements: !1274)
!1274 = !{!1275, !1276, !1277, !1278}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1273, file: !513, line: 50, baseType: !1019, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1273, file: !513, line: 59, baseType: !805, size: 128, offset: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1273, file: !513, line: 64, baseType: !681, size: 8, offset: 192)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1273, file: !513, line: 67, baseType: !1272, size: 64, offset: 256)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1235, file: !513, line: 159, baseType: !1280, size: 64, offset: 1024)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !513, line: 72, size: 256, elements: !1282)
!1282 = !{!1283, !1284, !1285, !1286}
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1281, file: !513, line: 74, baseType: !1000, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1281, file: !513, line: 77, baseType: !1280, size: 64, offset: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1281, file: !513, line: 78, baseType: !1280, size: 64, offset: 128)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1281, file: !513, line: 81, baseType: !1280, size: 64, offset: 192)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1235, file: !513, line: 162, baseType: !681, size: 8, offset: 1088)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1235, file: !513, line: 166, baseType: !757, size: 64, offset: 1152)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !984, file: !526, line: 229, baseType: !1290, size: 128, offset: 256)
!1290 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1291, size: 128, elements: !708)
!1291 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1292, size: 64)
!1292 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !526, line: 229, flags: DIFlagFwdDecl)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !984, file: !526, line: 232, baseType: !983, size: 64, offset: 384)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !984, file: !526, line: 233, baseType: !983, size: 64, offset: 448)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !984, file: !526, line: 238, baseType: !1296, size: 64, offset: 512)
!1296 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !526, line: 235, size: 64, elements: !1297)
!1297 = !{!1298, !1304}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1296, file: !526, line: 236, baseType: !1299, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !526, line: 273, size: 128, elements: !1301)
!1301 = !{!1302, !1303}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1300, file: !526, line: 275, baseType: !1009, size: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1300, file: !526, line: 278, baseType: !1009, size: 64, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1296, file: !526, line: 237, baseType: !1305, size: 64)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !526, line: 259, size: 320, elements: !1307)
!1307 = !{!1308, !1309, !1310, !1311, !1312}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1306, file: !526, line: 261, baseType: !929, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1306, file: !526, line: 262, baseType: !929, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1306, file: !526, line: 266, baseType: !929, size: 64, offset: 128)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1306, file: !526, line: 267, baseType: !929, size: 64, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1306, file: !526, line: 270, baseType: !682, size: 32, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !984, file: !526, line: 241, baseType: !1230, size: 64, offset: 576)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !984, file: !526, line: 244, baseType: !682, size: 32, offset: 640)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !984, file: !526, line: 247, baseType: !682, size: 32, offset: 672)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !984, file: !526, line: 250, baseType: !682, size: 32, offset: 704)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !984, file: !526, line: 253, baseType: !682, size: 32, offset: 736)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !984, file: !526, line: 256, baseType: !682, size: 32, offset: 768)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !950, file: !932, line: 179, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !932, line: 150, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !932, line: 142, size: 320, elements: !1323)
!1323 = !{!1324, !1325, !1326, !1327, !1330, !1331}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1322, file: !932, line: 144, baseType: !757, size: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1322, file: !932, line: 145, baseType: !929, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1322, file: !932, line: 146, baseType: !929, size: 64, offset: 128)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1322, file: !932, line: 147, baseType: !1328, size: 32, offset: 192)
!1328 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1329, line: 31, baseType: !682)
!1329 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1322, file: !932, line: 148, baseType: !7, size: 32, offset: 224)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1322, file: !932, line: 149, baseType: !681, size: 8, offset: 256)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !950, file: !932, line: 180, baseType: !1333, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1334, size: 64)
!1334 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !932, line: 162, baseType: !1335)
!1335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !932, line: 159, size: 128, elements: !1336)
!1336 = !{!1337, !1338}
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1335, file: !932, line: 160, baseType: !757, size: 64)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1335, file: !932, line: 161, baseType: !724, size: 64, offset: 64)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !950, file: !932, line: 181, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !932, line: 181, flags: DIFlagFwdDecl)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !945, file: !932, line: 317, baseType: !1343, size: 64)
!1343 = !DICompositeType(tag: DW_TAG_array_type, baseType: !724, size: 64, elements: !853)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !945, file: !932, line: 318, baseType: !1345, size: 320)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !932, line: 188, size: 320, elements: !1346)
!1346 = !{!1347, !1349, !1406}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1345, file: !932, line: 190, baseType: !1348, size: 192)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !949, size: 192, elements: !828)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1345, file: !932, line: 193, baseType: !1350, size: 64, offset: 192)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !932, line: 206, size: 320, elements: !1352)
!1352 = !{!1353, !1391, !1392, !1393, !1405}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1351, file: !932, line: 208, baseType: !1354, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1355, size: 64)
!1355 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !690, line: 62, baseType: !1356)
!1356 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1357, line: 538, size: 256, elements: !1358)
!1357 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1358 = !{!1359, !1363, !1369, !1382}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1356, file: !1357, line: 539, baseType: !1360, size: 32)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1357, line: 482, size: 32, elements: !1361)
!1361 = !{!1362}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1360, file: !1357, line: 484, baseType: !7, size: 32)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1356, file: !1357, line: 540, baseType: !1364, size: 192)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1357, line: 488, size: 192, elements: !1365)
!1365 = !{!1366, !1367, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1364, file: !1357, line: 489, baseType: !1360, size: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1364, file: !1357, line: 492, baseType: !687, size: 64, offset: 64)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1364, file: !1357, line: 496, baseType: !757, size: 64, offset: 128)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1356, file: !1357, line: 541, baseType: !1370, size: 256)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1357, line: 504, size: 256, elements: !1371)
!1371 = !{!1372, !1373, !1380, !1381}
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1370, file: !1357, line: 505, baseType: !1360, size: 32)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1370, file: !1357, line: 509, baseType: !1374, size: 64, offset: 64)
!1374 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1357, line: 501, baseType: !1375)
!1375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1376, size: 64)
!1376 = !DISubroutineType(types: !1377)
!1377 = !{null, !1378}
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1370, file: !1357, line: 510, baseType: !1378, size: 64, offset: 128)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1370, file: !1357, line: 513, baseType: !1354, size: 64, offset: 192)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1356, file: !1357, line: 542, baseType: !1383, size: 128)
!1383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1357, line: 530, size: 128, elements: !1384)
!1384 = !{!1385, !1386}
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1383, file: !1357, line: 531, baseType: !1360, size: 32)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1383, file: !1357, line: 534, baseType: !1387, size: 64, offset: 64)
!1387 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1357, line: 525, baseType: !1388)
!1388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1389, size: 64)
!1389 = !DISubroutineType(types: !1390)
!1390 = !{!681, !757, !687, !707, !707}
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1351, file: !932, line: 211, baseType: !7, size: 32, offset: 64)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1351, file: !932, line: 214, baseType: !724, size: 64, offset: 128)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1351, file: !932, line: 224, baseType: !1394, size: 64, offset: 192)
!1394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1395, size: 64)
!1395 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !932, line: 202, baseType: !1396)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !932, line: 202, size: 128, elements: !1397)
!1397 = !{!1398}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1396, file: !932, line: 202, baseType: !1399, size: 128)
!1399 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !932, line: 200, baseType: !1400)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !932, line: 200, size: 128, elements: !1401)
!1401 = !{!1402, !1403, !1404}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1400, file: !932, line: 200, baseType: !7, size: 32)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1400, file: !932, line: 200, baseType: !7, size: 32, offset: 32)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1400, file: !932, line: 200, baseType: !963, size: 64, offset: 64)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1351, file: !932, line: 234, baseType: !1394, size: 64, offset: 256)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1345, file: !932, line: 197, baseType: !724, size: 64, offset: 256)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !945, file: !932, line: 319, baseType: !817, size: 256)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !945, file: !932, line: 320, baseType: !836, size: 192)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !759, file: !318, line: 3384, baseType: !1410, size: 1472)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !318, line: 3114, size: 1472, elements: !1411)
!1411 = !{!1412, !1433, !1434, !1435, !1436}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1410, file: !318, line: 3115, baseType: !1413, size: 1216)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !318, line: 2984, size: 1216, elements: !1414)
!1414 = !{!1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1413, file: !318, line: 2985, baseType: !925, size: 960)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1413, file: !318, line: 2986, baseType: !757, size: 64, offset: 960)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1413, file: !318, line: 2987, baseType: !757, size: 64, offset: 1024)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1413, file: !318, line: 2988, baseType: !757, size: 64, offset: 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1413, file: !318, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1413, file: !318, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1413, file: !318, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1413, file: !318, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1413, file: !318, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1413, file: !318, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1413, file: !318, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1413, file: !318, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1413, file: !318, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1413, file: !318, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1413, file: !318, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1413, file: !318, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1413, file: !318, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1413, file: !318, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1410, file: !318, line: 3117, baseType: !757, size: 64, offset: 1216)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1410, file: !318, line: 3119, baseType: !757, size: 64, offset: 1280)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1410, file: !318, line: 3121, baseType: !757, size: 64, offset: 1344)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1410, file: !318, line: 3123, baseType: !757, size: 64, offset: 1408)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !759, file: !318, line: 3385, baseType: !1438, size: 1088)
!1438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !318, line: 2874, size: 1088, elements: !1439)
!1439 = !{!1440, !1441, !1442}
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1438, file: !318, line: 2875, baseType: !925, size: 960)
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1438, file: !318, line: 2876, baseType: !929, size: 64, offset: 960)
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1438, file: !318, line: 2877, baseType: !1443, size: 64, offset: 1024)
!1443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1444, size: 64)
!1444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1445, line: 172, size: 128, elements: !1446)
!1445 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1446 = !{!1447, !1448, !1449, !1450, !1451, !1452, !1453}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1444, file: !1445, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1444, file: !1445, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1449 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1444, file: !1445, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1450 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1444, file: !1445, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1444, file: !1445, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1444, file: !1445, line: 195, baseType: !7, size: 32, offset: 32)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1444, file: !1445, line: 199, baseType: !757, size: 64, offset: 64)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !759, file: !318, line: 3386, baseType: !1413, size: 1216)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !759, file: !318, line: 3387, baseType: !1456, size: 1280)
!1456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !318, line: 3093, size: 1280, elements: !1457)
!1457 = !{!1458, !1459}
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1456, file: !318, line: 3094, baseType: !1413, size: 1216)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1456, file: !318, line: 3095, baseType: !1443, size: 64, offset: 1216)
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !759, file: !318, line: 3388, baseType: !1461, size: 1216)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !318, line: 2824, size: 1216, elements: !1462)
!1462 = !{!1463, !1464, !1465, !1466, !1467, !1468}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1461, file: !318, line: 2825, baseType: !887, size: 896)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1461, file: !318, line: 2827, baseType: !757, size: 64, offset: 896)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1461, file: !318, line: 2828, baseType: !757, size: 64, offset: 960)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1461, file: !318, line: 2829, baseType: !757, size: 64, offset: 1024)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1461, file: !318, line: 2830, baseType: !757, size: 64, offset: 1088)
