; ModuleID = 'tree.bc'
source_filename = "tree.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.htab = type { i32 (i8*)*, i32 (i8*, i8*)*, void (i8*)*, i8**, i64, i64, i64, i32, i32, i8* (i64, i64)*, void (i8*)*, i8*, i8* (i8*, i64, i64)*, void (i8*, i8*)*, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }

!1400 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!1401 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!1402 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!1403 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!1404 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!1405 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!1406 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!1407 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!1408 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!1409 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!1410 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!1411 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!1412 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!1413 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!1414 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!1415 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!1416 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!1417 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!1418 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!1419 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!1420 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!1421 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !1383, line: 727, baseType: !7, size: 32, elements: !1422)
!1422 = !{!1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446}
!1423 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!1424 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!1425 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!1426 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!1427 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!1428 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!1429 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!1430 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!1431 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!1432 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!1433 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!1434 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!1435 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!1436 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!1437 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!1438 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!1439 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!1440 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!1441 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!1442 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!1443 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!1444 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!1445 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!1446 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!1447 = !{!1448, !1449, !1450, !1451, !1454, !1455, !155, !1457, !1511, !1538, !1519, !397, !1584, !1459, !2745, !2747, !1513, !1814, !2748, !2753, !2760, !2767, !2768, !2769, !1452, !20, !639, !1806, !1830, !2774, !2523, !1856, !2775, !7, !2780, !1930, !2789, !1964, !2791}
!1448 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1449, size: 64)
!1449 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!1450 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!1451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1452, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1453, size: 64)
!1453 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!1455 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1456, size: 64)
!1456 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1453)
!1457 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !1458, line: 56, baseType: !1459)
!1458 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1460, size: 64)
!1460 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !1461)
!1461 = !{!1462, !1495, !1501, !1514, !1533, !1544, !1549, !1558, !1564, !1577, !1589, !1627, !1635, !1663, !1680, !1681, !1686, !1695, !1701, !1706, !1710, !1714, !2394, !2443, !2449, !2455, !2462, !2475, !2489, !2506, !2518, !2540, !2555, !2727}
!1462 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1460, file: !6, line: 3372, baseType: !1463, size: 64)
!1463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !1464)
!1464 = !{!1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492, !1493, !1494}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1463, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !1463, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !1463, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !1463, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !1463, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !1463, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !1463, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!1472 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !1463, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!1473 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !1463, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!1474 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !1463, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!1475 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !1463, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!1476 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !1463, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!1477 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !1463, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!1478 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !1463, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!1479 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !1463, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!1480 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !1463, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!1481 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !1463, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!1482 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !1463, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!1483 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1463, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!1484 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1463, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!1485 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1463, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!1486 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1463, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!1487 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1463, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!1488 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1463, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!1489 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1463, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!1490 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1463, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!1491 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !1463, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!1492 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !1463, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!1493 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !1463, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!1494 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !1463, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!1495 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1460, file: !6, line: 3373, baseType: !1496, size: 192)
!1496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !1497)
!1497 = !{!1498, !1499, !1500}
!1498 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1496, file: !6, line: 403, baseType: !1463, size: 64)
!1499 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !1496, file: !6, line: 404, baseType: !1457, size: 64, offset: 64)
!1500 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1496, file: !6, line: 405, baseType: !1457, size: 64, offset: 128)
!1501 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1460, file: !6, line: 3374, baseType: !1502, size: 320)
!1502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !1503)
!1503 = !{!1504, !1505}
!1504 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1502, file: !6, line: 1385, baseType: !1496, size: 192)
!1505 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !1502, file: !6, line: 1386, baseType: !1506, size: 128, offset: 192)
!1506 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !1507, line: 58, baseType: !1508)
!1507 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1508 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1507, line: 54, size: 128, elements: !1509)
!1509 = !{!1510, !1512}
!1510 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !1508, file: !1507, line: 56, baseType: !1511, size: 64)
!1511 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!1512 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !1508, file: !1507, line: 57, baseType: !1513, size: 64, offset: 64)
!1513 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!1514 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !1460, file: !6, line: 3375, baseType: !1515, size: 256)
!1515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !1516)
!1516 = !{!1517, !1518}
!1517 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1515, file: !6, line: 1398, baseType: !1496, size: 192)
!1518 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !1515, file: !6, line: 1399, baseType: !1519, size: 64, offset: 192)
!1519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1520, size: 64)
!1520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !1521, line: 52, size: 256, elements: !1522)
!1521 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1522 = !{!1523, !1524, !1525, !1526, !1527, !1528, !1529}
!1523 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !1520, file: !1521, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!1524 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !1520, file: !1521, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1525 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !1520, file: !1521, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1526 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !1520, file: !1521, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1527 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !1520, file: !1521, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1528 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !1520, file: !1521, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!1529 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !1520, file: !1521, line: 62, baseType: !1530, size: 192, offset: 64)
!1530 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1511, size: 192, elements: !1531)
!1531 = !{!1532}
!1532 = !DISubrange(count: 3)
!1533 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !1460, file: !6, line: 3376, baseType: !1534, size: 256)
!1534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !1535)
!1535 = !{!1536, !1537}
!1536 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1534, file: !6, line: 1409, baseType: !1496, size: 192)
!1537 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !1534, file: !6, line: 1410, baseType: !1538, size: 64, offset: 192)
!1538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1539, size: 64)
!1539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !1540, line: 27, size: 192, elements: !1541)
!1540 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1541 = !{!1542, !1543}
!1542 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1539, file: !1540, line: 29, baseType: !1506, size: 128)
!1543 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1539, file: !1540, line: 30, baseType: !20, size: 32, offset: 128)
!1544 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !1460, file: !6, line: 3377, baseType: !1545, size: 256)
!1545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !1546)
!1546 = !{!1547, !1548}
!1547 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1545, file: !6, line: 1438, baseType: !1496, size: 192)
!1548 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1545, file: !6, line: 1439, baseType: !1457, size: 64, offset: 192)
!1549 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1460, file: !6, line: 3378, baseType: !1550, size: 256)
!1550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !1551)
!1551 = !{!1552, !1553, !1554}
!1552 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1550, file: !6, line: 1419, baseType: !1496, size: 192)
!1553 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !1550, file: !6, line: 1420, baseType: !1450, size: 32, offset: 192)
!1554 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1550, file: !6, line: 1421, baseType: !1555, size: 8, offset: 224)
!1555 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1453, size: 8, elements: !1556)
!1556 = !{!1557}
!1557 = !DISubrange(count: 1)
!1558 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !1460, file: !6, line: 3379, baseType: !1559, size: 320)
!1559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !1560)
!1560 = !{!1561, !1562, !1563}
!1561 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1559, file: !6, line: 1429, baseType: !1496, size: 192)
!1562 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !1559, file: !6, line: 1430, baseType: !1457, size: 64, offset: 192)
!1563 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !1559, file: !6, line: 1431, baseType: !1457, size: 64, offset: 256)
!1564 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !1460, file: !6, line: 3380, baseType: !1565, size: 320)
!1565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !1566)
!1566 = !{!1567, !1568}
!1567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1565, file: !6, line: 1461, baseType: !1496, size: 192)
!1568 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !1565, file: !6, line: 1462, baseType: !1569, size: 128, offset: 192)
!1569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !1570, line: 31, size: 128, elements: !1571)
!1570 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1571 = !{!1572, !1575, !1576}
!1572 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1569, file: !1570, line: 32, baseType: !1573, size: 64)
!1573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1574, size: 64)
!1574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1449)
!1575 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !1569, file: !1570, line: 33, baseType: !7, size: 32, offset: 64)
!1576 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !1569, file: !1570, line: 34, baseType: !7, size: 32, offset: 96)
!1577 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !1460, file: !6, line: 3381, baseType: !1578, size: 384)
!1578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !1579)
!1579 = !{!1580, !1581, !1586, !1587, !1588}
!1580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1578, file: !6, line: 2508, baseType: !1496, size: 192)
!1581 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1578, file: !6, line: 2509, baseType: !1582, size: 32, offset: 192)
!1582 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !1583, line: 58, baseType: !1584)
!1583 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1584 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !1585, line: 44, baseType: !7)
!1585 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1586 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1578, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!1587 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1578, file: !6, line: 2511, baseType: !1457, size: 64, offset: 256)
!1588 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !1578, file: !6, line: 2512, baseType: !1457, size: 64, offset: 320)
!1589 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !1460, file: !6, line: 3382, baseType: !1590, size: 896)
!1590 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !1591)
!1591 = !{!1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624}
!1592 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1590, file: !6, line: 2653, baseType: !1578, size: 384)
!1593 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1590, file: !6, line: 2654, baseType: !1457, size: 64, offset: 384)
!1594 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !1590, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!1595 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !1590, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!1596 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !1590, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!1597 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !1590, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!1598 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !1590, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!1599 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !1590, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!1600 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !1590, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!1601 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !1590, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!1602 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !1590, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!1603 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !1590, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!1604 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !1590, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!1605 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !1590, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!1606 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !1590, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!1607 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !1590, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!1608 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !1590, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!1609 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !1590, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!1610 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !1590, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!1611 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !1590, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!1612 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !1590, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!1613 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !1590, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!1614 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !1590, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!1615 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !1590, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!1616 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !1590, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!1617 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !1590, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!1618 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !1590, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!1619 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1590, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!1620 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1590, file: !6, line: 2705, baseType: !1457, size: 64, offset: 576)
!1621 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1590, file: !6, line: 2706, baseType: !1457, size: 64, offset: 640)
!1622 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1590, file: !6, line: 2707, baseType: !1457, size: 64, offset: 704)
!1623 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !1590, file: !6, line: 2708, baseType: !1457, size: 64, offset: 768)
!1624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !1590, file: !6, line: 2711, baseType: !1625, size: 64, offset: 832)
!1625 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1626, size: 64)
!1626 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!1627 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !1460, file: !6, line: 3383, baseType: !1628, size: 960)
!1628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !1629)
!1629 = !{!1630, !1631}
!1630 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1628, file: !6, line: 2757, baseType: !1590, size: 896)
!1631 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1628, file: !6, line: 2758, baseType: !1632, size: 64, offset: 896)
!1632 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !1458, line: 50, baseType: !1633)
!1633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1634, size: 64)
!1634 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1458, line: 49, flags: DIFlagFwdDecl)
!1635 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !1460, file: !6, line: 3384, baseType: !1636, size: 1472)
!1636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !1637)
!1637 = !{!1638, !1659, !1660, !1661, !1662}
!1638 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1636, file: !6, line: 3115, baseType: !1639, size: 1216)
!1639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !1640)
!1640 = !{!1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657, !1658}
!1641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1639, file: !6, line: 2985, baseType: !1628, size: 960)
!1642 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1639, file: !6, line: 2986, baseType: !1457, size: 64, offset: 960)
!1643 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1639, file: !6, line: 2987, baseType: !1457, size: 64, offset: 1024)
!1644 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1639, file: !6, line: 2988, baseType: !1457, size: 64, offset: 1088)
!1645 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1639, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1646 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1639, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1647 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1639, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1648 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1639, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1649 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1639, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1650 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1639, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1651 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1639, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1652 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1639, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1653 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1639, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1654 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1639, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1655 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1639, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1656 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1639, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1657 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1639, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1658 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1639, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1659 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1636, file: !6, line: 3117, baseType: !1457, size: 64, offset: 1216)
!1660 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1636, file: !6, line: 3119, baseType: !1457, size: 64, offset: 1280)
!1661 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1636, file: !6, line: 3121, baseType: !1457, size: 64, offset: 1344)
!1662 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1636, file: !6, line: 3123, baseType: !1457, size: 64, offset: 1408)
!1663 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !1460, file: !6, line: 3385, baseType: !1664, size: 1088)
!1664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !1665)
!1665 = !{!1666, !1667, !1668}
!1666 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1664, file: !6, line: 2875, baseType: !1628, size: 960)
!1667 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1664, file: !6, line: 2876, baseType: !1632, size: 64, offset: 960)
!1668 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1664, file: !6, line: 2877, baseType: !1669, size: 64, offset: 1024)
!1669 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1670, size: 64)
!1670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1671, line: 172, size: 128, elements: !1672)
!1671 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1672 = !{!1673, !1674, !1675, !1676, !1677, !1678, !1679}
!1673 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1670, file: !1671, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1674 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1670, file: !1671, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1675 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1670, file: !1671, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1676 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1670, file: !1671, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1677 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1670, file: !1671, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1678 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1670, file: !1671, line: 195, baseType: !7, size: 32, offset: 32)
!1679 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1670, file: !1671, line: 199, baseType: !1457, size: 64, offset: 64)
!1680 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !1460, file: !6, line: 3386, baseType: !1639, size: 1216)
!1681 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !1460, file: !6, line: 3387, baseType: !1682, size: 1280)
!1682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !1683)
!1683 = !{!1684, !1685}
!1684 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1682, file: !6, line: 3094, baseType: !1639, size: 1216)
!1685 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1682, file: !6, line: 3095, baseType: !1669, size: 64, offset: 1216)
!1686 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !1460, file: !6, line: 3388, baseType: !1687, size: 1216)
!1687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !1688)
!1688 = !{!1689, !1690, !1691, !1692, !1693, !1694}
!1689 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1687, file: !6, line: 2825, baseType: !1590, size: 896)
!1690 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1687, file: !6, line: 2827, baseType: !1457, size: 64, offset: 896)
!1691 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1687, file: !6, line: 2828, baseType: !1457, size: 64, offset: 960)
!1692 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1687, file: !6, line: 2829, baseType: !1457, size: 64, offset: 1024)
!1693 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1687, file: !6, line: 2830, baseType: !1457, size: 64, offset: 1088)
!1694 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1687, file: !6, line: 2831, baseType: !1457, size: 64, offset: 1152)
!1695 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !1460, file: !6, line: 3389, baseType: !1696, size: 1024)
!1696 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !1697)
!1697 = !{!1698, !1699, !1700}
!1698 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1696, file: !6, line: 2851, baseType: !1628, size: 960)
!1699 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1696, file: !6, line: 2852, baseType: !1450, size: 32, offset: 960)
!1700 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1696, file: !6, line: 2853, baseType: !1450, size: 32, offset: 992)
!1701 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !1460, file: !6, line: 3390, baseType: !1702, size: 1024)
!1702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !1703)
!1703 = !{!1704, !1705}
!1704 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1702, file: !6, line: 2858, baseType: !1628, size: 960)
!1705 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1702, file: !6, line: 2859, baseType: !1669, size: 64, offset: 960)
!1706 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !1460, file: !6, line: 3391, baseType: !1707, size: 960)
!1707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !1708)
!1708 = !{!1709}
!1709 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1707, file: !6, line: 2863, baseType: !1628, size: 960)
!1710 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !1460, file: !6, line: 3392, baseType: !1711, size: 1472)
!1711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !1712)
!1712 = !{!1713}
!1713 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1711, file: !6, line: 3305, baseType: !1636, size: 1472)
!1714 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !1460, file: !6, line: 3393, baseType: !1715, size: 1792)
!1715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !1716)
!1716 = !{!1717, !1718, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390, !2391, !2392, !2393}
!1717 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1715, file: !6, line: 3249, baseType: !1636, size: 1472)
!1718 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1715, file: !6, line: 3251, baseType: !1719, size: 64, offset: 1472)
!1719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1720, size: 64)
!1720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1721, line: 463, size: 1152, elements: !1722)
!1721 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1722 = !{!1723, !1887, !2201, !2202, !2314, !2317, !2318, !2319, !2320, !2321, !2322, !2346, !2349, !2350, !2351, !2352, !2353, !2354, !2355, !2356, !2357, !2358, !2359, !2360, !2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372}
!1723 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1720, file: !1721, line: 464, baseType: !1724, size: 64)
!1724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1725, size: 64)
!1725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !149, line: 194, size: 384, elements: !1726)
!1726 = !{!1727, !1776, !1789, !1803, !1855, !1868}
!1727 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1725, file: !149, line: 197, baseType: !1728, size: 64)
!1728 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !149, line: 182, baseType: !1729)
!1729 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1730, size: 64)
!1730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !149, line: 116, size: 704, elements: !1731)
!1731 = !{!1732, !1733, !1734, !1735, !1736, !1737, !1764, !1773, !1774, !1775}
!1732 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1730, file: !149, line: 119, baseType: !1729, size: 64)
!1733 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1730, file: !149, line: 122, baseType: !1729, size: 64, offset: 64)
!1734 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1730, file: !149, line: 123, baseType: !1729, size: 64, offset: 128)
!1735 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1730, file: !149, line: 126, baseType: !1450, size: 32, offset: 192)
!1736 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1730, file: !149, line: 129, baseType: !148, size: 32, offset: 224)
!1737 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1730, file: !149, line: 165, baseType: !1738, size: 192, offset: 256)
!1738 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !149, line: 132, size: 192, elements: !1739)
!1739 = !{!1740, !1753, !1759}
!1740 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1738, file: !149, line: 137, baseType: !1741, size: 128)
!1741 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !149, line: 133, size: 128, elements: !1742)
!1742 = !{!1743, !1752}
!1743 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1741, file: !149, line: 135, baseType: !1744, size: 64)
!1744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1745, size: 64)
!1745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !149, line: 93, size: 320, elements: !1746)
!1746 = !{!1747, !1748, !1749, !1750, !1751}
!1747 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1745, file: !149, line: 96, baseType: !1744, size: 64)
!1748 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1745, file: !149, line: 97, baseType: !1744, size: 64, offset: 64)
!1749 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1745, file: !149, line: 101, baseType: !1457, size: 64, offset: 128)
!1750 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1745, file: !149, line: 106, baseType: !1457, size: 64, offset: 192)
!1751 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1745, file: !149, line: 111, baseType: !1457, size: 64, offset: 256)
!1752 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1741, file: !149, line: 136, baseType: !1744, size: 64, offset: 64)
!1753 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1738, file: !149, line: 151, baseType: !1754, size: 192)
!1754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !149, line: 139, size: 192, elements: !1755)
!1755 = !{!1756, !1757, !1758}
!1756 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1754, file: !149, line: 141, baseType: !1457, size: 64)
!1757 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1754, file: !149, line: 145, baseType: !1457, size: 64, offset: 64)
!1758 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1754, file: !149, line: 150, baseType: !1450, size: 32, offset: 128)
!1759 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1738, file: !149, line: 164, baseType: !1760, size: 128)
!1760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !149, line: 153, size: 128, elements: !1761)
!1761 = !{!1762, !1763}
!1762 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1760, file: !149, line: 161, baseType: !1457, size: 64)
!1763 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1760, file: !149, line: 163, baseType: !1582, size: 32, offset: 64)
!1764 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1730, file: !149, line: 168, baseType: !1765, size: 64, offset: 448)
!1765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1766, size: 64)
!1766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !149, line: 67, size: 320, elements: !1767)
!1767 = !{!1768, !1769, !1770, !1771, !1772}
!1768 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1766, file: !149, line: 70, baseType: !1765, size: 64)
!1769 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1766, file: !149, line: 73, baseType: !1729, size: 64, offset: 64)
!1770 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1766, file: !149, line: 78, baseType: !1457, size: 64, offset: 128)
!1771 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1766, file: !149, line: 85, baseType: !1632, size: 64, offset: 192)
!1772 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1766, file: !149, line: 88, baseType: !1450, size: 32, offset: 256)
!1773 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1730, file: !149, line: 173, baseType: !1632, size: 64, offset: 512)
!1774 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1730, file: !149, line: 173, baseType: !1632, size: 64, offset: 576)
!1775 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1730, file: !149, line: 177, baseType: !1449, size: 8, offset: 640)
!1776 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1725, file: !149, line: 200, baseType: !1777, size: 64, offset: 64)
!1777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1778, size: 64)
!1778 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !149, line: 185, baseType: !1779)
!1779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !149, line: 185, size: 128, elements: !1780)
!1780 = !{!1781}
!1781 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1779, file: !149, line: 185, baseType: !1782, size: 128)
!1782 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_base", file: !149, line: 184, baseType: !1783)
!1783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_base", file: !149, line: 184, size: 128, elements: !1784)
!1784 = !{!1785, !1786, !1787}
!1785 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1783, file: !149, line: 184, baseType: !7, size: 32)
!1786 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1783, file: !149, line: 184, baseType: !7, size: 32, offset: 32)
!1787 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1783, file: !149, line: 184, baseType: !1788, size: 64, offset: 64)
!1788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1728, size: 64, elements: !1556)
!1789 = !DIDerivedType(tag: DW_TAG_member, name: "lp_array", scope: !1725, file: !149, line: 203, baseType: !1790, size: 64, offset: 128)
!1790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1791, size: 64)
!1791 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_gc", file: !149, line: 189, baseType: !1792)
!1792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_gc", file: !149, line: 189, size: 128, elements: !1793)
!1793 = !{!1794}
!1794 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1792, file: !149, line: 189, baseType: !1795, size: 128)
!1795 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_landing_pad_base", file: !149, line: 188, baseType: !1796)
!1796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_landing_pad_base", file: !149, line: 188, size: 128, elements: !1797)
!1797 = !{!1798, !1799, !1800}
!1798 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1796, file: !149, line: 188, baseType: !7, size: 32)
!1799 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1796, file: !149, line: 188, baseType: !7, size: 32, offset: 32)
!1800 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1796, file: !149, line: 188, baseType: !1801, size: 64, offset: 64)
!1801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1802, size: 64, elements: !1556)
!1802 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_landing_pad", file: !149, line: 180, baseType: !1765)
!1803 = !DIDerivedType(tag: DW_TAG_member, name: "throw_stmt_table", scope: !1725, file: !149, line: 207, baseType: !1804, size: 64, offset: 192)
!1804 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1805, line: 144, baseType: !1806)
!1805 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1806 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1807, size: 64)
!1807 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1805, line: 100, size: 896, elements: !1808)
!1808 = !{!1809, !1817, !1822, !1827, !1829, !1832, !1833, !1834, !1835, !1836, !1841, !1843, !1844, !1849, !1854}
!1809 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1807, file: !1805, line: 102, baseType: !1810, size: 64)
!1810 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1805, line: 52, baseType: !1811)
!1811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1812, size: 64)
!1812 = !DISubroutineType(types: !1813)
!1813 = !{!1814, !1815}
!1814 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1805, line: 47, baseType: !7)
!1815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1816, size: 64)
!1816 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1817 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1807, file: !1805, line: 105, baseType: !1818, size: 64, offset: 64)
!1818 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1805, line: 59, baseType: !1819)
!1819 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1820, size: 64)
!1820 = !DISubroutineType(types: !1821)
!1821 = !{!1450, !1815, !1815}
!1822 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1807, file: !1805, line: 108, baseType: !1823, size: 64, offset: 128)
!1823 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1805, line: 63, baseType: !1824)
!1824 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1825, size: 64)
!1825 = !DISubroutineType(types: !1826)
!1826 = !{null, !1454}
!1827 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1807, file: !1805, line: 111, baseType: !1828, size: 64, offset: 192)
!1828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1829 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1807, file: !1805, line: 114, baseType: !1830, size: 64, offset: 256)
!1830 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1831, line: 46, baseType: !1511)
!1831 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1832 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1807, file: !1805, line: 117, baseType: !1830, size: 64, offset: 320)
!1833 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1807, file: !1805, line: 120, baseType: !1830, size: 64, offset: 384)
!1834 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1807, file: !1805, line: 124, baseType: !7, size: 32, offset: 448)
!1835 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1807, file: !1805, line: 128, baseType: !7, size: 32, offset: 480)
!1836 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1807, file: !1805, line: 131, baseType: !1837, size: 64, offset: 512)
!1837 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1805, line: 75, baseType: !1838)
!1838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1839, size: 64)
!1839 = !DISubroutineType(types: !1840)
!1840 = !{!1454, !1830, !1830}
!1841 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1807, file: !1805, line: 132, baseType: !1842, size: 64, offset: 576)
!1842 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1805, line: 78, baseType: !1824)
!1843 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1807, file: !1805, line: 135, baseType: !1454, size: 64, offset: 640)
!1844 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1807, file: !1805, line: 136, baseType: !1845, size: 64, offset: 704)
!1845 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1805, line: 82, baseType: !1846)
!1846 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1847, size: 64)
!1847 = !DISubroutineType(types: !1848)
!1848 = !{!1454, !1454, !1830, !1830}
!1849 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1807, file: !1805, line: 137, baseType: !1850, size: 64, offset: 768)
!1850 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1805, line: 83, baseType: !1851)
!1851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1852, size: 64)
!1852 = !DISubroutineType(types: !1853)
!1853 = !{null, !1454, !1454}
!1854 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1807, file: !1805, line: 141, baseType: !7, size: 32, offset: 832)
!1855 = !DIDerivedType(tag: DW_TAG_member, name: "ttype_data", scope: !1725, file: !149, line: 211, baseType: !1856, size: 64, offset: 256)
!1856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1857, size: 64)
!1857 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !1858)
!1858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !1859)
!1859 = !{!1860}
!1860 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1858, file: !6, line: 183, baseType: !1861, size: 128)
!1861 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !1862)
!1862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !1863)
!1863 = !{!1864, !1865, !1866}
!1864 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1862, file: !6, line: 182, baseType: !7, size: 32)
!1865 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1862, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!1866 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1862, file: !6, line: 182, baseType: !1867, size: 64, offset: 64)
!1867 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1457, size: 64, elements: !1556)
!1868 = !DIDerivedType(tag: DW_TAG_member, name: "ehspec_data", scope: !1725, file: !149, line: 220, baseType: !1869, size: 64, offset: 320)
!1869 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_status_u", file: !149, line: 217, size: 64, elements: !1870)
!1870 = !{!1871, !1872}
!1871 = !DIDerivedType(tag: DW_TAG_member, name: "arm_eabi", scope: !1869, file: !149, line: 218, baseType: !1856, size: 64)
!1872 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !1869, file: !149, line: 219, baseType: !1873, size: 64)
!1873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1874, size: 64)
!1874 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_gc", file: !1875, line: 29, baseType: !1876)
!1875 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_gc", file: !1875, line: 29, size: 96, elements: !1877)
!1877 = !{!1878}
!1878 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1876, file: !1875, line: 29, baseType: !1879, size: 96)
!1879 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_uchar_base", file: !1875, line: 27, baseType: !1880)
!1880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_uchar_base", file: !1875, line: 27, size: 96, elements: !1881)
!1881 = !{!1882, !1883, !1884}
!1882 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1880, file: !1875, line: 27, baseType: !7, size: 32)
!1883 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1880, file: !1875, line: 27, baseType: !7, size: 32, offset: 32)
!1884 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1880, file: !1875, line: 27, baseType: !1885, size: 8, offset: 64)
!1885 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1886, size: 8, elements: !1556)
!1886 = !DIDerivedType(tag: DW_TAG_typedef, name: "uchar", file: !1875, line: 26, baseType: !1449)
!1887 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1720, file: !1721, line: 467, baseType: !1888, size: 64, offset: 64)
!1888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1889, size: 64)
!1889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !350, line: 374, size: 640, elements: !1890)
!1890 = !{!1891, !2176, !2177, !2190, !2191, !2192, !2193, !2194, !2195, !2197, !2199, !2200}
!1891 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1889, file: !350, line: 377, baseType: !1892, size: 64)
!1892 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !1458, line: 111, baseType: !1893)
!1893 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1894, size: 64)
!1894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !350, line: 217, size: 832, elements: !1895)
!1895 = !{!1896, !2139, !2140, !2141, !2144, !2150, !2151, !2152, !2170, !2171, !2172, !2173, !2174, !2175}
!1896 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !1894, file: !350, line: 219, baseType: !1897, size: 64)
!1897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1898, size: 64)
!1898 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !350, line: 151, baseType: !1899)
!1899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !350, line: 151, size: 128, elements: !1900)
!1900 = !{!1901}
!1901 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1899, file: !350, line: 151, baseType: !1902, size: 128)
!1902 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !350, line: 150, baseType: !1903)
!1903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !350, line: 150, size: 128, elements: !1904)
!1904 = !{!1905, !1906, !1907}
!1905 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1903, file: !350, line: 150, baseType: !7, size: 32)
!1906 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1903, file: !350, line: 150, baseType: !7, size: 32, offset: 32)
!1907 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1903, file: !350, line: 150, baseType: !1908, size: 64, offset: 64)
!1908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1909, size: 64, elements: !1556)
!1909 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !1458, line: 108, baseType: !1910)
!1910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1911, size: 64)
!1911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !350, line: 122, size: 512, elements: !1912)
!1912 = !{!1913, !1914, !1915, !2131, !2132, !2133, !2134, !2135, !2136, !2137}
!1913 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1911, file: !350, line: 124, baseType: !1893, size: 64)
!1914 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1911, file: !350, line: 125, baseType: !1893, size: 64, offset: 64)
!1915 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1911, file: !350, line: 131, baseType: !1916, size: 64, offset: 128)
!1916 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !350, line: 128, size: 64, elements: !1917)
!1917 = !{!1918, !2130}
!1918 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1916, file: !350, line: 129, baseType: !1919, size: 64)
!1919 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !1458, line: 66, baseType: !1920)
!1920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1921, size: 64)
!1921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !1383, line: 143, size: 192, elements: !1922)
!1922 = !{!1923, !2128, !2129}
!1923 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1921, file: !1383, line: 145, baseType: !1924, size: 64)
!1924 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !1458, line: 69, baseType: !1925)
!1925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1926, size: 64)
!1926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !1383, line: 136, size: 192, elements: !1927)
!1927 = !{!1928, !2126, !2127}
!1928 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1926, file: !1383, line: 137, baseType: !1929, size: 64)
!1929 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !1458, line: 58, baseType: !1930)
!1930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1931, size: 64)
!1931 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !1383, line: 737, size: 768, elements: !1932)
!1932 = !{!1933, !1950, !1983, !1989, !1994, !1999, !2006, !2012, !2018, !2023, !2037, !2042, !2048, !2053, !2063, !2068, !2084, !2091, !2098, !2104, !2109, !2115, !2121}
!1933 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1931, file: !1383, line: 738, baseType: !1934, size: 256)
!1934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !1383, line: 271, size: 256, elements: !1935)
!1935 = !{!1936, !1937, !1938, !1939, !1940, !1941, !1942, !1943, !1944, !1945, !1946, !1947, !1948, !1949}
!1936 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1934, file: !1383, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1937 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1934, file: !1383, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1938 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1934, file: !1383, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1939 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1934, file: !1383, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1940 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1934, file: !1383, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1941 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1934, file: !1383, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1942 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1934, file: !1383, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1943 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1934, file: !1383, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1944 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1934, file: !1383, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1945 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1934, file: !1383, line: 312, baseType: !7, size: 32, offset: 32)
!1946 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1934, file: !1383, line: 316, baseType: !1582, size: 32, offset: 64)
!1947 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1934, file: !1383, line: 319, baseType: !7, size: 32, offset: 96)
!1948 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1934, file: !1383, line: 323, baseType: !1893, size: 64, offset: 128)
!1949 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1934, file: !1383, line: 327, baseType: !1457, size: 64, offset: 192)
!1950 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1931, file: !1383, line: 739, baseType: !1951, size: 448)
!1951 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !1383, line: 350, size: 448, elements: !1952)
!1952 = !{!1953, !1982}
!1953 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1951, file: !1383, line: 353, baseType: !1954, size: 384)
!1954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !1383, line: 333, size: 384, elements: !1955)
!1955 = !{!1956, !1957, !1965}
!1956 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1954, file: !1383, line: 336, baseType: !1934, size: 256)
!1957 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1954, file: !1383, line: 343, baseType: !1958, size: 64, offset: 256)
!1958 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1959, size: 64)
!1959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1960, line: 37, size: 128, elements: !1961)
!1960 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1961 = !{!1962, !1963}
!1962 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1959, file: !1960, line: 39, baseType: !1958, size: 64)
!1963 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1959, file: !1960, line: 40, baseType: !1964, size: 64, offset: 64)
!1964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1457, size: 64)
!1965 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1954, file: !1383, line: 344, baseType: !1966, size: 64, offset: 320)
!1966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1967, size: 64)
!1967 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1960, line: 45, size: 320, elements: !1968)
!1968 = !{!1969, !1970}
!1969 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1967, file: !1960, line: 47, baseType: !1966, size: 64)
!1970 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1967, file: !1960, line: 48, baseType: !1971, size: 256, offset: 64)
!1971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !1972)
!1972 = !{!1973, !1975, !1976, !1981}
!1973 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1971, file: !6, line: 1884, baseType: !1974, size: 64)
!1974 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1971, size: 64)
!1975 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1971, file: !6, line: 1885, baseType: !1974, size: 64, offset: 64)
!1976 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1971, file: !6, line: 1891, baseType: !1977, size: 64, offset: 128)
!1977 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1971, file: !6, line: 1891, size: 64, elements: !1978)
!1978 = !{!1979, !1980}
!1979 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1977, file: !6, line: 1891, baseType: !1929, size: 64)
!1980 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1977, file: !6, line: 1891, baseType: !1457, size: 64)
!1981 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1971, file: !6, line: 1892, baseType: !1964, size: 64, offset: 192)
!1982 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1951, file: !1383, line: 359, baseType: !1867, size: 64, offset: 384)
!1983 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1931, file: !1383, line: 740, baseType: !1984, size: 512)
!1984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !1383, line: 365, size: 512, elements: !1985)
!1985 = !{!1986, !1987, !1988}
!1986 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1984, file: !1383, line: 368, baseType: !1954, size: 384)
!1987 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1984, file: !1383, line: 373, baseType: !1457, size: 64, offset: 384)
!1988 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1984, file: !1383, line: 374, baseType: !1457, size: 64, offset: 448)
!1989 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1931, file: !1383, line: 741, baseType: !1990, size: 576)
!1990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !1383, line: 380, size: 576, elements: !1991)
!1991 = !{!1992, !1993}
!1992 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1990, file: !1383, line: 383, baseType: !1984, size: 512)
!1993 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1990, file: !1383, line: 389, baseType: !1867, size: 64, offset: 512)
!1994 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1931, file: !1383, line: 742, baseType: !1995, size: 320)
!1995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !1383, line: 395, size: 320, elements: !1996)
!1996 = !{!1997, !1998}
!1997 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1995, file: !1383, line: 397, baseType: !1934, size: 256)
!1998 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1995, file: !1383, line: 400, baseType: !1919, size: 64, offset: 256)
!1999 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1931, file: !1383, line: 743, baseType: !2000, size: 448)
!2000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !1383, line: 406, size: 448, elements: !2001)
!2001 = !{!2002, !2003, !2004, !2005}
!2002 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2000, file: !1383, line: 408, baseType: !1934, size: 256)
!2003 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2000, file: !1383, line: 412, baseType: !1457, size: 64, offset: 256)
!2004 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2000, file: !1383, line: 420, baseType: !1457, size: 64, offset: 320)
!2005 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2000, file: !1383, line: 423, baseType: !1919, size: 64, offset: 384)
!2006 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1931, file: !1383, line: 744, baseType: !2007, size: 384)
!2007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !1383, line: 429, size: 384, elements: !2008)
!2008 = !{!2009, !2010, !2011}
!2009 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2007, file: !1383, line: 431, baseType: !1934, size: 256)
!2010 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2007, file: !1383, line: 434, baseType: !1457, size: 64, offset: 256)
!2011 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !2007, file: !1383, line: 437, baseType: !1919, size: 64, offset: 320)
!2012 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1931, file: !1383, line: 745, baseType: !2013, size: 384)
!2013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !1383, line: 443, size: 384, elements: !2014)
!2014 = !{!2015, !2016, !2017}
!2015 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2013, file: !1383, line: 445, baseType: !1934, size: 256)
!2016 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2013, file: !1383, line: 449, baseType: !1457, size: 64, offset: 256)
!2017 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !2013, file: !1383, line: 453, baseType: !1919, size: 64, offset: 320)
!2018 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1931, file: !1383, line: 746, baseType: !2019, size: 320)
!2019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !1383, line: 459, size: 320, elements: !2020)
!2020 = !{!2021, !2022}
!2021 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2019, file: !1383, line: 461, baseType: !1934, size: 256)
!2022 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !2019, file: !1383, line: 464, baseType: !1457, size: 64, offset: 256)
!2023 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1931, file: !1383, line: 747, baseType: !2024, size: 768)
!2024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !1383, line: 469, size: 768, elements: !2025)
!2025 = !{!2026, !2027, !2028, !2029, !2030}
!2026 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2024, file: !1383, line: 471, baseType: !1934, size: 256)
!2027 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !2024, file: !1383, line: 474, baseType: !7, size: 32, offset: 256)
!2028 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !2024, file: !1383, line: 475, baseType: !7, size: 32, offset: 288)
!2029 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2024, file: !1383, line: 478, baseType: !1457, size: 64, offset: 320)
!2030 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !2024, file: !1383, line: 481, baseType: !2031, size: 384, offset: 384)
!2031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2032, size: 384, elements: !1556)
!2032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !2033)
!2033 = !{!2034, !2035, !2036}
!2034 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !2032, file: !6, line: 1920, baseType: !1971, size: 256)
!2035 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !2032, file: !6, line: 1921, baseType: !1457, size: 64, offset: 256)
!2036 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2032, file: !6, line: 1922, baseType: !1582, size: 32, offset: 320)
!2037 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1931, file: !1383, line: 748, baseType: !2038, size: 320)
!2038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !1383, line: 487, size: 320, elements: !2039)
!2039 = !{!2040, !2041}
!2040 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2038, file: !1383, line: 490, baseType: !1934, size: 256)
!2041 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2038, file: !1383, line: 494, baseType: !1450, size: 32, offset: 256)
!2042 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1931, file: !1383, line: 749, baseType: !2043, size: 384)
!2043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !1383, line: 500, size: 384, elements: !2044)
!2044 = !{!2045, !2046, !2047}
!2045 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2043, file: !1383, line: 502, baseType: !1934, size: 256)
!2046 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !2043, file: !1383, line: 506, baseType: !1919, size: 64, offset: 256)
!2047 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2043, file: !1383, line: 510, baseType: !1919, size: 64, offset: 320)
!2048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1931, file: !1383, line: 750, baseType: !2049, size: 320)
!2049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !1383, line: 529, size: 320, elements: !2050)
!2050 = !{!2051, !2052}
!2051 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2049, file: !1383, line: 531, baseType: !1934, size: 256)
!2052 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2049, file: !1383, line: 540, baseType: !1919, size: 64, offset: 256)
!2053 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1931, file: !1383, line: 751, baseType: !2054, size: 704)
!2054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !1383, line: 546, size: 704, elements: !2055)
!2055 = !{!2056, !2057, !2058, !2059, !2060, !2061, !2062}
!2056 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2054, file: !1383, line: 549, baseType: !1984, size: 512)
!2057 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2054, file: !1383, line: 553, baseType: !1455, size: 64, offset: 512)
!2058 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !2054, file: !1383, line: 557, baseType: !1449, size: 8, offset: 576)
!2059 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !2054, file: !1383, line: 558, baseType: !1449, size: 8, offset: 584)
!2060 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !2054, file: !1383, line: 559, baseType: !1449, size: 8, offset: 592)
!2061 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !2054, file: !1383, line: 560, baseType: !1449, size: 8, offset: 600)
!2062 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2054, file: !1383, line: 566, baseType: !1867, size: 64, offset: 640)
!2063 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1931, file: !1383, line: 752, baseType: !2064, size: 384)
!2064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !1383, line: 571, size: 384, elements: !2065)
!2065 = !{!2066, !2067}
!2066 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2064, file: !1383, line: 573, baseType: !1995, size: 320)
!2067 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2064, file: !1383, line: 577, baseType: !1457, size: 64, offset: 320)
!2068 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1931, file: !1383, line: 753, baseType: !2069, size: 576)
!2069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !1383, line: 600, size: 576, elements: !2070)
!2070 = !{!2071, !2072, !2073, !2074, !2083}
!2071 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2069, file: !1383, line: 602, baseType: !1995, size: 320)
!2072 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2069, file: !1383, line: 605, baseType: !1457, size: 64, offset: 320)
!2073 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !2069, file: !1383, line: 609, baseType: !1830, size: 64, offset: 384)
!2074 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !2069, file: !1383, line: 612, baseType: !2075, size: 64, offset: 448)
!2075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2076, size: 64)
!2076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !1383, line: 581, size: 320, elements: !2077)
!2077 = !{!2078, !2079, !2080, !2081, !2082}
!2078 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !2076, file: !1383, line: 583, baseType: !155, size: 32)
!2079 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2076, file: !1383, line: 586, baseType: !1457, size: 64, offset: 64)
!2080 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2076, file: !1383, line: 589, baseType: !1457, size: 64, offset: 128)
!2081 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !2076, file: !1383, line: 592, baseType: !1457, size: 64, offset: 192)
!2082 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !2076, file: !1383, line: 595, baseType: !1457, size: 64, offset: 256)
!2083 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !2069, file: !1383, line: 616, baseType: !1919, size: 64, offset: 512)
!2084 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1931, file: !1383, line: 754, baseType: !2085, size: 512)
!2085 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !1383, line: 622, size: 512, elements: !2086)
!2086 = !{!2087, !2088, !2089, !2090}
!2087 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2085, file: !1383, line: 624, baseType: !1995, size: 320)
!2088 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2085, file: !1383, line: 628, baseType: !1457, size: 64, offset: 320)
!2089 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !2085, file: !1383, line: 632, baseType: !1457, size: 64, offset: 384)
!2090 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !2085, file: !1383, line: 636, baseType: !1457, size: 64, offset: 448)
!2091 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1931, file: !1383, line: 755, baseType: !2092, size: 704)
!2092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !1383, line: 642, size: 704, elements: !2093)
!2093 = !{!2094, !2095, !2096, !2097}
!2094 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !2092, file: !1383, line: 644, baseType: !2085, size: 512)
!2095 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !2092, file: !1383, line: 648, baseType: !1457, size: 64, offset: 512)
!2096 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !2092, file: !1383, line: 652, baseType: !1457, size: 64, offset: 576)
!2097 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !2092, file: !1383, line: 653, baseType: !1457, size: 64, offset: 640)
!2098 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1931, file: !1383, line: 756, baseType: !2099, size: 448)
!2099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !1383, line: 663, size: 448, elements: !2100)
!2100 = !{!2101, !2102, !2103}
!2101 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2099, file: !1383, line: 665, baseType: !1995, size: 320)
!2102 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2099, file: !1383, line: 668, baseType: !1457, size: 64, offset: 320)
!2103 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !2099, file: !1383, line: 673, baseType: !1457, size: 64, offset: 384)
!2104 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1931, file: !1383, line: 757, baseType: !2105, size: 384)
!2105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !1383, line: 694, size: 384, elements: !2106)
!2106 = !{!2107, !2108}
!2107 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2105, file: !1383, line: 696, baseType: !1995, size: 320)
!2108 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2105, file: !1383, line: 699, baseType: !1457, size: 64, offset: 320)
!2109 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1931, file: !1383, line: 758, baseType: !2110, size: 384)
!2110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !1383, line: 681, size: 384, elements: !2111)
!2111 = !{!2112, !2113, !2114}
!2112 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2110, file: !1383, line: 683, baseType: !1934, size: 256)
!2113 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !2110, file: !1383, line: 686, baseType: !1457, size: 64, offset: 256)
!2114 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !2110, file: !1383, line: 689, baseType: !1457, size: 64, offset: 320)
!2115 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1931, file: !1383, line: 759, baseType: !2116, size: 384)
!2116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !1383, line: 707, size: 384, elements: !2117)
!2117 = !{!2118, !2119, !2120}
!2118 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2116, file: !1383, line: 709, baseType: !1934, size: 256)
!2119 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !2116, file: !1383, line: 712, baseType: !1457, size: 64, offset: 256)
!2120 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !2116, file: !1383, line: 712, baseType: !1457, size: 64, offset: 320)
!2121 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1931, file: !1383, line: 760, baseType: !2122, size: 320)
!2122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !1383, line: 718, size: 320, elements: !2123)
!2123 = !{!2124, !2125}
!2124 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2122, file: !1383, line: 720, baseType: !1934, size: 256)
!2125 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !2122, file: !1383, line: 723, baseType: !1457, size: 64, offset: 256)
!2126 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1926, file: !1383, line: 138, baseType: !1925, size: 64, offset: 64)
!2127 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1926, file: !1383, line: 139, baseType: !1925, size: 64, offset: 128)
!2128 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1921, file: !1383, line: 146, baseType: !1924, size: 64, offset: 64)
!2129 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1921, file: !1383, line: 152, baseType: !1919, size: 64, offset: 128)
!2130 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1916, file: !350, line: 130, baseType: !1632, size: 64)
!2131 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1911, file: !350, line: 134, baseType: !1454, size: 64, offset: 192)
!2132 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1911, file: !350, line: 137, baseType: !1457, size: 64, offset: 256)
!2133 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1911, file: !350, line: 138, baseType: !1582, size: 32, offset: 320)
!2134 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1911, file: !350, line: 142, baseType: !7, size: 32, offset: 352)
!2135 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1911, file: !350, line: 144, baseType: !1450, size: 32, offset: 384)
!2136 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1911, file: !350, line: 145, baseType: !1450, size: 32, offset: 416)
!2137 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1911, file: !350, line: 146, baseType: !2138, size: 64, offset: 448)
!2138 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !350, line: 119, baseType: !1513)
!2139 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !1894, file: !350, line: 220, baseType: !1897, size: 64, offset: 64)
!2140 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1894, file: !350, line: 223, baseType: !1454, size: 64, offset: 128)
!2141 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !1894, file: !350, line: 226, baseType: !2142, size: 64, offset: 192)
!2142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2143, size: 64)
!2143 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !350, line: 185, flags: DIFlagFwdDecl)
!2144 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !1894, file: !350, line: 229, baseType: !2145, size: 128, offset: 256)
!2145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2146, size: 128, elements: !2148)
!2146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2147, size: 64)
!2147 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !350, line: 229, flags: DIFlagFwdDecl)
!2148 = !{!2149}
!2149 = !DISubrange(count: 2)
!2150 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !1894, file: !350, line: 232, baseType: !1893, size: 64, offset: 384)
!2151 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !1894, file: !350, line: 233, baseType: !1893, size: 64, offset: 448)
!2152 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !1894, file: !350, line: 238, baseType: !2153, size: 64, offset: 512)
!2153 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !350, line: 235, size: 64, elements: !2154)
!2154 = !{!2155, !2161}
!2155 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2153, file: !350, line: 236, baseType: !2156, size: 64)
!2156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2157, size: 64)
!2157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !350, line: 273, size: 128, elements: !2158)
!2158 = !{!2159, !2160}
!2159 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2157, file: !350, line: 275, baseType: !1919, size: 64)
!2160 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2157, file: !350, line: 278, baseType: !1919, size: 64, offset: 64)
!2161 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2153, file: !350, line: 237, baseType: !2162, size: 64)
!2162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2163, size: 64)
!2163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !350, line: 259, size: 320, elements: !2164)
!2164 = !{!2165, !2166, !2167, !2168, !2169}
!2165 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2163, file: !350, line: 261, baseType: !1632, size: 64)
!2166 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2163, file: !350, line: 262, baseType: !1632, size: 64, offset: 64)
!2167 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2163, file: !350, line: 266, baseType: !1632, size: 64, offset: 128)
!2168 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2163, file: !350, line: 267, baseType: !1632, size: 64, offset: 192)
!2169 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2163, file: !350, line: 270, baseType: !1450, size: 32, offset: 256)
!2170 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1894, file: !350, line: 241, baseType: !2138, size: 64, offset: 576)
!2171 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1894, file: !350, line: 244, baseType: !1450, size: 32, offset: 640)
!2172 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !1894, file: !350, line: 247, baseType: !1450, size: 32, offset: 672)
!2173 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !1894, file: !350, line: 250, baseType: !1450, size: 32, offset: 704)
!2174 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !1894, file: !350, line: 253, baseType: !1450, size: 32, offset: 736)
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1894, file: !350, line: 256, baseType: !1450, size: 32, offset: 768)
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1889, file: !350, line: 378, baseType: !1892, size: 64, offset: 64)
!2177 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1889, file: !350, line: 381, baseType: !2178, size: 64, offset: 128)
!2178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2179, size: 64)
!2179 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !350, line: 282, baseType: !2180)
!2180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !350, line: 282, size: 128, elements: !2181)
!2181 = !{!2182}
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2180, file: !350, line: 282, baseType: !2183, size: 128)
!2183 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !350, line: 281, baseType: !2184)
!2184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !350, line: 281, size: 128, elements: !2185)
!2185 = !{!2186, !2187, !2188}
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2184, file: !350, line: 281, baseType: !7, size: 32)
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2184, file: !350, line: 281, baseType: !7, size: 32, offset: 32)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2184, file: !350, line: 281, baseType: !2189, size: 64, offset: 64)
!2189 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1892, size: 64, elements: !1556)
!2190 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1889, file: !350, line: 384, baseType: !1450, size: 32, offset: 192)
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1889, file: !350, line: 387, baseType: !1450, size: 32, offset: 224)
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1889, file: !350, line: 390, baseType: !1450, size: 32, offset: 256)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1889, file: !350, line: 394, baseType: !2178, size: 64, offset: 320)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1889, file: !350, line: 396, baseType: !349, size: 32, offset: 384)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1889, file: !350, line: 399, baseType: !2196, size: 64, offset: 416)
!2196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !355, size: 64, elements: !2148)
!2197 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1889, file: !350, line: 402, baseType: !2198, size: 64, offset: 480)
!2198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !2148)
!2199 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1889, file: !350, line: 406, baseType: !1450, size: 32, offset: 544)
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1889, file: !350, line: 409, baseType: !1450, size: 32, offset: 576)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1720, file: !1721, line: 470, baseType: !1920, size: 64, offset: 128)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1720, file: !1721, line: 473, baseType: !2203, size: 64, offset: 192)
!2203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2204, size: 64)
!2204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1671, line: 39, size: 1152, elements: !2205)
!2205 = !{!2206, !2207, !2220, !2221, !2222, !2291, !2292, !2296, !2297, !2298, !2299, !2300}
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !2204, file: !1671, line: 41, baseType: !1804, size: 64)
!2207 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !2204, file: !1671, line: 48, baseType: !2208, size: 64, offset: 64)
!2208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2209, size: 64)
!2209 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !1383, line: 35, baseType: !2210)
!2210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !1383, line: 35, size: 128, elements: !2211)
!2211 = !{!2212}
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2210, file: !1383, line: 35, baseType: !2213, size: 128)
!2213 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !1383, line: 33, baseType: !2214)
!2214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !1383, line: 33, size: 128, elements: !2215)
!2215 = !{!2216, !2217, !2218}
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2214, file: !1383, line: 33, baseType: !7, size: 32)
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2214, file: !1383, line: 33, baseType: !7, size: 32, offset: 32)
!2218 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2214, file: !1383, line: 33, baseType: !2219, size: 64, offset: 64)
!2219 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1929, size: 64, elements: !1556)
!2220 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !2204, file: !1671, line: 51, baseType: !1856, size: 64, offset: 128)
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !2204, file: !1671, line: 54, baseType: !1457, size: 64, offset: 192)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2204, file: !1671, line: 57, baseType: !2223, size: 128, offset: 256)
!2223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !2224, line: 31, size: 128, elements: !2225)
!2224 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2225 = !{!2226, !2227, !2228, !2229, !2230, !2231, !2232}
!2226 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !2223, file: !2224, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !2223, file: !2224, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2223, file: !2224, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !2223, file: !2224, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !2223, file: !2224, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2231 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !2223, file: !2224, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2232 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2223, file: !2224, line: 56, baseType: !2233, size: 64, offset: 64)
!2233 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !1458, line: 47, baseType: !2234)
!2234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2235, size: 64)
!2235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2236, line: 75, size: 256, elements: !2237)
