; ModuleID = 'tree-ssa-operands.bc'
source_filename = "tree-ssa-operands.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!284 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!285 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!286 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!287 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!288 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !250, line: 727, baseType: !7, size: 32, elements: !289)
!289 = !{!290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313}
!290 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!293 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!294 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!295 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!296 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!297 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!298 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!299 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!300 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!301 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!302 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!303 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!304 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!305 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!306 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!307 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!308 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!309 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!310 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!311 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!312 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!313 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tree_code_class", file: !6, line: 58, baseType: !7, size: 32, elements: !315)
!315 = !{!316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326}
!316 = !DIEnumerator(name: "tcc_exceptional", value: 0, isUnsigned: true)
!317 = !DIEnumerator(name: "tcc_constant", value: 1, isUnsigned: true)
!318 = !DIEnumerator(name: "tcc_type", value: 2, isUnsigned: true)
!319 = !DIEnumerator(name: "tcc_declaration", value: 3, isUnsigned: true)
!320 = !DIEnumerator(name: "tcc_reference", value: 4, isUnsigned: true)
!321 = !DIEnumerator(name: "tcc_comparison", value: 5, isUnsigned: true)
!322 = !DIEnumerator(name: "tcc_unary", value: 6, isUnsigned: true)
!323 = !DIEnumerator(name: "tcc_binary", value: 7, isUnsigned: true)
!324 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!325 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!326 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!327 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !328, line: 119, baseType: !7, size: 32, elements: !329)
!328 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!329 = !{!330, !331, !332, !333}
!330 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!331 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!332 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!333 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!334 = !{!335, !336, !337, !338, !341, !342, !344, !5, !1517, !455, !7, !1522, !640, !1523, !673, !339, !668, !1076, !675, !1525}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!337 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !339, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !340)
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !345, line: 56, baseType: !346)
!345 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !6, line: 3371, size: 1792, elements: !348)
!348 = !{!349, !382, !388, !401, !408, !415, !420, !429, !435, !448, !460, !498, !506, !534, !551, !552, !557, !566, !572, !577, !581, !585, !1166, !1215, !1221, !1227, !1234, !1247, !1261, !1278, !1290, !1312, !1327, !1499}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !347, file: !6, line: 3372, baseType: !350, size: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !6, line: 360, size: 64, elements: !351)
!351 = !{!352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !350, file: !6, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !350, file: !6, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !350, file: !6, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !350, file: !6, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !350, file: !6, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !350, file: !6, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !350, file: !6, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !350, file: !6, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !350, file: !6, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !350, file: !6, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !350, file: !6, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !350, file: !6, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !350, file: !6, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !350, file: !6, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !350, file: !6, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !350, file: !6, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !350, file: !6, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !350, file: !6, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !350, file: !6, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !350, file: !6, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !350, file: !6, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !350, file: !6, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !350, file: !6, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !350, file: !6, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !350, file: !6, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !350, file: !6, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !350, file: !6, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !350, file: !6, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !350, file: !6, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !350, file: !6, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !347, file: !6, line: 3373, baseType: !383, size: 192)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !6, line: 402, size: 192, elements: !384)
!384 = !{!385, !386, !387}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !383, file: !6, line: 403, baseType: !350, size: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !383, file: !6, line: 404, baseType: !344, size: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !383, file: !6, line: 405, baseType: !344, size: 64, offset: 128)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !347, file: !6, line: 3374, baseType: !389, size: 320)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !6, line: 1384, size: 320, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !389, file: !6, line: 1385, baseType: !383, size: 192)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !389, file: !6, line: 1386, baseType: !393, size: 128, offset: 192)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !394, line: 58, baseType: !395)
!394 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !394, line: 54, size: 128, elements: !396)
!396 = !{!397, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !395, file: !394, line: 56, baseType: !398, size: 64)
!398 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !395, file: !394, line: 57, baseType: !400, size: 64, offset: 64)
!400 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !347, file: !6, line: 3375, baseType: !402, size: 256)
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !6, line: 1397, size: 256, elements: !403)
!403 = !{!404, !405}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !402, file: !6, line: 1398, baseType: !383, size: 192)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !402, file: !6, line: 1399, baseType: !406, size: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !407, size: 64)
!407 = !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !6, line: 1392, flags: DIFlagFwdDecl)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !347, file: !6, line: 3376, baseType: !409, size: 256)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !6, line: 1408, size: 256, elements: !410)
!410 = !{!411, !412}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !409, file: !6, line: 1409, baseType: !383, size: 192)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !409, file: !6, line: 1410, baseType: !413, size: 64, offset: 192)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !6, line: 1403, flags: DIFlagFwdDecl)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !347, file: !6, line: 3377, baseType: !416, size: 256)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !6, line: 1437, size: 256, elements: !417)
!417 = !{!418, !419}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !416, file: !6, line: 1438, baseType: !383, size: 192)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !416, file: !6, line: 1439, baseType: !344, size: 64, offset: 192)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !347, file: !6, line: 3378, baseType: !421, size: 256)
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !6, line: 1418, size: 256, elements: !422)
!422 = !{!423, !424, !425}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !421, file: !6, line: 1419, baseType: !383, size: 192)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !421, file: !6, line: 1420, baseType: !337, size: 32, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !421, file: !6, line: 1421, baseType: !426, size: 8, offset: 224)
!426 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 8, elements: !427)
!427 = !{!428}
!428 = !DISubrange(count: 1)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !347, file: !6, line: 3379, baseType: !430, size: 320)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !6, line: 1428, size: 320, elements: !431)
!431 = !{!432, !433, !434}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !430, file: !6, line: 1429, baseType: !383, size: 192)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !430, file: !6, line: 1430, baseType: !344, size: 64, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !430, file: !6, line: 1431, baseType: !344, size: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !347, file: !6, line: 3380, baseType: !436, size: 320)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !6, line: 1460, size: 320, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !436, file: !6, line: 1461, baseType: !383, size: 192)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !436, file: !6, line: 1462, baseType: !440, size: 128, offset: 192)
!440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !441, line: 31, size: 128, elements: !442)
!441 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!442 = !{!443, !446, !447}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !440, file: !441, line: 32, baseType: !444, size: 64)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64)
!445 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !336)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !440, file: !441, line: 33, baseType: !7, size: 32, offset: 64)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !440, file: !441, line: 34, baseType: !7, size: 32, offset: 96)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !347, file: !6, line: 3381, baseType: !449, size: 384)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !6, line: 2507, size: 384, elements: !450)
!450 = !{!451, !452, !457, !458, !459}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !449, file: !6, line: 2508, baseType: !383, size: 192)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !449, file: !6, line: 2509, baseType: !453, size: 32, offset: 192)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !454, line: 58, baseType: !455)
!454 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !456, line: 44, baseType: !7)
!456 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!457 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !449, file: !6, line: 2510, baseType: !7, size: 32, offset: 224)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !449, file: !6, line: 2511, baseType: !344, size: 64, offset: 256)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !449, file: !6, line: 2512, baseType: !344, size: 64, offset: 320)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !347, file: !6, line: 3382, baseType: !461, size: 896)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !6, line: 2652, size: 896, elements: !462)
!462 = !{!463, !464, !465, !466, !467, !468, !469, !470, !471, !472, !473, !474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !461, file: !6, line: 2653, baseType: !449, size: 384)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !461, file: !6, line: 2654, baseType: !344, size: 64, offset: 384)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !461, file: !6, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !461, file: !6, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !461, file: !6, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !461, file: !6, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !461, file: !6, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !461, file: !6, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !461, file: !6, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !461, file: !6, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !461, file: !6, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !461, file: !6, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !461, file: !6, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !461, file: !6, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !461, file: !6, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !461, file: !6, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !461, file: !6, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !461, file: !6, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !461, file: !6, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !461, file: !6, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !461, file: !6, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !461, file: !6, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !461, file: !6, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !461, file: !6, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !461, file: !6, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !461, file: !6, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !461, file: !6, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !461, file: !6, line: 2703, baseType: !7, size: 32, offset: 512)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !461, file: !6, line: 2705, baseType: !344, size: 64, offset: 576)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !461, file: !6, line: 2706, baseType: !344, size: 64, offset: 640)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !461, file: !6, line: 2707, baseType: !344, size: 64, offset: 704)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !461, file: !6, line: 2708, baseType: !344, size: 64, offset: 768)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !461, file: !6, line: 2711, baseType: !496, size: 64, offset: 832)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !6, line: 2711, flags: DIFlagFwdDecl)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !347, file: !6, line: 3383, baseType: !499, size: 960)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !6, line: 2756, size: 960, elements: !500)
!500 = !{!501, !502}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !499, file: !6, line: 2757, baseType: !461, size: 896)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !499, file: !6, line: 2758, baseType: !503, size: 64, offset: 896)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !345, line: 50, baseType: !504)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !345, line: 49, flags: DIFlagFwdDecl)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !347, file: !6, line: 3384, baseType: !507, size: 1472)
!507 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !6, line: 3114, size: 1472, elements: !508)
!508 = !{!509, !530, !531, !532, !533}
!509 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !507, file: !6, line: 3115, baseType: !510, size: 1216)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !6, line: 2984, size: 1216, elements: !511)
!511 = !{!512, !513, !514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !510, file: !6, line: 2985, baseType: !499, size: 960)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !510, file: !6, line: 2986, baseType: !344, size: 64, offset: 960)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !510, file: !6, line: 2987, baseType: !344, size: 64, offset: 1024)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !510, file: !6, line: 2988, baseType: !344, size: 64, offset: 1088)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !510, file: !6, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !510, file: !6, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !510, file: !6, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !510, file: !6, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !510, file: !6, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !510, file: !6, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !510, file: !6, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !510, file: !6, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !510, file: !6, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !510, file: !6, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !510, file: !6, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !510, file: !6, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !510, file: !6, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !510, file: !6, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !507, file: !6, line: 3117, baseType: !344, size: 64, offset: 1216)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !507, file: !6, line: 3119, baseType: !344, size: 64, offset: 1280)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !507, file: !6, line: 3121, baseType: !344, size: 64, offset: 1344)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !507, file: !6, line: 3123, baseType: !344, size: 64, offset: 1408)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !347, file: !6, line: 3385, baseType: !535, size: 1088)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !6, line: 2874, size: 1088, elements: !536)
!536 = !{!537, !538, !539}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !535, file: !6, line: 2875, baseType: !499, size: 960)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !535, file: !6, line: 2876, baseType: !503, size: 64, offset: 960)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !535, file: !6, line: 2877, baseType: !540, size: 64, offset: 1024)
!540 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !541, size: 64)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !542, line: 172, size: 128, elements: !543)
!542 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!543 = !{!544, !545, !546, !547, !548, !549, !550}
!544 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !541, file: !542, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !541, file: !542, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !541, file: !542, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !541, file: !542, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !541, file: !542, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !541, file: !542, line: 195, baseType: !7, size: 32, offset: 32)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !541, file: !542, line: 199, baseType: !344, size: 64, offset: 64)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !347, file: !6, line: 3386, baseType: !510, size: 1216)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !347, file: !6, line: 3387, baseType: !553, size: 1280)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !6, line: 3093, size: 1280, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !553, file: !6, line: 3094, baseType: !510, size: 1216)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !553, file: !6, line: 3095, baseType: !540, size: 64, offset: 1216)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !347, file: !6, line: 3388, baseType: !558, size: 1216)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !6, line: 2824, size: 1216, elements: !559)
!559 = !{!560, !561, !562, !563, !564, !565}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !558, file: !6, line: 2825, baseType: !461, size: 896)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !558, file: !6, line: 2827, baseType: !344, size: 64, offset: 896)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !558, file: !6, line: 2828, baseType: !344, size: 64, offset: 960)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !558, file: !6, line: 2829, baseType: !344, size: 64, offset: 1024)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !558, file: !6, line: 2830, baseType: !344, size: 64, offset: 1088)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !558, file: !6, line: 2831, baseType: !344, size: 64, offset: 1152)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !347, file: !6, line: 3389, baseType: !567, size: 1024)
!567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !6, line: 2850, size: 1024, elements: !568)
!568 = !{!569, !570, !571}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !567, file: !6, line: 2851, baseType: !499, size: 960)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !567, file: !6, line: 2852, baseType: !337, size: 32, offset: 960)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !567, file: !6, line: 2853, baseType: !337, size: 32, offset: 992)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !347, file: !6, line: 3390, baseType: !573, size: 1024)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !6, line: 2857, size: 1024, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !573, file: !6, line: 2858, baseType: !499, size: 960)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !573, file: !6, line: 2859, baseType: !540, size: 64, offset: 960)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !347, file: !6, line: 3391, baseType: !578, size: 960)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !6, line: 2862, size: 960, elements: !579)
!579 = !{!580}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !6, line: 2863, baseType: !499, size: 960)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !347, file: !6, line: 3392, baseType: !582, size: 1472)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !6, line: 3304, size: 1472, elements: !583)
!583 = !{!584}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !582, file: !6, line: 3305, baseType: !507, size: 1472)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !347, file: !6, line: 3393, baseType: !586, size: 1792)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !6, line: 3248, size: 1792, elements: !587)
!587 = !{!588, !589, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159, !1160, !1161, !1162, !1163, !1164, !1165}
!588 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !586, file: !6, line: 3249, baseType: !507, size: 1472)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !586, file: !6, line: 3251, baseType: !590, size: 64, offset: 1472)
!590 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !591, size: 64)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !592, line: 463, size: 1152, elements: !593)
!592 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!593 = !{!594, !597, !913, !914, !1086, !1089, !1090, !1091, !1092, !1093, !1094, !1118, !1121, !1122, !1123, !1124, !1125, !1126, !1127, !1128, !1129, !1130, !1131, !1132, !1133, !1134, !1135, !1136, !1137, !1138, !1139, !1140, !1141, !1142, !1143, !1144}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !591, file: !592, line: 464, baseType: !595, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !592, line: 464, flags: DIFlagFwdDecl)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !591, file: !592, line: 467, baseType: !598, size: 64, offset: 64)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !599, size: 64)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !202, line: 374, size: 640, elements: !600)
!600 = !{!601, !888, !889, !902, !903, !904, !905, !906, !907, !909, !911, !912}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !599, file: !202, line: 377, baseType: !602, size: 64)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !345, line: 111, baseType: !603)
!603 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !604, size: 64)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !202, line: 217, size: 832, elements: !605)
!605 = !{!606, !851, !852, !853, !856, !862, !863, !864, !882, !883, !884, !885, !886, !887}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !604, file: !202, line: 219, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !202, line: 151, baseType: !609)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !202, line: 151, size: 128, elements: !610)
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !609, file: !202, line: 151, baseType: !612, size: 128)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !202, line: 150, baseType: !613)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !202, line: 150, size: 128, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !613, file: !202, line: 150, baseType: !7, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !613, file: !202, line: 150, baseType: !7, size: 32, offset: 32)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !613, file: !202, line: 150, baseType: !618, size: 64, offset: 64)
!618 = !DICompositeType(tag: DW_TAG_array_type, baseType: !619, size: 64, elements: !427)
!619 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !345, line: 108, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !202, line: 122, size: 512, elements: !622)
!622 = !{!623, !624, !625, !843, !844, !845, !846, !847, !848, !849}
!623 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !621, file: !202, line: 124, baseType: !603, size: 64)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !621, file: !202, line: 125, baseType: !603, size: 64, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !621, file: !202, line: 131, baseType: !626, size: 64, offset: 128)
!626 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !202, line: 128, size: 64, elements: !627)
!627 = !{!628, !842}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !626, file: !202, line: 129, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !345, line: 66, baseType: !630)
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !250, line: 143, size: 192, elements: !632)
!632 = !{!633, !840, !841}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !631, file: !250, line: 145, baseType: !634, size: 64)
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !345, line: 69, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !636, size: 64)
!636 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !250, line: 136, size: 192, elements: !637)
!637 = !{!638, !838, !839}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !636, file: !250, line: 137, baseType: !639, size: 64)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !345, line: 58, baseType: !640)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !250, line: 737, size: 768, elements: !642)
!642 = !{!643, !660, !693, !699, !704, !709, !716, !722, !728, !733, !747, !752, !758, !763, !773, !778, !796, !803, !810, !816, !821, !827, !833}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !641, file: !250, line: 738, baseType: !644, size: 256)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !250, line: 271, size: 256, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !644, file: !250, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !644, file: !250, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !644, file: !250, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !644, file: !250, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !644, file: !250, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !644, file: !250, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !644, file: !250, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !644, file: !250, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !644, file: !250, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !644, file: !250, line: 312, baseType: !7, size: 32, offset: 32)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !644, file: !250, line: 316, baseType: !453, size: 32, offset: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !644, file: !250, line: 319, baseType: !7, size: 32, offset: 96)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !644, file: !250, line: 323, baseType: !603, size: 64, offset: 128)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !644, file: !250, line: 327, baseType: !344, size: 64, offset: 192)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !641, file: !250, line: 739, baseType: !661, size: 448)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !250, line: 350, size: 448, elements: !662)
!662 = !{!663, !691}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !661, file: !250, line: 353, baseType: !664, size: 384)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !250, line: 333, size: 384, elements: !665)
!665 = !{!666, !667, !674}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !664, file: !250, line: 336, baseType: !644, size: 256)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !664, file: !250, line: 343, baseType: !668, size: 64, offset: 256)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !669, size: 64)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !328, line: 37, size: 128, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !669, file: !328, line: 39, baseType: !668, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !669, file: !328, line: 40, baseType: !673, size: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !664, file: !250, line: 344, baseType: !675, size: 64, offset: 320)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !328, line: 45, size: 320, elements: !677)
!677 = !{!678, !679}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !676, file: !328, line: 47, baseType: !675, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !676, file: !328, line: 48, baseType: !680, size: 256, offset: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !6, line: 1883, size: 256, elements: !681)
!681 = !{!682, !684, !685, !690}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !680, file: !6, line: 1884, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !680, file: !6, line: 1885, baseType: !683, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !680, file: !6, line: 1891, baseType: !686, size: 64, offset: 128)
!686 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !680, file: !6, line: 1891, size: 64, elements: !687)
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !686, file: !6, line: 1891, baseType: !639, size: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !686, file: !6, line: 1891, baseType: !344, size: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !680, file: !6, line: 1892, baseType: !673, size: 64, offset: 192)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !661, file: !250, line: 359, baseType: !692, size: 64, offset: 384)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !344, size: 64, elements: !427)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !641, file: !250, line: 740, baseType: !694, size: 512)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !250, line: 365, size: 512, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !694, file: !250, line: 368, baseType: !664, size: 384)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !694, file: !250, line: 373, baseType: !344, size: 64, offset: 384)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !694, file: !250, line: 374, baseType: !344, size: 64, offset: 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !641, file: !250, line: 741, baseType: !700, size: 576)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !250, line: 380, size: 576, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !700, file: !250, line: 383, baseType: !694, size: 512)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !700, file: !250, line: 389, baseType: !692, size: 64, offset: 512)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !641, file: !250, line: 742, baseType: !705, size: 320)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !250, line: 395, size: 320, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !705, file: !250, line: 397, baseType: !644, size: 256)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !705, file: !250, line: 400, baseType: !629, size: 64, offset: 256)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !641, file: !250, line: 743, baseType: !710, size: 448)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !250, line: 406, size: 448, elements: !711)
!711 = !{!712, !713, !714, !715}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !710, file: !250, line: 408, baseType: !644, size: 256)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !710, file: !250, line: 412, baseType: !344, size: 64, offset: 256)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !710, file: !250, line: 420, baseType: !344, size: 64, offset: 320)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !710, file: !250, line: 423, baseType: !629, size: 64, offset: 384)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !641, file: !250, line: 744, baseType: !717, size: 384)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !250, line: 429, size: 384, elements: !718)
!718 = !{!719, !720, !721}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !717, file: !250, line: 431, baseType: !644, size: 256)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !717, file: !250, line: 434, baseType: !344, size: 64, offset: 256)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !717, file: !250, line: 437, baseType: !629, size: 64, offset: 320)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !641, file: !250, line: 745, baseType: !723, size: 384)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !250, line: 443, size: 384, elements: !724)
!724 = !{!725, !726, !727}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !723, file: !250, line: 445, baseType: !644, size: 256)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !723, file: !250, line: 449, baseType: !344, size: 64, offset: 256)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !723, file: !250, line: 453, baseType: !629, size: 64, offset: 320)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !641, file: !250, line: 746, baseType: !729, size: 320)
!729 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !250, line: 459, size: 320, elements: !730)
!730 = !{!731, !732}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !729, file: !250, line: 461, baseType: !644, size: 256)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !729, file: !250, line: 464, baseType: !344, size: 64, offset: 256)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !641, file: !250, line: 747, baseType: !734, size: 768)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !250, line: 469, size: 768, elements: !735)
!735 = !{!736, !737, !738, !739, !740}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !734, file: !250, line: 471, baseType: !644, size: 256)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !734, file: !250, line: 474, baseType: !7, size: 32, offset: 256)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !734, file: !250, line: 475, baseType: !7, size: 32, offset: 288)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !734, file: !250, line: 478, baseType: !344, size: 64, offset: 320)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !734, file: !250, line: 481, baseType: !741, size: 384, offset: 384)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 384, elements: !427)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !6, line: 1917, size: 384, elements: !743)
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !742, file: !6, line: 1920, baseType: !680, size: 256)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !742, file: !6, line: 1921, baseType: !344, size: 64, offset: 256)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !742, file: !6, line: 1922, baseType: !453, size: 32, offset: 320)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !641, file: !250, line: 748, baseType: !748, size: 320)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !250, line: 487, size: 320, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !748, file: !250, line: 490, baseType: !644, size: 256)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !748, file: !250, line: 494, baseType: !337, size: 32, offset: 256)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !641, file: !250, line: 749, baseType: !753, size: 384)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !250, line: 500, size: 384, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !753, file: !250, line: 502, baseType: !644, size: 256)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !753, file: !250, line: 506, baseType: !629, size: 64, offset: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !753, file: !250, line: 510, baseType: !629, size: 64, offset: 320)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !641, file: !250, line: 750, baseType: !759, size: 320)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !250, line: 529, size: 320, elements: !760)
!760 = !{!761, !762}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !759, file: !250, line: 531, baseType: !644, size: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !759, file: !250, line: 540, baseType: !629, size: 64, offset: 256)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !641, file: !250, line: 751, baseType: !764, size: 704)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !250, line: 546, size: 704, elements: !765)
!765 = !{!766, !767, !768, !769, !770, !771, !772}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !764, file: !250, line: 549, baseType: !694, size: 512)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !764, file: !250, line: 553, baseType: !342, size: 64, offset: 512)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !764, file: !250, line: 557, baseType: !336, size: 8, offset: 576)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !764, file: !250, line: 558, baseType: !336, size: 8, offset: 584)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !764, file: !250, line: 559, baseType: !336, size: 8, offset: 592)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !764, file: !250, line: 560, baseType: !336, size: 8, offset: 600)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !764, file: !250, line: 566, baseType: !692, size: 64, offset: 640)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !641, file: !250, line: 752, baseType: !774, size: 384)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !250, line: 571, size: 384, elements: !775)
!775 = !{!776, !777}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !774, file: !250, line: 573, baseType: !705, size: 320)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !774, file: !250, line: 577, baseType: !344, size: 64, offset: 320)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !641, file: !250, line: 753, baseType: !779, size: 576)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !250, line: 600, size: 576, elements: !780)
!780 = !{!781, !782, !783, !786, !795}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !779, file: !250, line: 602, baseType: !705, size: 320)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !779, file: !250, line: 605, baseType: !344, size: 64, offset: 320)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !779, file: !250, line: 609, baseType: !784, size: 64, offset: 384)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !785, line: 46, baseType: !398)
!785 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!786 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !779, file: !250, line: 612, baseType: !787, size: 64, offset: 448)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !250, line: 581, size: 320, elements: !789)
!789 = !{!790, !791, !792, !793, !794}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !788, file: !250, line: 583, baseType: !5, size: 32)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !788, file: !250, line: 586, baseType: !344, size: 64, offset: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !788, file: !250, line: 589, baseType: !344, size: 64, offset: 128)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !788, file: !250, line: 592, baseType: !344, size: 64, offset: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !788, file: !250, line: 595, baseType: !344, size: 64, offset: 256)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !779, file: !250, line: 616, baseType: !629, size: 64, offset: 512)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !641, file: !250, line: 754, baseType: !797, size: 512)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !250, line: 622, size: 512, elements: !798)
!798 = !{!799, !800, !801, !802}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !797, file: !250, line: 624, baseType: !705, size: 320)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !797, file: !250, line: 628, baseType: !344, size: 64, offset: 320)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !797, file: !250, line: 632, baseType: !344, size: 64, offset: 384)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !797, file: !250, line: 636, baseType: !344, size: 64, offset: 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !641, file: !250, line: 755, baseType: !804, size: 704)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !250, line: 642, size: 704, elements: !805)
!805 = !{!806, !807, !808, !809}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !804, file: !250, line: 644, baseType: !797, size: 512)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !804, file: !250, line: 648, baseType: !344, size: 64, offset: 512)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !804, file: !250, line: 652, baseType: !344, size: 64, offset: 576)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !804, file: !250, line: 653, baseType: !344, size: 64, offset: 640)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !641, file: !250, line: 756, baseType: !811, size: 448)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !250, line: 663, size: 448, elements: !812)
!812 = !{!813, !814, !815}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !811, file: !250, line: 665, baseType: !705, size: 320)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !811, file: !250, line: 668, baseType: !344, size: 64, offset: 320)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !811, file: !250, line: 673, baseType: !344, size: 64, offset: 384)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !641, file: !250, line: 757, baseType: !817, size: 384)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !250, line: 694, size: 384, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !817, file: !250, line: 696, baseType: !705, size: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !817, file: !250, line: 699, baseType: !344, size: 64, offset: 320)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !641, file: !250, line: 758, baseType: !822, size: 384)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !250, line: 681, size: 384, elements: !823)
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !822, file: !250, line: 683, baseType: !644, size: 256)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !822, file: !250, line: 686, baseType: !344, size: 64, offset: 256)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !822, file: !250, line: 689, baseType: !344, size: 64, offset: 320)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !641, file: !250, line: 759, baseType: !828, size: 384)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !250, line: 707, size: 384, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !828, file: !250, line: 709, baseType: !644, size: 256)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !828, file: !250, line: 712, baseType: !344, size: 64, offset: 256)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !828, file: !250, line: 712, baseType: !344, size: 64, offset: 320)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !641, file: !250, line: 760, baseType: !834, size: 320)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !250, line: 718, size: 320, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !834, file: !250, line: 720, baseType: !644, size: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !834, file: !250, line: 723, baseType: !344, size: 64, offset: 256)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !636, file: !250, line: 138, baseType: !635, size: 64, offset: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !636, file: !250, line: 139, baseType: !635, size: 64, offset: 128)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !631, file: !250, line: 146, baseType: !634, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !631, file: !250, line: 152, baseType: !629, size: 64, offset: 128)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !626, file: !202, line: 130, baseType: !503, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !621, file: !202, line: 134, baseType: !341, size: 64, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !621, file: !202, line: 137, baseType: !344, size: 64, offset: 256)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !621, file: !202, line: 138, baseType: !453, size: 32, offset: 320)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !621, file: !202, line: 142, baseType: !7, size: 32, offset: 352)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !621, file: !202, line: 144, baseType: !337, size: 32, offset: 384)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !621, file: !202, line: 145, baseType: !337, size: 32, offset: 416)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !621, file: !202, line: 146, baseType: !850, size: 64, offset: 448)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !202, line: 119, baseType: !400)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !604, file: !202, line: 220, baseType: !607, size: 64, offset: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !604, file: !202, line: 223, baseType: !341, size: 64, offset: 128)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !604, file: !202, line: 226, baseType: !854, size: 64, offset: 192)
!854 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !855, size: 64)
!855 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !202, line: 185, flags: DIFlagFwdDecl)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !604, file: !202, line: 229, baseType: !857, size: 128, offset: 256)
!857 = !DICompositeType(tag: DW_TAG_array_type, baseType: !858, size: 128, elements: !860)
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !202, line: 229, flags: DIFlagFwdDecl)
!860 = !{!861}
!861 = !DISubrange(count: 2)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !604, file: !202, line: 232, baseType: !603, size: 64, offset: 384)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !604, file: !202, line: 233, baseType: !603, size: 64, offset: 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !604, file: !202, line: 238, baseType: !865, size: 64, offset: 512)
!865 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !202, line: 235, size: 64, elements: !866)
!866 = !{!867, !873}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !865, file: !202, line: 236, baseType: !868, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !869, size: 64)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !202, line: 273, size: 128, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !869, file: !202, line: 275, baseType: !629, size: 64)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !869, file: !202, line: 278, baseType: !629, size: 64, offset: 64)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !865, file: !202, line: 237, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !875, size: 64)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !202, line: 259, size: 320, elements: !876)
!876 = !{!877, !878, !879, !880, !881}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !875, file: !202, line: 261, baseType: !503, size: 64)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !875, file: !202, line: 262, baseType: !503, size: 64, offset: 64)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !875, file: !202, line: 266, baseType: !503, size: 64, offset: 128)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !875, file: !202, line: 267, baseType: !503, size: 64, offset: 192)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !875, file: !202, line: 270, baseType: !337, size: 32, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !604, file: !202, line: 241, baseType: !850, size: 64, offset: 576)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !604, file: !202, line: 244, baseType: !337, size: 32, offset: 640)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !604, file: !202, line: 247, baseType: !337, size: 32, offset: 672)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !604, file: !202, line: 250, baseType: !337, size: 32, offset: 704)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !604, file: !202, line: 253, baseType: !337, size: 32, offset: 736)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !604, file: !202, line: 256, baseType: !337, size: 32, offset: 768)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !599, file: !202, line: 378, baseType: !602, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !599, file: !202, line: 381, baseType: !890, size: 64, offset: 128)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !202, line: 282, baseType: !892)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !202, line: 282, size: 128, elements: !893)
!893 = !{!894}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !892, file: !202, line: 282, baseType: !895, size: 128)
!895 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !202, line: 281, baseType: !896)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !202, line: 281, size: 128, elements: !897)
!897 = !{!898, !899, !900}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !896, file: !202, line: 281, baseType: !7, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !896, file: !202, line: 281, baseType: !7, size: 32, offset: 32)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !896, file: !202, line: 281, baseType: !901, size: 64, offset: 64)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !602, size: 64, elements: !427)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !599, file: !202, line: 384, baseType: !337, size: 32, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !599, file: !202, line: 387, baseType: !337, size: 32, offset: 224)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !599, file: !202, line: 390, baseType: !337, size: 32, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !599, file: !202, line: 394, baseType: !890, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !599, file: !202, line: 396, baseType: !201, size: 32, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !599, file: !202, line: 399, baseType: !908, size: 64, offset: 416)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !860)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !599, file: !202, line: 402, baseType: !910, size: 64, offset: 480)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !860)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !599, file: !202, line: 406, baseType: !337, size: 32, offset: 544)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !599, file: !202, line: 409, baseType: !337, size: 32, offset: 576)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !591, file: !592, line: 470, baseType: !630, size: 64, offset: 128)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !591, file: !592, line: 473, baseType: !915, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !542, line: 39, size: 1152, elements: !917)
!917 = !{!918, !968, !981, !993, !994, !1063, !1064, !1068, !1069, !1070, !1071, !1072}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !916, file: !542, line: 41, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !920, line: 144, baseType: !921)
!920 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !920, line: 100, size: 896, elements: !923)
!923 = !{!924, !932, !937, !942, !944, !945, !946, !947, !948, !949, !954, !956, !957, !962, !967}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !922, file: !920, line: 102, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !920, line: 52, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = !DISubroutineType(types: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !920, line: 47, baseType: !7)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !922, file: !920, line: 105, baseType: !933, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !920, line: 59, baseType: !934)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{!337, !930, !930}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !922, file: !920, line: 108, baseType: !938, size: 64, offset: 128)
!938 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !920, line: 63, baseType: !939)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !341}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !922, file: !920, line: 111, baseType: !943, size: 64, offset: 192)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !922, file: !920, line: 114, baseType: !784, size: 64, offset: 256)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !922, file: !920, line: 117, baseType: !784, size: 64, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !922, file: !920, line: 120, baseType: !784, size: 64, offset: 384)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !922, file: !920, line: 124, baseType: !7, size: 32, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !922, file: !920, line: 128, baseType: !7, size: 32, offset: 480)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !922, file: !920, line: 131, baseType: !950, size: 64, offset: 512)
!950 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !920, line: 75, baseType: !951)
!951 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !952, size: 64)
!952 = !DISubroutineType(types: !953)
!953 = !{!341, !784, !784}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !922, file: !920, line: 132, baseType: !955, size: 64, offset: 576)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !920, line: 78, baseType: !939)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !922, file: !920, line: 135, baseType: !341, size: 64, offset: 640)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !922, file: !920, line: 136, baseType: !958, size: 64, offset: 704)
!958 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !920, line: 82, baseType: !959)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = !DISubroutineType(types: !961)
!961 = !{!341, !341, !784, !784}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !922, file: !920, line: 137, baseType: !963, size: 64, offset: 768)
!963 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !920, line: 83, baseType: !964)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = !DISubroutineType(types: !966)
!966 = !{null, !341, !341}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !922, file: !920, line: 141, baseType: !7, size: 32, offset: 832)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !916, file: !542, line: 48, baseType: !969, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !250, line: 35, baseType: !971)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !250, line: 35, size: 128, elements: !972)
!972 = !{!973}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !971, file: !250, line: 35, baseType: !974, size: 128)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !250, line: 33, baseType: !975)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !250, line: 33, size: 128, elements: !976)
!976 = !{!977, !978, !979}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !975, file: !250, line: 33, baseType: !7, size: 32)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !975, file: !250, line: 33, baseType: !7, size: 32, offset: 32)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !975, file: !250, line: 33, baseType: !980, size: 64, offset: 64)
!980 = !DICompositeType(tag: DW_TAG_array_type, baseType: !639, size: 64, elements: !427)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !916, file: !542, line: 51, baseType: !982, size: 64, offset: 128)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !6, line: 183, baseType: !984)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !6, line: 183, size: 128, elements: !985)
!985 = !{!986}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !984, file: !6, line: 183, baseType: !987, size: 128)
!987 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !6, line: 182, baseType: !988)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !6, line: 182, size: 128, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !988, file: !6, line: 182, baseType: !7, size: 32)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !988, file: !6, line: 182, baseType: !7, size: 32, offset: 32)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !988, file: !6, line: 182, baseType: !692, size: 64, offset: 64)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !916, file: !542, line: 54, baseType: !344, size: 64, offset: 192)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !916, file: !542, line: 57, baseType: !995, size: 128, offset: 256)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !996, line: 31, size: 128, elements: !997)
!996 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !995, file: !996, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !995, file: !996, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !995, file: !996, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !995, file: !996, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !995, file: !996, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !995, file: !996, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !995, file: !996, line: 56, baseType: !1005, size: 64, offset: 64)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !345, line: 47, baseType: !1006)
!1006 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1007, size: 64)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !1008, line: 75, size: 256, elements: !1009)
!1008 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1009 = !{!1010, !1022, !1023, !1024}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1007, file: !1008, line: 76, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !1008, line: 68, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !1008, line: 63, size: 320, elements: !1014)
!1014 = !{!1015, !1017, !1018, !1019}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1013, file: !1008, line: 64, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1013, file: !1008, line: 65, baseType: !1016, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1013, file: !1008, line: 66, baseType: !7, size: 32, offset: 128)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !1013, file: !1008, line: 67, baseType: !1020, size: 128, offset: 192)
!1020 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 128, elements: !860)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !1008, line: 29, baseType: !398)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !1007, file: !1008, line: 77, baseType: !1011, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !1007, file: !1008, line: 78, baseType: !7, size: 32, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1007, file: !1008, line: 79, baseType: !1025, size: 64, offset: 192)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !1008, line: 49, baseType: !1027)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !1008, line: 45, size: 832, elements: !1028)
!1028 = !{!1029, !1030, !1031}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !1027, file: !1008, line: 46, baseType: !1016, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !1027, file: !1008, line: 47, baseType: !1006, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !1027, file: !1008, line: 48, baseType: !1032, size: 704, offset: 128)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !1033, line: 164, size: 704, elements: !1034)
!1033 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1034 = !{!1035, !1036, !1046, !1047, !1048, !1049, !1050, !1051, !1055, !1059, !1060, !1061, !1062}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !1032, file: !1033, line: 166, baseType: !400, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !1032, file: !1033, line: 167, baseType: !1037, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !1033, line: 157, size: 192, elements: !1039)
!1039 = !{!1040, !1041, !1042}
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !1038, file: !1033, line: 159, baseType: !339, size: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1038, file: !1033, line: 160, baseType: !1037, size: 64, offset: 64)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !1038, file: !1033, line: 161, baseType: !1043, size: 32, offset: 128)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !340, size: 32, elements: !1044)
!1044 = !{!1045}
!1045 = !DISubrange(count: 4)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !1032, file: !1033, line: 168, baseType: !339, size: 64, offset: 128)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1032, file: !1033, line: 169, baseType: !339, size: 64, offset: 192)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !1032, file: !1033, line: 170, baseType: !339, size: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !1032, file: !1033, line: 171, baseType: !400, size: 64, offset: 320)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !1032, file: !1033, line: 172, baseType: !337, size: 32, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !1032, file: !1033, line: 176, baseType: !1052, size: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1053, size: 64)
!1053 = !DISubroutineType(types: !1054)
!1054 = !{!1037, !341, !400}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !1032, file: !1033, line: 177, baseType: !1056, size: 64, offset: 512)
!1056 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1057, size: 64)
!1057 = !DISubroutineType(types: !1058)
!1058 = !{null, !341, !1037}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !1032, file: !1033, line: 178, baseType: !341, size: 64, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !1032, file: !1033, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !1032, file: !1033, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !1032, file: !1033, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !916, file: !542, line: 60, baseType: !995, size: 128, offset: 384)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !916, file: !542, line: 64, baseType: !1065, size: 64, offset: 512)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1067, line: 33, flags: DIFlagFwdDecl)
!1067 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !916, file: !542, line: 67, baseType: !344, size: 64, offset: 576)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !916, file: !542, line: 73, baseType: !919, size: 64, offset: 640)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !916, file: !542, line: 77, baseType: !1005, size: 64, offset: 704)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !916, file: !542, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !916, file: !542, line: 82, baseType: !1073, size: 320, offset: 832)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !328, line: 62, size: 320, elements: !1074)
!1074 = !{!1075, !1081, !1082, !1083, !1084, !1085}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1073, file: !328, line: 63, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !328, line: 56, size: 128, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1077, file: !328, line: 57, baseType: !1076, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1077, file: !328, line: 58, baseType: !426, size: 8, offset: 64)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1073, file: !328, line: 64, baseType: !7, size: 32, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1073, file: !328, line: 66, baseType: !7, size: 32, offset: 96)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1073, file: !328, line: 68, baseType: !336, size: 8, offset: 128)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1073, file: !328, line: 70, baseType: !668, size: 64, offset: 192)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1073, file: !328, line: 71, baseType: !675, size: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !591, file: !592, line: 476, baseType: !1087, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !592, line: 476, flags: DIFlagFwdDecl)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !591, file: !592, line: 479, baseType: !919, size: 64, offset: 320)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !591, file: !592, line: 484, baseType: !344, size: 64, offset: 384)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !591, file: !592, line: 488, baseType: !344, size: 64, offset: 448)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !591, file: !592, line: 493, baseType: !344, size: 64, offset: 512)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !591, file: !592, line: 496, baseType: !344, size: 64, offset: 576)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !591, file: !592, line: 501, baseType: !1095, size: 64, offset: 640)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !213, line: 2355, size: 576, elements: !1097)
!1097 = !{!1098, !1101, !1102, !1103, !1104, !1106, !1107, !1112, !1113, !1114, !1115, !1116, !1117}
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1096, file: !213, line: 2356, baseType: !1099, size: 64)
!1099 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1100, size: 64)
!1100 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !213, line: 2356, flags: DIFlagFwdDecl)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1096, file: !213, line: 2357, baseType: !342, size: 64, offset: 64)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1096, file: !213, line: 2358, baseType: !337, size: 32, offset: 128)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1096, file: !213, line: 2359, baseType: !337, size: 32, offset: 160)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1096, file: !213, line: 2360, baseType: !1105, size: 128, offset: 192)
!1105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !337, size: 128, elements: !1044)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1096, file: !213, line: 2364, baseType: !337, size: 32, offset: 320)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1096, file: !213, line: 2367, baseType: !1108, size: 128, offset: 384)
!1108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !213, line: 2349, size: 128, elements: !1109)
!1109 = !{!1110, !1111}
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1108, file: !213, line: 2351, baseType: !503, size: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1108, file: !213, line: 2352, baseType: !400, size: 64, offset: 64)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1096, file: !213, line: 2371, baseType: !212, size: 32, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1096, file: !213, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1096, file: !213, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1096, file: !213, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1096, file: !213, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1096, file: !213, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !591, file: !592, line: 504, baseType: !1119, size: 64, offset: 704)
!1119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1120, size: 64)
!1120 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !592, line: 504, flags: DIFlagFwdDecl)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !591, file: !592, line: 507, baseType: !919, size: 64, offset: 768)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !591, file: !592, line: 510, baseType: !337, size: 32, offset: 832)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !591, file: !592, line: 513, baseType: !337, size: 32, offset: 864)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !591, file: !592, line: 516, baseType: !453, size: 32, offset: 896)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !591, file: !592, line: 519, baseType: !453, size: 32, offset: 928)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !591, file: !592, line: 522, baseType: !7, size: 32, offset: 960)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !591, file: !592, line: 523, baseType: !7, size: 32, offset: 992)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !591, file: !592, line: 528, baseType: !342, size: 64, offset: 1024)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !591, file: !592, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !591, file: !592, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
