; ModuleID = 'tree-loop-distribution.bc'
source_filename = "tree-loop-distribution.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!610 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!618 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !581, line: 727, baseType: !7, size: 32, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!621 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!644 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!645 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !581, line: 80, baseType: !7, size: 32, elements: !646)
!646 = !{!647, !648, !649, !650}
!647 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!648 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!649 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!650 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!651 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !652, line: 119, baseType: !7, size: 32, elements: !653)
!652 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!653 = !{!654, !655, !656, !657}
!654 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!655 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!656 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!657 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!658 = !{!659, !660, !661, !662, !665, !666, !668, !731, !746, !2033, !789, !7, !2038, !2044, !2062, !2074, !2186, !2057, !2056, !2187, !366, !790, !2190, !814, !1334, !663, !769, !645, !2085, !809}
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!661 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !664)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !669, line: 47, baseType: !670)
!669 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !672, line: 75, size: 256, elements: !673)
!672 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!673 = !{!674, !689, !690, !691}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !671, file: !672, line: 76, baseType: !675, size: 64)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !676, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !672, line: 68, baseType: !677)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !672, line: 63, size: 320, elements: !678)
!678 = !{!679, !681, !682, !683}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !677, file: !672, line: 64, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !677, file: !672, line: 65, baseType: !680, size: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !677, file: !672, line: 66, baseType: !7, size: 32, offset: 128)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !677, file: !672, line: 67, baseType: !684, size: 128, offset: 192)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !685, size: 128, elements: !687)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !672, line: 29, baseType: !686)
!686 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!687 = !{!688}
!688 = !DISubrange(count: 2)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !671, file: !672, line: 77, baseType: !675, size: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !671, file: !672, line: 78, baseType: !7, size: 32, offset: 128)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !671, file: !672, line: 79, baseType: !692, size: 64, offset: 192)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !672, line: 49, baseType: !694)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !672, line: 45, size: 832, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !694, file: !672, line: 46, baseType: !680, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !694, file: !672, line: 47, baseType: !670, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !694, file: !672, line: 48, baseType: !699, size: 704, offset: 128)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !700, line: 164, size: 704, elements: !701)
!700 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!701 = !{!702, !704, !714, !715, !716, !717, !718, !719, !723, !727, !728, !729, !730}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !699, file: !700, line: 166, baseType: !703, size: 64)
!703 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !699, file: !700, line: 167, baseType: !705, size: 64, offset: 64)
!705 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !706, size: 64)
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !700, line: 157, size: 192, elements: !707)
!707 = !{!708, !709, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !706, file: !700, line: 159, baseType: !663, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !706, file: !700, line: 160, baseType: !705, size: 64, offset: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !706, file: !700, line: 161, baseType: !711, size: 32, offset: 128)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 32, elements: !712)
!712 = !{!713}
!713 = !DISubrange(count: 4)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !699, file: !700, line: 168, baseType: !663, size: 64, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !699, file: !700, line: 169, baseType: !663, size: 64, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !699, file: !700, line: 170, baseType: !663, size: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !699, file: !700, line: 171, baseType: !703, size: 64, offset: 320)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !699, file: !700, line: 172, baseType: !661, size: 32, offset: 384)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !699, file: !700, line: 176, baseType: !720, size: 64, offset: 448)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = !DISubroutineType(types: !722)
!722 = !{!705, !665, !703}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !699, file: !700, line: 177, baseType: !724, size: 64, offset: 512)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DISubroutineType(types: !726)
!726 = !{null, !665, !705}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !699, file: !700, line: 178, baseType: !665, size: 64, offset: 576)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !699, file: !700, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !699, file: !700, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !699, file: !700, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_heap", file: !733, line: 32, baseType: !734)
!733 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_heap", file: !733, line: 32, size: 96, elements: !735)
!735 = !{!736}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !734, file: !733, line: 32, baseType: !737, size: 96)
!737 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_base", file: !733, line: 31, baseType: !738)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_base", file: !733, line: 31, size: 96, elements: !739)
!739 = !{!740, !741, !742}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !738, file: !733, line: 31, baseType: !7, size: 32)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !738, file: !733, line: 31, baseType: !7, size: 32, offset: 32)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !738, file: !733, line: 31, baseType: !743, size: 32, offset: 64)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 32, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 1)
!746 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !561, line: 84, baseType: !747)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !561, line: 100, size: 1216, elements: !749)
!749 = !{!750, !751, !752, !1997, !1998, !2003, !2004, !2005, !2006, !2007, !2008, !2009, !2010, !2011, !2012, !2013, !2014, !2015, !2023, !2031, !2032}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !748, file: !561, line: 102, baseType: !661, size: 32)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !748, file: !561, line: 105, baseType: !7, size: 32, offset: 32)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !748, file: !561, line: 108, baseType: !753, size: 64, offset: 64)
!753 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !754, size: 64)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !755)
!755 = !{!756, !1964, !1965, !1966, !1967, !1971, !1972, !1973, !1991, !1992, !1993, !1994, !1995, !1996}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !754, file: !318, line: 219, baseType: !757, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !759)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !760)
!760 = !{!761}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !759, file: !318, line: 151, baseType: !762, size: 128)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !763)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !764)
!764 = !{!765, !766, !767}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !763, file: !318, line: 150, baseType: !7, size: 32)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !763, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !763, file: !318, line: 150, baseType: !768, size: 64, offset: 64)
!768 = !DICompositeType(tag: DW_TAG_array_type, baseType: !769, size: 64, elements: !744)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !669, line: 108, baseType: !770)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !772)
!772 = !{!773, !774, !775, !1956, !1957, !1958, !1959, !1960, !1961, !1962}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !771, file: !318, line: 124, baseType: !753, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !771, file: !318, line: 125, baseType: !753, size: 64, offset: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !771, file: !318, line: 131, baseType: !776, size: 64, offset: 128)
!776 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !777)
!777 = !{!778, !1955}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !776, file: !318, line: 129, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !669, line: 66, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !581, line: 143, size: 192, elements: !782)
!782 = !{!783, !1953, !1954}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !781, file: !581, line: 145, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !669, line: 69, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !581, line: 136, size: 192, elements: !787)
!787 = !{!788, !1951, !1952}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !786, file: !581, line: 137, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !669, line: 58, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !581, line: 737, size: 768, elements: !792)
!792 = !{!793, !1798, !1808, !1814, !1819, !1824, !1831, !1837, !1843, !1848, !1862, !1867, !1873, !1878, !1888, !1893, !1909, !1916, !1923, !1929, !1934, !1940, !1946}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !791, file: !581, line: 738, baseType: !794, size: 256)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !581, line: 271, size: 256, elements: !795)
!795 = !{!796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !811, !812, !813}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !794, file: !581, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !794, file: !581, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !794, file: !581, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !794, file: !581, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !794, file: !581, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !794, file: !581, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !794, file: !581, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !794, file: !581, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !794, file: !581, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !794, file: !581, line: 312, baseType: !7, size: 32, offset: 32)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !794, file: !581, line: 316, baseType: !807, size: 32, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !808, line: 58, baseType: !809)
!808 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!809 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !810, line: 44, baseType: !7)
!810 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!811 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !794, file: !581, line: 319, baseType: !7, size: 32, offset: 96)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !794, file: !581, line: 323, baseType: !753, size: 64, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !794, file: !581, line: 327, baseType: !814, size: 64, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !669, line: 56, baseType: !815)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !816, size: 64)
!816 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !817)
!817 = !{!818, !851, !857, !868, !887, !898, !903, !910, !916, !929, !937, !975, !1090, !1118, !1135, !1136, !1141, !1150, !1156, !1161, !1165, !1169, !1449, !1496, !1502, !1508, !1515, !1528, !1542, !1559, !1571, !1593, !1608, !1780}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !816, file: !334, line: 3372, baseType: !819, size: 64)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !820)
!820 = !{!821, !822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !819, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !819, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !819, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !819, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !819, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !819, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !819, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !819, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !819, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !819, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !819, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !819, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !819, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !819, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !819, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !819, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !819, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !819, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !819, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !819, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !819, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !819, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !819, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !819, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !819, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !819, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !819, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !819, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !819, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !819, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !816, file: !334, line: 3373, baseType: !852, size: 192)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !853)
!853 = !{!854, !855, !856}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !852, file: !334, line: 403, baseType: !819, size: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !852, file: !334, line: 404, baseType: !814, size: 64, offset: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !852, file: !334, line: 405, baseType: !814, size: 64, offset: 128)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !816, file: !334, line: 3374, baseType: !858, size: 320)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !858, file: !334, line: 1385, baseType: !852, size: 192)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !858, file: !334, line: 1386, baseType: !862, size: 128, offset: 192)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !863, line: 58, baseType: !864)
!863 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !863, line: 54, size: 128, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !864, file: !863, line: 56, baseType: !686, size: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !864, file: !863, line: 57, baseType: !703, size: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !816, file: !334, line: 3375, baseType: !869, size: 256)
!869 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !870)
!870 = !{!871, !872}
!871 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !869, file: !334, line: 1398, baseType: !852, size: 192)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !869, file: !334, line: 1399, baseType: !873, size: 64, offset: 192)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !875, line: 52, size: 256, elements: !876)
!875 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!876 = !{!877, !878, !879, !880, !881, !882, !883}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !874, file: !875, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !874, file: !875, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !874, file: !875, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !874, file: !875, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !874, file: !875, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !874, file: !875, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !874, file: !875, line: 62, baseType: !884, size: 192, offset: 64)
!884 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 192, elements: !885)
!885 = !{!886}
!886 = !DISubrange(count: 3)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !816, file: !334, line: 3376, baseType: !888, size: 256)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !889)
!889 = !{!890, !891}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !888, file: !334, line: 1409, baseType: !852, size: 192)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !888, file: !334, line: 1410, baseType: !892, size: 64, offset: 192)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !894, line: 27, size: 192, elements: !895)
!894 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!895 = !{!896, !897}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !893, file: !894, line: 29, baseType: !862, size: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !893, file: !894, line: 30, baseType: !189, size: 32, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !816, file: !334, line: 3377, baseType: !899, size: 256)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !899, file: !334, line: 1438, baseType: !852, size: 192)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !899, file: !334, line: 1439, baseType: !814, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !816, file: !334, line: 3378, baseType: !904, size: 256)
!904 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !905)
!905 = !{!906, !907, !908}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !904, file: !334, line: 1419, baseType: !852, size: 192)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !904, file: !334, line: 1420, baseType: !661, size: 32, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !904, file: !334, line: 1421, baseType: !909, size: 8, offset: 224)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 8, elements: !744)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !816, file: !334, line: 3379, baseType: !911, size: 320)
!911 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !912)
!912 = !{!913, !914, !915}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !911, file: !334, line: 1429, baseType: !852, size: 192)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !911, file: !334, line: 1430, baseType: !814, size: 64, offset: 192)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !911, file: !334, line: 1431, baseType: !814, size: 64, offset: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !816, file: !334, line: 3380, baseType: !917, size: 320)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !918)
!918 = !{!919, !920}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !917, file: !334, line: 1461, baseType: !852, size: 192)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !917, file: !334, line: 1462, baseType: !921, size: 128, offset: 192)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !922, line: 31, size: 128, elements: !923)
!922 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!923 = !{!924, !927, !928}
!924 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !921, file: !922, line: 32, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !926, size: 64)
!926 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !660)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !921, file: !922, line: 33, baseType: !7, size: 32, offset: 64)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !921, file: !922, line: 34, baseType: !7, size: 32, offset: 96)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !816, file: !334, line: 3381, baseType: !930, size: 384)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !931)
!931 = !{!932, !933, !934, !935, !936}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !930, file: !334, line: 2508, baseType: !852, size: 192)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !930, file: !334, line: 2509, baseType: !807, size: 32, offset: 192)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !930, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !930, file: !334, line: 2511, baseType: !814, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !930, file: !334, line: 2512, baseType: !814, size: 64, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !816, file: !334, line: 3382, baseType: !938, size: 896)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !939)
!939 = !{!940, !941, !942, !943, !944, !945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !961, !962, !963, !964, !965, !966, !967, !968, !969, !970, !971, !972}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !938, file: !334, line: 2653, baseType: !930, size: 384)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !938, file: !334, line: 2654, baseType: !814, size: 64, offset: 384)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !938, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !938, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !938, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !938, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !938, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !938, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !938, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !938, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !938, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !938, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !938, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !938, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !938, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !938, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !938, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !938, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !938, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !938, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !938, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !938, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !938, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !938, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !938, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !938, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !938, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !938, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !938, file: !334, line: 2705, baseType: !814, size: 64, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !938, file: !334, line: 2706, baseType: !814, size: 64, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !938, file: !334, line: 2707, baseType: !814, size: 64, offset: 704)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !938, file: !334, line: 2708, baseType: !814, size: 64, offset: 768)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !938, file: !334, line: 2711, baseType: !973, size: 64, offset: 832)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !816, file: !334, line: 3383, baseType: !976, size: 960)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !977)
!977 = !{!978, !979}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !976, file: !334, line: 2757, baseType: !938, size: 896)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !976, file: !334, line: 2758, baseType: !980, size: 64, offset: 896)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !669, line: 50, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !983, line: 240, size: 384, elements: !984)
!983 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!984 = !{!985, !986, !987, !988, !989, !990, !991, !992, !993, !994, !995}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !982, file: !983, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !982, file: !983, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !982, file: !983, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !982, file: !983, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !982, file: !983, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !982, file: !983, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !982, file: !983, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !982, file: !983, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !982, file: !983, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !982, file: !983, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !982, file: !983, line: 321, baseType: !996, size: 320, offset: 64)
!996 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !983, line: 315, size: 320, elements: !997)
!997 = !{!998, !1057, !1059, !1088, !1089}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !996, file: !983, line: 316, baseType: !999, size: 64)
!999 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 64, elements: !744)
!1000 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !983, line: 183, baseType: !1001)
!1001 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !983, line: 166, size: 64, elements: !1002)
!1002 = !{!1003, !1004, !1005, !1006, !1007, !1015, !1016, !1028, !1031, !1032, !1033, !1034, !1047, !1054}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !1001, file: !983, line: 168, baseType: !661, size: 32)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !1001, file: !983, line: 169, baseType: !7, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !1001, file: !983, line: 170, baseType: !666, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !1001, file: !983, line: 171, baseType: !980, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !1001, file: !983, line: 172, baseType: !1008, size: 64)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !669, line: 53, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !983, line: 359, size: 128, elements: !1011)
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !1010, file: !983, line: 360, baseType: !661, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !1010, file: !983, line: 361, baseType: !1014, size: 64, offset: 64)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !980, size: 64, elements: !744)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !1001, file: !983, line: 173, baseType: !189, size: 32)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !1001, file: !983, line: 174, baseType: !1017, size: 32)
!1017 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !983, line: 133, baseType: !1018)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !983, line: 115, size: 32, elements: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !1018, file: !983, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !1018, file: !983, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !1018, file: !983, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !1018, file: !983, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !1018, file: !983, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !1018, file: !983, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !1018, file: !983, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !1018, file: !983, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !1001, file: !983, line: 175, baseType: !1029, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !983, line: 175, flags: DIFlagFwdDecl)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !1001, file: !983, line: 176, baseType: !670, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !1001, file: !983, line: 177, baseType: !814, size: 64)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !1001, file: !983, line: 178, baseType: !753, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !1001, file: !983, line: 179, baseType: !1035, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !983, line: 150, baseType: !1037)
!1037 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !983, line: 142, size: 320, elements: !1038)
!1038 = !{!1039, !1040, !1041, !1042, !1045, !1046}
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1037, file: !983, line: 144, baseType: !814, size: 64)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1037, file: !983, line: 145, baseType: !980, size: 64, offset: 64)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1037, file: !983, line: 146, baseType: !980, size: 64, offset: 128)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1037, file: !983, line: 147, baseType: !1043, size: 32, offset: 192)
!1043 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1044, line: 31, baseType: !661)
!1044 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1037, file: !983, line: 148, baseType: !7, size: 32, offset: 224)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1037, file: !983, line: 149, baseType: !660, size: 8, offset: 256)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !1001, file: !983, line: 180, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1049, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !983, line: 162, baseType: !1050)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !983, line: 159, size: 128, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1050, file: !983, line: 160, baseType: !814, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1050, file: !983, line: 161, baseType: !703, size: 64, offset: 64)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !1001, file: !983, line: 181, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !983, line: 181, flags: DIFlagFwdDecl)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !996, file: !983, line: 317, baseType: !1058, size: 64)
!1058 = !DICompositeType(tag: DW_TAG_array_type, baseType: !703, size: 64, elements: !744)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !996, file: !983, line: 318, baseType: !1060, size: 320)
!1060 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !983, line: 188, size: 320, elements: !1061)
!1061 = !{!1062, !1064, !1087}
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1060, file: !983, line: 190, baseType: !1063, size: 192)
!1063 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1000, size: 192, elements: !885)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1060, file: !983, line: 193, baseType: !1065, size: 64, offset: 192)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !983, line: 206, size: 320, elements: !1067)
!1067 = !{!1068, !1072, !1073, !1074, !1086}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1066, file: !983, line: 208, baseType: !1069, size: 64)
!1069 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1070, size: 64)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !669, line: 62, baseType: !1071)
!1071 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !669, line: 61, flags: DIFlagFwdDecl)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1066, file: !983, line: 211, baseType: !7, size: 32, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1066, file: !983, line: 214, baseType: !703, size: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1066, file: !983, line: 224, baseType: !1075, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1076, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !983, line: 202, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !983, line: 202, size: 128, elements: !1078)
!1078 = !{!1079}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1077, file: !983, line: 202, baseType: !1080, size: 128)
!1080 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !983, line: 200, baseType: !1081)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !983, line: 200, size: 128, elements: !1082)
!1082 = !{!1083, !1084, !1085}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1081, file: !983, line: 200, baseType: !7, size: 32)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1081, file: !983, line: 200, baseType: !7, size: 32, offset: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1081, file: !983, line: 200, baseType: !1014, size: 64, offset: 64)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1066, file: !983, line: 234, baseType: !1075, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1060, file: !983, line: 197, baseType: !703, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !996, file: !983, line: 319, baseType: !874, size: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !996, file: !983, line: 320, baseType: !893, size: 192)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !816, file: !334, line: 3384, baseType: !1091, size: 1472)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1092)
!1092 = !{!1093, !1114, !1115, !1116, !1117}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1091, file: !334, line: 3115, baseType: !1094, size: 1216)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1094, file: !334, line: 2985, baseType: !976, size: 960)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1094, file: !334, line: 2986, baseType: !814, size: 64, offset: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1094, file: !334, line: 2987, baseType: !814, size: 64, offset: 1024)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1094, file: !334, line: 2988, baseType: !814, size: 64, offset: 1088)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1094, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1094, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1094, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1094, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1094, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1094, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1094, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1094, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1094, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1094, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1094, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1094, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1094, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1094, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1091, file: !334, line: 3117, baseType: !814, size: 64, offset: 1216)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1091, file: !334, line: 3119, baseType: !814, size: 64, offset: 1280)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1091, file: !334, line: 3121, baseType: !814, size: 64, offset: 1344)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1091, file: !334, line: 3123, baseType: !814, size: 64, offset: 1408)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !816, file: !334, line: 3385, baseType: !1119, size: 1088)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1120)
!1120 = !{!1121, !1122, !1123}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1119, file: !334, line: 2875, baseType: !976, size: 960)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1119, file: !334, line: 2876, baseType: !980, size: 64, offset: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1119, file: !334, line: 2877, baseType: !1124, size: 64, offset: 1024)
!1124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1125, size: 64)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1126, line: 172, size: 128, elements: !1127)
!1126 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1127 = !{!1128, !1129, !1130, !1131, !1132, !1133, !1134}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1125, file: !1126, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1125, file: !1126, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1125, file: !1126, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1125, file: !1126, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1125, file: !1126, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1125, file: !1126, line: 195, baseType: !7, size: 32, offset: 32)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1125, file: !1126, line: 199, baseType: !814, size: 64, offset: 64)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !816, file: !334, line: 3386, baseType: !1094, size: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !816, file: !334, line: 3387, baseType: !1137, size: 1280)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1138)
!1138 = !{!1139, !1140}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !334, line: 3094, baseType: !1094, size: 1216)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1137, file: !334, line: 3095, baseType: !1124, size: 64, offset: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !816, file: !334, line: 3388, baseType: !1142, size: 1216)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147, !1148, !1149}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !334, line: 2825, baseType: !938, size: 896)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1142, file: !334, line: 2827, baseType: !814, size: 64, offset: 896)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1142, file: !334, line: 2828, baseType: !814, size: 64, offset: 960)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1142, file: !334, line: 2829, baseType: !814, size: 64, offset: 1024)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1142, file: !334, line: 2830, baseType: !814, size: 64, offset: 1088)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1142, file: !334, line: 2831, baseType: !814, size: 64, offset: 1152)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !816, file: !334, line: 3389, baseType: !1151, size: 1024)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1152)
!1152 = !{!1153, !1154, !1155}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1151, file: !334, line: 2851, baseType: !976, size: 960)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1151, file: !334, line: 2852, baseType: !661, size: 32, offset: 960)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1151, file: !334, line: 2853, baseType: !661, size: 32, offset: 992)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !816, file: !334, line: 3390, baseType: !1157, size: 1024)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1157, file: !334, line: 2858, baseType: !976, size: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1157, file: !334, line: 2859, baseType: !1124, size: 64, offset: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !816, file: !334, line: 3391, baseType: !1162, size: 960)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1163)
!1163 = !{!1164}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1162, file: !334, line: 2863, baseType: !976, size: 960)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !816, file: !334, line: 3392, baseType: !1166, size: 1472)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1167)
!1167 = !{!1168}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1166, file: !334, line: 3305, baseType: !1091, size: 1472)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !816, file: !334, line: 3393, baseType: !1170, size: 1792)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1171)
!1171 = !{!1172, !1173, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1170, file: !334, line: 3249, baseType: !1091, size: 1472)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1170, file: !334, line: 3251, baseType: !1174, size: 64, offset: 1472)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1176, line: 463, size: 1152, elements: !1177)
!1176 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1177 = !{!1178, !1181, !1212, !1213, !1352, !1372, !1373, !1374, !1375, !1376, !1377, !1401, !1404, !1405, !1406, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1175, file: !1176, line: 464, baseType: !1179, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1180, size: 64)
!1180 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1176, line: 464, flags: DIFlagFwdDecl)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1175, file: !1176, line: 467, baseType: !1182, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1183, size: 64)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1184)
!1184 = !{!1185, !1187, !1188, !1201, !1202, !1203, !1204, !1205, !1206, !1208, !1210, !1211}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1183, file: !318, line: 377, baseType: !1186, size: 64)
!1186 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !669, line: 111, baseType: !753)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1183, file: !318, line: 378, baseType: !1186, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1183, file: !318, line: 381, baseType: !1189, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1192)
!1192 = !{!1193}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1191, file: !318, line: 282, baseType: !1194, size: 128)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1196)
!1196 = !{!1197, !1198, !1199}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1195, file: !318, line: 281, baseType: !7, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1195, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1195, file: !318, line: 281, baseType: !1200, size: 64, offset: 64)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1186, size: 64, elements: !744)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1183, file: !318, line: 384, baseType: !661, size: 32, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1183, file: !318, line: 387, baseType: !661, size: 32, offset: 224)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1183, file: !318, line: 390, baseType: !661, size: 32, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1183, file: !318, line: 394, baseType: !1189, size: 64, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1183, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1183, file: !318, line: 399, baseType: !1207, size: 64, offset: 416)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !687)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1183, file: !318, line: 402, baseType: !1209, size: 64, offset: 480)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !687)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1183, file: !318, line: 406, baseType: !661, size: 32, offset: 544)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1183, file: !318, line: 409, baseType: !661, size: 32, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1175, file: !1176, line: 470, baseType: !780, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1175, file: !1176, line: 473, baseType: !1214, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1126, line: 39, size: 1152, elements: !1216)
!1216 = !{!1217, !1269, !1282, !1295, !1296, !1307, !1308, !1312, !1313, !1314, !1315, !1316}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1215, file: !1126, line: 41, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1219, line: 144, baseType: !1220)
!1219 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1219, line: 100, size: 896, elements: !1222)
!1222 = !{!1223, !1231, !1236, !1241, !1243, !1246, !1247, !1248, !1249, !1250, !1255, !1257, !1258, !1263, !1268}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1221, file: !1219, line: 102, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1219, line: 52, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!1228, !1229}
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1219, line: 47, baseType: !7)
!1229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1230, size: 64)
!1230 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1221, file: !1219, line: 105, baseType: !1232, size: 64, offset: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1219, line: 59, baseType: !1233)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = !DISubroutineType(types: !1235)
!1235 = !{!661, !1229, !1229}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1221, file: !1219, line: 108, baseType: !1237, size: 64, offset: 128)
!1237 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1219, line: 63, baseType: !1238)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = !DISubroutineType(types: !1240)
!1240 = !{null, !665}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1221, file: !1219, line: 111, baseType: !1242, size: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !1219, line: 114, baseType: !1244, size: 64, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1245, line: 46, baseType: !686)
!1245 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1221, file: !1219, line: 117, baseType: !1244, size: 64, offset: 320)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1221, file: !1219, line: 120, baseType: !1244, size: 64, offset: 384)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1221, file: !1219, line: 124, baseType: !7, size: 32, offset: 448)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1221, file: !1219, line: 128, baseType: !7, size: 32, offset: 480)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1221, file: !1219, line: 131, baseType: !1251, size: 64, offset: 512)
!1251 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1219, line: 75, baseType: !1252)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DISubroutineType(types: !1254)
!1254 = !{!665, !1244, !1244}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1221, file: !1219, line: 132, baseType: !1256, size: 64, offset: 576)
!1256 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1219, line: 78, baseType: !1238)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1221, file: !1219, line: 135, baseType: !665, size: 64, offset: 640)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1221, file: !1219, line: 136, baseType: !1259, size: 64, offset: 704)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1219, line: 82, baseType: !1260)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = !DISubroutineType(types: !1262)
!1262 = !{!665, !665, !1244, !1244}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1221, file: !1219, line: 137, baseType: !1264, size: 64, offset: 768)
!1264 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1219, line: 83, baseType: !1265)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = !DISubroutineType(types: !1267)
!1267 = !{null, !665, !665}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1221, file: !1219, line: 141, baseType: !7, size: 32, offset: 832)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1215, file: !1126, line: 48, baseType: !1270, size: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !581, line: 35, baseType: !1272)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !581, line: 35, size: 128, elements: !1273)
!1273 = !{!1274}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1272, file: !581, line: 35, baseType: !1275, size: 128)
!1275 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !581, line: 33, baseType: !1276)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !581, line: 33, size: 128, elements: !1277)
!1277 = !{!1278, !1279, !1280}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1276, file: !581, line: 33, baseType: !7, size: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1276, file: !581, line: 33, baseType: !7, size: 32, offset: 32)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1276, file: !581, line: 33, baseType: !1281, size: 64, offset: 64)
!1281 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 64, elements: !744)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1215, file: !1126, line: 51, baseType: !1283, size: 64, offset: 128)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1285)
!1285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1286)
!1286 = !{!1287}
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1285, file: !334, line: 183, baseType: !1288, size: 128)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1289)
!1289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1290)
!1290 = !{!1291, !1292, !1293}
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1289, file: !334, line: 182, baseType: !7, size: 32)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1289, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1289, file: !334, line: 182, baseType: !1294, size: 64, offset: 64)
!1294 = !DICompositeType(tag: DW_TAG_array_type, baseType: !814, size: 64, elements: !744)
!1295 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1215, file: !1126, line: 54, baseType: !814, size: 64, offset: 192)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1215, file: !1126, line: 57, baseType: !1297, size: 128, offset: 256)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1298, line: 31, size: 128, elements: !1299)
!1298 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1299 = !{!1300, !1301, !1302, !1303, !1304, !1305, !1306}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1297, file: !1298, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1297, file: !1298, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1297, file: !1298, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1297, file: !1298, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1297, file: !1298, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1297, file: !1298, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1297, file: !1298, line: 56, baseType: !668, size: 64, offset: 64)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1215, file: !1126, line: 60, baseType: !1297, size: 128, offset: 384)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1215, file: !1126, line: 64, baseType: !1309, size: 64, offset: 512)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1311, line: 33, flags: DIFlagFwdDecl)
!1311 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1215, file: !1126, line: 67, baseType: !814, size: 64, offset: 576)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1215, file: !1126, line: 73, baseType: !1218, size: 64, offset: 640)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1215, file: !1126, line: 77, baseType: !668, size: 64, offset: 704)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1215, file: !1126, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1215, file: !1126, line: 82, baseType: !1317, size: 320, offset: 832)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !652, line: 62, size: 320, elements: !1318)
!1318 = !{!1319, !1325, !1326, !1327, !1328, !1335}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1317, file: !652, line: 63, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !652, line: 56, size: 128, elements: !1322)
!1322 = !{!1323, !1324}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1321, file: !652, line: 57, baseType: !1320, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1321, file: !652, line: 58, baseType: !909, size: 8, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1317, file: !652, line: 64, baseType: !7, size: 32, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1317, file: !652, line: 66, baseType: !7, size: 32, offset: 96)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1317, file: !652, line: 68, baseType: !660, size: 8, offset: 128)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1317, file: !652, line: 70, baseType: !1329, size: 64, offset: 192)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !652, line: 37, size: 128, elements: !1331)
!1331 = !{!1332, !1333}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1330, file: !652, line: 39, baseType: !1329, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1330, file: !652, line: 40, baseType: !1334, size: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !814, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1317, file: !652, line: 71, baseType: !1336, size: 64, offset: 256)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !652, line: 45, size: 320, elements: !1338)
!1338 = !{!1339, !1340}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1337, file: !652, line: 47, baseType: !1336, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1337, file: !652, line: 48, baseType: !1341, size: 256, offset: 64)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1342)
!1342 = !{!1343, !1345, !1346, !1351}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1341, file: !334, line: 1884, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1341, file: !334, line: 1885, baseType: !1344, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1341, file: !334, line: 1891, baseType: !1347, size: 64, offset: 128)
!1347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1341, file: !334, line: 1891, size: 64, elements: !1348)
!1348 = !{!1349, !1350}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1347, file: !334, line: 1891, baseType: !789, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1347, file: !334, line: 1891, baseType: !814, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1341, file: !334, line: 1892, baseType: !1334, size: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1175, file: !1176, line: 476, baseType: !1353, size: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !561, line: 187, size: 256, elements: !1355)
!1355 = !{!1356, !1357, !1370, !1371}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1354, file: !561, line: 189, baseType: !661, size: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1354, file: !561, line: 192, baseType: !1358, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !561, line: 87, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !561, line: 87, size: 128, elements: !1361)
!1361 = !{!1362}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1360, file: !561, line: 87, baseType: !1363, size: 128)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !561, line: 85, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !561, line: 85, size: 128, elements: !1365)
!1365 = !{!1366, !1367, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1364, file: !561, line: 85, baseType: !7, size: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1364, file: !561, line: 85, baseType: !7, size: 32, offset: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1364, file: !561, line: 85, baseType: !1369, size: 64, offset: 64)
!1369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !746, size: 64, elements: !744)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1354, file: !561, line: 197, baseType: !1218, size: 64, offset: 128)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1354, file: !561, line: 200, baseType: !747, size: 64, offset: 192)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1175, file: !1176, line: 479, baseType: !1218, size: 64, offset: 320)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1175, file: !1176, line: 484, baseType: !814, size: 64, offset: 384)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1175, file: !1176, line: 488, baseType: !814, size: 64, offset: 448)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1175, file: !1176, line: 493, baseType: !814, size: 64, offset: 512)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1175, file: !1176, line: 496, baseType: !814, size: 64, offset: 576)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1175, file: !1176, line: 501, baseType: !1378, size: 64, offset: 640)
!1378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1379, size: 64)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1380)
!1380 = !{!1381, !1384, !1385, !1386, !1387, !1389, !1390, !1395, !1396, !1397, !1398, !1399, !1400}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1379, file: !329, line: 2356, baseType: !1382, size: 64)
!1382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1383, size: 64)
!1383 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1379, file: !329, line: 2357, baseType: !666, size: 64, offset: 64)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1379, file: !329, line: 2358, baseType: !661, size: 32, offset: 128)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1379, file: !329, line: 2359, baseType: !661, size: 32, offset: 160)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1379, file: !329, line: 2360, baseType: !1388, size: 128, offset: 192)
!1388 = !DICompositeType(tag: DW_TAG_array_type, baseType: !661, size: 128, elements: !712)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1379, file: !329, line: 2364, baseType: !661, size: 32, offset: 320)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1379, file: !329, line: 2367, baseType: !1391, size: 128, offset: 384)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1392)
!1392 = !{!1393, !1394}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1391, file: !329, line: 2351, baseType: !980, size: 64)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1391, file: !329, line: 2352, baseType: !703, size: 64, offset: 64)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1379, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1379, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1379, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1379, file: !329, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1379, file: !329, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1379, file: !329, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1175, file: !1176, line: 504, baseType: !1402, size: 64, offset: 704)
!1402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1403, size: 64)
!1403 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1176, line: 504, flags: DIFlagFwdDecl)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1175, file: !1176, line: 507, baseType: !1218, size: 64, offset: 768)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1175, file: !1176, line: 510, baseType: !661, size: 32, offset: 832)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1175, file: !1176, line: 513, baseType: !661, size: 32, offset: 864)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1175, file: !1176, line: 516, baseType: !807, size: 32, offset: 896)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1175, file: !1176, line: 519, baseType: !807, size: 32, offset: 928)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1175, file: !1176, line: 522, baseType: !7, size: 32, offset: 960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1175, file: !1176, line: 523, baseType: !7, size: 32, offset: 992)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1175, file: !1176, line: 528, baseType: !666, size: 64, offset: 1024)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1175, file: !1176, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1175, file: !1176, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1175, file: !1176, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1175, file: !1176, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1175, file: !1176, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1175, file: !1176, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1175, file: !1176, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1175, file: !1176, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1175, file: !1176, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1175, file: !1176, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1175, file: !1176, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1175, file: !1176, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1175, file: !1176, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1175, file: !1176, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1175, file: !1176, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1175, file: !1176, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1170, file: !334, line: 3254, baseType: !814, size: 64, offset: 1536)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1170, file: !334, line: 3257, baseType: !814, size: 64, offset: 1600)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1170, file: !334, line: 3258, baseType: !814, size: 64, offset: 1664)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1170, file: !334, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1170, file: !334, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1170, file: !334, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
