; ModuleID = 'tree-cfgcleanup.bc'
source_filename = "tree-cfgcleanup.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }

!594 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!618 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !581, line: 727, baseType: !7, size: 32, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!621 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!644 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!645 = !{!646, !647, !648, !649, !652, !653, !655, !386, !718, !981, !2138, !1015, !650, !2140, !2141}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!648 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !656, line: 47, baseType: !657)
!656 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !659, line: 75, size: 256, elements: !660)
!659 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!660 = !{!661, !676, !677, !678}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !658, file: !659, line: 76, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !659, line: 68, baseType: !664)
!664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !659, line: 63, size: 320, elements: !665)
!665 = !{!666, !668, !669, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !664, file: !659, line: 64, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !664, file: !659, line: 65, baseType: !667, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !664, file: !659, line: 66, baseType: !7, size: 32, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !664, file: !659, line: 67, baseType: !671, size: 128, offset: 192)
!671 = !DICompositeType(tag: DW_TAG_array_type, baseType: !672, size: 128, elements: !674)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !659, line: 29, baseType: !673)
!673 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!674 = !{!675}
!675 = !DISubrange(count: 2)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !658, file: !659, line: 77, baseType: !662, size: 64, offset: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !658, file: !659, line: 78, baseType: !7, size: 32, offset: 128)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !658, file: !659, line: 79, baseType: !679, size: 64, offset: 192)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !659, line: 49, baseType: !681)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !659, line: 45, size: 832, elements: !682)
!682 = !{!683, !684, !685}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !681, file: !659, line: 46, baseType: !667, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !681, file: !659, line: 47, baseType: !657, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !681, file: !659, line: 48, baseType: !686, size: 704, offset: 128)
!686 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !687, line: 164, size: 704, elements: !688)
!687 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!688 = !{!689, !691, !701, !702, !703, !704, !705, !706, !710, !714, !715, !716, !717}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !686, file: !687, line: 166, baseType: !690, size: 64)
!690 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !686, file: !687, line: 167, baseType: !692, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !687, line: 157, size: 192, elements: !694)
!694 = !{!695, !696, !697}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !693, file: !687, line: 159, baseType: !650, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !693, file: !687, line: 160, baseType: !692, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !693, file: !687, line: 161, baseType: !698, size: 32, offset: 128)
!698 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 32, elements: !699)
!699 = !{!700}
!700 = !DISubrange(count: 4)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !686, file: !687, line: 168, baseType: !650, size: 64, offset: 128)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !686, file: !687, line: 169, baseType: !650, size: 64, offset: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !686, file: !687, line: 170, baseType: !650, size: 64, offset: 256)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !686, file: !687, line: 171, baseType: !690, size: 64, offset: 320)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !686, file: !687, line: 172, baseType: !648, size: 32, offset: 384)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !686, file: !687, line: 176, baseType: !707, size: 64, offset: 448)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DISubroutineType(types: !709)
!709 = !{!692, !652, !690}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !686, file: !687, line: 177, baseType: !711, size: 64, offset: 512)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DISubroutineType(types: !713)
!713 = !{null, !652, !692}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !686, file: !687, line: 178, baseType: !652, size: 64, offset: 576)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !686, file: !687, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !686, file: !687, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !686, file: !687, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !656, line: 56, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !354, line: 3371, size: 1792, elements: !721)
!721 = !{!722, !755, !761, !772, !791, !802, !807, !816, !822, !835, !847, !885, !1371, !1399, !1416, !1417, !1422, !1431, !1437, !1442, !1446, !1450, !1789, !1836, !1842, !1848, !1855, !1868, !1882, !1899, !1911, !1933, !1948, !2120}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !720, file: !354, line: 3372, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !354, line: 360, size: 64, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !723, file: !354, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !723, file: !354, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !723, file: !354, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !723, file: !354, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !723, file: !354, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !723, file: !354, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !723, file: !354, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !723, file: !354, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !723, file: !354, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !723, file: !354, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !723, file: !354, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !723, file: !354, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !723, file: !354, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !723, file: !354, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !723, file: !354, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !723, file: !354, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !723, file: !354, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !723, file: !354, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !723, file: !354, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !723, file: !354, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !723, file: !354, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !723, file: !354, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !723, file: !354, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !723, file: !354, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !723, file: !354, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !723, file: !354, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !723, file: !354, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !723, file: !354, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !723, file: !354, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !723, file: !354, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !720, file: !354, line: 3373, baseType: !756, size: 192)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !354, line: 402, size: 192, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !756, file: !354, line: 403, baseType: !723, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !756, file: !354, line: 404, baseType: !718, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !354, line: 405, baseType: !718, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !720, file: !354, line: 3374, baseType: !762, size: 320)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !354, line: 1384, size: 320, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !354, line: 1385, baseType: !756, size: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !762, file: !354, line: 1386, baseType: !766, size: 128, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !767, line: 58, baseType: !768)
!767 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !767, line: 54, size: 128, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !768, file: !767, line: 56, baseType: !673, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !768, file: !767, line: 57, baseType: !690, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !720, file: !354, line: 3375, baseType: !773, size: 256)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !354, line: 1397, size: 256, elements: !774)
!774 = !{!775, !776}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !773, file: !354, line: 1398, baseType: !756, size: 192)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !773, file: !354, line: 1399, baseType: !777, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !779, line: 52, size: 256, elements: !780)
!779 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!780 = !{!781, !782, !783, !784, !785, !786, !787}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !778, file: !779, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !778, file: !779, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !778, file: !779, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !778, file: !779, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !778, file: !779, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !778, file: !779, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !778, file: !779, line: 62, baseType: !788, size: 192, offset: 64)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 192, elements: !789)
!789 = !{!790}
!790 = !DISubrange(count: 3)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !720, file: !354, line: 3376, baseType: !792, size: 256)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !354, line: 1408, size: 256, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !354, line: 1409, baseType: !756, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !792, file: !354, line: 1410, baseType: !796, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !798, line: 27, size: 192, elements: !799)
!798 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!799 = !{!800, !801}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !797, file: !798, line: 29, baseType: !766, size: 128)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !797, file: !798, line: 30, baseType: !189, size: 32, offset: 128)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !720, file: !354, line: 3377, baseType: !803, size: 256)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !354, line: 1437, size: 256, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !354, line: 1438, baseType: !756, size: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !803, file: !354, line: 1439, baseType: !718, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !720, file: !354, line: 3378, baseType: !808, size: 256)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !354, line: 1418, size: 256, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !808, file: !354, line: 1419, baseType: !756, size: 192)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !808, file: !354, line: 1420, baseType: !648, size: 32, offset: 192)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !808, file: !354, line: 1421, baseType: !813, size: 8, offset: 224)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 8, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 1)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !720, file: !354, line: 3379, baseType: !817, size: 320)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !354, line: 1428, size: 320, elements: !818)
!818 = !{!819, !820, !821}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !817, file: !354, line: 1429, baseType: !756, size: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !817, file: !354, line: 1430, baseType: !718, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !817, file: !354, line: 1431, baseType: !718, size: 64, offset: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !720, file: !354, line: 3380, baseType: !823, size: 320)
!823 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !354, line: 1460, size: 320, elements: !824)
!824 = !{!825, !826}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !823, file: !354, line: 1461, baseType: !756, size: 192)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !823, file: !354, line: 1462, baseType: !827, size: 128, offset: 192)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !828, line: 31, size: 128, elements: !829)
!828 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!829 = !{!830, !833, !834}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !827, file: !828, line: 32, baseType: !831, size: 64)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !827, file: !828, line: 33, baseType: !7, size: 32, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !827, file: !828, line: 34, baseType: !7, size: 32, offset: 96)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !720, file: !354, line: 3381, baseType: !836, size: 384)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !354, line: 2507, size: 384, elements: !837)
!837 = !{!838, !839, !844, !845, !846}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !836, file: !354, line: 2508, baseType: !756, size: 192)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !836, file: !354, line: 2509, baseType: !840, size: 32, offset: 192)
!840 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !841, line: 58, baseType: !842)
!841 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!842 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !843, line: 44, baseType: !7)
!843 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!844 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !836, file: !354, line: 2510, baseType: !7, size: 32, offset: 224)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !836, file: !354, line: 2511, baseType: !718, size: 64, offset: 256)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !836, file: !354, line: 2512, baseType: !718, size: 64, offset: 320)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !720, file: !354, line: 3382, baseType: !848, size: 896)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !354, line: 2652, size: 896, elements: !849)
!849 = !{!850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !848, file: !354, line: 2653, baseType: !836, size: 384)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !848, file: !354, line: 2654, baseType: !718, size: 64, offset: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !848, file: !354, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !848, file: !354, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !848, file: !354, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !848, file: !354, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !848, file: !354, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !848, file: !354, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !848, file: !354, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !848, file: !354, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !848, file: !354, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !848, file: !354, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !848, file: !354, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !848, file: !354, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !848, file: !354, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !848, file: !354, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !848, file: !354, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !848, file: !354, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !848, file: !354, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !848, file: !354, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !848, file: !354, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !848, file: !354, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !848, file: !354, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !848, file: !354, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !848, file: !354, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !848, file: !354, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !848, file: !354, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !848, file: !354, line: 2703, baseType: !7, size: 32, offset: 512)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !848, file: !354, line: 2705, baseType: !718, size: 64, offset: 576)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !848, file: !354, line: 2706, baseType: !718, size: 64, offset: 640)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !848, file: !354, line: 2707, baseType: !718, size: 64, offset: 704)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !848, file: !354, line: 2708, baseType: !718, size: 64, offset: 768)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !848, file: !354, line: 2711, baseType: !883, size: 64, offset: 832)
!883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !884, size: 64)
!884 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !354, line: 2711, flags: DIFlagFwdDecl)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !720, file: !354, line: 3383, baseType: !886, size: 960)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !354, line: 2756, size: 960, elements: !887)
!887 = !{!888, !889}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !886, file: !354, line: 2757, baseType: !848, size: 896)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !886, file: !354, line: 2758, baseType: !890, size: 64, offset: 896)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !656, line: 50, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !893, line: 240, size: 384, elements: !894)
!893 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!894 = !{!895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !892, file: !893, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !892, file: !893, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !892, file: !893, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !892, file: !893, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !892, file: !893, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !892, file: !893, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !892, file: !893, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !892, file: !893, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !892, file: !893, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !892, file: !893, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !892, file: !893, line: 321, baseType: !906, size: 320, offset: 64)
!906 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !893, line: 315, size: 320, elements: !907)
!907 = !{!908, !1304, !1306, !1369, !1370}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !906, file: !893, line: 316, baseType: !909, size: 64)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 64, elements: !814)
!910 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !893, line: 183, baseType: !911)
!911 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !893, line: 166, size: 64, elements: !912)
!912 = !{!913, !914, !915, !916, !917, !925, !926, !938, !941, !942, !943, !1281, !1294, !1301}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !911, file: !893, line: 168, baseType: !648, size: 32)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !911, file: !893, line: 169, baseType: !7, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !911, file: !893, line: 170, baseType: !653, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !911, file: !893, line: 171, baseType: !890, size: 64)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !911, file: !893, line: 172, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !656, line: 53, baseType: !919)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !893, line: 359, size: 128, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !920, file: !893, line: 360, baseType: !648, size: 32)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !920, file: !893, line: 361, baseType: !924, size: 64, offset: 64)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !890, size: 64, elements: !814)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !911, file: !893, line: 173, baseType: !189, size: 32)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !911, file: !893, line: 174, baseType: !927, size: 32)
!927 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !893, line: 133, baseType: !928)
!928 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !893, line: 115, size: 32, elements: !929)
!929 = !{!930, !931, !932, !933, !934, !935, !936, !937}
!930 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !928, file: !893, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !928, file: !893, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !928, file: !893, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !928, file: !893, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !928, file: !893, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !928, file: !893, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !928, file: !893, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !928, file: !893, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !911, file: !893, line: 175, baseType: !939, size: 64)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !893, line: 175, flags: DIFlagFwdDecl)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !911, file: !893, line: 176, baseType: !657, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !911, file: !893, line: 177, baseType: !718, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !911, file: !893, line: 178, baseType: !944, size: 64)
!944 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !945, size: 64)
!945 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !946)
!946 = !{!947, !1193, !1194, !1195, !1251, !1255, !1256, !1257, !1275, !1276, !1277, !1278, !1279, !1280}
!947 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !945, file: !325, line: 219, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !950)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !951)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !950, file: !325, line: 151, baseType: !953, size: 128)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !955)
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !954, file: !325, line: 150, baseType: !7, size: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !954, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !954, file: !325, line: 150, baseType: !959, size: 64, offset: 64)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !960, size: 64, elements: !814)
!960 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !656, line: 108, baseType: !961)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !963)
!963 = !{!964, !965, !966, !1185, !1186, !1187, !1188, !1189, !1190, !1191}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !962, file: !325, line: 124, baseType: !944, size: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !962, file: !325, line: 125, baseType: !944, size: 64, offset: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !962, file: !325, line: 131, baseType: !967, size: 64, offset: 128)
!967 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !968)
!968 = !{!969, !1184}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !967, file: !325, line: 129, baseType: !970, size: 64)
!970 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !656, line: 66, baseType: !971)
!971 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !972, size: 64)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !581, line: 143, size: 192, elements: !973)
!973 = !{!974, !1182, !1183}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !972, file: !581, line: 145, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !656, line: 69, baseType: !976)
!976 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !977, size: 64)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !581, line: 136, size: 192, elements: !978)
!978 = !{!979, !1180, !1181}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !977, file: !581, line: 137, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !656, line: 58, baseType: !981)
!981 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !982, size: 64)
!982 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !581, line: 737, size: 768, elements: !983)
!983 = !{!984, !1001, !1035, !1041, !1046, !1051, !1058, !1064, !1070, !1075, !1089, !1094, !1100, !1105, !1115, !1120, !1138, !1145, !1152, !1158, !1163, !1169, !1175}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !982, file: !581, line: 738, baseType: !985, size: 256)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !581, line: 271, size: 256, elements: !986)
!986 = !{!987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999, !1000}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !985, file: !581, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !985, file: !581, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !985, file: !581, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !985, file: !581, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !985, file: !581, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !985, file: !581, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !985, file: !581, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !985, file: !581, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !985, file: !581, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !985, file: !581, line: 312, baseType: !7, size: 32, offset: 32)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !985, file: !581, line: 316, baseType: !840, size: 32, offset: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !985, file: !581, line: 319, baseType: !7, size: 32, offset: 96)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !985, file: !581, line: 323, baseType: !944, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !985, file: !581, line: 327, baseType: !718, size: 64, offset: 192)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !982, file: !581, line: 739, baseType: !1002, size: 448)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !581, line: 350, size: 448, elements: !1003)
!1003 = !{!1004, !1033}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1002, file: !581, line: 353, baseType: !1005, size: 384)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !581, line: 333, size: 384, elements: !1006)
!1006 = !{!1007, !1008, !1016}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1005, file: !581, line: 336, baseType: !985, size: 256)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1005, file: !581, line: 343, baseType: !1009, size: 64, offset: 256)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1011, line: 37, size: 128, elements: !1012)
!1011 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1010, file: !1011, line: 39, baseType: !1009, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1010, file: !1011, line: 40, baseType: !1015, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1005, file: !581, line: 344, baseType: !1017, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1011, line: 45, size: 320, elements: !1019)
!1019 = !{!1020, !1021}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1018, file: !1011, line: 47, baseType: !1017, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1018, file: !1011, line: 48, baseType: !1022, size: 256, offset: 64)
!1022 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !354, line: 1883, size: 256, elements: !1023)
!1023 = !{!1024, !1026, !1027, !1032}
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1022, file: !354, line: 1884, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1022, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1022, file: !354, line: 1885, baseType: !1025, size: 64, offset: 64)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1022, file: !354, line: 1891, baseType: !1028, size: 64, offset: 128)
!1028 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1022, file: !354, line: 1891, size: 64, elements: !1029)
!1029 = !{!1030, !1031}
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1028, file: !354, line: 1891, baseType: !980, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1028, file: !354, line: 1891, baseType: !718, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1022, file: !354, line: 1892, baseType: !1015, size: 64, offset: 192)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1002, file: !581, line: 359, baseType: !1034, size: 64, offset: 384)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 64, elements: !814)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !982, file: !581, line: 740, baseType: !1036, size: 512)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !581, line: 365, size: 512, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1036, file: !581, line: 368, baseType: !1005, size: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1036, file: !581, line: 373, baseType: !718, size: 64, offset: 384)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1036, file: !581, line: 374, baseType: !718, size: 64, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !982, file: !581, line: 741, baseType: !1042, size: 576)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !581, line: 380, size: 576, elements: !1043)
!1043 = !{!1044, !1045}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1042, file: !581, line: 383, baseType: !1036, size: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1042, file: !581, line: 389, baseType: !1034, size: 64, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !982, file: !581, line: 742, baseType: !1047, size: 320)
!1047 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !581, line: 395, size: 320, elements: !1048)
!1048 = !{!1049, !1050}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1047, file: !581, line: 397, baseType: !985, size: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1047, file: !581, line: 400, baseType: !970, size: 64, offset: 256)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !982, file: !581, line: 743, baseType: !1052, size: 448)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !581, line: 406, size: 448, elements: !1053)
!1053 = !{!1054, !1055, !1056, !1057}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1052, file: !581, line: 408, baseType: !985, size: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1052, file: !581, line: 412, baseType: !718, size: 64, offset: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1052, file: !581, line: 420, baseType: !718, size: 64, offset: 320)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1052, file: !581, line: 423, baseType: !970, size: 64, offset: 384)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !982, file: !581, line: 744, baseType: !1059, size: 384)
!1059 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !581, line: 429, size: 384, elements: !1060)
!1060 = !{!1061, !1062, !1063}
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1059, file: !581, line: 431, baseType: !985, size: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1059, file: !581, line: 434, baseType: !718, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1059, file: !581, line: 437, baseType: !970, size: 64, offset: 320)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !982, file: !581, line: 745, baseType: !1065, size: 384)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !581, line: 443, size: 384, elements: !1066)
!1066 = !{!1067, !1068, !1069}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1065, file: !581, line: 445, baseType: !985, size: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1065, file: !581, line: 449, baseType: !718, size: 64, offset: 256)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1065, file: !581, line: 453, baseType: !970, size: 64, offset: 320)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !982, file: !581, line: 746, baseType: !1071, size: 320)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !581, line: 459, size: 320, elements: !1072)
!1072 = !{!1073, !1074}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1071, file: !581, line: 461, baseType: !985, size: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1071, file: !581, line: 464, baseType: !718, size: 64, offset: 256)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !982, file: !581, line: 747, baseType: !1076, size: 768)
!1076 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !581, line: 469, size: 768, elements: !1077)
!1077 = !{!1078, !1079, !1080, !1081, !1082}
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1076, file: !581, line: 471, baseType: !985, size: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1076, file: !581, line: 474, baseType: !7, size: 32, offset: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1076, file: !581, line: 475, baseType: !7, size: 32, offset: 288)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1076, file: !581, line: 478, baseType: !718, size: 64, offset: 320)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1076, file: !581, line: 481, baseType: !1083, size: 384, offset: 384)
!1083 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1084, size: 384, elements: !814)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !354, line: 1917, size: 384, elements: !1085)
!1085 = !{!1086, !1087, !1088}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1084, file: !354, line: 1920, baseType: !1022, size: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1084, file: !354, line: 1921, baseType: !718, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1084, file: !354, line: 1922, baseType: !840, size: 32, offset: 320)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !982, file: !581, line: 748, baseType: !1090, size: 320)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !581, line: 487, size: 320, elements: !1091)
!1091 = !{!1092, !1093}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1090, file: !581, line: 490, baseType: !985, size: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1090, file: !581, line: 494, baseType: !648, size: 32, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !982, file: !581, line: 749, baseType: !1095, size: 384)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !581, line: 500, size: 384, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1095, file: !581, line: 502, baseType: !985, size: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1095, file: !581, line: 506, baseType: !970, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1095, file: !581, line: 510, baseType: !970, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !982, file: !581, line: 750, baseType: !1101, size: 320)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !581, line: 529, size: 320, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1101, file: !581, line: 531, baseType: !985, size: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1101, file: !581, line: 540, baseType: !970, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !982, file: !581, line: 751, baseType: !1106, size: 704)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !581, line: 546, size: 704, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112, !1113, !1114}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1106, file: !581, line: 549, baseType: !1036, size: 512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1106, file: !581, line: 553, baseType: !653, size: 64, offset: 512)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1106, file: !581, line: 557, baseType: !647, size: 8, offset: 576)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1106, file: !581, line: 558, baseType: !647, size: 8, offset: 584)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1106, file: !581, line: 559, baseType: !647, size: 8, offset: 592)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1106, file: !581, line: 560, baseType: !647, size: 8, offset: 600)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1106, file: !581, line: 566, baseType: !1034, size: 64, offset: 640)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !982, file: !581, line: 752, baseType: !1116, size: 384)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !581, line: 571, size: 384, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1116, file: !581, line: 573, baseType: !1047, size: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1116, file: !581, line: 577, baseType: !718, size: 64, offset: 320)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !982, file: !581, line: 753, baseType: !1121, size: 576)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !581, line: 600, size: 576, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1128, !1137}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1121, file: !581, line: 602, baseType: !1047, size: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1121, file: !581, line: 605, baseType: !718, size: 64, offset: 320)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1121, file: !581, line: 609, baseType: !1126, size: 64, offset: 384)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1127, line: 46, baseType: !673)
!1127 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1121, file: !581, line: 612, baseType: !1129, size: 64, offset: 448)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !581, line: 581, size: 320, elements: !1131)
!1131 = !{!1132, !1133, !1134, !1135, !1136}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1130, file: !581, line: 583, baseType: !386, size: 32)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1130, file: !581, line: 586, baseType: !718, size: 64, offset: 64)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1130, file: !581, line: 589, baseType: !718, size: 64, offset: 128)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1130, file: !581, line: 592, baseType: !718, size: 64, offset: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1130, file: !581, line: 595, baseType: !718, size: 64, offset: 256)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1121, file: !581, line: 616, baseType: !970, size: 64, offset: 512)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !982, file: !581, line: 754, baseType: !1139, size: 512)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !581, line: 622, size: 512, elements: !1140)
!1140 = !{!1141, !1142, !1143, !1144}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1139, file: !581, line: 624, baseType: !1047, size: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1139, file: !581, line: 628, baseType: !718, size: 64, offset: 320)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1139, file: !581, line: 632, baseType: !718, size: 64, offset: 384)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1139, file: !581, line: 636, baseType: !718, size: 64, offset: 448)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !982, file: !581, line: 755, baseType: !1146, size: 704)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !581, line: 642, size: 704, elements: !1147)
!1147 = !{!1148, !1149, !1150, !1151}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1146, file: !581, line: 644, baseType: !1139, size: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1146, file: !581, line: 648, baseType: !718, size: 64, offset: 512)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1146, file: !581, line: 652, baseType: !718, size: 64, offset: 576)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1146, file: !581, line: 653, baseType: !718, size: 64, offset: 640)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !982, file: !581, line: 756, baseType: !1153, size: 448)
!1153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !581, line: 663, size: 448, elements: !1154)
!1154 = !{!1155, !1156, !1157}
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1153, file: !581, line: 665, baseType: !1047, size: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1153, file: !581, line: 668, baseType: !718, size: 64, offset: 320)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1153, file: !581, line: 673, baseType: !718, size: 64, offset: 384)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !982, file: !581, line: 757, baseType: !1159, size: 384)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !581, line: 694, size: 384, elements: !1160)
!1160 = !{!1161, !1162}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1159, file: !581, line: 696, baseType: !1047, size: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1159, file: !581, line: 699, baseType: !718, size: 64, offset: 320)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !982, file: !581, line: 758, baseType: !1164, size: 384)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !581, line: 681, size: 384, elements: !1165)
!1165 = !{!1166, !1167, !1168}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1164, file: !581, line: 683, baseType: !985, size: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1164, file: !581, line: 686, baseType: !718, size: 64, offset: 256)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1164, file: !581, line: 689, baseType: !718, size: 64, offset: 320)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !982, file: !581, line: 759, baseType: !1170, size: 384)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !581, line: 707, size: 384, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1170, file: !581, line: 709, baseType: !985, size: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1170, file: !581, line: 712, baseType: !718, size: 64, offset: 256)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1170, file: !581, line: 712, baseType: !718, size: 64, offset: 320)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !982, file: !581, line: 760, baseType: !1176, size: 320)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !581, line: 718, size: 320, elements: !1177)
!1177 = !{!1178, !1179}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1176, file: !581, line: 720, baseType: !985, size: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1176, file: !581, line: 723, baseType: !718, size: 64, offset: 256)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !977, file: !581, line: 138, baseType: !976, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !977, file: !581, line: 139, baseType: !976, size: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !972, file: !581, line: 146, baseType: !975, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !972, file: !581, line: 152, baseType: !970, size: 64, offset: 128)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !967, file: !325, line: 130, baseType: !890, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !962, file: !325, line: 134, baseType: !652, size: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !962, file: !325, line: 137, baseType: !718, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !962, file: !325, line: 138, baseType: !840, size: 32, offset: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !962, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !962, file: !325, line: 144, baseType: !648, size: 32, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !962, file: !325, line: 145, baseType: !648, size: 32, offset: 416)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !962, file: !325, line: 146, baseType: !1192, size: 64, offset: 448)
!1192 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !690)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !945, file: !325, line: 220, baseType: !948, size: 64, offset: 64)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !945, file: !325, line: 223, baseType: !652, size: 64, offset: 128)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !945, file: !325, line: 226, baseType: !1196, size: 64, offset: 192)
!1196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1197, size: 64)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !336, line: 100, size: 1216, elements: !1198)
!1198 = !{!1199, !1200, !1201, !1202, !1203, !1208, !1209, !1210, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1233, !1241, !1249, !1250}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1197, file: !336, line: 102, baseType: !648, size: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1197, file: !336, line: 105, baseType: !7, size: 32, offset: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1197, file: !336, line: 108, baseType: !944, size: 64, offset: 64)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1197, file: !336, line: 111, baseType: !944, size: 64, offset: 128)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1197, file: !336, line: 114, baseType: !1204, size: 64, offset: 192)
!1204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !336, line: 41, size: 64, elements: !1205)
!1205 = !{!1206, !1207}
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1204, file: !336, line: 42, baseType: !335, size: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1204, file: !336, line: 43, baseType: !7, size: 32, offset: 32)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1197, file: !336, line: 117, baseType: !7, size: 32, offset: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1197, file: !336, line: 120, baseType: !7, size: 32, offset: 288)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1197, file: !336, line: 123, baseType: !1211, size: 64, offset: 320)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !336, line: 87, baseType: !1213)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !336, line: 87, size: 128, elements: !1214)
!1214 = !{!1215}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1213, file: !336, line: 87, baseType: !1216, size: 128)
!1216 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !336, line: 85, baseType: !1217)
!1217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !336, line: 85, size: 128, elements: !1218)
!1218 = !{!1219, !1220, !1221}
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1217, file: !336, line: 85, baseType: !7, size: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1217, file: !336, line: 85, baseType: !7, size: 32, offset: 32)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1217, file: !336, line: 85, baseType: !1222, size: 64, offset: 64)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1223, size: 64, elements: !814)
!1223 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !336, line: 84, baseType: !1196)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1197, file: !336, line: 126, baseType: !1196, size: 64, offset: 384)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1197, file: !336, line: 129, baseType: !1196, size: 64, offset: 448)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1197, file: !336, line: 132, baseType: !652, size: 64, offset: 512)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1197, file: !336, line: 139, baseType: !718, size: 64, offset: 576)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1197, file: !336, line: 143, baseType: !766, size: 128, offset: 640)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1197, file: !336, line: 146, baseType: !766, size: 128, offset: 768)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1197, file: !336, line: 148, baseType: !647, size: 8, offset: 896)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1197, file: !336, line: 149, baseType: !647, size: 8, offset: 904)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1197, file: !336, line: 153, baseType: !344, size: 32, offset: 928)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1197, file: !336, line: 156, baseType: !1234, size: 64, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1235, size: 64)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !336, line: 48, size: 320, elements: !1236)
!1236 = !{!1237, !1238, !1239, !1240}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1235, file: !336, line: 50, baseType: !980, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1235, file: !336, line: 59, baseType: !766, size: 128, offset: 64)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1235, file: !336, line: 64, baseType: !647, size: 8, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1235, file: !336, line: 67, baseType: !1234, size: 64, offset: 256)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1197, file: !336, line: 159, baseType: !1242, size: 64, offset: 1024)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !336, line: 72, size: 256, elements: !1244)
!1244 = !{!1245, !1246, !1247, !1248}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1243, file: !336, line: 74, baseType: !961, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1243, file: !336, line: 77, baseType: !1242, size: 64, offset: 64)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1243, file: !336, line: 78, baseType: !1242, size: 64, offset: 128)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1243, file: !336, line: 81, baseType: !1242, size: 64, offset: 192)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1197, file: !336, line: 162, baseType: !647, size: 8, offset: 1088)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1197, file: !336, line: 166, baseType: !718, size: 64, offset: 1152)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !945, file: !325, line: 229, baseType: !1252, size: 128, offset: 256)
!1252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1253, size: 128, elements: !674)
!1253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1254, size: 64)
!1254 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !945, file: !325, line: 232, baseType: !944, size: 64, offset: 384)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !945, file: !325, line: 233, baseType: !944, size: 64, offset: 448)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !945, file: !325, line: 238, baseType: !1258, size: 64, offset: 512)
!1258 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1259)
!1259 = !{!1260, !1266}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1258, file: !325, line: 236, baseType: !1261, size: 64)
!1261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1262, size: 64)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1263)
!1263 = !{!1264, !1265}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1262, file: !325, line: 275, baseType: !970, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1262, file: !325, line: 278, baseType: !970, size: 64, offset: 64)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1258, file: !325, line: 237, baseType: !1267, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1268, size: 64)
!1268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1269)
!1269 = !{!1270, !1271, !1272, !1273, !1274}
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1268, file: !325, line: 261, baseType: !890, size: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1268, file: !325, line: 262, baseType: !890, size: 64, offset: 64)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1268, file: !325, line: 266, baseType: !890, size: 64, offset: 128)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1268, file: !325, line: 267, baseType: !890, size: 64, offset: 192)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1268, file: !325, line: 270, baseType: !648, size: 32, offset: 256)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !945, file: !325, line: 241, baseType: !1192, size: 64, offset: 576)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !945, file: !325, line: 244, baseType: !648, size: 32, offset: 640)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !945, file: !325, line: 247, baseType: !648, size: 32, offset: 672)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !945, file: !325, line: 250, baseType: !648, size: 32, offset: 704)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !945, file: !325, line: 253, baseType: !648, size: 32, offset: 736)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !945, file: !325, line: 256, baseType: !648, size: 32, offset: 768)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !911, file: !893, line: 179, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1283, size: 64)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !893, line: 150, baseType: !1284)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !893, line: 142, size: 320, elements: !1285)
!1285 = !{!1286, !1287, !1288, !1289, !1292, !1293}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1284, file: !893, line: 144, baseType: !718, size: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1284, file: !893, line: 145, baseType: !890, size: 64, offset: 64)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1284, file: !893, line: 146, baseType: !890, size: 64, offset: 128)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1284, file: !893, line: 147, baseType: !1290, size: 32, offset: 192)
!1290 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1291, line: 31, baseType: !648)
!1291 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1284, file: !893, line: 148, baseType: !7, size: 32, offset: 224)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1284, file: !893, line: 149, baseType: !647, size: 8, offset: 256)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !911, file: !893, line: 180, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !893, line: 162, baseType: !1297)
!1297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !893, line: 159, size: 128, elements: !1298)
!1298 = !{!1299, !1300}
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1297, file: !893, line: 160, baseType: !718, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1297, file: !893, line: 161, baseType: !690, size: 64, offset: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !911, file: !893, line: 181, baseType: !1302, size: 64)
!1302 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1303, size: 64)
!1303 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !893, line: 181, flags: DIFlagFwdDecl)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !906, file: !893, line: 317, baseType: !1305, size: 64)
!1305 = !DICompositeType(tag: DW_TAG_array_type, baseType: !690, size: 64, elements: !814)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !906, file: !893, line: 318, baseType: !1307, size: 320)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !893, line: 188, size: 320, elements: !1308)
!1308 = !{!1309, !1311, !1368}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1307, file: !893, line: 190, baseType: !1310, size: 192)
!1310 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 192, elements: !789)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1307, file: !893, line: 193, baseType: !1312, size: 64, offset: 192)
!1312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1313, size: 64)
!1313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !893, line: 206, size: 320, elements: !1314)
!1314 = !{!1315, !1353, !1354, !1355, !1367}
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1313, file: !893, line: 208, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1317, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !656, line: 62, baseType: !1318)
!1318 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1319, line: 538, size: 256, elements: !1320)
!1319 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1320 = !{!1321, !1325, !1331, !1344}
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1318, file: !1319, line: 539, baseType: !1322, size: 32)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1319, line: 482, size: 32, elements: !1323)
!1323 = !{!1324}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1322, file: !1319, line: 484, baseType: !7, size: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1318, file: !1319, line: 540, baseType: !1326, size: 192)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1319, line: 488, size: 192, elements: !1327)
!1327 = !{!1328, !1329, !1330}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1326, file: !1319, line: 489, baseType: !1322, size: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1326, file: !1319, line: 492, baseType: !653, size: 64, offset: 64)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1326, file: !1319, line: 496, baseType: !718, size: 64, offset: 128)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1318, file: !1319, line: 541, baseType: !1332, size: 256)
!1332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1319, line: 504, size: 256, elements: !1333)
!1333 = !{!1334, !1335, !1342, !1343}
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1332, file: !1319, line: 505, baseType: !1322, size: 32)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1332, file: !1319, line: 509, baseType: !1336, size: 64, offset: 64)
!1336 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1319, line: 501, baseType: !1337)
!1337 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1338, size: 64)
!1338 = !DISubroutineType(types: !1339)
!1339 = !{null, !1340}
!1340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1332, file: !1319, line: 510, baseType: !1340, size: 64, offset: 128)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1332, file: !1319, line: 513, baseType: !1316, size: 64, offset: 192)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1318, file: !1319, line: 542, baseType: !1345, size: 128)
!1345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1319, line: 530, size: 128, elements: !1346)
!1346 = !{!1347, !1348}
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1345, file: !1319, line: 531, baseType: !1322, size: 32)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1345, file: !1319, line: 534, baseType: !1349, size: 64, offset: 64)
!1349 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1319, line: 525, baseType: !1350)
!1350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1351, size: 64)
!1351 = !DISubroutineType(types: !1352)
!1352 = !{!647, !718, !653, !673, !673}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1313, file: !893, line: 211, baseType: !7, size: 32, offset: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1313, file: !893, line: 214, baseType: !690, size: 64, offset: 128)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1313, file: !893, line: 224, baseType: !1356, size: 64, offset: 192)
!1356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1357, size: 64)
!1357 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !893, line: 202, baseType: !1358)
!1358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !893, line: 202, size: 128, elements: !1359)
!1359 = !{!1360}
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1358, file: !893, line: 202, baseType: !1361, size: 128)
!1361 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !893, line: 200, baseType: !1362)
!1362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !893, line: 200, size: 128, elements: !1363)
!1363 = !{!1364, !1365, !1366}
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1362, file: !893, line: 200, baseType: !7, size: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1362, file: !893, line: 200, baseType: !7, size: 32, offset: 32)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1362, file: !893, line: 200, baseType: !924, size: 64, offset: 64)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1313, file: !893, line: 234, baseType: !1356, size: 64, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1307, file: !893, line: 197, baseType: !690, size: 64, offset: 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !906, file: !893, line: 319, baseType: !778, size: 256)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !906, file: !893, line: 320, baseType: !797, size: 192)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !720, file: !354, line: 3384, baseType: !1372, size: 1472)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !354, line: 3114, size: 1472, elements: !1373)
!1373 = !{!1374, !1395, !1396, !1397, !1398}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1372, file: !354, line: 3115, baseType: !1375, size: 1216)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !354, line: 2984, size: 1216, elements: !1376)
!1376 = !{!1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1375, file: !354, line: 2985, baseType: !886, size: 960)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1375, file: !354, line: 2986, baseType: !718, size: 64, offset: 960)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1375, file: !354, line: 2987, baseType: !718, size: 64, offset: 1024)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1375, file: !354, line: 2988, baseType: !718, size: 64, offset: 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1375, file: !354, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1375, file: !354, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1375, file: !354, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1375, file: !354, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1375, file: !354, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1375, file: !354, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1375, file: !354, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1375, file: !354, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1375, file: !354, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1375, file: !354, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1375, file: !354, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1375, file: !354, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1375, file: !354, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1375, file: !354, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1372, file: !354, line: 3117, baseType: !718, size: 64, offset: 1216)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1372, file: !354, line: 3119, baseType: !718, size: 64, offset: 1280)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1372, file: !354, line: 3121, baseType: !718, size: 64, offset: 1344)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1372, file: !354, line: 3123, baseType: !718, size: 64, offset: 1408)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !720, file: !354, line: 3385, baseType: !1400, size: 1088)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !354, line: 2874, size: 1088, elements: !1401)
!1401 = !{!1402, !1403, !1404}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1400, file: !354, line: 2875, baseType: !886, size: 960)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1400, file: !354, line: 2876, baseType: !890, size: 64, offset: 960)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1400, file: !354, line: 2877, baseType: !1405, size: 64, offset: 1024)
!1405 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1406, size: 64)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1407, line: 172, size: 128, elements: !1408)
!1407 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1408 = !{!1409, !1410, !1411, !1412, !1413, !1414, !1415}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1406, file: !1407, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1406, file: !1407, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1406, file: !1407, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1406, file: !1407, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1406, file: !1407, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1406, file: !1407, line: 195, baseType: !7, size: 32, offset: 32)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1406, file: !1407, line: 199, baseType: !718, size: 64, offset: 64)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !720, file: !354, line: 3386, baseType: !1375, size: 1216)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !720, file: !354, line: 3387, baseType: !1418, size: 1280)
!1418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !354, line: 3093, size: 1280, elements: !1419)
!1419 = !{!1420, !1421}
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1418, file: !354, line: 3094, baseType: !1375, size: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1418, file: !354, line: 3095, baseType: !1405, size: 64, offset: 1216)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !720, file: !354, line: 3388, baseType: !1423, size: 1216)
!1423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !354, line: 2824, size: 1216, elements: !1424)
!1424 = !{!1425, !1426, !1427, !1428, !1429, !1430}
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1423, file: !354, line: 2825, baseType: !848, size: 896)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1423, file: !354, line: 2827, baseType: !718, size: 64, offset: 896)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1423, file: !354, line: 2828, baseType: !718, size: 64, offset: 960)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1423, file: !354, line: 2829, baseType: !718, size: 64, offset: 1024)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1423, file: !354, line: 2830, baseType: !718, size: 64, offset: 1088)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1423, file: !354, line: 2831, baseType: !718, size: 64, offset: 1152)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !720, file: !354, line: 3389, baseType: !1432, size: 1024)
!1432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !354, line: 2850, size: 1024, elements: !1433)
!1433 = !{!1434, !1435, !1436}
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1432, file: !354, line: 2851, baseType: !886, size: 960)
