; ModuleID = 'tree-ssa-sink.bc'
source_filename = "tree-ssa-sink.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.anon = type { i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!595 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!611 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !613, line: 119, baseType: !7, size: 32, elements: !614)
!613 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!614 = !{!615, !616, !617, !618}
!615 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!616 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!617 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!618 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !574, line: 727, baseType: !7, size: 32, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!621 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!644 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!645 = !{!646, !647, !648, !649, !652, !653, !196, !655, !2007, !980, !2010, !1013, !650, !2012, !1549, !2013}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!648 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !656, line: 56, baseType: !657)
!656 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !659)
!659 = !{!660, !693, !699, !712, !731, !742, !747, !756, !762, !775, !787, !825, !1335, !1363, !1380, !1381, !1386, !1395, !1401, !1406, !1410, !1414, !1658, !1705, !1711, !1717, !1724, !1737, !1751, !1768, !1780, !1802, !1817, !1989}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !164, line: 3372, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !661, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !661, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !661, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !661, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !661, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !661, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !661, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !661, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !661, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !661, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !661, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !661, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !661, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !661, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !661, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !661, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !661, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !661, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !661, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !661, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !661, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !661, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !661, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !661, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !661, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !661, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !661, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !661, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !661, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !661, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !658, file: !164, line: 3373, baseType: !694, size: 192)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !694, file: !164, line: 403, baseType: !661, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !694, file: !164, line: 404, baseType: !655, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !164, line: 405, baseType: !655, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !658, file: !164, line: 3374, baseType: !700, size: 320)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !700, file: !164, line: 1385, baseType: !694, size: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !700, file: !164, line: 1386, baseType: !704, size: 128, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !705, line: 58, baseType: !706)
!705 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !705, line: 54, size: 128, elements: !707)
!707 = !{!708, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !706, file: !705, line: 56, baseType: !709, size: 64)
!709 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !706, file: !705, line: 57, baseType: !711, size: 64, offset: 64)
!711 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !658, file: !164, line: 3375, baseType: !713, size: 256)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !164, line: 1398, baseType: !694, size: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !713, file: !164, line: 1399, baseType: !717, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !719, line: 52, size: 256, elements: !720)
!719 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!720 = !{!721, !722, !723, !724, !725, !726, !727}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !718, file: !719, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !718, file: !719, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !718, file: !719, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !718, file: !719, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !718, file: !719, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !718, file: !719, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !718, file: !719, line: 62, baseType: !728, size: 192, offset: 64)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 192, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 3)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !658, file: !164, line: 3376, baseType: !732, size: 256)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !732, file: !164, line: 1409, baseType: !694, size: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !732, file: !164, line: 1410, baseType: !736, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !738, line: 27, size: 192, elements: !739)
!738 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !737, file: !738, line: 29, baseType: !704, size: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !737, file: !738, line: 30, baseType: !5, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !658, file: !164, line: 3377, baseType: !743, size: 256)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !164, line: 1438, baseType: !694, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !743, file: !164, line: 1439, baseType: !655, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !658, file: !164, line: 3378, baseType: !748, size: 256)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !164, line: 1419, baseType: !694, size: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !748, file: !164, line: 1420, baseType: !648, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !748, file: !164, line: 1421, baseType: !753, size: 8, offset: 224)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 8, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 1)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !658, file: !164, line: 3379, baseType: !757, size: 320)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !757, file: !164, line: 1429, baseType: !694, size: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !757, file: !164, line: 1430, baseType: !655, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !757, file: !164, line: 1431, baseType: !655, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !658, file: !164, line: 3380, baseType: !763, size: 320)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !164, line: 1461, baseType: !694, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !763, file: !164, line: 1462, baseType: !767, size: 128, offset: 192)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !768, line: 31, size: 128, elements: !769)
!768 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!769 = !{!770, !773, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !767, file: !768, line: 32, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !767, file: !768, line: 33, baseType: !7, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !767, file: !768, line: 34, baseType: !7, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !658, file: !164, line: 3381, baseType: !776, size: 384)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !777)
!777 = !{!778, !779, !784, !785, !786}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !164, line: 2508, baseType: !694, size: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !776, file: !164, line: 2509, baseType: !780, size: 32, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !781, line: 58, baseType: !782)
!781 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !783, line: 44, baseType: !7)
!783 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!784 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !776, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !164, line: 2511, baseType: !655, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !776, file: !164, line: 2512, baseType: !655, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !658, file: !164, line: 3382, baseType: !788, size: 896)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !788, file: !164, line: 2653, baseType: !776, size: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !788, file: !164, line: 2654, baseType: !655, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !788, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !788, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !788, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !788, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !788, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !788, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !788, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !788, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !788, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !788, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !788, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !788, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !788, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !788, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !788, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !788, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !788, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !788, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !788, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !788, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !788, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !788, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !788, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !788, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !788, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !788, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !788, file: !164, line: 2705, baseType: !655, size: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !788, file: !164, line: 2706, baseType: !655, size: 64, offset: 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !788, file: !164, line: 2707, baseType: !655, size: 64, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !788, file: !164, line: 2708, baseType: !655, size: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !788, file: !164, line: 2711, baseType: !823, size: 64, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !658, file: !164, line: 3383, baseType: !826, size: 960)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !826, file: !164, line: 2757, baseType: !788, size: 896)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !826, file: !164, line: 2758, baseType: !830, size: 64, offset: 896)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !656, line: 50, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !833, line: 240, size: 384, elements: !834)
!833 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !832, file: !833, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !832, file: !833, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !832, file: !833, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !832, file: !833, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !832, file: !833, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !832, file: !833, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !832, file: !833, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !832, file: !833, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !832, file: !833, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !832, file: !833, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !832, file: !833, line: 321, baseType: !846, size: 320, offset: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !833, line: 315, size: 320, elements: !847)
!847 = !{!848, !1302, !1304, !1333, !1334}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !846, file: !833, line: 316, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 64, elements: !754)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !833, line: 183, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !833, line: 166, size: 64, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !865, !866, !878, !881, !941, !942, !1279, !1292, !1299}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !851, file: !833, line: 168, baseType: !648, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !851, file: !833, line: 169, baseType: !7, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !851, file: !833, line: 170, baseType: !653, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !851, file: !833, line: 171, baseType: !830, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !851, file: !833, line: 172, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !656, line: 53, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !833, line: 359, size: 128, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !860, file: !833, line: 360, baseType: !648, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !860, file: !833, line: 361, baseType: !864, size: 64, offset: 64)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 64, elements: !754)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !851, file: !833, line: 173, baseType: !5, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !851, file: !833, line: 174, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !833, line: 133, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !833, line: 115, size: 32, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !868, file: !833, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !868, file: !833, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !868, file: !833, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !868, file: !833, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !868, file: !833, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !868, file: !833, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !868, file: !833, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !868, file: !833, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !851, file: !833, line: 175, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !833, line: 175, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !851, file: !833, line: 176, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !884, line: 75, size: 256, elements: !885)
!884 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!885 = !{!886, !900, !901, !902}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !883, file: !884, line: 76, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !884, line: 68, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !884, line: 63, size: 320, elements: !890)
!890 = !{!891, !893, !894, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !889, file: !884, line: 64, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !889, file: !884, line: 65, baseType: !892, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !889, file: !884, line: 66, baseType: !7, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !889, file: !884, line: 67, baseType: !896, size: 128, offset: 192)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 128, elements: !898)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !884, line: 29, baseType: !709)
!898 = !{!899}
!899 = !DISubrange(count: 2)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !883, file: !884, line: 77, baseType: !887, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !883, file: !884, line: 78, baseType: !7, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !883, file: !884, line: 79, baseType: !903, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !884, line: 49, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !884, line: 45, size: 832, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !905, file: !884, line: 46, baseType: !892, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !905, file: !884, line: 47, baseType: !882, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !905, file: !884, line: 48, baseType: !910, size: 704, offset: 128)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !911, line: 164, size: 704, elements: !912)
!911 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!912 = !{!913, !914, !924, !925, !926, !927, !928, !929, !933, !937, !938, !939, !940}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !910, file: !911, line: 166, baseType: !711, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !910, file: !911, line: 167, baseType: !915, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !911, line: 157, size: 192, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !916, file: !911, line: 159, baseType: !650, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !916, file: !911, line: 160, baseType: !915, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !916, file: !911, line: 161, baseType: !921, size: 32, offset: 128)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 32, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 4)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !910, file: !911, line: 168, baseType: !650, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !910, file: !911, line: 169, baseType: !650, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !910, file: !911, line: 170, baseType: !650, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !910, file: !911, line: 171, baseType: !711, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !910, file: !911, line: 172, baseType: !648, size: 32, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !910, file: !911, line: 176, baseType: !930, size: 64, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!915, !652, !711}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !910, file: !911, line: 177, baseType: !934, size: 64, offset: 512)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !652, !915}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !910, file: !911, line: 178, baseType: !652, size: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !910, file: !911, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !910, file: !911, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !910, file: !911, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !851, file: !833, line: 177, baseType: !655, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !851, file: !833, line: 178, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !945)
!945 = !{!946, !1191, !1192, !1193, !1249, !1253, !1254, !1255, !1273, !1274, !1275, !1276, !1277, !1278}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !944, file: !135, line: 219, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !950)
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !949, file: !135, line: 151, baseType: !952, size: 128)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !953, file: !135, line: 150, baseType: !7, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !953, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !953, file: !135, line: 150, baseType: !958, size: 64, offset: 64)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 64, elements: !754)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !656, line: 108, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !962)
!962 = !{!963, !964, !965, !1183, !1184, !1185, !1186, !1187, !1188, !1189}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !961, file: !135, line: 124, baseType: !943, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !961, file: !135, line: 125, baseType: !943, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !961, file: !135, line: 131, baseType: !966, size: 64, offset: 128)
!966 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !967)
!967 = !{!968, !1182}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !966, file: !135, line: 129, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !656, line: 66, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !574, line: 143, size: 192, elements: !972)
!972 = !{!973, !1180, !1181}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !971, file: !574, line: 145, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !656, line: 69, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !574, line: 136, size: 192, elements: !977)
!977 = !{!978, !1178, !1179}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !976, file: !574, line: 137, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !656, line: 58, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !574, line: 737, size: 768, elements: !982)
!982 = !{!983, !1000, !1033, !1039, !1044, !1049, !1056, !1062, !1068, !1073, !1087, !1092, !1098, !1103, !1113, !1118, !1136, !1143, !1150, !1156, !1161, !1167, !1173}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !981, file: !574, line: 738, baseType: !984, size: 256)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !574, line: 271, size: 256, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !984, file: !574, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !984, file: !574, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !984, file: !574, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !984, file: !574, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !984, file: !574, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !984, file: !574, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !984, file: !574, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !984, file: !574, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !984, file: !574, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !984, file: !574, line: 312, baseType: !7, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !984, file: !574, line: 316, baseType: !780, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !984, file: !574, line: 319, baseType: !7, size: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !984, file: !574, line: 323, baseType: !943, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !984, file: !574, line: 327, baseType: !655, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !981, file: !574, line: 739, baseType: !1001, size: 448)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !574, line: 350, size: 448, elements: !1002)
!1002 = !{!1003, !1031}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1001, file: !574, line: 353, baseType: !1004, size: 384)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !574, line: 333, size: 384, elements: !1005)
!1005 = !{!1006, !1007, !1014}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1004, file: !574, line: 336, baseType: !984, size: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1004, file: !574, line: 343, baseType: !1008, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !613, line: 37, size: 128, elements: !1010)
!1010 = !{!1011, !1012}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !613, line: 39, baseType: !1008, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1009, file: !613, line: 40, baseType: !1013, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1004, file: !574, line: 344, baseType: !1015, size: 64, offset: 320)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !613, line: 45, size: 320, elements: !1017)
!1017 = !{!1018, !1019}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !613, line: 47, baseType: !1015, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1016, file: !613, line: 48, baseType: !1020, size: 256, offset: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !1021)
!1021 = !{!1022, !1024, !1025, !1030}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1020, file: !164, line: 1884, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1020, file: !164, line: 1885, baseType: !1023, size: 64, offset: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1020, file: !164, line: 1891, baseType: !1026, size: 64, offset: 128)
!1026 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1020, file: !164, line: 1891, size: 64, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1026, file: !164, line: 1891, baseType: !979, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1026, file: !164, line: 1891, baseType: !655, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1020, file: !164, line: 1892, baseType: !1013, size: 64, offset: 192)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1001, file: !574, line: 359, baseType: !1032, size: 64, offset: 384)
!1032 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 64, elements: !754)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !981, file: !574, line: 740, baseType: !1034, size: 512)
!1034 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !574, line: 365, size: 512, elements: !1035)
!1035 = !{!1036, !1037, !1038}
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1034, file: !574, line: 368, baseType: !1004, size: 384)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1034, file: !574, line: 373, baseType: !655, size: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1034, file: !574, line: 374, baseType: !655, size: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !981, file: !574, line: 741, baseType: !1040, size: 576)
!1040 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !574, line: 380, size: 576, elements: !1041)
!1041 = !{!1042, !1043}
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1040, file: !574, line: 383, baseType: !1034, size: 512)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1040, file: !574, line: 389, baseType: !1032, size: 64, offset: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !981, file: !574, line: 742, baseType: !1045, size: 320)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !574, line: 395, size: 320, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1045, file: !574, line: 397, baseType: !984, size: 256)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1045, file: !574, line: 400, baseType: !969, size: 64, offset: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !981, file: !574, line: 743, baseType: !1050, size: 448)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !574, line: 406, size: 448, elements: !1051)
!1051 = !{!1052, !1053, !1054, !1055}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1050, file: !574, line: 408, baseType: !984, size: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1050, file: !574, line: 412, baseType: !655, size: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1050, file: !574, line: 420, baseType: !655, size: 64, offset: 320)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1050, file: !574, line: 423, baseType: !969, size: 64, offset: 384)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !981, file: !574, line: 744, baseType: !1057, size: 384)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !574, line: 429, size: 384, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1057, file: !574, line: 431, baseType: !984, size: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1057, file: !574, line: 434, baseType: !655, size: 64, offset: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1057, file: !574, line: 437, baseType: !969, size: 64, offset: 320)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !981, file: !574, line: 745, baseType: !1063, size: 384)
!1063 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !574, line: 443, size: 384, elements: !1064)
!1064 = !{!1065, !1066, !1067}
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1063, file: !574, line: 445, baseType: !984, size: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1063, file: !574, line: 449, baseType: !655, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1063, file: !574, line: 453, baseType: !969, size: 64, offset: 320)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !981, file: !574, line: 746, baseType: !1069, size: 320)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !574, line: 459, size: 320, elements: !1070)
!1070 = !{!1071, !1072}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1069, file: !574, line: 461, baseType: !984, size: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1069, file: !574, line: 464, baseType: !655, size: 64, offset: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !981, file: !574, line: 747, baseType: !1074, size: 768)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !574, line: 469, size: 768, elements: !1075)
!1075 = !{!1076, !1077, !1078, !1079, !1080}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1074, file: !574, line: 471, baseType: !984, size: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1074, file: !574, line: 474, baseType: !7, size: 32, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1074, file: !574, line: 475, baseType: !7, size: 32, offset: 288)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1074, file: !574, line: 478, baseType: !655, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1074, file: !574, line: 481, baseType: !1081, size: 384, offset: 384)
!1081 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1082, size: 384, elements: !754)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !164, line: 1917, size: 384, elements: !1083)
!1083 = !{!1084, !1085, !1086}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1082, file: !164, line: 1920, baseType: !1020, size: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1082, file: !164, line: 1921, baseType: !655, size: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1082, file: !164, line: 1922, baseType: !780, size: 32, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !981, file: !574, line: 748, baseType: !1088, size: 320)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !574, line: 487, size: 320, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1088, file: !574, line: 490, baseType: !984, size: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1088, file: !574, line: 494, baseType: !648, size: 32, offset: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !981, file: !574, line: 749, baseType: !1093, size: 384)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !574, line: 500, size: 384, elements: !1094)
!1094 = !{!1095, !1096, !1097}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1093, file: !574, line: 502, baseType: !984, size: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1093, file: !574, line: 506, baseType: !969, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1093, file: !574, line: 510, baseType: !969, size: 64, offset: 320)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !981, file: !574, line: 750, baseType: !1099, size: 320)
!1099 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !574, line: 529, size: 320, elements: !1100)
!1100 = !{!1101, !1102}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1099, file: !574, line: 531, baseType: !984, size: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1099, file: !574, line: 540, baseType: !969, size: 64, offset: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !981, file: !574, line: 751, baseType: !1104, size: 704)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !574, line: 546, size: 704, elements: !1105)
!1105 = !{!1106, !1107, !1108, !1109, !1110, !1111, !1112}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1104, file: !574, line: 549, baseType: !1034, size: 512)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1104, file: !574, line: 553, baseType: !653, size: 64, offset: 512)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1104, file: !574, line: 557, baseType: !647, size: 8, offset: 576)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1104, file: !574, line: 558, baseType: !647, size: 8, offset: 584)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1104, file: !574, line: 559, baseType: !647, size: 8, offset: 592)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1104, file: !574, line: 560, baseType: !647, size: 8, offset: 600)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1104, file: !574, line: 566, baseType: !1032, size: 64, offset: 640)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !981, file: !574, line: 752, baseType: !1114, size: 384)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !574, line: 571, size: 384, elements: !1115)
!1115 = !{!1116, !1117}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1114, file: !574, line: 573, baseType: !1045, size: 320)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1114, file: !574, line: 577, baseType: !655, size: 64, offset: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !981, file: !574, line: 753, baseType: !1119, size: 576)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !574, line: 600, size: 576, elements: !1120)
!1120 = !{!1121, !1122, !1123, !1126, !1135}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1119, file: !574, line: 602, baseType: !1045, size: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1119, file: !574, line: 605, baseType: !655, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1119, file: !574, line: 609, baseType: !1124, size: 64, offset: 384)
!1124 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1125, line: 46, baseType: !709)
!1125 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1119, file: !574, line: 612, baseType: !1127, size: 64, offset: 448)
!1127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1128, size: 64)
!1128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !574, line: 581, size: 320, elements: !1129)
!1129 = !{!1130, !1131, !1132, !1133, !1134}
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1128, file: !574, line: 583, baseType: !196, size: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1128, file: !574, line: 586, baseType: !655, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1128, file: !574, line: 589, baseType: !655, size: 64, offset: 128)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1128, file: !574, line: 592, baseType: !655, size: 64, offset: 192)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1128, file: !574, line: 595, baseType: !655, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1119, file: !574, line: 616, baseType: !969, size: 64, offset: 512)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !981, file: !574, line: 754, baseType: !1137, size: 512)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !574, line: 622, size: 512, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1137, file: !574, line: 624, baseType: !1045, size: 320)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1137, file: !574, line: 628, baseType: !655, size: 64, offset: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1137, file: !574, line: 632, baseType: !655, size: 64, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1137, file: !574, line: 636, baseType: !655, size: 64, offset: 448)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !981, file: !574, line: 755, baseType: !1144, size: 704)
!1144 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !574, line: 642, size: 704, elements: !1145)
!1145 = !{!1146, !1147, !1148, !1149}
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1144, file: !574, line: 644, baseType: !1137, size: 512)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1144, file: !574, line: 648, baseType: !655, size: 64, offset: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1144, file: !574, line: 652, baseType: !655, size: 64, offset: 576)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1144, file: !574, line: 653, baseType: !655, size: 64, offset: 640)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !981, file: !574, line: 756, baseType: !1151, size: 448)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !574, line: 663, size: 448, elements: !1152)
!1152 = !{!1153, !1154, !1155}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1151, file: !574, line: 665, baseType: !1045, size: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1151, file: !574, line: 668, baseType: !655, size: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1151, file: !574, line: 673, baseType: !655, size: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !981, file: !574, line: 757, baseType: !1157, size: 384)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !574, line: 694, size: 384, elements: !1158)
!1158 = !{!1159, !1160}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1157, file: !574, line: 696, baseType: !1045, size: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1157, file: !574, line: 699, baseType: !655, size: 64, offset: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !981, file: !574, line: 758, baseType: !1162, size: 384)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !574, line: 681, size: 384, elements: !1163)
!1163 = !{!1164, !1165, !1166}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1162, file: !574, line: 683, baseType: !984, size: 256)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1162, file: !574, line: 686, baseType: !655, size: 64, offset: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1162, file: !574, line: 689, baseType: !655, size: 64, offset: 320)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !981, file: !574, line: 759, baseType: !1168, size: 384)
!1168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !574, line: 707, size: 384, elements: !1169)
!1169 = !{!1170, !1171, !1172}
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1168, file: !574, line: 709, baseType: !984, size: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1168, file: !574, line: 712, baseType: !655, size: 64, offset: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1168, file: !574, line: 712, baseType: !655, size: 64, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !981, file: !574, line: 760, baseType: !1174, size: 320)
!1174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !574, line: 718, size: 320, elements: !1175)
!1175 = !{!1176, !1177}
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1174, file: !574, line: 720, baseType: !984, size: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1174, file: !574, line: 723, baseType: !655, size: 64, offset: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !976, file: !574, line: 138, baseType: !975, size: 64, offset: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !976, file: !574, line: 139, baseType: !975, size: 64, offset: 128)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !971, file: !574, line: 146, baseType: !974, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !971, file: !574, line: 152, baseType: !969, size: 64, offset: 128)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !966, file: !135, line: 130, baseType: !830, size: 64)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !961, file: !135, line: 134, baseType: !652, size: 64, offset: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !961, file: !135, line: 137, baseType: !655, size: 64, offset: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !961, file: !135, line: 138, baseType: !780, size: 32, offset: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !961, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !961, file: !135, line: 144, baseType: !648, size: 32, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !961, file: !135, line: 145, baseType: !648, size: 32, offset: 416)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !961, file: !135, line: 146, baseType: !1190, size: 64, offset: 448)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !711)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !944, file: !135, line: 220, baseType: !947, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !944, file: !135, line: 223, baseType: !652, size: 64, offset: 128)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !944, file: !135, line: 226, baseType: !1194, size: 64, offset: 192)
!1194 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1195, size: 64)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201, !1206, !1207, !1208, !1222, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1239, !1247, !1248}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1195, file: !146, line: 102, baseType: !648, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1195, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1195, file: !146, line: 108, baseType: !943, size: 64, offset: 64)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1195, file: !146, line: 111, baseType: !943, size: 64, offset: 128)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1195, file: !146, line: 114, baseType: !1202, size: 64, offset: 192)
!1202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1203)
!1203 = !{!1204, !1205}
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1202, file: !146, line: 42, baseType: !145, size: 32)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1202, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1195, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1195, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1195, file: !146, line: 123, baseType: !1209, size: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1210, size: 64)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1211)
!1211 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1212)
!1212 = !{!1213}
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1211, file: !146, line: 87, baseType: !1214, size: 128)
!1214 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1215)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1215, file: !146, line: 85, baseType: !7, size: 32)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1215, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1215, file: !146, line: 85, baseType: !1220, size: 64, offset: 64)
!1220 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1221, size: 64, elements: !754)
!1221 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1194)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1195, file: !146, line: 126, baseType: !1194, size: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1195, file: !146, line: 129, baseType: !1194, size: 64, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1195, file: !146, line: 132, baseType: !652, size: 64, offset: 512)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1195, file: !146, line: 139, baseType: !655, size: 64, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1195, file: !146, line: 143, baseType: !704, size: 128, offset: 640)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1195, file: !146, line: 146, baseType: !704, size: 128, offset: 768)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1195, file: !146, line: 148, baseType: !647, size: 8, offset: 896)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1195, file: !146, line: 149, baseType: !647, size: 8, offset: 904)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1195, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1195, file: !146, line: 156, baseType: !1232, size: 64, offset: 960)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1234)
!1234 = !{!1235, !1236, !1237, !1238}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1233, file: !146, line: 50, baseType: !979, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1233, file: !146, line: 59, baseType: !704, size: 128, offset: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1233, file: !146, line: 64, baseType: !647, size: 8, offset: 192)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1233, file: !146, line: 67, baseType: !1232, size: 64, offset: 256)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1195, file: !146, line: 159, baseType: !1240, size: 64, offset: 1024)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1242)
!1242 = !{!1243, !1244, !1245, !1246}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1241, file: !146, line: 74, baseType: !960, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1241, file: !146, line: 77, baseType: !1240, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1241, file: !146, line: 78, baseType: !1240, size: 64, offset: 128)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1241, file: !146, line: 81, baseType: !1240, size: 64, offset: 192)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1195, file: !146, line: 162, baseType: !647, size: 8, offset: 1088)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1195, file: !146, line: 166, baseType: !655, size: 64, offset: 1152)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !944, file: !135, line: 229, baseType: !1250, size: 128, offset: 256)
!1250 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1251, size: 128, elements: !898)
!1251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1252, size: 64)
!1252 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !944, file: !135, line: 232, baseType: !943, size: 64, offset: 384)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !944, file: !135, line: 233, baseType: !943, size: 64, offset: 448)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !944, file: !135, line: 238, baseType: !1256, size: 64, offset: 512)
!1256 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1257)
!1257 = !{!1258, !1264}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1256, file: !135, line: 236, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1261)
!1261 = !{!1262, !1263}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1260, file: !135, line: 275, baseType: !969, size: 64)
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1260, file: !135, line: 278, baseType: !969, size: 64, offset: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1256, file: !135, line: 237, baseType: !1265, size: 64)
!1265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1266, size: 64)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1267)
!1267 = !{!1268, !1269, !1270, !1271, !1272}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1266, file: !135, line: 261, baseType: !830, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1266, file: !135, line: 262, baseType: !830, size: 64, offset: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1266, file: !135, line: 266, baseType: !830, size: 64, offset: 128)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1266, file: !135, line: 267, baseType: !830, size: 64, offset: 192)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1266, file: !135, line: 270, baseType: !648, size: 32, offset: 256)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !944, file: !135, line: 241, baseType: !1190, size: 64, offset: 576)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !944, file: !135, line: 244, baseType: !648, size: 32, offset: 640)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !944, file: !135, line: 247, baseType: !648, size: 32, offset: 672)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !944, file: !135, line: 250, baseType: !648, size: 32, offset: 704)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !944, file: !135, line: 253, baseType: !648, size: 32, offset: 736)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !944, file: !135, line: 256, baseType: !648, size: 32, offset: 768)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !851, file: !833, line: 179, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !833, line: 150, baseType: !1282)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !833, line: 142, size: 320, elements: !1283)
!1283 = !{!1284, !1285, !1286, !1287, !1290, !1291}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1282, file: !833, line: 144, baseType: !655, size: 64)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1282, file: !833, line: 145, baseType: !830, size: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1282, file: !833, line: 146, baseType: !830, size: 64, offset: 128)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1282, file: !833, line: 147, baseType: !1288, size: 32, offset: 192)
!1288 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1289, line: 31, baseType: !648)
!1289 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1282, file: !833, line: 148, baseType: !7, size: 32, offset: 224)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1282, file: !833, line: 149, baseType: !647, size: 8, offset: 256)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !851, file: !833, line: 180, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !833, line: 162, baseType: !1295)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !833, line: 159, size: 128, elements: !1296)
!1296 = !{!1297, !1298}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1295, file: !833, line: 160, baseType: !655, size: 64)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1295, file: !833, line: 161, baseType: !711, size: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !851, file: !833, line: 181, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !833, line: 181, flags: DIFlagFwdDecl)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !846, file: !833, line: 317, baseType: !1303, size: 64)
!1303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 64, elements: !754)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !846, file: !833, line: 318, baseType: !1305, size: 320)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !833, line: 188, size: 320, elements: !1306)
!1306 = !{!1307, !1309, !1332}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1305, file: !833, line: 190, baseType: !1308, size: 192)
!1308 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 192, elements: !729)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1305, file: !833, line: 193, baseType: !1310, size: 64, offset: 192)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !833, line: 206, size: 320, elements: !1312)
!1312 = !{!1313, !1317, !1318, !1319, !1331}
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1311, file: !833, line: 208, baseType: !1314, size: 64)
!1314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !656, line: 62, baseType: !1316)
!1316 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !656, line: 61, flags: DIFlagFwdDecl)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1311, file: !833, line: 211, baseType: !7, size: 32, offset: 64)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1311, file: !833, line: 214, baseType: !711, size: 64, offset: 128)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1311, file: !833, line: 224, baseType: !1320, size: 64, offset: 192)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !833, line: 202, baseType: !1322)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !833, line: 202, size: 128, elements: !1323)
!1323 = !{!1324}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1322, file: !833, line: 202, baseType: !1325, size: 128)
!1325 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !833, line: 200, baseType: !1326)
!1326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !833, line: 200, size: 128, elements: !1327)
!1327 = !{!1328, !1329, !1330}
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1326, file: !833, line: 200, baseType: !7, size: 32)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1326, file: !833, line: 200, baseType: !7, size: 32, offset: 32)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1326, file: !833, line: 200, baseType: !864, size: 64, offset: 64)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1311, file: !833, line: 234, baseType: !1320, size: 64, offset: 256)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1305, file: !833, line: 197, baseType: !711, size: 64, offset: 256)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !846, file: !833, line: 319, baseType: !718, size: 256)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !846, file: !833, line: 320, baseType: !737, size: 192)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !658, file: !164, line: 3384, baseType: !1336, size: 1472)
!1336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1337)
!1337 = !{!1338, !1359, !1360, !1361, !1362}
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1336, file: !164, line: 3115, baseType: !1339, size: 1216)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1340)
!1340 = !{!1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353, !1354, !1355, !1356, !1357, !1358}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1339, file: !164, line: 2985, baseType: !826, size: 960)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1339, file: !164, line: 2986, baseType: !655, size: 64, offset: 960)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1339, file: !164, line: 2987, baseType: !655, size: 64, offset: 1024)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1339, file: !164, line: 2988, baseType: !655, size: 64, offset: 1088)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1339, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1339, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1339, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1339, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1339, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1339, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1339, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1339, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1339, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1339, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1339, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1339, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1339, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1339, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1336, file: !164, line: 3117, baseType: !655, size: 64, offset: 1216)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1336, file: !164, line: 3119, baseType: !655, size: 64, offset: 1280)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1336, file: !164, line: 3121, baseType: !655, size: 64, offset: 1344)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1336, file: !164, line: 3123, baseType: !655, size: 64, offset: 1408)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !658, file: !164, line: 3385, baseType: !1364, size: 1088)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1365)
!1365 = !{!1366, !1367, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1364, file: !164, line: 2875, baseType: !826, size: 960)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1364, file: !164, line: 2876, baseType: !830, size: 64, offset: 960)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1364, file: !164, line: 2877, baseType: !1369, size: 64, offset: 1024)
!1369 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1370, size: 64)
!1370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1371, line: 172, size: 128, elements: !1372)
!1371 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1372 = !{!1373, !1374, !1375, !1376, !1377, !1378, !1379}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1370, file: !1371, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1370, file: !1371, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1370, file: !1371, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1370, file: !1371, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1370, file: !1371, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1370, file: !1371, line: 195, baseType: !7, size: 32, offset: 32)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1370, file: !1371, line: 199, baseType: !655, size: 64, offset: 64)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !658, file: !164, line: 3386, baseType: !1339, size: 1216)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !658, file: !164, line: 3387, baseType: !1382, size: 1280)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1383)
!1383 = !{!1384, !1385}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1382, file: !164, line: 3094, baseType: !1339, size: 1216)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1382, file: !164, line: 3095, baseType: !1369, size: 64, offset: 1216)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !658, file: !164, line: 3388, baseType: !1387, size: 1216)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1388)
!1388 = !{!1389, !1390, !1391, !1392, !1393, !1394}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1387, file: !164, line: 2825, baseType: !788, size: 896)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1387, file: !164, line: 2827, baseType: !655, size: 64, offset: 896)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1387, file: !164, line: 2828, baseType: !655, size: 64, offset: 960)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1387, file: !164, line: 2829, baseType: !655, size: 64, offset: 1024)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1387, file: !164, line: 2830, baseType: !655, size: 64, offset: 1088)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1387, file: !164, line: 2831, baseType: !655, size: 64, offset: 1152)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !658, file: !164, line: 3389, baseType: !1396, size: 1024)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1397)
!1397 = !{!1398, !1399, !1400}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1396, file: !164, line: 2851, baseType: !826, size: 960)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1396, file: !164, line: 2852, baseType: !648, size: 32, offset: 960)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1396, file: !164, line: 2853, baseType: !648, size: 32, offset: 992)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !658, file: !164, line: 3390, baseType: !1402, size: 1024)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1403)
!1403 = !{!1404, !1405}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1402, file: !164, line: 2858, baseType: !826, size: 960)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1402, file: !164, line: 2859, baseType: !1369, size: 64, offset: 960)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !658, file: !164, line: 3391, baseType: !1407, size: 960)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1408)
!1408 = !{!1409}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1407, file: !164, line: 2863, baseType: !826, size: 960)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !658, file: !164, line: 3392, baseType: !1411, size: 1472)
!1411 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1412)
!1412 = !{!1413}
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1411, file: !164, line: 3305, baseType: !1336, size: 1472)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !658, file: !164, line: 3393, baseType: !1415, size: 1792)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1416)
!1416 = !{!1417, !1418, !1637, !1638, !1639, !1640, !1641, !1642, !1643, !1644, !1645, !1646, !1647, !1648, !1649, !1650, !1651, !1652, !1653, !1654, !1655, !1656, !1657}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1415, file: !164, line: 3249, baseType: !1336, size: 1472)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1415, file: !164, line: 3251, baseType: !1419, size: 64, offset: 1472)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1421, line: 463, size: 1152, elements: !1422)
!1421 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1422 = !{!1423, !1426, !1457, !1458, !1573, !1581, !1582, !1583, !1584, !1585, !1586, !1610, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635, !1636}
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1420, file: !1421, line: 464, baseType: !1424, size: 64)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1421, line: 464, flags: DIFlagFwdDecl)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1420, file: !1421, line: 467, baseType: !1427, size: 64, offset: 64)
!1427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1428, size: 64)
!1428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1429)
