; ModuleID = 'tree-chrec.bc'
source_filename = "tree-chrec.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }
%struct.tree_base = type { i64 }

!350 = !DIEnumerator(name: "DOM_OK", value: 2, isUnsigned: true)
!351 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "calling_abi", file: !352, line: 474, baseType: !5, size: 32, elements: !353)
!352 = !DIFile(filename: "./config/i386/i386.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!353 = !{!354, !355}
!354 = !DIEnumerator(name: "SYSV_ABI", value: 0, isUnsigned: true)
!355 = !DIEnumerator(name: "MS_ABI", value: 1, isUnsigned: true)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_code", file: !133, line: 280, baseType: !5, size: 32, elements: !357)
!357 = !{!358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373}
!358 = !DIEnumerator(name: "OMP_CLAUSE_ERROR", value: 0, isUnsigned: true)
!359 = !DIEnumerator(name: "OMP_CLAUSE_PRIVATE", value: 1, isUnsigned: true)
!360 = !DIEnumerator(name: "OMP_CLAUSE_SHARED", value: 2, isUnsigned: true)
!361 = !DIEnumerator(name: "OMP_CLAUSE_FIRSTPRIVATE", value: 3, isUnsigned: true)
!362 = !DIEnumerator(name: "OMP_CLAUSE_LASTPRIVATE", value: 4, isUnsigned: true)
!363 = !DIEnumerator(name: "OMP_CLAUSE_REDUCTION", value: 5, isUnsigned: true)
!364 = !DIEnumerator(name: "OMP_CLAUSE_COPYIN", value: 6, isUnsigned: true)
!365 = !DIEnumerator(name: "OMP_CLAUSE_COPYPRIVATE", value: 7, isUnsigned: true)
!366 = !DIEnumerator(name: "OMP_CLAUSE_IF", value: 8, isUnsigned: true)
!367 = !DIEnumerator(name: "OMP_CLAUSE_NUM_THREADS", value: 9, isUnsigned: true)
!368 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE", value: 10, isUnsigned: true)
!369 = !DIEnumerator(name: "OMP_CLAUSE_NOWAIT", value: 11, isUnsigned: true)
!370 = !DIEnumerator(name: "OMP_CLAUSE_ORDERED", value: 12, isUnsigned: true)
!371 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT", value: 13, isUnsigned: true)
!372 = !DIEnumerator(name: "OMP_CLAUSE_COLLAPSE", value: 14, isUnsigned: true)
!373 = !DIEnumerator(name: "OMP_CLAUSE_UNTIED", value: 15, isUnsigned: true)
!374 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_default_kind", file: !133, line: 1817, baseType: !5, size: 32, elements: !375)
!375 = !{!376, !377, !378, !379, !380}
!376 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_UNSPECIFIED", value: 0, isUnsigned: true)
!377 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_SHARED", value: 1, isUnsigned: true)
!378 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_NONE", value: 2, isUnsigned: true)
!379 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_PRIVATE", value: 3, isUnsigned: true)
!380 = !DIEnumerator(name: "OMP_CLAUSE_DEFAULT_FIRSTPRIVATE", value: 4, isUnsigned: true)
!381 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omp_clause_schedule_kind", file: !133, line: 1805, baseType: !5, size: 32, elements: !382)
!382 = !{!383, !384, !385, !386, !387}
!383 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_STATIC", value: 0, isUnsigned: true)
!384 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_DYNAMIC", value: 1, isUnsigned: true)
!385 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_GUIDED", value: 2, isUnsigned: true)
!386 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_AUTO", value: 3, isUnsigned: true)
!387 = !DIEnumerator(name: "OMP_CLAUSE_SCHEDULE_RUNTIME", value: 4, isUnsigned: true)
!388 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ev_direction", file: !389, line: 712, baseType: !5, size: 32, elements: !390)
!389 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!390 = !{!391, !392, !393}
!391 = !DIEnumerator(name: "EV_DIR_GROWS", value: 0, isUnsigned: true)
!392 = !DIEnumerator(name: "EV_DIR_DECREASES", value: 1, isUnsigned: true)
!393 = !DIEnumerator(name: "EV_DIR_UNKNOWN", value: 2, isUnsigned: true)
!394 = !{!395, !396, !397, !398, !401, !402, !132, !404, !406, !408, !1757, !460, !5}
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!397 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !400)
!404 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !405, line: 44, baseType: !5)
!405 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !407, line: 56, baseType: !408)
!407 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !410)
!410 = !{!411, !444, !450, !463, !482, !493, !498, !507, !513, !526, !536, !574, !1086, !1114, !1130, !1131, !1136, !1145, !1151, !1156, !1160, !1164, !1408, !1455, !1461, !1467, !1474, !1487, !1501, !1518, !1530, !1552, !1567, !1739}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !409, file: !133, line: 3372, baseType: !412, size: 64)
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !413)
!413 = !{!414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !412, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !412, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !412, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !412, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !412, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !412, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !412, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !412, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !412, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !412, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !412, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !412, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !412, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !412, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !412, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !412, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !412, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !412, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !412, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !412, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !412, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !412, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !412, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !412, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !412, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !412, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !412, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !412, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !412, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !412, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !409, file: !133, line: 3373, baseType: !445, size: 192)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !446)
!446 = !{!447, !448, !449}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !445, file: !133, line: 403, baseType: !412, size: 64)
!448 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !445, file: !133, line: 404, baseType: !406, size: 64, offset: 64)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !445, file: !133, line: 405, baseType: !406, size: 64, offset: 128)
!450 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !409, file: !133, line: 3374, baseType: !451, size: 320)
!451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !452)
!452 = !{!453, !454}
!453 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !451, file: !133, line: 1385, baseType: !445, size: 192)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !451, file: !133, line: 1386, baseType: !455, size: 128, offset: 192)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !456, line: 58, baseType: !457)
!456 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !456, line: 54, size: 128, elements: !458)
!458 = !{!459, !461}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !457, file: !456, line: 56, baseType: !460, size: 64)
!460 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !457, file: !456, line: 57, baseType: !462, size: 64, offset: 64)
!462 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!463 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !409, file: !133, line: 3375, baseType: !464, size: 256)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !465)
!465 = !{!466, !467}
!466 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !464, file: !133, line: 1398, baseType: !445, size: 192)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !464, file: !133, line: 1399, baseType: !468, size: 64, offset: 192)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !470, line: 52, size: 256, elements: !471)
!470 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!471 = !{!472, !473, !474, !475, !476, !477, !478}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !469, file: !470, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !469, file: !470, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !469, file: !470, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !469, file: !470, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !469, file: !470, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !469, file: !470, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !469, file: !470, line: 62, baseType: !479, size: 192, offset: 64)
!479 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 192, elements: !480)
!480 = !{!481}
!481 = !DISubrange(count: 3)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !409, file: !133, line: 3376, baseType: !483, size: 256)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !484)
!484 = !{!485, !486}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !483, file: !133, line: 1409, baseType: !445, size: 192)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !483, file: !133, line: 1410, baseType: !487, size: 64, offset: 192)
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !489, line: 27, size: 192, elements: !490)
!489 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!490 = !{!491, !492}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !488, file: !489, line: 29, baseType: !455, size: 128)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !488, file: !489, line: 30, baseType: !3, size: 32, offset: 128)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !409, file: !133, line: 3377, baseType: !494, size: 256)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !495)
!495 = !{!496, !497}
!496 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !494, file: !133, line: 1438, baseType: !445, size: 192)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !494, file: !133, line: 1439, baseType: !406, size: 64, offset: 192)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !409, file: !133, line: 3378, baseType: !499, size: 256)
!499 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !500)
!500 = !{!501, !502, !503}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !499, file: !133, line: 1419, baseType: !445, size: 192)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !499, file: !133, line: 1420, baseType: !397, size: 32, offset: 192)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !499, file: !133, line: 1421, baseType: !504, size: 8, offset: 224)
!504 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 8, elements: !505)
!505 = !{!506}
!506 = !DISubrange(count: 1)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !409, file: !133, line: 3379, baseType: !508, size: 320)
!508 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !509)
!509 = !{!510, !511, !512}
!510 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !508, file: !133, line: 1429, baseType: !445, size: 192)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !508, file: !133, line: 1430, baseType: !406, size: 64, offset: 192)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !508, file: !133, line: 1431, baseType: !406, size: 64, offset: 256)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !409, file: !133, line: 3380, baseType: !514, size: 320)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !515)
!515 = !{!516, !517}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !133, line: 1461, baseType: !445, size: 192)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !514, file: !133, line: 1462, baseType: !518, size: 128, offset: 192)
!518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !519, line: 31, size: 128, elements: !520)
!519 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!520 = !{!521, !524, !525}
!521 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !518, file: !519, line: 32, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !523, size: 64)
!523 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !396)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !518, file: !519, line: 33, baseType: !5, size: 32, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !518, file: !519, line: 34, baseType: !5, size: 32, offset: 96)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !409, file: !133, line: 3381, baseType: !527, size: 384)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !528)
!528 = !{!529, !530, !533, !534, !535}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !527, file: !133, line: 2508, baseType: !445, size: 192)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !527, file: !133, line: 2509, baseType: !531, size: 32, offset: 192)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !532, line: 58, baseType: !404)
!532 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!533 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !527, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !527, file: !133, line: 2511, baseType: !406, size: 64, offset: 256)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !527, file: !133, line: 2512, baseType: !406, size: 64, offset: 320)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !409, file: !133, line: 3382, baseType: !537, size: 896)
!537 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !538)
!538 = !{!539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571}
!539 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !537, file: !133, line: 2653, baseType: !527, size: 384)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !537, file: !133, line: 2654, baseType: !406, size: 64, offset: 384)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !537, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !537, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !537, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !537, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !537, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !537, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !537, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !537, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !537, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !537, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !537, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !537, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !537, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !537, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !537, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !537, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!557 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !537, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !537, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !537, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !537, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !537, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !537, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !537, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !537, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !537, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !537, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !537, file: !133, line: 2705, baseType: !406, size: 64, offset: 576)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !537, file: !133, line: 2706, baseType: !406, size: 64, offset: 640)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !537, file: !133, line: 2707, baseType: !406, size: 64, offset: 704)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !537, file: !133, line: 2708, baseType: !406, size: 64, offset: 768)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !537, file: !133, line: 2711, baseType: !572, size: 64, offset: 832)
!572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !573, size: 64)
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !409, file: !133, line: 3383, baseType: !575, size: 960)
!575 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !576)
!576 = !{!577, !578}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !575, file: !133, line: 2757, baseType: !537, size: 896)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !575, file: !133, line: 2758, baseType: !579, size: 64, offset: 896)
!579 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !407, line: 50, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !582, line: 240, size: 384, elements: !583)
!582 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!583 = !{!584, !585, !586, !587, !588, !589, !590, !591, !592, !593, !594}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !581, file: !582, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !581, file: !582, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !581, file: !582, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !581, file: !582, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !581, file: !582, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !581, file: !582, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !581, file: !582, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !581, file: !582, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !581, file: !582, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !581, file: !582, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !581, file: !582, line: 321, baseType: !595, size: 320, offset: 64)
!595 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !582, line: 315, size: 320, elements: !596)
!596 = !{!597, !1053, !1055, !1084, !1085}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !595, file: !582, line: 316, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 64, elements: !505)
!599 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !582, line: 183, baseType: !600)
!600 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !582, line: 166, size: 64, elements: !601)
!601 = !{!602, !603, !604, !605, !606, !614, !615, !627, !630, !690, !691, !1030, !1043, !1050}
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !600, file: !582, line: 168, baseType: !397, size: 32)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !600, file: !582, line: 169, baseType: !5, size: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !600, file: !582, line: 170, baseType: !402, size: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !600, file: !582, line: 171, baseType: !579, size: 64)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !600, file: !582, line: 172, baseType: !607, size: 64)
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !407, line: 53, baseType: !608)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !609, size: 64)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !582, line: 359, size: 128, elements: !610)
!610 = !{!611, !612}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !609, file: !582, line: 360, baseType: !397, size: 32)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !609, file: !582, line: 361, baseType: !613, size: 64, offset: 64)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !579, size: 64, elements: !505)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !600, file: !582, line: 173, baseType: !3, size: 32)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !600, file: !582, line: 174, baseType: !616, size: 32)
!616 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !582, line: 133, baseType: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !582, line: 115, size: 32, elements: !618)
!618 = !{!619, !620, !621, !622, !623, !624, !625, !626}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !617, file: !582, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !617, file: !582, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !617, file: !582, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !617, file: !582, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !617, file: !582, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !617, file: !582, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !617, file: !582, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !617, file: !582, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !600, file: !582, line: 175, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !582, line: 175, flags: DIFlagFwdDecl)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !600, file: !582, line: 176, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !633, line: 75, size: 256, elements: !634)
!633 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!634 = !{!635, !649, !650, !651}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !632, file: !633, line: 76, baseType: !636, size: 64)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !633, line: 68, baseType: !638)
!638 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !633, line: 63, size: 320, elements: !639)
!639 = !{!640, !642, !643, !644}
!640 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !638, file: !633, line: 64, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !638, file: !633, line: 65, baseType: !641, size: 64, offset: 64)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !638, file: !633, line: 66, baseType: !5, size: 32, offset: 128)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !638, file: !633, line: 67, baseType: !645, size: 128, offset: 192)
!645 = !DICompositeType(tag: DW_TAG_array_type, baseType: !646, size: 128, elements: !647)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !633, line: 29, baseType: !460)
!647 = !{!648}
!648 = !DISubrange(count: 2)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !632, file: !633, line: 77, baseType: !636, size: 64, offset: 64)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !632, file: !633, line: 78, baseType: !5, size: 32, offset: 128)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !632, file: !633, line: 79, baseType: !652, size: 64, offset: 192)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !633, line: 49, baseType: !654)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !633, line: 45, size: 832, elements: !655)
!655 = !{!656, !657, !658}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !654, file: !633, line: 46, baseType: !641, size: 64)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !654, file: !633, line: 47, baseType: !631, size: 64, offset: 64)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !654, file: !633, line: 48, baseType: !659, size: 704, offset: 128)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !660, line: 164, size: 704, elements: !661)
!660 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!661 = !{!662, !663, !673, !674, !675, !676, !677, !678, !682, !686, !687, !688, !689}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !659, file: !660, line: 166, baseType: !462, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !659, file: !660, line: 167, baseType: !664, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !660, line: 157, size: 192, elements: !666)
!666 = !{!667, !668, !669}
!667 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !665, file: !660, line: 159, baseType: !399, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !665, file: !660, line: 160, baseType: !664, size: 64, offset: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !665, file: !660, line: 161, baseType: !670, size: 32, offset: 128)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !400, size: 32, elements: !671)
!671 = !{!672}
!672 = !DISubrange(count: 4)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !659, file: !660, line: 168, baseType: !399, size: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !659, file: !660, line: 169, baseType: !399, size: 64, offset: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !659, file: !660, line: 170, baseType: !399, size: 64, offset: 256)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !659, file: !660, line: 171, baseType: !462, size: 64, offset: 320)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !659, file: !660, line: 172, baseType: !397, size: 32, offset: 384)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !659, file: !660, line: 176, baseType: !679, size: 64, offset: 448)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DISubroutineType(types: !681)
!681 = !{!664, !401, !462}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !659, file: !660, line: 177, baseType: !683, size: 64, offset: 512)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DISubroutineType(types: !685)
!685 = !{null, !401, !664}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !659, file: !660, line: 178, baseType: !401, size: 64, offset: 576)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !659, file: !660, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !659, file: !660, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !659, file: !660, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !600, file: !582, line: 177, baseType: !406, size: 64)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !600, file: !582, line: 178, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !341, line: 217, size: 832, elements: !694)
!694 = !{!695, !942, !943, !944, !1000, !1004, !1005, !1006, !1024, !1025, !1026, !1027, !1028, !1029}
!695 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !693, file: !341, line: 219, baseType: !696, size: 64)
!696 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !341, line: 151, baseType: !698)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !341, line: 151, size: 128, elements: !699)
!699 = !{!700}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !698, file: !341, line: 151, baseType: !701, size: 128)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !341, line: 150, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !341, line: 150, size: 128, elements: !703)
!703 = !{!704, !705, !706}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !702, file: !341, line: 150, baseType: !5, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !702, file: !341, line: 150, baseType: !5, size: 32, offset: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !702, file: !341, line: 150, baseType: !707, size: 64, offset: 64)
!707 = !DICompositeType(tag: DW_TAG_array_type, baseType: !708, size: 64, elements: !505)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !407, line: 108, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !341, line: 122, size: 512, elements: !711)
!711 = !{!712, !713, !714, !934, !935, !936, !937, !938, !939, !940}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !710, file: !341, line: 124, baseType: !692, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !710, file: !341, line: 125, baseType: !692, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !710, file: !341, line: 131, baseType: !715, size: 64, offset: 128)
!715 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !341, line: 128, size: 64, elements: !716)
!716 = !{!717, !933}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !715, file: !341, line: 129, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !407, line: 66, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !721, line: 143, size: 192, elements: !722)
!721 = !DIFile(filename: "./gimple.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !{!723, !931, !932}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !720, file: !721, line: 145, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !407, line: 69, baseType: !725)
!725 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !726, size: 64)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !721, line: 136, size: 192, elements: !727)
!727 = !{!728, !929, !930}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !726, file: !721, line: 137, baseType: !729, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !407, line: 58, baseType: !730)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !721, line: 737, size: 768, elements: !732)
!732 = !{!733, !750, !784, !790, !795, !800, !807, !813, !819, !824, !838, !843, !849, !854, !864, !869, !887, !894, !901, !907, !912, !918, !924}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !731, file: !721, line: 738, baseType: !734, size: 256)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !721, line: 271, size: 256, elements: !735)
!735 = !{!736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !734, file: !721, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !734, file: !721, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !734, file: !721, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !734, file: !721, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !734, file: !721, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !734, file: !721, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !734, file: !721, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !734, file: !721, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !734, file: !721, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !734, file: !721, line: 312, baseType: !5, size: 32, offset: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !734, file: !721, line: 316, baseType: !531, size: 32, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !734, file: !721, line: 319, baseType: !5, size: 32, offset: 96)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !734, file: !721, line: 323, baseType: !692, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !734, file: !721, line: 327, baseType: !406, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !731, file: !721, line: 739, baseType: !751, size: 448)
!751 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !721, line: 350, size: 448, elements: !752)
!752 = !{!753, !782}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !751, file: !721, line: 353, baseType: !754, size: 384)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !721, line: 333, size: 384, elements: !755)
!755 = !{!756, !757, !765}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !754, file: !721, line: 336, baseType: !734, size: 256)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !754, file: !721, line: 343, baseType: !758, size: 64, offset: 256)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !760, line: 37, size: 128, elements: !761)
!760 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!761 = !{!762, !763}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !759, file: !760, line: 39, baseType: !758, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !759, file: !760, line: 40, baseType: !764, size: 64, offset: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !406, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !754, file: !721, line: 344, baseType: !766, size: 64, offset: 320)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !760, line: 45, size: 320, elements: !768)
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !767, file: !760, line: 47, baseType: !766, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !767, file: !760, line: 48, baseType: !771, size: 256, offset: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !772)
!772 = !{!773, !775, !776, !781}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !771, file: !133, line: 1884, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !771, file: !133, line: 1885, baseType: !774, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !771, file: !133, line: 1891, baseType: !777, size: 64, offset: 128)
!777 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !771, file: !133, line: 1891, size: 64, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !777, file: !133, line: 1891, baseType: !729, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !777, file: !133, line: 1891, baseType: !406, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !771, file: !133, line: 1892, baseType: !764, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !751, file: !721, line: 359, baseType: !783, size: 64, offset: 384)
!783 = !DICompositeType(tag: DW_TAG_array_type, baseType: !406, size: 64, elements: !505)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !731, file: !721, line: 740, baseType: !785, size: 512)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !721, line: 365, size: 512, elements: !786)
!786 = !{!787, !788, !789}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !785, file: !721, line: 368, baseType: !754, size: 384)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !785, file: !721, line: 373, baseType: !406, size: 64, offset: 384)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !785, file: !721, line: 374, baseType: !406, size: 64, offset: 448)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !731, file: !721, line: 741, baseType: !791, size: 576)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !721, line: 380, size: 576, elements: !792)
!792 = !{!793, !794}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !791, file: !721, line: 383, baseType: !785, size: 512)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !791, file: !721, line: 389, baseType: !783, size: 64, offset: 512)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !731, file: !721, line: 742, baseType: !796, size: 320)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !721, line: 395, size: 320, elements: !797)
!797 = !{!798, !799}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !796, file: !721, line: 397, baseType: !734, size: 256)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !796, file: !721, line: 400, baseType: !718, size: 64, offset: 256)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !731, file: !721, line: 743, baseType: !801, size: 448)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !721, line: 406, size: 448, elements: !802)
!802 = !{!803, !804, !805, !806}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !801, file: !721, line: 408, baseType: !734, size: 256)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !801, file: !721, line: 412, baseType: !406, size: 64, offset: 256)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !801, file: !721, line: 420, baseType: !406, size: 64, offset: 320)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !801, file: !721, line: 423, baseType: !718, size: 64, offset: 384)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !731, file: !721, line: 744, baseType: !808, size: 384)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !721, line: 429, size: 384, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !808, file: !721, line: 431, baseType: !734, size: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !808, file: !721, line: 434, baseType: !406, size: 64, offset: 256)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !808, file: !721, line: 437, baseType: !718, size: 64, offset: 320)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !731, file: !721, line: 745, baseType: !814, size: 384)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !721, line: 443, size: 384, elements: !815)
!815 = !{!816, !817, !818}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !814, file: !721, line: 445, baseType: !734, size: 256)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !814, file: !721, line: 449, baseType: !406, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !814, file: !721, line: 453, baseType: !718, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !731, file: !721, line: 746, baseType: !820, size: 320)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !721, line: 459, size: 320, elements: !821)
!821 = !{!822, !823}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !820, file: !721, line: 461, baseType: !734, size: 256)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !820, file: !721, line: 464, baseType: !406, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !731, file: !721, line: 747, baseType: !825, size: 768)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !721, line: 469, size: 768, elements: !826)
!826 = !{!827, !828, !829, !830, !831}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !825, file: !721, line: 471, baseType: !734, size: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !825, file: !721, line: 474, baseType: !5, size: 32, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !825, file: !721, line: 475, baseType: !5, size: 32, offset: 288)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !825, file: !721, line: 478, baseType: !406, size: 64, offset: 320)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !825, file: !721, line: 481, baseType: !832, size: 384, offset: 384)
!832 = !DICompositeType(tag: DW_TAG_array_type, baseType: !833, size: 384, elements: !505)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !834)
!834 = !{!835, !836, !837}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !833, file: !133, line: 1920, baseType: !771, size: 256)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !833, file: !133, line: 1921, baseType: !406, size: 64, offset: 256)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !833, file: !133, line: 1922, baseType: !531, size: 32, offset: 320)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !731, file: !721, line: 748, baseType: !839, size: 320)
!839 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !721, line: 487, size: 320, elements: !840)
!840 = !{!841, !842}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !839, file: !721, line: 490, baseType: !734, size: 256)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !839, file: !721, line: 494, baseType: !397, size: 32, offset: 256)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !731, file: !721, line: 749, baseType: !844, size: 384)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !721, line: 500, size: 384, elements: !845)
!845 = !{!846, !847, !848}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !844, file: !721, line: 502, baseType: !734, size: 256)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !844, file: !721, line: 506, baseType: !718, size: 64, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !844, file: !721, line: 510, baseType: !718, size: 64, offset: 320)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !731, file: !721, line: 750, baseType: !850, size: 320)
!850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !721, line: 529, size: 320, elements: !851)
!851 = !{!852, !853}
!852 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !850, file: !721, line: 531, baseType: !734, size: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !850, file: !721, line: 540, baseType: !718, size: 64, offset: 256)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !731, file: !721, line: 751, baseType: !855, size: 704)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !721, line: 546, size: 704, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !855, file: !721, line: 549, baseType: !785, size: 512)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !855, file: !721, line: 553, baseType: !402, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !855, file: !721, line: 557, baseType: !396, size: 8, offset: 576)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !855, file: !721, line: 558, baseType: !396, size: 8, offset: 584)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !855, file: !721, line: 559, baseType: !396, size: 8, offset: 592)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !855, file: !721, line: 560, baseType: !396, size: 8, offset: 600)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !855, file: !721, line: 566, baseType: !783, size: 64, offset: 640)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !731, file: !721, line: 752, baseType: !865, size: 384)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !721, line: 571, size: 384, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !865, file: !721, line: 573, baseType: !796, size: 320)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !865, file: !721, line: 577, baseType: !406, size: 64, offset: 320)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !731, file: !721, line: 753, baseType: !870, size: 576)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !721, line: 600, size: 576, elements: !871)
!871 = !{!872, !873, !874, !877, !886}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !870, file: !721, line: 602, baseType: !796, size: 320)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !870, file: !721, line: 605, baseType: !406, size: 64, offset: 320)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !870, file: !721, line: 609, baseType: !875, size: 64, offset: 384)
!875 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !876, line: 46, baseType: !460)
!876 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!877 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !870, file: !721, line: 612, baseType: !878, size: 64, offset: 448)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !879, size: 64)
!879 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !721, line: 581, size: 320, elements: !880)
!880 = !{!881, !882, !883, !884, !885}
!881 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !879, file: !721, line: 583, baseType: !132, size: 32)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !879, file: !721, line: 586, baseType: !406, size: 64, offset: 64)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !879, file: !721, line: 589, baseType: !406, size: 64, offset: 128)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !879, file: !721, line: 592, baseType: !406, size: 64, offset: 192)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !879, file: !721, line: 595, baseType: !406, size: 64, offset: 256)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !870, file: !721, line: 616, baseType: !718, size: 64, offset: 512)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !731, file: !721, line: 754, baseType: !888, size: 512)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !721, line: 622, size: 512, elements: !889)
!889 = !{!890, !891, !892, !893}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !888, file: !721, line: 624, baseType: !796, size: 320)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !888, file: !721, line: 628, baseType: !406, size: 64, offset: 320)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !888, file: !721, line: 632, baseType: !406, size: 64, offset: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !888, file: !721, line: 636, baseType: !406, size: 64, offset: 448)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !731, file: !721, line: 755, baseType: !895, size: 704)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !721, line: 642, size: 704, elements: !896)
!896 = !{!897, !898, !899, !900}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !895, file: !721, line: 644, baseType: !888, size: 512)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !895, file: !721, line: 648, baseType: !406, size: 64, offset: 512)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !895, file: !721, line: 652, baseType: !406, size: 64, offset: 576)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !895, file: !721, line: 653, baseType: !406, size: 64, offset: 640)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !731, file: !721, line: 756, baseType: !902, size: 448)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !721, line: 663, size: 448, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !902, file: !721, line: 665, baseType: !796, size: 320)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !902, file: !721, line: 668, baseType: !406, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !902, file: !721, line: 673, baseType: !406, size: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !731, file: !721, line: 757, baseType: !908, size: 384)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !721, line: 694, size: 384, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !908, file: !721, line: 696, baseType: !796, size: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !908, file: !721, line: 699, baseType: !406, size: 64, offset: 320)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !731, file: !721, line: 758, baseType: !913, size: 384)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !721, line: 681, size: 384, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !913, file: !721, line: 683, baseType: !734, size: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !913, file: !721, line: 686, baseType: !406, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !913, file: !721, line: 689, baseType: !406, size: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !731, file: !721, line: 759, baseType: !919, size: 384)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !721, line: 707, size: 384, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !919, file: !721, line: 709, baseType: !734, size: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !919, file: !721, line: 712, baseType: !406, size: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !919, file: !721, line: 712, baseType: !406, size: 64, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !731, file: !721, line: 760, baseType: !925, size: 320)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !721, line: 718, size: 320, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !925, file: !721, line: 720, baseType: !734, size: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !925, file: !721, line: 723, baseType: !406, size: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !726, file: !721, line: 138, baseType: !725, size: 64, offset: 64)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !726, file: !721, line: 139, baseType: !725, size: 64, offset: 128)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !720, file: !721, line: 146, baseType: !724, size: 64, offset: 64)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !720, file: !721, line: 152, baseType: !718, size: 64, offset: 128)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !715, file: !341, line: 130, baseType: !579, size: 64)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !710, file: !341, line: 134, baseType: !401, size: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !710, file: !341, line: 137, baseType: !406, size: 64, offset: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !710, file: !341, line: 138, baseType: !531, size: 32, offset: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !710, file: !341, line: 142, baseType: !5, size: 32, offset: 352)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !710, file: !341, line: 144, baseType: !397, size: 32, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !710, file: !341, line: 145, baseType: !397, size: 32, offset: 416)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !710, file: !341, line: 146, baseType: !941, size: 64, offset: 448)
!941 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !341, line: 119, baseType: !462)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !693, file: !341, line: 220, baseType: !696, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !693, file: !341, line: 223, baseType: !401, size: 64, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !693, file: !341, line: 226, baseType: !945, size: 64, offset: 192)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 100, size: 1216, elements: !947)
!947 = !{!948, !949, !950, !951, !952, !957, !958, !959, !973, !974, !975, !976, !977, !978, !979, !980, !981, !982, !990, !998, !999}
!948 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !946, file: !328, line: 102, baseType: !397, size: 32)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !946, file: !328, line: 105, baseType: !5, size: 32, offset: 32)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !946, file: !328, line: 108, baseType: !692, size: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !946, file: !328, line: 111, baseType: !692, size: 64, offset: 128)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !946, file: !328, line: 114, baseType: !953, size: 64, offset: 192)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !328, line: 41, size: 64, elements: !954)
!954 = !{!955, !956}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !953, file: !328, line: 42, baseType: !327, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !953, file: !328, line: 43, baseType: !5, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !946, file: !328, line: 117, baseType: !5, size: 32, offset: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !946, file: !328, line: 120, baseType: !5, size: 32, offset: 288)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !946, file: !328, line: 123, baseType: !960, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !328, line: 87, baseType: !962)
!962 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !328, line: 87, size: 128, elements: !963)
!963 = !{!964}
!964 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !962, file: !328, line: 87, baseType: !965, size: 128)
!965 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !328, line: 85, baseType: !966)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !328, line: 85, size: 128, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !966, file: !328, line: 85, baseType: !5, size: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !966, file: !328, line: 85, baseType: !5, size: 32, offset: 32)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !966, file: !328, line: 85, baseType: !971, size: 64, offset: 64)
!971 = !DICompositeType(tag: DW_TAG_array_type, baseType: !972, size: 64, elements: !505)
!972 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !328, line: 84, baseType: !945)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !946, file: !328, line: 126, baseType: !945, size: 64, offset: 384)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !946, file: !328, line: 129, baseType: !945, size: 64, offset: 448)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !946, file: !328, line: 132, baseType: !401, size: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !946, file: !328, line: 139, baseType: !406, size: 64, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !946, file: !328, line: 143, baseType: !455, size: 128, offset: 640)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !946, file: !328, line: 146, baseType: !455, size: 128, offset: 768)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !946, file: !328, line: 148, baseType: !396, size: 8, offset: 896)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !946, file: !328, line: 149, baseType: !396, size: 8, offset: 904)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !946, file: !328, line: 153, baseType: !336, size: 32, offset: 928)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !946, file: !328, line: 156, baseType: !983, size: 64, offset: 960)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !328, line: 48, size: 320, elements: !985)
!985 = !{!986, !987, !988, !989}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !984, file: !328, line: 50, baseType: !729, size: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !984, file: !328, line: 59, baseType: !455, size: 128, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !984, file: !328, line: 64, baseType: !396, size: 8, offset: 192)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !984, file: !328, line: 67, baseType: !983, size: 64, offset: 256)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !946, file: !328, line: 159, baseType: !991, size: 64, offset: 1024)
!991 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !992, size: 64)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !328, line: 72, size: 256, elements: !993)
!993 = !{!994, !995, !996, !997}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !992, file: !328, line: 74, baseType: !709, size: 64)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !992, file: !328, line: 77, baseType: !991, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !992, file: !328, line: 78, baseType: !991, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !992, file: !328, line: 81, baseType: !991, size: 64, offset: 192)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !946, file: !328, line: 162, baseType: !396, size: 8, offset: 1088)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !946, file: !328, line: 166, baseType: !406, size: 64, offset: 1152)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !693, file: !341, line: 229, baseType: !1001, size: 128, offset: 256)
!1001 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1002, size: 128, elements: !647)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !341, line: 229, flags: DIFlagFwdDecl)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !693, file: !341, line: 232, baseType: !692, size: 64, offset: 384)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !693, file: !341, line: 233, baseType: !692, size: 64, offset: 448)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !693, file: !341, line: 238, baseType: !1007, size: 64, offset: 512)
!1007 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !341, line: 235, size: 64, elements: !1008)
!1008 = !{!1009, !1015}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1007, file: !341, line: 236, baseType: !1010, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1011, size: 64)
!1011 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !341, line: 273, size: 128, elements: !1012)
!1012 = !{!1013, !1014}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1011, file: !341, line: 275, baseType: !718, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1011, file: !341, line: 278, baseType: !718, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1007, file: !341, line: 237, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !341, line: 259, size: 320, elements: !1018)
!1018 = !{!1019, !1020, !1021, !1022, !1023}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1017, file: !341, line: 261, baseType: !579, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1017, file: !341, line: 262, baseType: !579, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1017, file: !341, line: 266, baseType: !579, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1017, file: !341, line: 267, baseType: !579, size: 64, offset: 192)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1017, file: !341, line: 270, baseType: !397, size: 32, offset: 256)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !693, file: !341, line: 241, baseType: !941, size: 64, offset: 576)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !693, file: !341, line: 244, baseType: !397, size: 32, offset: 640)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !693, file: !341, line: 247, baseType: !397, size: 32, offset: 672)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !693, file: !341, line: 250, baseType: !397, size: 32, offset: 704)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !693, file: !341, line: 253, baseType: !397, size: 32, offset: 736)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !693, file: !341, line: 256, baseType: !397, size: 32, offset: 768)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !600, file: !582, line: 179, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !582, line: 150, baseType: !1033)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !582, line: 142, size: 320, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1041, !1042}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1033, file: !582, line: 144, baseType: !406, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1033, file: !582, line: 145, baseType: !579, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1033, file: !582, line: 146, baseType: !579, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1033, file: !582, line: 147, baseType: !1039, size: 32, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1040, line: 31, baseType: !397)
!1040 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1033, file: !582, line: 148, baseType: !5, size: 32, offset: 224)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1033, file: !582, line: 149, baseType: !396, size: 8, offset: 256)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !600, file: !582, line: 180, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !582, line: 162, baseType: !1046)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !582, line: 159, size: 128, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1046, file: !582, line: 160, baseType: !406, size: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1046, file: !582, line: 161, baseType: !462, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !600, file: !582, line: 181, baseType: !1051, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !582, line: 181, flags: DIFlagFwdDecl)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !595, file: !582, line: 317, baseType: !1054, size: 64)
!1054 = !DICompositeType(tag: DW_TAG_array_type, baseType: !462, size: 64, elements: !505)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !595, file: !582, line: 318, baseType: !1056, size: 320)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !582, line: 188, size: 320, elements: !1057)
!1057 = !{!1058, !1060, !1083}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1056, file: !582, line: 190, baseType: !1059, size: 192)
!1059 = !DICompositeType(tag: DW_TAG_array_type, baseType: !599, size: 192, elements: !480)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1056, file: !582, line: 193, baseType: !1061, size: 64, offset: 192)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !582, line: 206, size: 320, elements: !1063)
!1063 = !{!1064, !1068, !1069, !1070, !1082}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1062, file: !582, line: 208, baseType: !1065, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !407, line: 62, baseType: !1067)
!1067 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !407, line: 61, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1062, file: !582, line: 211, baseType: !5, size: 32, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1062, file: !582, line: 214, baseType: !462, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1062, file: !582, line: 224, baseType: !1071, size: 64, offset: 192)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !582, line: 202, baseType: !1073)
!1073 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !582, line: 202, size: 128, elements: !1074)
!1074 = !{!1075}
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1073, file: !582, line: 202, baseType: !1076, size: 128)
!1076 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !582, line: 200, baseType: !1077)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !582, line: 200, size: 128, elements: !1078)
!1078 = !{!1079, !1080, !1081}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1077, file: !582, line: 200, baseType: !5, size: 32)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1077, file: !582, line: 200, baseType: !5, size: 32, offset: 32)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1077, file: !582, line: 200, baseType: !613, size: 64, offset: 64)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1062, file: !582, line: 234, baseType: !1071, size: 64, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1056, file: !582, line: 197, baseType: !462, size: 64, offset: 256)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !595, file: !582, line: 319, baseType: !469, size: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !595, file: !582, line: 320, baseType: !488, size: 192)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !409, file: !133, line: 3384, baseType: !1087, size: 1472)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1088)
!1088 = !{!1089, !1110, !1111, !1112, !1113}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1087, file: !133, line: 3115, baseType: !1090, size: 1216)
!1090 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1091)
!1091 = !{!1092, !1093, !1094, !1095, !1096, !1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109}
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1090, file: !133, line: 2985, baseType: !575, size: 960)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1090, file: !133, line: 2986, baseType: !406, size: 64, offset: 960)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1090, file: !133, line: 2987, baseType: !406, size: 64, offset: 1024)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1090, file: !133, line: 2988, baseType: !406, size: 64, offset: 1088)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1090, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1090, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1090, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1090, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1090, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1090, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1090, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1090, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1090, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1090, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1090, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1090, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1090, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1090, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1087, file: !133, line: 3117, baseType: !406, size: 64, offset: 1216)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1087, file: !133, line: 3119, baseType: !406, size: 64, offset: 1280)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1087, file: !133, line: 3121, baseType: !406, size: 64, offset: 1344)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1087, file: !133, line: 3123, baseType: !406, size: 64, offset: 1408)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !409, file: !133, line: 3385, baseType: !1115, size: 1088)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1116)
!1116 = !{!1117, !1118, !1119}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1115, file: !133, line: 2875, baseType: !575, size: 960)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1115, file: !133, line: 2876, baseType: !579, size: 64, offset: 960)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1115, file: !133, line: 2877, baseType: !1120, size: 64, offset: 1024)
!1120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1121, size: 64)
!1121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !389, line: 172, size: 128, elements: !1122)
!1122 = !{!1123, !1124, !1125, !1126, !1127, !1128, !1129}
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1121, file: !389, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1121, file: !389, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1121, file: !389, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1121, file: !389, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1121, file: !389, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1121, file: !389, line: 195, baseType: !5, size: 32, offset: 32)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1121, file: !389, line: 199, baseType: !406, size: 64, offset: 64)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !409, file: !133, line: 3386, baseType: !1090, size: 1216)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !409, file: !133, line: 3387, baseType: !1132, size: 1280)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1133)
!1133 = !{!1134, !1135}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1132, file: !133, line: 3094, baseType: !1090, size: 1216)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1132, file: !133, line: 3095, baseType: !1120, size: 64, offset: 1216)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !409, file: !133, line: 3388, baseType: !1137, size: 1216)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !1138)
!1138 = !{!1139, !1140, !1141, !1142, !1143, !1144}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !133, line: 2825, baseType: !537, size: 896)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1137, file: !133, line: 2827, baseType: !406, size: 64, offset: 896)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1137, file: !133, line: 2828, baseType: !406, size: 64, offset: 960)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1137, file: !133, line: 2829, baseType: !406, size: 64, offset: 1024)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1137, file: !133, line: 2830, baseType: !406, size: 64, offset: 1088)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1137, file: !133, line: 2831, baseType: !406, size: 64, offset: 1152)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !409, file: !133, line: 3389, baseType: !1146, size: 1024)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !1147)
!1147 = !{!1148, !1149, !1150}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1146, file: !133, line: 2851, baseType: !575, size: 960)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1146, file: !133, line: 2852, baseType: !397, size: 32, offset: 960)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1146, file: !133, line: 2853, baseType: !397, size: 32, offset: 992)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !409, file: !133, line: 3390, baseType: !1152, size: 1024)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !1153)
!1153 = !{!1154, !1155}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1152, file: !133, line: 2858, baseType: !575, size: 960)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1152, file: !133, line: 2859, baseType: !1120, size: 64, offset: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !409, file: !133, line: 3391, baseType: !1157, size: 960)
!1157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !133, line: 2862, size: 960, elements: !1158)
!1158 = !{!1159}
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1157, file: !133, line: 2863, baseType: !575, size: 960)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !409, file: !133, line: 3392, baseType: !1161, size: 1472)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !133, line: 3304, size: 1472, elements: !1162)
!1162 = !{!1163}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1161, file: !133, line: 3305, baseType: !1087, size: 1472)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !409, file: !133, line: 3393, baseType: !1165, size: 1792)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !133, line: 3248, size: 1792, elements: !1166)
!1166 = !{!1167, !1168, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1165, file: !133, line: 3249, baseType: !1087, size: 1472)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1165, file: !133, line: 3251, baseType: !1169, size: 64, offset: 1472)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1171, line: 463, size: 1152, elements: !1172)
!1171 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1172 = !{!1173, !1176, !1207, !1208, !1323, !1331, !1332, !1333, !1334, !1335, !1336, !1360, !1363, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1170, file: !1171, line: 464, baseType: !1174, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1175 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1171, line: 464, flags: DIFlagFwdDecl)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1170, file: !1171, line: 467, baseType: !1177, size: 64, offset: 64)
!1177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1178, size: 64)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !341, line: 374, size: 640, elements: !1179)
!1179 = !{!1180, !1182, !1183, !1196, !1197, !1198, !1199, !1200, !1201, !1203, !1205, !1206}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1178, file: !341, line: 377, baseType: !1181, size: 64)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !407, line: 111, baseType: !692)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1178, file: !341, line: 378, baseType: !1181, size: 64, offset: 64)
