; ModuleID = 'tree-vect-loop-manip.bc'
source_filename = "tree-vect-loop-manip.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!452 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vect_relevant", file: !437, line: 354, baseType: !7, size: 32, elements: !453)
!453 = !{!454, !455, !456, !457, !458}
!454 = !DIEnumerator(name: "vect_unused_in_scope", value: 0, isUnsigned: true)
!455 = !DIEnumerator(name: "vect_used_in_outer_by_reduction", value: 1, isUnsigned: true)
!456 = !DIEnumerator(name: "vect_used_in_outer", value: 2, isUnsigned: true)
!457 = !DIEnumerator(name: "vect_used_by_reduction", value: 3, isUnsigned: true)
!458 = !DIEnumerator(name: "vect_used_in_scope", value: 4, isUnsigned: true)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "vect_def_type", file: !437, line: 57, baseType: !7, size: 32, elements: !460)
!460 = !{!461, !462, !463, !464, !465, !466, !467, !468, !469}
!461 = !DIEnumerator(name: "vect_uninitialized_def", value: 0, isUnsigned: true)
!462 = !DIEnumerator(name: "vect_constant_def", value: 1, isUnsigned: true)
!463 = !DIEnumerator(name: "vect_external_def", value: 2, isUnsigned: true)
!464 = !DIEnumerator(name: "vect_internal_def", value: 3, isUnsigned: true)
!465 = !DIEnumerator(name: "vect_induction_def", value: 4, isUnsigned: true)
!466 = !DIEnumerator(name: "vect_reduction_def", value: 5, isUnsigned: true)
!467 = !DIEnumerator(name: "vect_double_reduction_def", value: 6, isUnsigned: true)
!468 = !DIEnumerator(name: "vect_nested_cycle", value: 7, isUnsigned: true)
!469 = !DIEnumerator(name: "vect_unknown_def_type", value: 8, isUnsigned: true)
!470 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "slp_vect_type", file: !437, line: 390, baseType: !7, size: 32, elements: !471)
!471 = !{!472, !473, !474}
!472 = !DIEnumerator(name: "loop_vect", value: 0, isUnsigned: true)
!473 = !DIEnumerator(name: "pure_slp", value: 1, isUnsigned: true)
!474 = !DIEnumerator(name: "hybrid", value: 2, isUnsigned: true)
!475 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !398, line: 727, baseType: !7, size: 32, elements: !476)
!476 = !{!477, !478, !479, !480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500}
!477 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!478 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!479 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!480 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!481 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!482 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!483 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!484 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!485 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!486 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!487 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!488 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!489 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!490 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!491 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!492 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!493 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!494 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!495 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!496 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!497 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!498 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!499 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!500 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!501 = !{!502, !503, !504, !505, !508, !509, !511, !638, !1863, !196, !1864, !1867, !7, !2150, !1405, !869, !506, !1874, !513, !2168, !2170, !565, !1960, !835, !1974}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!504 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !507)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !512, line: 56, baseType: !513)
!512 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !515)
!515 = !{!516, !549, !555, !568, !587, !598, !603, !612, !618, !631, !643, !681, !1191, !1219, !1236, !1237, !1242, !1251, !1257, !1262, !1266, !1270, !1514, !1561, !1567, !1573, !1580, !1593, !1607, !1624, !1636, !1658, !1673, !1845}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !514, file: !164, line: 3372, baseType: !517, size: 64)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !518)
!518 = !{!519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !517, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !517, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !517, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !517, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !517, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !517, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !517, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !517, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !517, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !517, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !517, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !517, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !517, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !517, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !517, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !517, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !517, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !517, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !517, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !517, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !517, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !517, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !517, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !517, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !517, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !517, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !517, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !517, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !517, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !517, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !514, file: !164, line: 3373, baseType: !550, size: 192)
!550 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !551)
!551 = !{!552, !553, !554}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !550, file: !164, line: 403, baseType: !517, size: 64)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !550, file: !164, line: 404, baseType: !511, size: 64, offset: 64)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !550, file: !164, line: 405, baseType: !511, size: 64, offset: 128)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !514, file: !164, line: 3374, baseType: !556, size: 320)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !557)
!557 = !{!558, !559}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !556, file: !164, line: 1385, baseType: !550, size: 192)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !556, file: !164, line: 1386, baseType: !560, size: 128, offset: 192)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !561, line: 58, baseType: !562)
!561 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!562 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 54, size: 128, elements: !563)
!563 = !{!564, !566}
!564 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !562, file: !561, line: 56, baseType: !565, size: 64)
!565 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !562, file: !561, line: 57, baseType: !567, size: 64, offset: 64)
!567 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !514, file: !164, line: 3375, baseType: !569, size: 256)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !570)
!570 = !{!571, !572}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !569, file: !164, line: 1398, baseType: !550, size: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !569, file: !164, line: 1399, baseType: !573, size: 64, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !575, line: 52, size: 256, elements: !576)
!575 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!576 = !{!577, !578, !579, !580, !581, !582, !583}
!577 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !574, file: !575, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !574, file: !575, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !574, file: !575, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !574, file: !575, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !574, file: !575, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !574, file: !575, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !574, file: !575, line: 62, baseType: !584, size: 192, offset: 64)
!584 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 192, elements: !585)
!585 = !{!586}
!586 = !DISubrange(count: 3)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !514, file: !164, line: 3376, baseType: !588, size: 256)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !589)
!589 = !{!590, !591}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !588, file: !164, line: 1409, baseType: !550, size: 192)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !588, file: !164, line: 1410, baseType: !592, size: 64, offset: 192)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !594, line: 27, size: 192, elements: !595)
!594 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !593, file: !594, line: 29, baseType: !560, size: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !593, file: !594, line: 30, baseType: !5, size: 32, offset: 128)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !514, file: !164, line: 3377, baseType: !599, size: 256)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !600)
!600 = !{!601, !602}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !599, file: !164, line: 1438, baseType: !550, size: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !599, file: !164, line: 1439, baseType: !511, size: 64, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !514, file: !164, line: 3378, baseType: !604, size: 256)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !605)
!605 = !{!606, !607, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !604, file: !164, line: 1419, baseType: !550, size: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !604, file: !164, line: 1420, baseType: !504, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !604, file: !164, line: 1421, baseType: !609, size: 8, offset: 224)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 8, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 1)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !514, file: !164, line: 3379, baseType: !613, size: 320)
!613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !614)
!614 = !{!615, !616, !617}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !613, file: !164, line: 1429, baseType: !550, size: 192)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !613, file: !164, line: 1430, baseType: !511, size: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !613, file: !164, line: 1431, baseType: !511, size: 64, offset: 256)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !514, file: !164, line: 3380, baseType: !619, size: 320)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !620)
!620 = !{!621, !622}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !619, file: !164, line: 1461, baseType: !550, size: 192)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !619, file: !164, line: 1462, baseType: !623, size: 128, offset: 192)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !624, line: 31, size: 128, elements: !625)
!624 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!625 = !{!626, !629, !630}
!626 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !623, file: !624, line: 32, baseType: !627, size: 64)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !628, size: 64)
!628 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !503)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !623, file: !624, line: 33, baseType: !7, size: 32, offset: 64)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !623, file: !624, line: 34, baseType: !7, size: 32, offset: 96)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !514, file: !164, line: 3381, baseType: !632, size: 384)
!632 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !633)
!633 = !{!634, !635, !640, !641, !642}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !632, file: !164, line: 2508, baseType: !550, size: 192)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !632, file: !164, line: 2509, baseType: !636, size: 32, offset: 192)
!636 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !637, line: 58, baseType: !638)
!637 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !639, line: 44, baseType: !7)
!639 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!640 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !632, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !632, file: !164, line: 2511, baseType: !511, size: 64, offset: 256)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !632, file: !164, line: 2512, baseType: !511, size: 64, offset: 320)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !514, file: !164, line: 3382, baseType: !644, size: 896)
!644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !644, file: !164, line: 2653, baseType: !632, size: 384)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !644, file: !164, line: 2654, baseType: !511, size: 64, offset: 384)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !644, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !644, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !644, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !644, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !644, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !644, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !644, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !644, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !644, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !644, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !644, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !644, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !644, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !644, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !644, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !644, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !644, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !644, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !644, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !644, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !644, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !644, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !644, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !644, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !644, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !644, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !644, file: !164, line: 2705, baseType: !511, size: 64, offset: 576)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !644, file: !164, line: 2706, baseType: !511, size: 64, offset: 640)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !644, file: !164, line: 2707, baseType: !511, size: 64, offset: 704)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !644, file: !164, line: 2708, baseType: !511, size: 64, offset: 768)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !644, file: !164, line: 2711, baseType: !679, size: 64, offset: 832)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !514, file: !164, line: 3383, baseType: !682, size: 960)
!682 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !683)
!683 = !{!684, !685}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !682, file: !164, line: 2757, baseType: !644, size: 896)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !682, file: !164, line: 2758, baseType: !686, size: 64, offset: 896)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !512, line: 50, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !689, line: 240, size: 384, elements: !690)
!689 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !688, file: !689, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !688, file: !689, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !688, file: !689, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !688, file: !689, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !688, file: !689, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !688, file: !689, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !688, file: !689, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !688, file: !689, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !688, file: !689, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !688, file: !689, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !688, file: !689, line: 321, baseType: !702, size: 320, offset: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !689, line: 315, size: 320, elements: !703)
!703 = !{!704, !1158, !1160, !1189, !1190}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !702, file: !689, line: 316, baseType: !705, size: 64)
!705 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 64, elements: !610)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !689, line: 183, baseType: !707)
!707 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !689, line: 166, size: 64, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !721, !722, !734, !737, !797, !798, !1135, !1148, !1155}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !707, file: !689, line: 168, baseType: !504, size: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !707, file: !689, line: 169, baseType: !7, size: 32)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !707, file: !689, line: 170, baseType: !509, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !707, file: !689, line: 171, baseType: !686, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !707, file: !689, line: 172, baseType: !714, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !512, line: 53, baseType: !715)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !689, line: 359, size: 128, elements: !717)
!717 = !{!718, !719}
!718 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !716, file: !689, line: 360, baseType: !504, size: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !716, file: !689, line: 361, baseType: !720, size: 64, offset: 64)
!720 = !DICompositeType(tag: DW_TAG_array_type, baseType: !686, size: 64, elements: !610)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !707, file: !689, line: 173, baseType: !5, size: 32)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !707, file: !689, line: 174, baseType: !723, size: 32)
!723 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !689, line: 133, baseType: !724)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !689, line: 115, size: 32, elements: !725)
!725 = !{!726, !727, !728, !729, !730, !731, !732, !733}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !724, file: !689, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !724, file: !689, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !724, file: !689, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !724, file: !689, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !724, file: !689, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !724, file: !689, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !724, file: !689, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !724, file: !689, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !707, file: !689, line: 175, baseType: !735, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !689, line: 175, flags: DIFlagFwdDecl)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !707, file: !689, line: 176, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !740, line: 75, size: 256, elements: !741)
!740 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!741 = !{!742, !756, !757, !758}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !739, file: !740, line: 76, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !740, line: 68, baseType: !745)
!745 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !740, line: 63, size: 320, elements: !746)
!746 = !{!747, !749, !750, !751}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !745, file: !740, line: 64, baseType: !748, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !745, file: !740, line: 65, baseType: !748, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !745, file: !740, line: 66, baseType: !7, size: 32, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !745, file: !740, line: 67, baseType: !752, size: 128, offset: 192)
!752 = !DICompositeType(tag: DW_TAG_array_type, baseType: !753, size: 128, elements: !754)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !740, line: 29, baseType: !565)
!754 = !{!755}
!755 = !DISubrange(count: 2)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !739, file: !740, line: 77, baseType: !743, size: 64, offset: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !739, file: !740, line: 78, baseType: !7, size: 32, offset: 128)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !739, file: !740, line: 79, baseType: !759, size: 64, offset: 192)
!759 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !760, size: 64)
!760 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !740, line: 49, baseType: !761)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !740, line: 45, size: 832, elements: !762)
!762 = !{!763, !764, !765}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !761, file: !740, line: 46, baseType: !748, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !761, file: !740, line: 47, baseType: !738, size: 64, offset: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !761, file: !740, line: 48, baseType: !766, size: 704, offset: 128)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !767, line: 164, size: 704, elements: !768)
!767 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!768 = !{!769, !770, !780, !781, !782, !783, !784, !785, !789, !793, !794, !795, !796}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !766, file: !767, line: 166, baseType: !567, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !766, file: !767, line: 167, baseType: !771, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !767, line: 157, size: 192, elements: !773)
!773 = !{!774, !775, !776}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !772, file: !767, line: 159, baseType: !506, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !772, file: !767, line: 160, baseType: !771, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !772, file: !767, line: 161, baseType: !777, size: 32, offset: 128)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !507, size: 32, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 4)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !766, file: !767, line: 168, baseType: !506, size: 64, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !766, file: !767, line: 169, baseType: !506, size: 64, offset: 192)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !766, file: !767, line: 170, baseType: !506, size: 64, offset: 256)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !766, file: !767, line: 171, baseType: !567, size: 64, offset: 320)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !766, file: !767, line: 172, baseType: !504, size: 32, offset: 384)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !766, file: !767, line: 176, baseType: !786, size: 64, offset: 448)
!786 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !787, size: 64)
!787 = !DISubroutineType(types: !788)
!788 = !{!771, !508, !567}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !766, file: !767, line: 177, baseType: !790, size: 64, offset: 512)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = !DISubroutineType(types: !792)
!792 = !{null, !508, !771}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !766, file: !767, line: 178, baseType: !508, size: 64, offset: 576)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !766, file: !767, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !766, file: !767, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !766, file: !767, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !707, file: !689, line: 177, baseType: !511, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !707, file: !689, line: 178, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !801)
!801 = !{!802, !1047, !1048, !1049, !1105, !1109, !1110, !1111, !1129, !1130, !1131, !1132, !1133, !1134}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !800, file: !135, line: 219, baseType: !803, size: 64)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !805)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !806)
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !805, file: !135, line: 151, baseType: !808, size: 128)
!808 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !809)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !810)
!810 = !{!811, !812, !813}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !809, file: !135, line: 150, baseType: !7, size: 32)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !809, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !809, file: !135, line: 150, baseType: !814, size: 64, offset: 64)
!814 = !DICompositeType(tag: DW_TAG_array_type, baseType: !815, size: 64, elements: !610)
!815 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !512, line: 108, baseType: !816)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !818)
!818 = !{!819, !820, !821, !1039, !1040, !1041, !1042, !1043, !1044, !1045}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !817, file: !135, line: 124, baseType: !799, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !817, file: !135, line: 125, baseType: !799, size: 64, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !817, file: !135, line: 131, baseType: !822, size: 64, offset: 128)
!822 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !823)
!823 = !{!824, !1038}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !822, file: !135, line: 129, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !512, line: 66, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !398, line: 143, size: 192, elements: !828)
!828 = !{!829, !1036, !1037}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !827, file: !398, line: 145, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !512, line: 69, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !398, line: 136, size: 192, elements: !833)
!833 = !{!834, !1034, !1035}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !832, file: !398, line: 137, baseType: !835, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !512, line: 58, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !398, line: 737, size: 768, elements: !838)
!838 = !{!839, !856, !889, !895, !900, !905, !912, !918, !924, !929, !943, !948, !954, !959, !969, !974, !992, !999, !1006, !1012, !1017, !1023, !1029}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !837, file: !398, line: 738, baseType: !840, size: 256)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !398, line: 271, size: 256, elements: !841)
!841 = !{!842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !840, file: !398, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !840, file: !398, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !840, file: !398, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !840, file: !398, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !840, file: !398, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !840, file: !398, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !840, file: !398, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !840, file: !398, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !840, file: !398, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !840, file: !398, line: 312, baseType: !7, size: 32, offset: 32)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !840, file: !398, line: 316, baseType: !636, size: 32, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !840, file: !398, line: 319, baseType: !7, size: 32, offset: 96)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !840, file: !398, line: 323, baseType: !799, size: 64, offset: 128)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !840, file: !398, line: 327, baseType: !511, size: 64, offset: 192)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !837, file: !398, line: 739, baseType: !857, size: 448)
!857 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !398, line: 350, size: 448, elements: !858)
!858 = !{!859, !887}
!859 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !857, file: !398, line: 353, baseType: !860, size: 384)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !398, line: 333, size: 384, elements: !861)
!861 = !{!862, !863, !870}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !860, file: !398, line: 336, baseType: !840, size: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !860, file: !398, line: 343, baseType: !864, size: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !391, line: 37, size: 128, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !865, file: !391, line: 39, baseType: !864, size: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !865, file: !391, line: 40, baseType: !869, size: 64, offset: 64)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !860, file: !398, line: 344, baseType: !871, size: 64, offset: 320)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !391, line: 45, size: 320, elements: !873)
!873 = !{!874, !875}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !872, file: !391, line: 47, baseType: !871, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !872, file: !391, line: 48, baseType: !876, size: 256, offset: 64)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !877)
!877 = !{!878, !880, !881, !886}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !876, file: !164, line: 1884, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !876, file: !164, line: 1885, baseType: !879, size: 64, offset: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !876, file: !164, line: 1891, baseType: !882, size: 64, offset: 128)
!882 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !876, file: !164, line: 1891, size: 64, elements: !883)
!883 = !{!884, !885}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !882, file: !164, line: 1891, baseType: !835, size: 64)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !882, file: !164, line: 1891, baseType: !511, size: 64)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !876, file: !164, line: 1892, baseType: !869, size: 64, offset: 192)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !857, file: !398, line: 359, baseType: !888, size: 64, offset: 384)
!888 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 64, elements: !610)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !837, file: !398, line: 740, baseType: !890, size: 512)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !398, line: 365, size: 512, elements: !891)
!891 = !{!892, !893, !894}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !890, file: !398, line: 368, baseType: !860, size: 384)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !890, file: !398, line: 373, baseType: !511, size: 64, offset: 384)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !890, file: !398, line: 374, baseType: !511, size: 64, offset: 448)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !837, file: !398, line: 741, baseType: !896, size: 576)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !398, line: 380, size: 576, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !896, file: !398, line: 383, baseType: !890, size: 512)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !896, file: !398, line: 389, baseType: !888, size: 64, offset: 512)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !837, file: !398, line: 742, baseType: !901, size: 320)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !398, line: 395, size: 320, elements: !902)
!902 = !{!903, !904}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !901, file: !398, line: 397, baseType: !840, size: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !901, file: !398, line: 400, baseType: !825, size: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !837, file: !398, line: 743, baseType: !906, size: 448)
!906 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !398, line: 406, size: 448, elements: !907)
!907 = !{!908, !909, !910, !911}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !906, file: !398, line: 408, baseType: !840, size: 256)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !906, file: !398, line: 412, baseType: !511, size: 64, offset: 256)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !906, file: !398, line: 420, baseType: !511, size: 64, offset: 320)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !906, file: !398, line: 423, baseType: !825, size: 64, offset: 384)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !837, file: !398, line: 744, baseType: !913, size: 384)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !398, line: 429, size: 384, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !913, file: !398, line: 431, baseType: !840, size: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !913, file: !398, line: 434, baseType: !511, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !913, file: !398, line: 437, baseType: !825, size: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !837, file: !398, line: 745, baseType: !919, size: 384)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !398, line: 443, size: 384, elements: !920)
!920 = !{!921, !922, !923}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !919, file: !398, line: 445, baseType: !840, size: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !919, file: !398, line: 449, baseType: !511, size: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !919, file: !398, line: 453, baseType: !825, size: 64, offset: 320)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !837, file: !398, line: 746, baseType: !925, size: 320)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !398, line: 459, size: 320, elements: !926)
!926 = !{!927, !928}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !925, file: !398, line: 461, baseType: !840, size: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !925, file: !398, line: 464, baseType: !511, size: 64, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !837, file: !398, line: 747, baseType: !930, size: 768)
!930 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !398, line: 469, size: 768, elements: !931)
!931 = !{!932, !933, !934, !935, !936}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !930, file: !398, line: 471, baseType: !840, size: 256)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !930, file: !398, line: 474, baseType: !7, size: 32, offset: 256)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !930, file: !398, line: 475, baseType: !7, size: 32, offset: 288)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !930, file: !398, line: 478, baseType: !511, size: 64, offset: 320)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !930, file: !398, line: 481, baseType: !937, size: 384, offset: 384)
!937 = !DICompositeType(tag: DW_TAG_array_type, baseType: !938, size: 384, elements: !610)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !164, line: 1917, size: 384, elements: !939)
!939 = !{!940, !941, !942}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !938, file: !164, line: 1920, baseType: !876, size: 256)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !938, file: !164, line: 1921, baseType: !511, size: 64, offset: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !938, file: !164, line: 1922, baseType: !636, size: 32, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !837, file: !398, line: 748, baseType: !944, size: 320)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !398, line: 487, size: 320, elements: !945)
!945 = !{!946, !947}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !944, file: !398, line: 490, baseType: !840, size: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !944, file: !398, line: 494, baseType: !504, size: 32, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !837, file: !398, line: 749, baseType: !949, size: 384)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !398, line: 500, size: 384, elements: !950)
!950 = !{!951, !952, !953}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !949, file: !398, line: 502, baseType: !840, size: 256)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !949, file: !398, line: 506, baseType: !825, size: 64, offset: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !949, file: !398, line: 510, baseType: !825, size: 64, offset: 320)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !837, file: !398, line: 750, baseType: !955, size: 320)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !398, line: 529, size: 320, elements: !956)
!956 = !{!957, !958}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !955, file: !398, line: 531, baseType: !840, size: 256)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !955, file: !398, line: 540, baseType: !825, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !837, file: !398, line: 751, baseType: !960, size: 704)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !398, line: 546, size: 704, elements: !961)
!961 = !{!962, !963, !964, !965, !966, !967, !968}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !960, file: !398, line: 549, baseType: !890, size: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !960, file: !398, line: 553, baseType: !509, size: 64, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !960, file: !398, line: 557, baseType: !503, size: 8, offset: 576)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !960, file: !398, line: 558, baseType: !503, size: 8, offset: 584)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !960, file: !398, line: 559, baseType: !503, size: 8, offset: 592)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !960, file: !398, line: 560, baseType: !503, size: 8, offset: 600)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !960, file: !398, line: 566, baseType: !888, size: 64, offset: 640)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !837, file: !398, line: 752, baseType: !970, size: 384)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !398, line: 571, size: 384, elements: !971)
!971 = !{!972, !973}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !970, file: !398, line: 573, baseType: !901, size: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !970, file: !398, line: 577, baseType: !511, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !837, file: !398, line: 753, baseType: !975, size: 576)
!975 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !398, line: 600, size: 576, elements: !976)
!976 = !{!977, !978, !979, !982, !991}
!977 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !975, file: !398, line: 602, baseType: !901, size: 320)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !975, file: !398, line: 605, baseType: !511, size: 64, offset: 320)
!979 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !975, file: !398, line: 609, baseType: !980, size: 64, offset: 384)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !981, line: 46, baseType: !565)
!981 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!982 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !975, file: !398, line: 612, baseType: !983, size: 64, offset: 448)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !398, line: 581, size: 320, elements: !985)
!985 = !{!986, !987, !988, !989, !990}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !984, file: !398, line: 583, baseType: !196, size: 32)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !984, file: !398, line: 586, baseType: !511, size: 64, offset: 64)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !984, file: !398, line: 589, baseType: !511, size: 64, offset: 128)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !984, file: !398, line: 592, baseType: !511, size: 64, offset: 192)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !984, file: !398, line: 595, baseType: !511, size: 64, offset: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !975, file: !398, line: 616, baseType: !825, size: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !837, file: !398, line: 754, baseType: !993, size: 512)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !398, line: 622, size: 512, elements: !994)
!994 = !{!995, !996, !997, !998}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !993, file: !398, line: 624, baseType: !901, size: 320)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !993, file: !398, line: 628, baseType: !511, size: 64, offset: 320)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !993, file: !398, line: 632, baseType: !511, size: 64, offset: 384)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !993, file: !398, line: 636, baseType: !511, size: 64, offset: 448)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !837, file: !398, line: 755, baseType: !1000, size: 704)
!1000 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !398, line: 642, size: 704, elements: !1001)
!1001 = !{!1002, !1003, !1004, !1005}
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1000, file: !398, line: 644, baseType: !993, size: 512)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1000, file: !398, line: 648, baseType: !511, size: 64, offset: 512)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1000, file: !398, line: 652, baseType: !511, size: 64, offset: 576)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1000, file: !398, line: 653, baseType: !511, size: 64, offset: 640)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !837, file: !398, line: 756, baseType: !1007, size: 448)
!1007 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !398, line: 663, size: 448, elements: !1008)
!1008 = !{!1009, !1010, !1011}
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1007, file: !398, line: 665, baseType: !901, size: 320)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1007, file: !398, line: 668, baseType: !511, size: 64, offset: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1007, file: !398, line: 673, baseType: !511, size: 64, offset: 384)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !837, file: !398, line: 757, baseType: !1013, size: 384)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !398, line: 694, size: 384, elements: !1014)
!1014 = !{!1015, !1016}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1013, file: !398, line: 696, baseType: !901, size: 320)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1013, file: !398, line: 699, baseType: !511, size: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !837, file: !398, line: 758, baseType: !1018, size: 384)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !398, line: 681, size: 384, elements: !1019)
!1019 = !{!1020, !1021, !1022}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1018, file: !398, line: 683, baseType: !840, size: 256)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1018, file: !398, line: 686, baseType: !511, size: 64, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1018, file: !398, line: 689, baseType: !511, size: 64, offset: 320)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !837, file: !398, line: 759, baseType: !1024, size: 384)
!1024 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !398, line: 707, size: 384, elements: !1025)
!1025 = !{!1026, !1027, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1024, file: !398, line: 709, baseType: !840, size: 256)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1024, file: !398, line: 712, baseType: !511, size: 64, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1024, file: !398, line: 712, baseType: !511, size: 64, offset: 320)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !837, file: !398, line: 760, baseType: !1030, size: 320)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !398, line: 718, size: 320, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1030, file: !398, line: 720, baseType: !840, size: 256)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1030, file: !398, line: 723, baseType: !511, size: 64, offset: 256)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !832, file: !398, line: 138, baseType: !831, size: 64, offset: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !832, file: !398, line: 139, baseType: !831, size: 64, offset: 128)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !827, file: !398, line: 146, baseType: !830, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !827, file: !398, line: 152, baseType: !825, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !822, file: !135, line: 130, baseType: !686, size: 64)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !817, file: !135, line: 134, baseType: !508, size: 64, offset: 192)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !817, file: !135, line: 137, baseType: !511, size: 64, offset: 256)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !817, file: !135, line: 138, baseType: !636, size: 32, offset: 320)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !817, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !817, file: !135, line: 144, baseType: !504, size: 32, offset: 384)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !817, file: !135, line: 145, baseType: !504, size: 32, offset: 416)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !817, file: !135, line: 146, baseType: !1046, size: 64, offset: 448)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !567)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !800, file: !135, line: 220, baseType: !803, size: 64, offset: 64)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !800, file: !135, line: 223, baseType: !508, size: 64, offset: 128)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !800, file: !135, line: 226, baseType: !1050, size: 64, offset: 192)
!1050 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056, !1057, !1062, !1063, !1064, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1095, !1103, !1104}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1051, file: !146, line: 102, baseType: !504, size: 32)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1051, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1051, file: !146, line: 108, baseType: !799, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1051, file: !146, line: 111, baseType: !799, size: 64, offset: 128)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1051, file: !146, line: 114, baseType: !1058, size: 64, offset: 192)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1058, file: !146, line: 42, baseType: !145, size: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1058, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1051, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1051, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1051, file: !146, line: 123, baseType: !1065, size: 64, offset: 320)
!1065 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1066 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1067)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1068)
!1068 = !{!1069}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1067, file: !146, line: 87, baseType: !1070, size: 128)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1071)
!1071 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1072)
!1072 = !{!1073, !1074, !1075}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1071, file: !146, line: 85, baseType: !7, size: 32)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1071, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1071, file: !146, line: 85, baseType: !1076, size: 64, offset: 64)
!1076 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1077, size: 64, elements: !610)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1050)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1051, file: !146, line: 126, baseType: !1050, size: 64, offset: 384)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1051, file: !146, line: 129, baseType: !1050, size: 64, offset: 448)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1051, file: !146, line: 132, baseType: !508, size: 64, offset: 512)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1051, file: !146, line: 139, baseType: !511, size: 64, offset: 576)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1051, file: !146, line: 143, baseType: !560, size: 128, offset: 640)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1051, file: !146, line: 146, baseType: !560, size: 128, offset: 768)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1051, file: !146, line: 148, baseType: !503, size: 8, offset: 896)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1051, file: !146, line: 149, baseType: !503, size: 8, offset: 904)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1051, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1051, file: !146, line: 156, baseType: !1088, size: 64, offset: 960)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1090)
!1090 = !{!1091, !1092, !1093, !1094}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1089, file: !146, line: 50, baseType: !835, size: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1089, file: !146, line: 59, baseType: !560, size: 128, offset: 64)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1089, file: !146, line: 64, baseType: !503, size: 8, offset: 192)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1089, file: !146, line: 67, baseType: !1088, size: 64, offset: 256)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1051, file: !146, line: 159, baseType: !1096, size: 64, offset: 1024)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1097, size: 64)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1097, file: !146, line: 74, baseType: !816, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1097, file: !146, line: 77, baseType: !1096, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1097, file: !146, line: 78, baseType: !1096, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1097, file: !146, line: 81, baseType: !1096, size: 64, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1051, file: !146, line: 162, baseType: !503, size: 8, offset: 1088)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1051, file: !146, line: 166, baseType: !511, size: 64, offset: 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !800, file: !135, line: 229, baseType: !1106, size: 128, offset: 256)
!1106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1107, size: 128, elements: !754)
!1107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1108, size: 64)
!1108 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !800, file: !135, line: 232, baseType: !799, size: 64, offset: 384)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !800, file: !135, line: 233, baseType: !799, size: 64, offset: 448)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !800, file: !135, line: 238, baseType: !1112, size: 64, offset: 512)
!1112 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1113)
!1113 = !{!1114, !1120}
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1112, file: !135, line: 236, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1116, file: !135, line: 275, baseType: !825, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1116, file: !135, line: 278, baseType: !825, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1112, file: !135, line: 237, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1122, file: !135, line: 261, baseType: !686, size: 64)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1122, file: !135, line: 262, baseType: !686, size: 64, offset: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1122, file: !135, line: 266, baseType: !686, size: 64, offset: 128)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1122, file: !135, line: 267, baseType: !686, size: 64, offset: 192)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1122, file: !135, line: 270, baseType: !504, size: 32, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !800, file: !135, line: 241, baseType: !1046, size: 64, offset: 576)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !800, file: !135, line: 244, baseType: !504, size: 32, offset: 640)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !800, file: !135, line: 247, baseType: !504, size: 32, offset: 672)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !800, file: !135, line: 250, baseType: !504, size: 32, offset: 704)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !800, file: !135, line: 253, baseType: !504, size: 32, offset: 736)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !800, file: !135, line: 256, baseType: !504, size: 32, offset: 768)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !707, file: !689, line: 179, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1137, size: 64)
!1137 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !689, line: 150, baseType: !1138)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !689, line: 142, size: 320, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143, !1146, !1147}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1138, file: !689, line: 144, baseType: !511, size: 64)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1138, file: !689, line: 145, baseType: !686, size: 64, offset: 64)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1138, file: !689, line: 146, baseType: !686, size: 64, offset: 128)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1138, file: !689, line: 147, baseType: !1144, size: 32, offset: 192)
!1144 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1145, line: 31, baseType: !504)
!1145 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1138, file: !689, line: 148, baseType: !7, size: 32, offset: 224)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1138, file: !689, line: 149, baseType: !503, size: 8, offset: 256)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !707, file: !689, line: 180, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1150, size: 64)
!1150 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !689, line: 162, baseType: !1151)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !689, line: 159, size: 128, elements: !1152)
!1152 = !{!1153, !1154}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1151, file: !689, line: 160, baseType: !511, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1151, file: !689, line: 161, baseType: !567, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !707, file: !689, line: 181, baseType: !1156, size: 64)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !689, line: 181, flags: DIFlagFwdDecl)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !702, file: !689, line: 317, baseType: !1159, size: 64)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 64, elements: !610)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !702, file: !689, line: 318, baseType: !1161, size: 320)
!1161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !689, line: 188, size: 320, elements: !1162)
!1162 = !{!1163, !1165, !1188}
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1161, file: !689, line: 190, baseType: !1164, size: 192)
!1164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !706, size: 192, elements: !585)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1161, file: !689, line: 193, baseType: !1166, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1167, size: 64)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !689, line: 206, size: 320, elements: !1168)
!1168 = !{!1169, !1173, !1174, !1175, !1187}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1167, file: !689, line: 208, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !512, line: 62, baseType: !1172)
!1172 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !512, line: 61, flags: DIFlagFwdDecl)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1167, file: !689, line: 211, baseType: !7, size: 32, offset: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1167, file: !689, line: 214, baseType: !567, size: 64, offset: 128)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1167, file: !689, line: 224, baseType: !1176, size: 64, offset: 192)
!1176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1177, size: 64)
!1177 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !689, line: 202, baseType: !1178)
!1178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !689, line: 202, size: 128, elements: !1179)
!1179 = !{!1180}
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1178, file: !689, line: 202, baseType: !1181, size: 128)
!1181 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !689, line: 200, baseType: !1182)
!1182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !689, line: 200, size: 128, elements: !1183)
!1183 = !{!1184, !1185, !1186}
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1182, file: !689, line: 200, baseType: !7, size: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1182, file: !689, line: 200, baseType: !7, size: 32, offset: 32)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1182, file: !689, line: 200, baseType: !720, size: 64, offset: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1167, file: !689, line: 234, baseType: !1176, size: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1161, file: !689, line: 197, baseType: !567, size: 64, offset: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !702, file: !689, line: 319, baseType: !574, size: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !702, file: !689, line: 320, baseType: !593, size: 192)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !514, file: !164, line: 3384, baseType: !1192, size: 1472)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1193)
!1193 = !{!1194, !1215, !1216, !1217, !1218}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1192, file: !164, line: 3115, baseType: !1195, size: 1216)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1196)
!1196 = !{!1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213, !1214}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1195, file: !164, line: 2985, baseType: !682, size: 960)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1195, file: !164, line: 2986, baseType: !511, size: 64, offset: 960)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1195, file: !164, line: 2987, baseType: !511, size: 64, offset: 1024)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1195, file: !164, line: 2988, baseType: !511, size: 64, offset: 1088)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1195, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1195, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1195, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1195, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1195, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1195, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1195, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1195, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1195, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1195, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1195, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1195, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1195, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1195, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1192, file: !164, line: 3117, baseType: !511, size: 64, offset: 1216)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1192, file: !164, line: 3119, baseType: !511, size: 64, offset: 1280)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1192, file: !164, line: 3121, baseType: !511, size: 64, offset: 1344)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1192, file: !164, line: 3123, baseType: !511, size: 64, offset: 1408)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !514, file: !164, line: 3385, baseType: !1220, size: 1088)
!1220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1221)
!1221 = !{!1222, !1223, !1224}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1220, file: !164, line: 2875, baseType: !682, size: 960)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1220, file: !164, line: 2876, baseType: !686, size: 64, offset: 960)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1220, file: !164, line: 2877, baseType: !1225, size: 64, offset: 1024)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1227, line: 172, size: 128, elements: !1228)
!1227 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1228 = !{!1229, !1230, !1231, !1232, !1233, !1234, !1235}
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1226, file: !1227, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1226, file: !1227, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1226, file: !1227, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1226, file: !1227, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1226, file: !1227, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1226, file: !1227, line: 195, baseType: !7, size: 32, offset: 32)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1226, file: !1227, line: 199, baseType: !511, size: 64, offset: 64)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !514, file: !164, line: 3386, baseType: !1195, size: 1216)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !514, file: !164, line: 3387, baseType: !1238, size: 1280)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1239)
!1239 = !{!1240, !1241}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1238, file: !164, line: 3094, baseType: !1195, size: 1216)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1238, file: !164, line: 3095, baseType: !1225, size: 64, offset: 1216)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !514, file: !164, line: 3388, baseType: !1243, size: 1216)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1244)
!1244 = !{!1245, !1246, !1247, !1248, !1249, !1250}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1243, file: !164, line: 2825, baseType: !644, size: 896)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1243, file: !164, line: 2827, baseType: !511, size: 64, offset: 896)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1243, file: !164, line: 2828, baseType: !511, size: 64, offset: 960)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1243, file: !164, line: 2829, baseType: !511, size: 64, offset: 1024)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1243, file: !164, line: 2830, baseType: !511, size: 64, offset: 1088)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1243, file: !164, line: 2831, baseType: !511, size: 64, offset: 1152)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !514, file: !164, line: 3389, baseType: !1252, size: 1024)
!1252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1253)
!1253 = !{!1254, !1255, !1256}
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1252, file: !164, line: 2851, baseType: !682, size: 960)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1252, file: !164, line: 2852, baseType: !504, size: 32, offset: 960)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1252, file: !164, line: 2853, baseType: !504, size: 32, offset: 992)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !514, file: !164, line: 3390, baseType: !1258, size: 1024)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1259)
!1259 = !{!1260, !1261}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1258, file: !164, line: 2858, baseType: !682, size: 960)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1258, file: !164, line: 2859, baseType: !1225, size: 64, offset: 960)
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !514, file: !164, line: 3391, baseType: !1263, size: 960)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1264)
!1264 = !{!1265}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1263, file: !164, line: 2863, baseType: !682, size: 960)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !514, file: !164, line: 3392, baseType: !1267, size: 1472)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1268)
!1268 = !{!1269}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1267, file: !164, line: 3305, baseType: !1192, size: 1472)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !514, file: !164, line: 3393, baseType: !1271, size: 1792)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1272)
!1272 = !{!1273, !1274, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508, !1509, !1510, !1511, !1512, !1513}
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1271, file: !164, line: 3249, baseType: !1192, size: 1472)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1271, file: !164, line: 3251, baseType: !1275, size: 64, offset: 1472)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1277, line: 463, size: 1152, elements: !1278)
!1277 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1278 = !{!1279, !1282, !1313, !1314, !1429, !1437, !1438, !1439, !1440, !1441, !1442, !1466, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491, !1492}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1276, file: !1277, line: 464, baseType: !1280, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1281, size: 64)
!1281 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1277, line: 464, flags: DIFlagFwdDecl)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1276, file: !1277, line: 467, baseType: !1283, size: 64, offset: 64)
!1283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1284, size: 64)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1285)
!1285 = !{!1286, !1288, !1289, !1302, !1303, !1304, !1305, !1306, !1307, !1309, !1311, !1312}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1284, file: !135, line: 377, baseType: !1287, size: 64)
