; ModuleID = 'tree-ssa-sccvn.bc'
source_filename = "tree-ssa-sccvn.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.VEC_vn_ssa_aux_t_heap = type { %struct.VEC_vn_ssa_aux_t_base }
%struct.VEC_vn_ssa_aux_t_base = type { i32, i32, [1 x %struct.vn_ssa_aux*] }
%struct.vn_ssa_aux = type { %union.tree_node*, %union.tree_node*, i32, i32, i32, i8 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }

!427 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!428 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !391, line: 80, baseType: !7, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434}
!431 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!434 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!435 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !391, line: 727, baseType: !7, size: 32, elements: !436)
!436 = !{!437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460}
!437 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!459 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!460 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!461 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !462, line: 119, baseType: !7, size: 32, elements: !463)
!462 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!463 = !{!464, !465, !466, !467}
!464 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!465 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!466 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!467 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!468 = !{!469, !470, !471, !472, !475, !476, !478, !473, !483, !134, !610, !1844, !1845, !1851, !1883, !1884, !1886, !1899, !1377, !1901, !7, !1902, !429, !1915, !1862, !537, !808, !1918, !841, !1920, !1311, !1923, !1924, !1954, !1956, !1971, !1964, !1973, !1976, !1978, !1979}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!471 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !473, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !477, size: 64)
!477 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !474)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vn_ssa_aux", file: !480, line: 136, size: 256, elements: !481)
!480 = !DIFile(filename: "./tree-ssa-sccvn.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!481 = !{!482, !1835, !1836, !1837, !1838, !1839, !1840, !1841, !1842, !1843}
!482 = !DIDerivedType(tag: DW_TAG_member, name: "valnum", scope: !479, file: !480, line: 139, baseType: !483, size: 64)
!483 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !484, line: 56, baseType: !485)
!484 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !487)
!487 = !{!488, !521, !527, !540, !559, !570, !575, !584, !590, !603, !615, !653, !1163, !1191, !1208, !1209, !1214, !1223, !1229, !1234, !1238, !1242, !1486, !1533, !1539, !1545, !1552, !1565, !1579, !1596, !1608, !1630, !1645, !1817}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !486, file: !135, line: 3372, baseType: !489, size: 64)
!489 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !490)
!490 = !{!491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513, !514, !515, !516, !517, !518, !519, !520}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !489, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !489, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !489, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !489, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !489, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !489, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !489, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !489, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !489, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !489, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !489, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !489, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !489, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !489, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !489, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !489, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !489, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !489, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !489, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !489, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !489, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !489, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !489, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !489, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !489, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !489, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !489, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !489, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !489, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !489, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !486, file: !135, line: 3373, baseType: !522, size: 192)
!522 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !523)
!523 = !{!524, !525, !526}
!524 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !522, file: !135, line: 403, baseType: !489, size: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !522, file: !135, line: 404, baseType: !483, size: 64, offset: 64)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !522, file: !135, line: 405, baseType: !483, size: 64, offset: 128)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !486, file: !135, line: 3374, baseType: !528, size: 320)
!528 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !529)
!529 = !{!530, !531}
!530 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !528, file: !135, line: 1385, baseType: !522, size: 192)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !528, file: !135, line: 1386, baseType: !532, size: 128, offset: 192)
!532 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !533, line: 58, baseType: !534)
!533 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !533, line: 54, size: 128, elements: !535)
!535 = !{!536, !538}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !534, file: !533, line: 56, baseType: !537, size: 64)
!537 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !534, file: !533, line: 57, baseType: !539, size: 64, offset: 64)
!539 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !486, file: !135, line: 3375, baseType: !541, size: 256)
!541 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !542)
!542 = !{!543, !544}
!543 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !541, file: !135, line: 1398, baseType: !522, size: 192)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !541, file: !135, line: 1399, baseType: !545, size: 64, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !546, size: 64)
!546 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !547, line: 52, size: 256, elements: !548)
!547 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!548 = !{!549, !550, !551, !552, !553, !554, !555}
!549 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !546, file: !547, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !546, file: !547, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !546, file: !547, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !546, file: !547, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !546, file: !547, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !546, file: !547, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !546, file: !547, line: 62, baseType: !556, size: 192, offset: 64)
!556 = !DICompositeType(tag: DW_TAG_array_type, baseType: !537, size: 192, elements: !557)
!557 = !{!558}
!558 = !DISubrange(count: 3)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !486, file: !135, line: 3376, baseType: !560, size: 256)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !135, line: 1409, baseType: !522, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !560, file: !135, line: 1410, baseType: !564, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !566, line: 27, size: 192, elements: !567)
!566 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!567 = !{!568, !569}
!568 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !565, file: !566, line: 29, baseType: !532, size: 128)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !565, file: !566, line: 30, baseType: !5, size: 32, offset: 128)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !486, file: !135, line: 3377, baseType: !571, size: 256)
!571 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !572)
!572 = !{!573, !574}
!573 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !571, file: !135, line: 1438, baseType: !522, size: 192)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !571, file: !135, line: 1439, baseType: !483, size: 64, offset: 192)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !486, file: !135, line: 3378, baseType: !576, size: 256)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !577)
!577 = !{!578, !579, !580}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !576, file: !135, line: 1419, baseType: !522, size: 192)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !576, file: !135, line: 1420, baseType: !471, size: 32, offset: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !576, file: !135, line: 1421, baseType: !581, size: 8, offset: 224)
!581 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 8, elements: !582)
!582 = !{!583}
!583 = !DISubrange(count: 1)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !486, file: !135, line: 3379, baseType: !585, size: 320)
!585 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !586)
!586 = !{!587, !588, !589}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !585, file: !135, line: 1429, baseType: !522, size: 192)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !585, file: !135, line: 1430, baseType: !483, size: 64, offset: 192)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !585, file: !135, line: 1431, baseType: !483, size: 64, offset: 256)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !486, file: !135, line: 3380, baseType: !591, size: 320)
!591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !592)
!592 = !{!593, !594}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !591, file: !135, line: 1461, baseType: !522, size: 192)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !591, file: !135, line: 1462, baseType: !595, size: 128, offset: 192)
!595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !596, line: 31, size: 128, elements: !597)
!596 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!597 = !{!598, !601, !602}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !595, file: !596, line: 32, baseType: !599, size: 64)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !470)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !595, file: !596, line: 33, baseType: !7, size: 32, offset: 64)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !595, file: !596, line: 34, baseType: !7, size: 32, offset: 96)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !486, file: !135, line: 3381, baseType: !604, size: 384)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !605)
!605 = !{!606, !607, !612, !613, !614}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !604, file: !135, line: 2508, baseType: !522, size: 192)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !604, file: !135, line: 2509, baseType: !608, size: 32, offset: 192)
!608 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !609, line: 58, baseType: !610)
!609 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !611, line: 44, baseType: !7)
!611 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!612 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !604, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !604, file: !135, line: 2511, baseType: !483, size: 64, offset: 256)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !604, file: !135, line: 2512, baseType: !483, size: 64, offset: 320)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !486, file: !135, line: 3382, baseType: !616, size: 896)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !617)
!617 = !{!618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650}
!618 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !616, file: !135, line: 2653, baseType: !604, size: 384)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !616, file: !135, line: 2654, baseType: !483, size: 64, offset: 384)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !616, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !616, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !616, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !616, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !616, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !616, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !616, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !616, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !616, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !616, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !616, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !616, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !616, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !616, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !616, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !616, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !616, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !616, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !616, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !616, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !616, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !616, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !616, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !616, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !616, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !616, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !616, file: !135, line: 2705, baseType: !483, size: 64, offset: 576)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !616, file: !135, line: 2706, baseType: !483, size: 64, offset: 640)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !616, file: !135, line: 2707, baseType: !483, size: 64, offset: 704)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !616, file: !135, line: 2708, baseType: !483, size: 64, offset: 768)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !616, file: !135, line: 2711, baseType: !651, size: 64, offset: 832)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !486, file: !135, line: 3383, baseType: !654, size: 960)
!654 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !655)
!655 = !{!656, !657}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !654, file: !135, line: 2757, baseType: !616, size: 896)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !654, file: !135, line: 2758, baseType: !658, size: 64, offset: 896)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !484, line: 50, baseType: !659)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !661, line: 240, size: 384, elements: !662)
!661 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !660, file: !661, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !660, file: !661, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !660, file: !661, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !660, file: !661, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !660, file: !661, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !660, file: !661, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !660, file: !661, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !660, file: !661, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !660, file: !661, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !660, file: !661, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !660, file: !661, line: 321, baseType: !674, size: 320, offset: 64)
!674 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !661, line: 315, size: 320, elements: !675)
!675 = !{!676, !1130, !1132, !1161, !1162}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !674, file: !661, line: 316, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 64, elements: !582)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !661, line: 183, baseType: !679)
!679 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !661, line: 166, size: 64, elements: !680)
!680 = !{!681, !682, !683, !684, !685, !693, !694, !706, !709, !769, !770, !1107, !1120, !1127}
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !679, file: !661, line: 168, baseType: !471, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !679, file: !661, line: 169, baseType: !7, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !679, file: !661, line: 170, baseType: !476, size: 64)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !679, file: !661, line: 171, baseType: !658, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !679, file: !661, line: 172, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !484, line: 53, baseType: !687)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !661, line: 359, size: 128, elements: !689)
!689 = !{!690, !691}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !688, file: !661, line: 360, baseType: !471, size: 32)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !688, file: !661, line: 361, baseType: !692, size: 64, offset: 64)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !658, size: 64, elements: !582)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !679, file: !661, line: 173, baseType: !5, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !679, file: !661, line: 174, baseType: !695, size: 32)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !661, line: 133, baseType: !696)
!696 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !661, line: 115, size: 32, elements: !697)
!697 = !{!698, !699, !700, !701, !702, !703, !704, !705}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !696, file: !661, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !696, file: !661, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !696, file: !661, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !696, file: !661, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !696, file: !661, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !696, file: !661, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !696, file: !661, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !696, file: !661, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !679, file: !661, line: 175, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !661, line: 175, flags: DIFlagFwdDecl)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !679, file: !661, line: 176, baseType: !710, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !712, line: 75, size: 256, elements: !713)
!712 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!713 = !{!714, !728, !729, !730}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !711, file: !712, line: 76, baseType: !715, size: 64)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !712, line: 68, baseType: !717)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !712, line: 63, size: 320, elements: !718)
!718 = !{!719, !721, !722, !723}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !717, file: !712, line: 64, baseType: !720, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !717, size: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !717, file: !712, line: 65, baseType: !720, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !717, file: !712, line: 66, baseType: !7, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !717, file: !712, line: 67, baseType: !724, size: 128, offset: 192)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !725, size: 128, elements: !726)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !712, line: 29, baseType: !537)
!726 = !{!727}
!727 = !DISubrange(count: 2)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !711, file: !712, line: 77, baseType: !715, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !711, file: !712, line: 78, baseType: !7, size: 32, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !711, file: !712, line: 79, baseType: !731, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !712, line: 49, baseType: !733)
!733 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !712, line: 45, size: 832, elements: !734)
!734 = !{!735, !736, !737}
!735 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !733, file: !712, line: 46, baseType: !720, size: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !733, file: !712, line: 47, baseType: !710, size: 64, offset: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !733, file: !712, line: 48, baseType: !738, size: 704, offset: 128)
!738 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !739, line: 164, size: 704, elements: !740)
!739 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!740 = !{!741, !742, !752, !753, !754, !755, !756, !757, !761, !765, !766, !767, !768}
!741 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !738, file: !739, line: 166, baseType: !539, size: 64)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !738, file: !739, line: 167, baseType: !743, size: 64, offset: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !744, size: 64)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !739, line: 157, size: 192, elements: !745)
!745 = !{!746, !747, !748}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !744, file: !739, line: 159, baseType: !473, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !744, file: !739, line: 160, baseType: !743, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !744, file: !739, line: 161, baseType: !749, size: 32, offset: 128)
!749 = !DICompositeType(tag: DW_TAG_array_type, baseType: !474, size: 32, elements: !750)
!750 = !{!751}
!751 = !DISubrange(count: 4)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !738, file: !739, line: 168, baseType: !473, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !738, file: !739, line: 169, baseType: !473, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !738, file: !739, line: 170, baseType: !473, size: 64, offset: 256)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !738, file: !739, line: 171, baseType: !539, size: 64, offset: 320)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !738, file: !739, line: 172, baseType: !471, size: 32, offset: 384)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !738, file: !739, line: 176, baseType: !758, size: 64, offset: 448)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = !DISubroutineType(types: !760)
!760 = !{!743, !475, !539}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !738, file: !739, line: 177, baseType: !762, size: 64, offset: 512)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DISubroutineType(types: !764)
!764 = !{null, !475, !743}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !738, file: !739, line: 178, baseType: !475, size: 64, offset: 576)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !738, file: !739, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !738, file: !739, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !738, file: !739, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !679, file: !661, line: 177, baseType: !483, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !679, file: !661, line: 178, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !343, line: 217, size: 832, elements: !773)
!773 = !{!774, !1019, !1020, !1021, !1077, !1081, !1082, !1083, !1101, !1102, !1103, !1104, !1105, !1106}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !772, file: !343, line: 219, baseType: !775, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !343, line: 151, baseType: !777)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !343, line: 151, size: 128, elements: !778)
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !777, file: !343, line: 151, baseType: !780, size: 128)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !343, line: 150, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !343, line: 150, size: 128, elements: !782)
!782 = !{!783, !784, !785}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !781, file: !343, line: 150, baseType: !7, size: 32)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !781, file: !343, line: 150, baseType: !7, size: 32, offset: 32)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !781, file: !343, line: 150, baseType: !786, size: 64, offset: 64)
!786 = !DICompositeType(tag: DW_TAG_array_type, baseType: !787, size: 64, elements: !582)
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !484, line: 108, baseType: !788)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !343, line: 122, size: 512, elements: !790)
!790 = !{!791, !792, !793, !1011, !1012, !1013, !1014, !1015, !1016, !1017}
!791 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !789, file: !343, line: 124, baseType: !771, size: 64)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !789, file: !343, line: 125, baseType: !771, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !789, file: !343, line: 131, baseType: !794, size: 64, offset: 128)
!794 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !343, line: 128, size: 64, elements: !795)
!795 = !{!796, !1010}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !794, file: !343, line: 129, baseType: !797, size: 64)
!797 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !484, line: 66, baseType: !798)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !391, line: 143, size: 192, elements: !800)
!800 = !{!801, !1008, !1009}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !799, file: !391, line: 145, baseType: !802, size: 64)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !484, line: 69, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !391, line: 136, size: 192, elements: !805)
!805 = !{!806, !1006, !1007}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !804, file: !391, line: 137, baseType: !807, size: 64)
!807 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !484, line: 58, baseType: !808)
!808 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !809, size: 64)
!809 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !391, line: 737, size: 768, elements: !810)
!810 = !{!811, !828, !861, !867, !872, !877, !884, !890, !896, !901, !915, !920, !926, !931, !941, !946, !964, !971, !978, !984, !989, !995, !1001}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !809, file: !391, line: 738, baseType: !812, size: 256)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !391, line: 271, size: 256, elements: !813)
!813 = !{!814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !812, file: !391, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !812, file: !391, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !812, file: !391, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !812, file: !391, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !812, file: !391, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !812, file: !391, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !812, file: !391, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !812, file: !391, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !812, file: !391, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !812, file: !391, line: 312, baseType: !7, size: 32, offset: 32)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !812, file: !391, line: 316, baseType: !608, size: 32, offset: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !812, file: !391, line: 319, baseType: !7, size: 32, offset: 96)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !812, file: !391, line: 323, baseType: !771, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !812, file: !391, line: 327, baseType: !483, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !809, file: !391, line: 739, baseType: !829, size: 448)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !391, line: 350, size: 448, elements: !830)
!830 = !{!831, !859}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !829, file: !391, line: 353, baseType: !832, size: 384)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !391, line: 333, size: 384, elements: !833)
!833 = !{!834, !835, !842}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !832, file: !391, line: 336, baseType: !812, size: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !832, file: !391, line: 343, baseType: !836, size: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !462, line: 37, size: 128, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !837, file: !462, line: 39, baseType: !836, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !837, file: !462, line: 40, baseType: !841, size: 64, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !483, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !832, file: !391, line: 344, baseType: !843, size: 64, offset: 320)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !844, size: 64)
!844 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !462, line: 45, size: 320, elements: !845)
!845 = !{!846, !847}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !844, file: !462, line: 47, baseType: !843, size: 64)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !844, file: !462, line: 48, baseType: !848, size: 256, offset: 64)
!848 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !849)
!849 = !{!850, !852, !853, !858}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !848, file: !135, line: 1884, baseType: !851, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !848, file: !135, line: 1885, baseType: !851, size: 64, offset: 64)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !848, file: !135, line: 1891, baseType: !854, size: 64, offset: 128)
!854 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !848, file: !135, line: 1891, size: 64, elements: !855)
!855 = !{!856, !857}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !854, file: !135, line: 1891, baseType: !807, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !854, file: !135, line: 1891, baseType: !483, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !848, file: !135, line: 1892, baseType: !841, size: 64, offset: 192)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !829, file: !391, line: 359, baseType: !860, size: 64, offset: 384)
!860 = !DICompositeType(tag: DW_TAG_array_type, baseType: !483, size: 64, elements: !582)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !809, file: !391, line: 740, baseType: !862, size: 512)
!862 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !391, line: 365, size: 512, elements: !863)
!863 = !{!864, !865, !866}
!864 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !862, file: !391, line: 368, baseType: !832, size: 384)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !862, file: !391, line: 373, baseType: !483, size: 64, offset: 384)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !862, file: !391, line: 374, baseType: !483, size: 64, offset: 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !809, file: !391, line: 741, baseType: !868, size: 576)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !391, line: 380, size: 576, elements: !869)
!869 = !{!870, !871}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !868, file: !391, line: 383, baseType: !862, size: 512)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !868, file: !391, line: 389, baseType: !860, size: 64, offset: 512)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !809, file: !391, line: 742, baseType: !873, size: 320)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !391, line: 395, size: 320, elements: !874)
!874 = !{!875, !876}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !873, file: !391, line: 397, baseType: !812, size: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !873, file: !391, line: 400, baseType: !797, size: 64, offset: 256)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !809, file: !391, line: 743, baseType: !878, size: 448)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !391, line: 406, size: 448, elements: !879)
!879 = !{!880, !881, !882, !883}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !878, file: !391, line: 408, baseType: !812, size: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !878, file: !391, line: 412, baseType: !483, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !878, file: !391, line: 420, baseType: !483, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !878, file: !391, line: 423, baseType: !797, size: 64, offset: 384)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !809, file: !391, line: 744, baseType: !885, size: 384)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !391, line: 429, size: 384, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !885, file: !391, line: 431, baseType: !812, size: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !885, file: !391, line: 434, baseType: !483, size: 64, offset: 256)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !885, file: !391, line: 437, baseType: !797, size: 64, offset: 320)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !809, file: !391, line: 745, baseType: !891, size: 384)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !391, line: 443, size: 384, elements: !892)
!892 = !{!893, !894, !895}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !891, file: !391, line: 445, baseType: !812, size: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !891, file: !391, line: 449, baseType: !483, size: 64, offset: 256)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !891, file: !391, line: 453, baseType: !797, size: 64, offset: 320)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !809, file: !391, line: 746, baseType: !897, size: 320)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !391, line: 459, size: 320, elements: !898)
!898 = !{!899, !900}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !897, file: !391, line: 461, baseType: !812, size: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !897, file: !391, line: 464, baseType: !483, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !809, file: !391, line: 747, baseType: !902, size: 768)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !391, line: 469, size: 768, elements: !903)
!903 = !{!904, !905, !906, !907, !908}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !902, file: !391, line: 471, baseType: !812, size: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !902, file: !391, line: 474, baseType: !7, size: 32, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !902, file: !391, line: 475, baseType: !7, size: 32, offset: 288)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !902, file: !391, line: 478, baseType: !483, size: 64, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !902, file: !391, line: 481, baseType: !909, size: 384, offset: 384)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !910, size: 384, elements: !582)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !910, file: !135, line: 1920, baseType: !848, size: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !910, file: !135, line: 1921, baseType: !483, size: 64, offset: 256)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !910, file: !135, line: 1922, baseType: !608, size: 32, offset: 320)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !809, file: !391, line: 748, baseType: !916, size: 320)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !391, line: 487, size: 320, elements: !917)
!917 = !{!918, !919}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !916, file: !391, line: 490, baseType: !812, size: 256)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !916, file: !391, line: 494, baseType: !471, size: 32, offset: 256)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !809, file: !391, line: 749, baseType: !921, size: 384)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !391, line: 500, size: 384, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !921, file: !391, line: 502, baseType: !812, size: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !921, file: !391, line: 506, baseType: !797, size: 64, offset: 256)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !921, file: !391, line: 510, baseType: !797, size: 64, offset: 320)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !809, file: !391, line: 750, baseType: !927, size: 320)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !391, line: 529, size: 320, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !927, file: !391, line: 531, baseType: !812, size: 256)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !927, file: !391, line: 540, baseType: !797, size: 64, offset: 256)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !809, file: !391, line: 751, baseType: !932, size: 704)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !391, line: 546, size: 704, elements: !933)
!933 = !{!934, !935, !936, !937, !938, !939, !940}
!934 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !932, file: !391, line: 549, baseType: !862, size: 512)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !932, file: !391, line: 553, baseType: !476, size: 64, offset: 512)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !932, file: !391, line: 557, baseType: !470, size: 8, offset: 576)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !932, file: !391, line: 558, baseType: !470, size: 8, offset: 584)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !932, file: !391, line: 559, baseType: !470, size: 8, offset: 592)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !932, file: !391, line: 560, baseType: !470, size: 8, offset: 600)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !932, file: !391, line: 566, baseType: !860, size: 64, offset: 640)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !809, file: !391, line: 752, baseType: !942, size: 384)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !391, line: 571, size: 384, elements: !943)
!943 = !{!944, !945}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !942, file: !391, line: 573, baseType: !873, size: 320)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !942, file: !391, line: 577, baseType: !483, size: 64, offset: 320)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !809, file: !391, line: 753, baseType: !947, size: 576)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !391, line: 600, size: 576, elements: !948)
!948 = !{!949, !950, !951, !954, !963}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !947, file: !391, line: 602, baseType: !873, size: 320)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !947, file: !391, line: 605, baseType: !483, size: 64, offset: 320)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !947, file: !391, line: 609, baseType: !952, size: 64, offset: 384)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !953, line: 46, baseType: !537)
!953 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!954 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !947, file: !391, line: 612, baseType: !955, size: 64, offset: 448)
!955 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !391, line: 581, size: 320, elements: !957)
!957 = !{!958, !959, !960, !961, !962}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !956, file: !391, line: 583, baseType: !134, size: 32)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !956, file: !391, line: 586, baseType: !483, size: 64, offset: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !956, file: !391, line: 589, baseType: !483, size: 64, offset: 128)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !956, file: !391, line: 592, baseType: !483, size: 64, offset: 192)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !956, file: !391, line: 595, baseType: !483, size: 64, offset: 256)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !947, file: !391, line: 616, baseType: !797, size: 64, offset: 512)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !809, file: !391, line: 754, baseType: !965, size: 512)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !391, line: 622, size: 512, elements: !966)
!966 = !{!967, !968, !969, !970}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !965, file: !391, line: 624, baseType: !873, size: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !965, file: !391, line: 628, baseType: !483, size: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !965, file: !391, line: 632, baseType: !483, size: 64, offset: 384)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !965, file: !391, line: 636, baseType: !483, size: 64, offset: 448)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !809, file: !391, line: 755, baseType: !972, size: 704)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !391, line: 642, size: 704, elements: !973)
!973 = !{!974, !975, !976, !977}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !972, file: !391, line: 644, baseType: !965, size: 512)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !972, file: !391, line: 648, baseType: !483, size: 64, offset: 512)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !972, file: !391, line: 652, baseType: !483, size: 64, offset: 576)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !972, file: !391, line: 653, baseType: !483, size: 64, offset: 640)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !809, file: !391, line: 756, baseType: !979, size: 448)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !391, line: 663, size: 448, elements: !980)
!980 = !{!981, !982, !983}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !979, file: !391, line: 665, baseType: !873, size: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !979, file: !391, line: 668, baseType: !483, size: 64, offset: 320)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !979, file: !391, line: 673, baseType: !483, size: 64, offset: 384)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !809, file: !391, line: 757, baseType: !985, size: 384)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !391, line: 694, size: 384, elements: !986)
!986 = !{!987, !988}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !985, file: !391, line: 696, baseType: !873, size: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !985, file: !391, line: 699, baseType: !483, size: 64, offset: 320)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !809, file: !391, line: 758, baseType: !990, size: 384)
!990 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !391, line: 681, size: 384, elements: !991)
!991 = !{!992, !993, !994}
!992 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !990, file: !391, line: 683, baseType: !812, size: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !990, file: !391, line: 686, baseType: !483, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !990, file: !391, line: 689, baseType: !483, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !809, file: !391, line: 759, baseType: !996, size: 384)
!996 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !391, line: 707, size: 384, elements: !997)
!997 = !{!998, !999, !1000}
!998 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !996, file: !391, line: 709, baseType: !812, size: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !996, file: !391, line: 712, baseType: !483, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !996, file: !391, line: 712, baseType: !483, size: 64, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !809, file: !391, line: 760, baseType: !1002, size: 320)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !391, line: 718, size: 320, elements: !1003)
!1003 = !{!1004, !1005}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1002, file: !391, line: 720, baseType: !812, size: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1002, file: !391, line: 723, baseType: !483, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !804, file: !391, line: 138, baseType: !803, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !804, file: !391, line: 139, baseType: !803, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !799, file: !391, line: 146, baseType: !802, size: 64, offset: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !799, file: !391, line: 152, baseType: !797, size: 64, offset: 128)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !794, file: !343, line: 130, baseType: !658, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !789, file: !343, line: 134, baseType: !475, size: 64, offset: 192)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !789, file: !343, line: 137, baseType: !483, size: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !789, file: !343, line: 138, baseType: !608, size: 32, offset: 320)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !789, file: !343, line: 142, baseType: !7, size: 32, offset: 352)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !789, file: !343, line: 144, baseType: !471, size: 32, offset: 384)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !789, file: !343, line: 145, baseType: !471, size: 32, offset: 416)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !789, file: !343, line: 146, baseType: !1018, size: 64, offset: 448)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !343, line: 119, baseType: !539)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !772, file: !343, line: 220, baseType: !775, size: 64, offset: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !772, file: !343, line: 223, baseType: !475, size: 64, offset: 128)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !772, file: !343, line: 226, baseType: !1022, size: 64, offset: 192)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 100, size: 1216, elements: !1024)
!1024 = !{!1025, !1026, !1027, !1028, !1029, !1034, !1035, !1036, !1050, !1051, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1067, !1075, !1076}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1023, file: !330, line: 102, baseType: !471, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1023, file: !330, line: 105, baseType: !7, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1023, file: !330, line: 108, baseType: !771, size: 64, offset: 64)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1023, file: !330, line: 111, baseType: !771, size: 64, offset: 128)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1023, file: !330, line: 114, baseType: !1030, size: 64, offset: 192)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !330, line: 41, size: 64, elements: !1031)
!1031 = !{!1032, !1033}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1030, file: !330, line: 42, baseType: !329, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1030, file: !330, line: 43, baseType: !7, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1023, file: !330, line: 117, baseType: !7, size: 32, offset: 256)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1023, file: !330, line: 120, baseType: !7, size: 32, offset: 288)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1023, file: !330, line: 123, baseType: !1037, size: 64, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1038, size: 64)
!1038 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !330, line: 87, baseType: !1039)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !330, line: 87, size: 128, elements: !1040)
!1040 = !{!1041}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1039, file: !330, line: 87, baseType: !1042, size: 128)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !330, line: 85, baseType: !1043)
!1043 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !330, line: 85, size: 128, elements: !1044)
!1044 = !{!1045, !1046, !1047}
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1043, file: !330, line: 85, baseType: !7, size: 32)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1043, file: !330, line: 85, baseType: !7, size: 32, offset: 32)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1043, file: !330, line: 85, baseType: !1048, size: 64, offset: 64)
!1048 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1049, size: 64, elements: !582)
!1049 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !330, line: 84, baseType: !1022)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1023, file: !330, line: 126, baseType: !1022, size: 64, offset: 384)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1023, file: !330, line: 129, baseType: !1022, size: 64, offset: 448)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1023, file: !330, line: 132, baseType: !475, size: 64, offset: 512)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1023, file: !330, line: 139, baseType: !483, size: 64, offset: 576)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1023, file: !330, line: 143, baseType: !532, size: 128, offset: 640)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1023, file: !330, line: 146, baseType: !532, size: 128, offset: 768)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1023, file: !330, line: 148, baseType: !470, size: 8, offset: 896)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1023, file: !330, line: 149, baseType: !470, size: 8, offset: 904)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1023, file: !330, line: 153, baseType: !338, size: 32, offset: 928)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1023, file: !330, line: 156, baseType: !1060, size: 64, offset: 960)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !330, line: 48, size: 320, elements: !1062)
!1062 = !{!1063, !1064, !1065, !1066}
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1061, file: !330, line: 50, baseType: !807, size: 64)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1061, file: !330, line: 59, baseType: !532, size: 128, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1061, file: !330, line: 64, baseType: !470, size: 8, offset: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1061, file: !330, line: 67, baseType: !1060, size: 64, offset: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1023, file: !330, line: 159, baseType: !1068, size: 64, offset: 1024)
!1068 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1069, size: 64)
!1069 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !330, line: 72, size: 256, elements: !1070)
!1070 = !{!1071, !1072, !1073, !1074}
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1069, file: !330, line: 74, baseType: !788, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1069, file: !330, line: 77, baseType: !1068, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1069, file: !330, line: 78, baseType: !1068, size: 64, offset: 128)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1069, file: !330, line: 81, baseType: !1068, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1023, file: !330, line: 162, baseType: !470, size: 8, offset: 1088)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1023, file: !330, line: 166, baseType: !483, size: 64, offset: 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !772, file: !343, line: 229, baseType: !1078, size: 128, offset: 256)
!1078 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1079, size: 128, elements: !726)
!1079 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1080, size: 64)
!1080 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !343, line: 229, flags: DIFlagFwdDecl)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !772, file: !343, line: 232, baseType: !771, size: 64, offset: 384)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !772, file: !343, line: 233, baseType: !771, size: 64, offset: 448)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !772, file: !343, line: 238, baseType: !1084, size: 64, offset: 512)
!1084 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !343, line: 235, size: 64, elements: !1085)
!1085 = !{!1086, !1092}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1084, file: !343, line: 236, baseType: !1087, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1088, size: 64)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !343, line: 273, size: 128, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1088, file: !343, line: 275, baseType: !797, size: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1088, file: !343, line: 278, baseType: !797, size: 64, offset: 64)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1084, file: !343, line: 237, baseType: !1093, size: 64)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !343, line: 259, size: 320, elements: !1095)
!1095 = !{!1096, !1097, !1098, !1099, !1100}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1094, file: !343, line: 261, baseType: !658, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1094, file: !343, line: 262, baseType: !658, size: 64, offset: 64)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1094, file: !343, line: 266, baseType: !658, size: 64, offset: 128)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1094, file: !343, line: 267, baseType: !658, size: 64, offset: 192)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1094, file: !343, line: 270, baseType: !471, size: 32, offset: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !772, file: !343, line: 241, baseType: !1018, size: 64, offset: 576)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !772, file: !343, line: 244, baseType: !471, size: 32, offset: 640)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !772, file: !343, line: 247, baseType: !471, size: 32, offset: 672)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !772, file: !343, line: 250, baseType: !471, size: 32, offset: 704)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !772, file: !343, line: 253, baseType: !471, size: 32, offset: 736)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !772, file: !343, line: 256, baseType: !471, size: 32, offset: 768)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !679, file: !661, line: 179, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !661, line: 150, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !661, line: 142, size: 320, elements: !1111)
!1111 = !{!1112, !1113, !1114, !1115, !1118, !1119}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1110, file: !661, line: 144, baseType: !483, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1110, file: !661, line: 145, baseType: !658, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1110, file: !661, line: 146, baseType: !658, size: 64, offset: 128)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1110, file: !661, line: 147, baseType: !1116, size: 32, offset: 192)
!1116 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1117, line: 31, baseType: !471)
!1117 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1110, file: !661, line: 148, baseType: !7, size: 32, offset: 224)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1110, file: !661, line: 149, baseType: !470, size: 8, offset: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !679, file: !661, line: 180, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !661, line: 162, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !661, line: 159, size: 128, elements: !1124)
!1124 = !{!1125, !1126}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1123, file: !661, line: 160, baseType: !483, size: 64)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1123, file: !661, line: 161, baseType: !539, size: 64, offset: 64)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !679, file: !661, line: 181, baseType: !1128, size: 64)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !661, line: 181, flags: DIFlagFwdDecl)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !674, file: !661, line: 317, baseType: !1131, size: 64)
!1131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !539, size: 64, elements: !582)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !674, file: !661, line: 318, baseType: !1133, size: 320)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !661, line: 188, size: 320, elements: !1134)
!1134 = !{!1135, !1137, !1160}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1133, file: !661, line: 190, baseType: !1136, size: 192)
!1136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !678, size: 192, elements: !557)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1133, file: !661, line: 193, baseType: !1138, size: 64, offset: 192)
!1138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1139, size: 64)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !661, line: 206, size: 320, elements: !1140)
!1140 = !{!1141, !1145, !1146, !1147, !1159}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1139, file: !661, line: 208, baseType: !1142, size: 64)
!1142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1143, size: 64)
!1143 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !484, line: 62, baseType: !1144)
!1144 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !484, line: 61, flags: DIFlagFwdDecl)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1139, file: !661, line: 211, baseType: !7, size: 32, offset: 64)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1139, file: !661, line: 214, baseType: !539, size: 64, offset: 128)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1139, file: !661, line: 224, baseType: !1148, size: 64, offset: 192)
!1148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1149, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !661, line: 202, baseType: !1150)
!1150 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !661, line: 202, size: 128, elements: !1151)
!1151 = !{!1152}
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1150, file: !661, line: 202, baseType: !1153, size: 128)
!1153 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !661, line: 200, baseType: !1154)
!1154 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !661, line: 200, size: 128, elements: !1155)
!1155 = !{!1156, !1157, !1158}
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1154, file: !661, line: 200, baseType: !7, size: 32)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1154, file: !661, line: 200, baseType: !7, size: 32, offset: 32)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1154, file: !661, line: 200, baseType: !692, size: 64, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1139, file: !661, line: 234, baseType: !1148, size: 64, offset: 256)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1133, file: !661, line: 197, baseType: !539, size: 64, offset: 256)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !674, file: !661, line: 319, baseType: !546, size: 256)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !674, file: !661, line: 320, baseType: !565, size: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !486, file: !135, line: 3384, baseType: !1164, size: 1472)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1165)
!1165 = !{!1166, !1187, !1188, !1189, !1190}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1164, file: !135, line: 3115, baseType: !1167, size: 1216)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1172, !1173, !1174, !1175, !1176, !1177, !1178, !1179, !1180, !1181, !1182, !1183, !1184, !1185, !1186}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !135, line: 2985, baseType: !654, size: 960)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1167, file: !135, line: 2986, baseType: !483, size: 64, offset: 960)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1167, file: !135, line: 2987, baseType: !483, size: 64, offset: 1024)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1167, file: !135, line: 2988, baseType: !483, size: 64, offset: 1088)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1167, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1167, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1167, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1167, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1167, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1167, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1167, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1167, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1167, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1167, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1167, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1167, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1167, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1167, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1164, file: !135, line: 3117, baseType: !483, size: 64, offset: 1216)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1164, file: !135, line: 3119, baseType: !483, size: 64, offset: 1280)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1164, file: !135, line: 3121, baseType: !483, size: 64, offset: 1344)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1164, file: !135, line: 3123, baseType: !483, size: 64, offset: 1408)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !486, file: !135, line: 3385, baseType: !1192, size: 1088)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1193)
!1193 = !{!1194, !1195, !1196}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1192, file: !135, line: 2875, baseType: !654, size: 960)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1192, file: !135, line: 2876, baseType: !658, size: 64, offset: 960)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1192, file: !135, line: 2877, baseType: !1197, size: 64, offset: 1024)
!1197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1198, size: 64)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1199, line: 172, size: 128, elements: !1200)
!1199 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1200 = !{!1201, !1202, !1203, !1204, !1205, !1206, !1207}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1198, file: !1199, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1198, file: !1199, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1198, file: !1199, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1198, file: !1199, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1198, file: !1199, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1198, file: !1199, line: 195, baseType: !7, size: 32, offset: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1198, file: !1199, line: 199, baseType: !483, size: 64, offset: 64)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !486, file: !135, line: 3386, baseType: !1167, size: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !486, file: !135, line: 3387, baseType: !1210, size: 1280)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1211)
!1211 = !{!1212, !1213}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1210, file: !135, line: 3094, baseType: !1167, size: 1216)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1210, file: !135, line: 3095, baseType: !1197, size: 64, offset: 1216)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !486, file: !135, line: 3388, baseType: !1215, size: 1216)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1216)
!1216 = !{!1217, !1218, !1219, !1220, !1221, !1222}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1215, file: !135, line: 2825, baseType: !616, size: 896)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1215, file: !135, line: 2827, baseType: !483, size: 64, offset: 896)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1215, file: !135, line: 2828, baseType: !483, size: 64, offset: 960)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1215, file: !135, line: 2829, baseType: !483, size: 64, offset: 1024)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1215, file: !135, line: 2830, baseType: !483, size: 64, offset: 1088)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1215, file: !135, line: 2831, baseType: !483, size: 64, offset: 1152)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !486, file: !135, line: 3389, baseType: !1224, size: 1024)
!1224 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1225)
!1225 = !{!1226, !1227, !1228}
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1224, file: !135, line: 2851, baseType: !654, size: 960)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1224, file: !135, line: 2852, baseType: !471, size: 32, offset: 960)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1224, file: !135, line: 2853, baseType: !471, size: 32, offset: 992)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !486, file: !135, line: 3390, baseType: !1230, size: 1024)
!1230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1231)
!1231 = !{!1232, !1233}
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1230, file: !135, line: 2858, baseType: !654, size: 960)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1230, file: !135, line: 2859, baseType: !1197, size: 64, offset: 960)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !486, file: !135, line: 3391, baseType: !1235, size: 960)
!1235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1236)
!1236 = !{!1237}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1235, file: !135, line: 2863, baseType: !654, size: 960)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !486, file: !135, line: 3392, baseType: !1239, size: 1472)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1240)
!1240 = !{!1241}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1239, file: !135, line: 3305, baseType: !1164, size: 1472)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !486, file: !135, line: 3393, baseType: !1243, size: 1792)
!1243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1244)
!1244 = !{!1245, !1246, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485}
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1243, file: !135, line: 3249, baseType: !1164, size: 1472)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1243, file: !135, line: 3251, baseType: !1247, size: 64, offset: 1472)
!1247 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1248, size: 64)
!1248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1249, line: 463, size: 1152, elements: !1250)
!1249 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1250 = !{!1251, !1254, !1285, !1286, !1401, !1409, !1410, !1411, !1412, !1413, !1414, !1438, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464}
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1248, file: !1249, line: 464, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1249, line: 464, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1248, file: !1249, line: 467, baseType: !1255, size: 64, offset: 64)
!1255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1256, size: 64)
!1256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !343, line: 374, size: 640, elements: !1257)
!1257 = !{!1258, !1260, !1261, !1274, !1275, !1276, !1277, !1278, !1279, !1281, !1283, !1284}
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1256, file: !343, line: 377, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !484, line: 111, baseType: !771)
