; ModuleID = 'tree-ssa-loop-ch.bc'
source_filename = "tree-ssa-loop-ch.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!597 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!611 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!612 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !574, line: 80, baseType: !7, size: 32, elements: !613)
!613 = !{!614, !615, !616, !617}
!614 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!618 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !574, line: 727, baseType: !7, size: 32, elements: !619)
!619 = !{!620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!620 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!643 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!644 = !{!645, !646, !647, !648, !651, !652, !654, !2040, !1370, !7, !366, !612, !694, !2053, !718, !1334, !649}
!645 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !646, size: 64)
!646 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!647 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !650)
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !656, line: 111, baseType: !657)
!656 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !318, line: 217, size: 832, elements: !659)
!659 = !{!660, !2007, !2008, !2009, !2010, !2014, !2015, !2016, !2034, !2035, !2036, !2037, !2038, !2039}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !658, file: !318, line: 219, baseType: !661, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !318, line: 151, baseType: !663)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !318, line: 151, size: 128, elements: !664)
!664 = !{!665}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !663, file: !318, line: 151, baseType: !666, size: 128)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !318, line: 150, baseType: !667)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !318, line: 150, size: 128, elements: !668)
!668 = !{!669, !670, !671}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !667, file: !318, line: 150, baseType: !7, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !667, file: !318, line: 150, baseType: !7, size: 32, offset: 32)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !667, file: !318, line: 150, baseType: !672, size: 64, offset: 64)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !673, size: 64, elements: !816)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !656, line: 108, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !318, line: 122, size: 512, elements: !676)
!676 = !{!677, !678, !679, !1999, !2000, !2001, !2002, !2003, !2004, !2005}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !675, file: !318, line: 124, baseType: !657, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !675, file: !318, line: 125, baseType: !657, size: 64, offset: 64)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !675, file: !318, line: 131, baseType: !680, size: 64, offset: 128)
!680 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !318, line: 128, size: 64, elements: !681)
!681 = !{!682, !1998}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !680, file: !318, line: 129, baseType: !683, size: 64)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !656, line: 66, baseType: !684)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !574, line: 143, size: 192, elements: !686)
!686 = !{!687, !1996, !1997}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !685, file: !574, line: 145, baseType: !688, size: 64)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !656, line: 69, baseType: !689)
!689 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !690, size: 64)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !574, line: 136, size: 192, elements: !691)
!691 = !{!692, !1994, !1995}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !690, file: !574, line: 137, baseType: !693, size: 64)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !656, line: 58, baseType: !694)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !574, line: 737, size: 768, elements: !696)
!696 = !{!697, !1841, !1851, !1857, !1862, !1867, !1874, !1880, !1886, !1891, !1905, !1910, !1916, !1921, !1931, !1936, !1952, !1959, !1966, !1972, !1977, !1983, !1989}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !695, file: !574, line: 738, baseType: !698, size: 256)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !574, line: 271, size: 256, elements: !699)
!699 = !{!700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !715, !716, !717}
!700 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !698, file: !574, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !698, file: !574, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !698, file: !574, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !698, file: !574, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !698, file: !574, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !698, file: !574, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !698, file: !574, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !698, file: !574, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !698, file: !574, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !698, file: !574, line: 312, baseType: !7, size: 32, offset: 32)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !698, file: !574, line: 316, baseType: !711, size: 32, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !712, line: 58, baseType: !713)
!712 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!713 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !714, line: 44, baseType: !7)
!714 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!715 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !698, file: !574, line: 319, baseType: !7, size: 32, offset: 96)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !698, file: !574, line: 323, baseType: !657, size: 64, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !698, file: !574, line: 327, baseType: !718, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !656, line: 56, baseType: !719)
!719 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !720, size: 64)
!720 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !334, line: 3371, size: 1792, elements: !721)
!721 = !{!722, !755, !761, !774, !793, !804, !809, !818, !824, !837, !845, !883, !1091, !1119, !1136, !1137, !1142, !1151, !1157, !1162, !1166, !1170, !1492, !1539, !1545, !1551, !1558, !1571, !1585, !1602, !1614, !1636, !1651, !1823}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !720, file: !334, line: 3372, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !334, line: 360, size: 64, elements: !724)
!724 = !{!725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !723, file: !334, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !723, file: !334, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !723, file: !334, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !723, file: !334, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !723, file: !334, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !723, file: !334, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !723, file: !334, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !723, file: !334, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !723, file: !334, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !723, file: !334, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !723, file: !334, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !723, file: !334, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !723, file: !334, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !723, file: !334, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !723, file: !334, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !723, file: !334, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !723, file: !334, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !723, file: !334, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !723, file: !334, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !723, file: !334, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !723, file: !334, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !723, file: !334, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !723, file: !334, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !723, file: !334, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !723, file: !334, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !723, file: !334, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !723, file: !334, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !723, file: !334, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !723, file: !334, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !723, file: !334, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !720, file: !334, line: 3373, baseType: !756, size: 192)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !334, line: 402, size: 192, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !756, file: !334, line: 403, baseType: !723, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !756, file: !334, line: 404, baseType: !718, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !334, line: 405, baseType: !718, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !720, file: !334, line: 3374, baseType: !762, size: 320)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !334, line: 1384, size: 320, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !334, line: 1385, baseType: !756, size: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !762, file: !334, line: 1386, baseType: !766, size: 128, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !767, line: 58, baseType: !768)
!767 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !767, line: 54, size: 128, elements: !769)
!769 = !{!770, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !768, file: !767, line: 56, baseType: !771, size: 64)
!771 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !768, file: !767, line: 57, baseType: !773, size: 64, offset: 64)
!773 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !720, file: !334, line: 3375, baseType: !775, size: 256)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !334, line: 1397, size: 256, elements: !776)
!776 = !{!777, !778}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !775, file: !334, line: 1398, baseType: !756, size: 192)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !775, file: !334, line: 1399, baseType: !779, size: 64, offset: 192)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !781, line: 52, size: 256, elements: !782)
!781 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = !{!783, !784, !785, !786, !787, !788, !789}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !780, file: !781, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !780, file: !781, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !780, file: !781, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !780, file: !781, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !780, file: !781, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !780, file: !781, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !780, file: !781, line: 62, baseType: !790, size: 192, offset: 64)
!790 = !DICompositeType(tag: DW_TAG_array_type, baseType: !771, size: 192, elements: !791)
!791 = !{!792}
!792 = !DISubrange(count: 3)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !720, file: !334, line: 3376, baseType: !794, size: 256)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !334, line: 1408, size: 256, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !794, file: !334, line: 1409, baseType: !756, size: 192)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !794, file: !334, line: 1410, baseType: !798, size: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !800, line: 27, size: 192, elements: !801)
!800 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!801 = !{!802, !803}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !799, file: !800, line: 29, baseType: !766, size: 128)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !799, file: !800, line: 30, baseType: !189, size: 32, offset: 128)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !720, file: !334, line: 3377, baseType: !805, size: 256)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !334, line: 1437, size: 256, elements: !806)
!806 = !{!807, !808}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !805, file: !334, line: 1438, baseType: !756, size: 192)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !805, file: !334, line: 1439, baseType: !718, size: 64, offset: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !720, file: !334, line: 3378, baseType: !810, size: 256)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !334, line: 1418, size: 256, elements: !811)
!811 = !{!812, !813, !814}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !810, file: !334, line: 1419, baseType: !756, size: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !810, file: !334, line: 1420, baseType: !647, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !810, file: !334, line: 1421, baseType: !815, size: 8, offset: 224)
!815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 8, elements: !816)
!816 = !{!817}
!817 = !DISubrange(count: 1)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !720, file: !334, line: 3379, baseType: !819, size: 320)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !334, line: 1428, size: 320, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !334, line: 1429, baseType: !756, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !819, file: !334, line: 1430, baseType: !718, size: 64, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !819, file: !334, line: 1431, baseType: !718, size: 64, offset: 256)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !720, file: !334, line: 3380, baseType: !825, size: 320)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !334, line: 1460, size: 320, elements: !826)
!826 = !{!827, !828}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !334, line: 1461, baseType: !756, size: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !825, file: !334, line: 1462, baseType: !829, size: 128, offset: 192)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !830, line: 31, size: 128, elements: !831)
!830 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!831 = !{!832, !835, !836}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !829, file: !830, line: 32, baseType: !833, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !834, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !646)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !829, file: !830, line: 33, baseType: !7, size: 32, offset: 64)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !829, file: !830, line: 34, baseType: !7, size: 32, offset: 96)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !720, file: !334, line: 3381, baseType: !838, size: 384)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !334, line: 2507, size: 384, elements: !839)
!839 = !{!840, !841, !842, !843, !844}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !838, file: !334, line: 2508, baseType: !756, size: 192)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !838, file: !334, line: 2509, baseType: !711, size: 32, offset: 192)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !838, file: !334, line: 2510, baseType: !7, size: 32, offset: 224)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !838, file: !334, line: 2511, baseType: !718, size: 64, offset: 256)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !838, file: !334, line: 2512, baseType: !718, size: 64, offset: 320)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !720, file: !334, line: 3382, baseType: !846, size: 896)
!846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !334, line: 2652, size: 896, elements: !847)
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !846, file: !334, line: 2653, baseType: !838, size: 384)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !846, file: !334, line: 2654, baseType: !718, size: 64, offset: 384)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !846, file: !334, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !846, file: !334, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !846, file: !334, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !846, file: !334, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !846, file: !334, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !846, file: !334, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !846, file: !334, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !846, file: !334, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !846, file: !334, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !846, file: !334, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !846, file: !334, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !846, file: !334, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !846, file: !334, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !846, file: !334, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !846, file: !334, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !846, file: !334, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !846, file: !334, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !846, file: !334, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !846, file: !334, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !846, file: !334, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !846, file: !334, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !846, file: !334, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !846, file: !334, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !846, file: !334, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !846, file: !334, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !846, file: !334, line: 2703, baseType: !7, size: 32, offset: 512)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !846, file: !334, line: 2705, baseType: !718, size: 64, offset: 576)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !846, file: !334, line: 2706, baseType: !718, size: 64, offset: 640)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !846, file: !334, line: 2707, baseType: !718, size: 64, offset: 704)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !846, file: !334, line: 2708, baseType: !718, size: 64, offset: 768)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !846, file: !334, line: 2711, baseType: !881, size: 64, offset: 832)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !334, line: 2711, flags: DIFlagFwdDecl)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !720, file: !334, line: 3383, baseType: !884, size: 960)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !334, line: 2756, size: 960, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !884, file: !334, line: 2757, baseType: !846, size: 896)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !884, file: !334, line: 2758, baseType: !888, size: 64, offset: 896)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !656, line: 50, baseType: !889)
!889 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !890, size: 64)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !891, line: 240, size: 384, elements: !892)
!891 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!892 = !{!893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !890, file: !891, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !890, file: !891, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !890, file: !891, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !890, file: !891, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !890, file: !891, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !890, file: !891, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !890, file: !891, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !890, file: !891, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !890, file: !891, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !890, file: !891, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !890, file: !891, line: 321, baseType: !904, size: 320, offset: 64)
!904 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !891, line: 315, size: 320, elements: !905)
!905 = !{!906, !1024, !1026, !1089, !1090}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !904, file: !891, line: 316, baseType: !907, size: 64)
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 64, elements: !816)
!908 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !891, line: 183, baseType: !909)
!909 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !891, line: 166, size: 64, elements: !910)
!910 = !{!911, !912, !913, !914, !915, !923, !924, !936, !939, !999, !1000, !1001, !1014, !1021}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !909, file: !891, line: 168, baseType: !647, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !909, file: !891, line: 169, baseType: !7, size: 32)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !909, file: !891, line: 170, baseType: !652, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !909, file: !891, line: 171, baseType: !888, size: 64)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !909, file: !891, line: 172, baseType: !916, size: 64)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !656, line: 53, baseType: !917)
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !891, line: 359, size: 128, elements: !919)
!919 = !{!920, !921}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !918, file: !891, line: 360, baseType: !647, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !918, file: !891, line: 361, baseType: !922, size: 64, offset: 64)
!922 = !DICompositeType(tag: DW_TAG_array_type, baseType: !888, size: 64, elements: !816)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !909, file: !891, line: 173, baseType: !189, size: 32)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !909, file: !891, line: 174, baseType: !925, size: 32)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !891, line: 133, baseType: !926)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !891, line: 115, size: 32, elements: !927)
!927 = !{!928, !929, !930, !931, !932, !933, !934, !935}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !926, file: !891, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !926, file: !891, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !926, file: !891, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !926, file: !891, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !926, file: !891, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !926, file: !891, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !926, file: !891, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !926, file: !891, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !909, file: !891, line: 175, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!938 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !891, line: 175, flags: DIFlagFwdDecl)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !909, file: !891, line: 176, baseType: !940, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !941, size: 64)
!941 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !942, line: 75, size: 256, elements: !943)
!942 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!943 = !{!944, !958, !959, !960}
!944 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !941, file: !942, line: 76, baseType: !945, size: 64)
!945 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !942, line: 68, baseType: !947)
!947 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !942, line: 63, size: 320, elements: !948)
!948 = !{!949, !951, !952, !953}
!949 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !947, file: !942, line: 64, baseType: !950, size: 64)
!950 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !947, file: !942, line: 65, baseType: !950, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !947, file: !942, line: 66, baseType: !7, size: 32, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !947, file: !942, line: 67, baseType: !954, size: 128, offset: 192)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !955, size: 128, elements: !956)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !942, line: 29, baseType: !771)
!956 = !{!957}
!957 = !DISubrange(count: 2)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !941, file: !942, line: 77, baseType: !945, size: 64, offset: 64)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !941, file: !942, line: 78, baseType: !7, size: 32, offset: 128)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !941, file: !942, line: 79, baseType: !961, size: 64, offset: 192)
!961 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !962, size: 64)
!962 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !942, line: 49, baseType: !963)
!963 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !942, line: 45, size: 832, elements: !964)
!964 = !{!965, !966, !967}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !963, file: !942, line: 46, baseType: !950, size: 64)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !963, file: !942, line: 47, baseType: !940, size: 64, offset: 64)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !963, file: !942, line: 48, baseType: !968, size: 704, offset: 128)
!968 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !969, line: 164, size: 704, elements: !970)
!969 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!970 = !{!971, !972, !982, !983, !984, !985, !986, !987, !991, !995, !996, !997, !998}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !968, file: !969, line: 166, baseType: !773, size: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !968, file: !969, line: 167, baseType: !973, size: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !974, size: 64)
!974 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !969, line: 157, size: 192, elements: !975)
!975 = !{!976, !977, !978}
!976 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !974, file: !969, line: 159, baseType: !649, size: 64)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !974, file: !969, line: 160, baseType: !973, size: 64, offset: 64)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !974, file: !969, line: 161, baseType: !979, size: 32, offset: 128)
!979 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 32, elements: !980)
!980 = !{!981}
!981 = !DISubrange(count: 4)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !968, file: !969, line: 168, baseType: !649, size: 64, offset: 128)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !968, file: !969, line: 169, baseType: !649, size: 64, offset: 192)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !968, file: !969, line: 170, baseType: !649, size: 64, offset: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !968, file: !969, line: 171, baseType: !773, size: 64, offset: 320)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !968, file: !969, line: 172, baseType: !647, size: 32, offset: 384)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !968, file: !969, line: 176, baseType: !988, size: 64, offset: 448)
!988 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !989, size: 64)
!989 = !DISubroutineType(types: !990)
!990 = !{!973, !651, !773}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !968, file: !969, line: 177, baseType: !992, size: 64, offset: 512)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = !DISubroutineType(types: !994)
!994 = !{null, !651, !973}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !968, file: !969, line: 178, baseType: !651, size: 64, offset: 576)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !968, file: !969, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !968, file: !969, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !968, file: !969, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !909, file: !891, line: 177, baseType: !718, size: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !909, file: !891, line: 178, baseType: !657, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !909, file: !891, line: 179, baseType: !1002, size: 64)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !891, line: 150, baseType: !1004)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !891, line: 142, size: 320, elements: !1005)
!1005 = !{!1006, !1007, !1008, !1009, !1012, !1013}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1004, file: !891, line: 144, baseType: !718, size: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1004, file: !891, line: 145, baseType: !888, size: 64, offset: 64)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1004, file: !891, line: 146, baseType: !888, size: 64, offset: 128)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1004, file: !891, line: 147, baseType: !1010, size: 32, offset: 192)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1011, line: 31, baseType: !647)
!1011 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1004, file: !891, line: 148, baseType: !7, size: 32, offset: 224)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1004, file: !891, line: 149, baseType: !646, size: 8, offset: 256)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !909, file: !891, line: 180, baseType: !1015, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !891, line: 162, baseType: !1017)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !891, line: 159, size: 128, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1017, file: !891, line: 160, baseType: !718, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1017, file: !891, line: 161, baseType: !773, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !909, file: !891, line: 181, baseType: !1022, size: 64)
!1022 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1023, size: 64)
!1023 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !891, line: 181, flags: DIFlagFwdDecl)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !904, file: !891, line: 317, baseType: !1025, size: 64)
!1025 = !DICompositeType(tag: DW_TAG_array_type, baseType: !773, size: 64, elements: !816)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !904, file: !891, line: 318, baseType: !1027, size: 320)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !891, line: 188, size: 320, elements: !1028)
!1028 = !{!1029, !1031, !1088}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1027, file: !891, line: 190, baseType: !1030, size: 192)
!1030 = !DICompositeType(tag: DW_TAG_array_type, baseType: !908, size: 192, elements: !791)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1027, file: !891, line: 193, baseType: !1032, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !891, line: 206, size: 320, elements: !1034)
!1034 = !{!1035, !1073, !1074, !1075, !1087}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1033, file: !891, line: 208, baseType: !1036, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1037, size: 64)
!1037 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !656, line: 62, baseType: !1038)
!1038 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1039, line: 538, size: 256, elements: !1040)
!1039 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1040 = !{!1041, !1045, !1051, !1064}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1038, file: !1039, line: 539, baseType: !1042, size: 32)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1039, line: 482, size: 32, elements: !1043)
!1043 = !{!1044}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1042, file: !1039, line: 484, baseType: !7, size: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1038, file: !1039, line: 540, baseType: !1046, size: 192)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1039, line: 488, size: 192, elements: !1047)
!1047 = !{!1048, !1049, !1050}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1046, file: !1039, line: 489, baseType: !1042, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1046, file: !1039, line: 492, baseType: !652, size: 64, offset: 64)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1046, file: !1039, line: 496, baseType: !718, size: 64, offset: 128)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1038, file: !1039, line: 541, baseType: !1052, size: 256)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1039, line: 504, size: 256, elements: !1053)
!1053 = !{!1054, !1055, !1062, !1063}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1052, file: !1039, line: 505, baseType: !1042, size: 32)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1052, file: !1039, line: 509, baseType: !1056, size: 64, offset: 64)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1039, line: 501, baseType: !1057)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = !DISubroutineType(types: !1059)
!1059 = !{null, !1060}
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1052, file: !1039, line: 510, baseType: !1060, size: 64, offset: 128)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1052, file: !1039, line: 513, baseType: !1036, size: 64, offset: 192)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1038, file: !1039, line: 542, baseType: !1065, size: 128)
!1065 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1039, line: 530, size: 128, elements: !1066)
!1066 = !{!1067, !1068}
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1065, file: !1039, line: 531, baseType: !1042, size: 32)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1065, file: !1039, line: 534, baseType: !1069, size: 64, offset: 64)
!1069 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1039, line: 525, baseType: !1070)
!1070 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1071, size: 64)
!1071 = !DISubroutineType(types: !1072)
!1072 = !{!646, !718, !652, !771, !771}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1033, file: !891, line: 211, baseType: !7, size: 32, offset: 64)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1033, file: !891, line: 214, baseType: !773, size: 64, offset: 128)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1033, file: !891, line: 224, baseType: !1076, size: 64, offset: 192)
!1076 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1077, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !891, line: 202, baseType: !1078)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !891, line: 202, size: 128, elements: !1079)
!1079 = !{!1080}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1078, file: !891, line: 202, baseType: !1081, size: 128)
!1081 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !891, line: 200, baseType: !1082)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !891, line: 200, size: 128, elements: !1083)
!1083 = !{!1084, !1085, !1086}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1082, file: !891, line: 200, baseType: !7, size: 32)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1082, file: !891, line: 200, baseType: !7, size: 32, offset: 32)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1082, file: !891, line: 200, baseType: !922, size: 64, offset: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1033, file: !891, line: 234, baseType: !1076, size: 64, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1027, file: !891, line: 197, baseType: !773, size: 64, offset: 256)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !904, file: !891, line: 319, baseType: !780, size: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !904, file: !891, line: 320, baseType: !799, size: 192)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !720, file: !334, line: 3384, baseType: !1092, size: 1472)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !334, line: 3114, size: 1472, elements: !1093)
!1093 = !{!1094, !1115, !1116, !1117, !1118}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1092, file: !334, line: 3115, baseType: !1095, size: 1216)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !334, line: 2984, size: 1216, elements: !1096)
!1096 = !{!1097, !1098, !1099, !1100, !1101, !1102, !1103, !1104, !1105, !1106, !1107, !1108, !1109, !1110, !1111, !1112, !1113, !1114}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !334, line: 2985, baseType: !884, size: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1095, file: !334, line: 2986, baseType: !718, size: 64, offset: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1095, file: !334, line: 2987, baseType: !718, size: 64, offset: 1024)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1095, file: !334, line: 2988, baseType: !718, size: 64, offset: 1088)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1095, file: !334, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1095, file: !334, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1095, file: !334, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1095, file: !334, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1095, file: !334, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1095, file: !334, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1095, file: !334, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1095, file: !334, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1095, file: !334, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1095, file: !334, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1095, file: !334, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1095, file: !334, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1095, file: !334, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1095, file: !334, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1092, file: !334, line: 3117, baseType: !718, size: 64, offset: 1216)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1092, file: !334, line: 3119, baseType: !718, size: 64, offset: 1280)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1092, file: !334, line: 3121, baseType: !718, size: 64, offset: 1344)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1092, file: !334, line: 3123, baseType: !718, size: 64, offset: 1408)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !720, file: !334, line: 3385, baseType: !1120, size: 1088)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !334, line: 2874, size: 1088, elements: !1121)
!1121 = !{!1122, !1123, !1124}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1120, file: !334, line: 2875, baseType: !884, size: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1120, file: !334, line: 2876, baseType: !888, size: 64, offset: 960)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1120, file: !334, line: 2877, baseType: !1125, size: 64, offset: 1024)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1127, line: 172, size: 128, elements: !1128)
!1127 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1128 = !{!1129, !1130, !1131, !1132, !1133, !1134, !1135}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1126, file: !1127, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1126, file: !1127, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1126, file: !1127, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1126, file: !1127, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1126, file: !1127, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1126, file: !1127, line: 195, baseType: !7, size: 32, offset: 32)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1126, file: !1127, line: 199, baseType: !718, size: 64, offset: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !720, file: !334, line: 3386, baseType: !1095, size: 1216)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !720, file: !334, line: 3387, baseType: !1138, size: 1280)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !334, line: 3093, size: 1280, elements: !1139)
!1139 = !{!1140, !1141}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !334, line: 3094, baseType: !1095, size: 1216)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1138, file: !334, line: 3095, baseType: !1125, size: 64, offset: 1216)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !720, file: !334, line: 3388, baseType: !1143, size: 1216)
!1143 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !334, line: 2824, size: 1216, elements: !1144)
!1144 = !{!1145, !1146, !1147, !1148, !1149, !1150}
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1143, file: !334, line: 2825, baseType: !846, size: 896)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1143, file: !334, line: 2827, baseType: !718, size: 64, offset: 896)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1143, file: !334, line: 2828, baseType: !718, size: 64, offset: 960)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1143, file: !334, line: 2829, baseType: !718, size: 64, offset: 1024)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1143, file: !334, line: 2830, baseType: !718, size: 64, offset: 1088)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1143, file: !334, line: 2831, baseType: !718, size: 64, offset: 1152)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !720, file: !334, line: 3389, baseType: !1152, size: 1024)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !334, line: 2850, size: 1024, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1152, file: !334, line: 2851, baseType: !884, size: 960)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1152, file: !334, line: 2852, baseType: !647, size: 32, offset: 960)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1152, file: !334, line: 2853, baseType: !647, size: 32, offset: 992)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !720, file: !334, line: 3390, baseType: !1158, size: 1024)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !334, line: 2857, size: 1024, elements: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1158, file: !334, line: 2858, baseType: !884, size: 960)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1158, file: !334, line: 2859, baseType: !1125, size: 64, offset: 960)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !720, file: !334, line: 3391, baseType: !1163, size: 960)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !334, line: 2862, size: 960, elements: !1164)
!1164 = !{!1165}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1163, file: !334, line: 2863, baseType: !884, size: 960)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !720, file: !334, line: 3392, baseType: !1167, size: 1472)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !334, line: 3304, size: 1472, elements: !1168)
!1168 = !{!1169}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1167, file: !334, line: 3305, baseType: !1092, size: 1472)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !720, file: !334, line: 3393, baseType: !1171, size: 1792)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !334, line: 3248, size: 1792, elements: !1172)
!1172 = !{!1173, !1174, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487, !1488, !1489, !1490, !1491}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1171, file: !334, line: 3249, baseType: !1092, size: 1472)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1171, file: !334, line: 3251, baseType: !1175, size: 64, offset: 1472)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1177, line: 463, size: 1152, elements: !1178)
!1177 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1178 = !{!1179, !1182, !1212, !1213, !1352, !1415, !1416, !1417, !1418, !1419, !1420, !1444, !1447, !1448, !1449, !1450, !1451, !1452, !1453, !1454, !1455, !1456, !1457, !1458, !1459, !1460, !1461, !1462, !1463, !1464, !1465, !1466, !1467, !1468, !1469, !1470}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1176, file: !1177, line: 464, baseType: !1180, size: 64)
!1180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1181, size: 64)
!1181 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1177, line: 464, flags: DIFlagFwdDecl)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1176, file: !1177, line: 467, baseType: !1183, size: 64, offset: 64)
!1183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1184, size: 64)
!1184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !318, line: 374, size: 640, elements: !1185)
!1185 = !{!1186, !1187, !1188, !1201, !1202, !1203, !1204, !1205, !1206, !1208, !1210, !1211}
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1184, file: !318, line: 377, baseType: !655, size: 64)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1184, file: !318, line: 378, baseType: !655, size: 64, offset: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1184, file: !318, line: 381, baseType: !1189, size: 64, offset: 128)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !318, line: 282, baseType: !1191)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !318, line: 282, size: 128, elements: !1192)
!1192 = !{!1193}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1191, file: !318, line: 282, baseType: !1194, size: 128)
!1194 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !318, line: 281, baseType: !1195)
!1195 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !318, line: 281, size: 128, elements: !1196)
!1196 = !{!1197, !1198, !1199}
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1195, file: !318, line: 281, baseType: !7, size: 32)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1195, file: !318, line: 281, baseType: !7, size: 32, offset: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1195, file: !318, line: 281, baseType: !1200, size: 64, offset: 64)
!1200 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 64, elements: !816)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1184, file: !318, line: 384, baseType: !647, size: 32, offset: 192)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1184, file: !318, line: 387, baseType: !647, size: 32, offset: 224)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1184, file: !318, line: 390, baseType: !647, size: 32, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1184, file: !318, line: 394, baseType: !1189, size: 64, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1184, file: !318, line: 396, baseType: !317, size: 32, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1184, file: !318, line: 399, baseType: !1207, size: 64, offset: 416)
!1207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !323, size: 64, elements: !956)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1184, file: !318, line: 402, baseType: !1209, size: 64, offset: 480)
!1209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !956)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1184, file: !318, line: 406, baseType: !647, size: 32, offset: 544)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1184, file: !318, line: 409, baseType: !647, size: 32, offset: 576)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1176, file: !1177, line: 470, baseType: !684, size: 64, offset: 128)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1176, file: !1177, line: 473, baseType: !1214, size: 64, offset: 192)
!1214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1215, size: 64)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1127, line: 39, size: 1152, elements: !1216)
!1216 = !{!1217, !1267, !1280, !1293, !1294, !1306, !1307, !1311, !1312, !1313, !1314, !1315}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1215, file: !1127, line: 41, baseType: !1218, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1219, line: 144, baseType: !1220)
!1219 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1219, line: 100, size: 896, elements: !1222)
!1222 = !{!1223, !1229, !1234, !1239, !1241, !1244, !1245, !1246, !1247, !1248, !1253, !1255, !1256, !1261, !1266}
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1221, file: !1219, line: 102, baseType: !1224, size: 64)
!1224 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1219, line: 52, baseType: !1225)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DISubroutineType(types: !1227)
!1227 = !{!1228, !1060}
!1228 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1219, line: 47, baseType: !7)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1221, file: !1219, line: 105, baseType: !1230, size: 64, offset: 64)
!1230 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1219, line: 59, baseType: !1231)
!1231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1232, size: 64)
!1232 = !DISubroutineType(types: !1233)
!1233 = !{!647, !1060, !1060}
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1221, file: !1219, line: 108, baseType: !1235, size: 64, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1219, line: 63, baseType: !1236)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DISubroutineType(types: !1238)
!1238 = !{null, !651}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1221, file: !1219, line: 111, baseType: !1240, size: 64, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1221, file: !1219, line: 114, baseType: !1242, size: 64, offset: 256)
!1242 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1243, line: 46, baseType: !771)
!1243 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1221, file: !1219, line: 117, baseType: !1242, size: 64, offset: 320)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1221, file: !1219, line: 120, baseType: !1242, size: 64, offset: 384)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1221, file: !1219, line: 124, baseType: !7, size: 32, offset: 448)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1221, file: !1219, line: 128, baseType: !7, size: 32, offset: 480)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1221, file: !1219, line: 131, baseType: !1249, size: 64, offset: 512)
!1249 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1219, line: 75, baseType: !1250)
!1250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1251, size: 64)
!1251 = !DISubroutineType(types: !1252)
!1252 = !{!651, !1242, !1242}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1221, file: !1219, line: 132, baseType: !1254, size: 64, offset: 576)
!1254 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1219, line: 78, baseType: !1236)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1221, file: !1219, line: 135, baseType: !651, size: 64, offset: 640)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1221, file: !1219, line: 136, baseType: !1257, size: 64, offset: 704)
!1257 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1219, line: 82, baseType: !1258)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DISubroutineType(types: !1260)
!1260 = !{!651, !651, !1242, !1242}
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1221, file: !1219, line: 137, baseType: !1262, size: 64, offset: 768)
!1262 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1219, line: 83, baseType: !1263)
!1263 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1264, size: 64)
!1264 = !DISubroutineType(types: !1265)
!1265 = !{null, !651, !651}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1221, file: !1219, line: 141, baseType: !7, size: 32, offset: 832)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1215, file: !1127, line: 48, baseType: !1268, size: 64, offset: 64)
!1268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1269, size: 64)
!1269 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !574, line: 35, baseType: !1270)
!1270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !574, line: 35, size: 128, elements: !1271)
!1271 = !{!1272}
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1270, file: !574, line: 35, baseType: !1273, size: 128)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !574, line: 33, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !574, line: 33, size: 128, elements: !1275)
!1275 = !{!1276, !1277, !1278}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1274, file: !574, line: 33, baseType: !7, size: 32)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1274, file: !574, line: 33, baseType: !7, size: 32, offset: 32)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1274, file: !574, line: 33, baseType: !1279, size: 64, offset: 64)
!1279 = !DICompositeType(tag: DW_TAG_array_type, baseType: !693, size: 64, elements: !816)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1215, file: !1127, line: 51, baseType: !1281, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !334, line: 183, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !334, line: 183, size: 128, elements: !1284)
!1284 = !{!1285}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1283, file: !334, line: 183, baseType: !1286, size: 128)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !334, line: 182, baseType: !1287)
!1287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !334, line: 182, size: 128, elements: !1288)
!1288 = !{!1289, !1290, !1291}
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1287, file: !334, line: 182, baseType: !7, size: 32)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1287, file: !334, line: 182, baseType: !7, size: 32, offset: 32)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1287, file: !334, line: 182, baseType: !1292, size: 64, offset: 64)
!1292 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 64, elements: !816)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1215, file: !1127, line: 54, baseType: !718, size: 64, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1215, file: !1127, line: 57, baseType: !1295, size: 128, offset: 256)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1296, line: 31, size: 128, elements: !1297)
!1296 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1297 = !{!1298, !1299, !1300, !1301, !1302, !1303, !1304}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1295, file: !1296, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1295, file: !1296, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1295, file: !1296, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1295, file: !1296, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1295, file: !1296, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1295, file: !1296, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1295, file: !1296, line: 56, baseType: !1305, size: 64, offset: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !656, line: 47, baseType: !940)
!1306 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1215, file: !1127, line: 60, baseType: !1295, size: 128, offset: 384)
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1215, file: !1127, line: 64, baseType: !1308, size: 64, offset: 512)
!1308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1309, size: 64)
!1309 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1310, line: 33, flags: DIFlagFwdDecl)
!1310 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1215, file: !1127, line: 67, baseType: !718, size: 64, offset: 576)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1215, file: !1127, line: 73, baseType: !1218, size: 64, offset: 640)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1215, file: !1127, line: 77, baseType: !1305, size: 64, offset: 704)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1215, file: !1127, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1215, file: !1127, line: 82, baseType: !1316, size: 320, offset: 832)
!1316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1317, line: 62, size: 320, elements: !1318)
!1317 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1318 = !{!1319, !1325, !1326, !1327, !1328, !1335}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1316, file: !1317, line: 63, baseType: !1320, size: 64)
!1320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1321, size: 64)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1317, line: 56, size: 128, elements: !1322)
!1322 = !{!1323, !1324}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1321, file: !1317, line: 57, baseType: !1320, size: 64)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1321, file: !1317, line: 58, baseType: !815, size: 8, offset: 64)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1316, file: !1317, line: 64, baseType: !7, size: 32, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1316, file: !1317, line: 66, baseType: !7, size: 32, offset: 96)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1316, file: !1317, line: 68, baseType: !646, size: 8, offset: 128)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1316, file: !1317, line: 70, baseType: !1329, size: 64, offset: 192)
!1329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1330, size: 64)
!1330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1317, line: 37, size: 128, elements: !1331)
!1331 = !{!1332, !1333}
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1330, file: !1317, line: 39, baseType: !1329, size: 64)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1330, file: !1317, line: 40, baseType: !1334, size: 64, offset: 64)
!1334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1316, file: !1317, line: 71, baseType: !1336, size: 64, offset: 256)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1317, line: 45, size: 320, elements: !1338)
!1338 = !{!1339, !1340}
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1337, file: !1317, line: 47, baseType: !1336, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1337, file: !1317, line: 48, baseType: !1341, size: 256, offset: 64)
!1341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !334, line: 1883, size: 256, elements: !1342)
!1342 = !{!1343, !1345, !1346, !1351}
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1341, file: !334, line: 1884, baseType: !1344, size: 64)
!1344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1341, size: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1341, file: !334, line: 1885, baseType: !1344, size: 64, offset: 64)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1341, file: !334, line: 1891, baseType: !1347, size: 64, offset: 128)
!1347 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1341, file: !334, line: 1891, size: 64, elements: !1348)
!1348 = !{!1349, !1350}
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1347, file: !334, line: 1891, baseType: !693, size: 64)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1347, file: !334, line: 1891, baseType: !718, size: 64)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1341, file: !334, line: 1892, baseType: !1334, size: 64, offset: 192)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1176, file: !1177, line: 476, baseType: !1353, size: 64, offset: 256)
!1353 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1354, size: 64)
!1354 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !561, line: 187, size: 256, elements: !1355)
!1355 = !{!1356, !1357, !1413, !1414}
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1354, file: !561, line: 189, baseType: !647, size: 32)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1354, file: !561, line: 192, baseType: !1358, size: 64, offset: 64)
!1358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1359, size: 64)
!1359 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !561, line: 87, baseType: !1360)
!1360 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !561, line: 87, size: 128, elements: !1361)
!1361 = !{!1362}
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1360, file: !561, line: 87, baseType: !1363, size: 128)
!1363 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !561, line: 85, baseType: !1364)
!1364 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !561, line: 85, size: 128, elements: !1365)
!1365 = !{!1366, !1367, !1368}
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1364, file: !561, line: 85, baseType: !7, size: 32)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1364, file: !561, line: 85, baseType: !7, size: 32, offset: 32)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1364, file: !561, line: 85, baseType: !1369, size: 64, offset: 64)
!1369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1370, size: 64, elements: !816)
!1370 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !561, line: 84, baseType: !1371)
!1371 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1372, size: 64)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !561, line: 100, size: 1216, elements: !1373)
!1373 = !{!1374, !1375, !1376, !1377, !1378, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1403, !1411, !1412}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1372, file: !561, line: 102, baseType: !647, size: 32)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1372, file: !561, line: 105, baseType: !7, size: 32, offset: 32)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1372, file: !561, line: 108, baseType: !657, size: 64, offset: 64)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1372, file: !561, line: 111, baseType: !657, size: 64, offset: 128)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1372, file: !561, line: 114, baseType: !1379, size: 64, offset: 192)
!1379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !561, line: 41, size: 64, elements: !1380)
!1380 = !{!1381, !1382}
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1379, file: !561, line: 42, baseType: !560, size: 32)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1379, file: !561, line: 43, baseType: !7, size: 32, offset: 32)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1372, file: !561, line: 117, baseType: !7, size: 32, offset: 256)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1372, file: !561, line: 120, baseType: !7, size: 32, offset: 288)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1372, file: !561, line: 123, baseType: !1358, size: 64, offset: 320)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1372, file: !561, line: 126, baseType: !1371, size: 64, offset: 384)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1372, file: !561, line: 129, baseType: !1371, size: 64, offset: 448)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1372, file: !561, line: 132, baseType: !651, size: 64, offset: 512)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1372, file: !561, line: 139, baseType: !718, size: 64, offset: 576)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1372, file: !561, line: 143, baseType: !766, size: 128, offset: 640)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1372, file: !561, line: 146, baseType: !766, size: 128, offset: 768)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1372, file: !561, line: 148, baseType: !646, size: 8, offset: 896)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1372, file: !561, line: 149, baseType: !646, size: 8, offset: 904)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1372, file: !561, line: 153, baseType: !569, size: 32, offset: 928)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1372, file: !561, line: 156, baseType: !1396, size: 64, offset: 960)
!1396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1397, size: 64)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !561, line: 48, size: 320, elements: !1398)
!1398 = !{!1399, !1400, !1401, !1402}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1397, file: !561, line: 50, baseType: !693, size: 64)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1397, file: !561, line: 59, baseType: !766, size: 128, offset: 64)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1397, file: !561, line: 64, baseType: !646, size: 8, offset: 192)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1397, file: !561, line: 67, baseType: !1396, size: 64, offset: 256)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1372, file: !561, line: 159, baseType: !1404, size: 64, offset: 1024)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !561, line: 72, size: 256, elements: !1406)
!1406 = !{!1407, !1408, !1409, !1410}
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1405, file: !561, line: 74, baseType: !674, size: 64)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1405, file: !561, line: 77, baseType: !1404, size: 64, offset: 64)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1405, file: !561, line: 78, baseType: !1404, size: 64, offset: 128)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1405, file: !561, line: 81, baseType: !1404, size: 64, offset: 192)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1372, file: !561, line: 162, baseType: !646, size: 8, offset: 1088)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1372, file: !561, line: 166, baseType: !718, size: 64, offset: 1152)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1354, file: !561, line: 197, baseType: !1218, size: 64, offset: 128)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1354, file: !561, line: 200, baseType: !1371, size: 64, offset: 192)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1176, file: !1177, line: 479, baseType: !1218, size: 64, offset: 320)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1176, file: !1177, line: 484, baseType: !718, size: 64, offset: 384)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1176, file: !1177, line: 488, baseType: !718, size: 64, offset: 448)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1176, file: !1177, line: 493, baseType: !718, size: 64, offset: 512)
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1176, file: !1177, line: 496, baseType: !718, size: 64, offset: 576)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1176, file: !1177, line: 501, baseType: !1421, size: 64, offset: 640)
!1421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1422, size: 64)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !329, line: 2355, size: 576, elements: !1423)
!1423 = !{!1424, !1427, !1428, !1429, !1430, !1432, !1433, !1438, !1439, !1440, !1441, !1442, !1443}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1422, file: !329, line: 2356, baseType: !1425, size: 64)
!1425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1426, size: 64)
!1426 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !329, line: 2356, flags: DIFlagFwdDecl)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1422, file: !329, line: 2357, baseType: !652, size: 64, offset: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1422, file: !329, line: 2358, baseType: !647, size: 32, offset: 128)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1422, file: !329, line: 2359, baseType: !647, size: 32, offset: 160)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1422, file: !329, line: 2360, baseType: !1431, size: 128, offset: 192)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !647, size: 128, elements: !980)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1422, file: !329, line: 2364, baseType: !647, size: 32, offset: 320)
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1422, file: !329, line: 2367, baseType: !1434, size: 128, offset: 384)
!1434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !329, line: 2349, size: 128, elements: !1435)
!1435 = !{!1436, !1437}
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1434, file: !329, line: 2351, baseType: !888, size: 64)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1434, file: !329, line: 2352, baseType: !773, size: 64, offset: 64)
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1422, file: !329, line: 2371, baseType: !328, size: 32, offset: 512)
!1439 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1422, file: !329, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1440 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1422, file: !329, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
