; ModuleID = 'tree-vect-stmts.bc'
source_filename = "tree-vect-stmts.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.processor_costs = type { i32, i32, i32, i32, [5 x i32], i32, [5 x i32], i32, i32, i32, i32, i32, [3 x i32], [3 x i32], i32, [3 x i32], [3 x i32], i32, [2 x i32], [2 x i32], i32, [3 x i32], [3 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [2 x %struct.stringop_algs], [2 x %struct.stringop_algs], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.stringop_algs = type { i32, [4 x %struct.stringop_strategy] }
%struct.stringop_strategy = type { i32, i32 }

!2108 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!2109 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!2110 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!2111 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!2112 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!2113 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!2114 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!2115 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!2116 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!2117 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!2118 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!2119 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!2120 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!2121 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!2122 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!2123 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!2124 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!2125 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!2126 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!2127 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!2128 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!2129 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!2130 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !2092, line: 727, baseType: !5, size: 32, elements: !2131)
!2131 = !{!2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151, !2152, !2153, !2154, !2155}
!2132 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!2133 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!2134 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!2135 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!2136 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!2137 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!2138 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!2139 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!2140 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!2141 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!2142 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!2143 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!2144 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!2145 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!2146 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!2147 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!2148 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!2149 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!2150 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!2151 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!2152 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!2153 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!2154 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!2155 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!2156 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !2092, line: 80, baseType: !5, size: 32, elements: !2157)
!2157 = !{!2158, !2159, !2160, !2161}
!2158 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!2159 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!2160 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!2161 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!2162 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !2163, file: !1, line: 1557, baseType: !5, size: 32, elements: !3856)
!2163 = distinct !DISubprogram(name: "vectorizable_conversion", scope: !1, file: !1, line: 1534, type: !2164, scopeLine: 1536, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !3551)
!2164 = !DISubroutineType(types: !2165)
!2165 = !{!2166, !2167, !3524, !3531, !3532}
!2166 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2167 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2168, line: 58, baseType: !2169)
!2168 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2170, size: 64)
!2170 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !2092, line: 737, size: 768, elements: !2171)
!2171 = !{!2172, !3371, !3381, !3387, !3392, !3397, !3404, !3410, !3416, !3421, !3435, !3440, !3446, !3451, !3461, !3466, !3482, !3489, !3496, !3502, !3507, !3513, !3519}
!2172 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2170, file: !2092, line: 738, baseType: !2173, size: 256)
!2173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !2092, line: 271, size: 256, elements: !2174)
!2174 = !{!2175, !2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2190, !2191, !3370}
!2175 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2173, file: !2092, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !2173, file: !2092, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2177 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2173, file: !2092, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2178 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !2173, file: !2092, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2179 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !2173, file: !2092, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2180 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !2173, file: !2092, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !2173, file: !2092, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2173, file: !2092, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!2183 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !2173, file: !2092, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2184 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2173, file: !2092, line: 312, baseType: !5, size: 32, offset: 32)
!2185 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !2173, file: !2092, line: 316, baseType: !2186, size: 32, offset: 64)
!2186 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2187, line: 58, baseType: !2188)
!2187 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2188 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2189, line: 44, baseType: !5)
!2189 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2190 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !2173, file: !2092, line: 319, baseType: !5, size: 32, offset: 96)
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !2173, file: !2092, line: 323, baseType: !2192, size: 64, offset: 128)
!2192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2193, size: 64)
!2193 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !2194)
!2194 = !{!2195, !3337, !3338, !3339, !3340, !3344, !3345, !3346, !3364, !3365, !3366, !3367, !3368, !3369}
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2193, file: !133, line: 219, baseType: !2196, size: 64)
!2196 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2197, size: 64)
!2197 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !2198)
!2198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !2199)
!2199 = !{!2200}
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2198, file: !133, line: 151, baseType: !2201, size: 128)
!2201 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !2202)
!2202 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !2203)
!2203 = !{!2204, !2205, !2206}
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2202, file: !133, line: 150, baseType: !5, size: 32)
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2202, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2202, file: !133, line: 150, baseType: !2207, size: 64, offset: 64)
!2207 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2208, size: 64, elements: !2271)
!2208 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2168, line: 108, baseType: !2209)
!2209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2210, size: 64)
!2210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !2211)
!2211 = !{!2212, !2213, !2214, !3329, !3330, !3331, !3332, !3333, !3334, !3335}
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2210, file: !133, line: 124, baseType: !2192, size: 64)
!2213 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2210, file: !133, line: 125, baseType: !2192, size: 64, offset: 64)
!2214 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2210, file: !133, line: 131, baseType: !2215, size: 64, offset: 128)
!2215 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !2216)
!2216 = !{!2217, !2232}
!2217 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2215, file: !133, line: 129, baseType: !2218, size: 64)
!2218 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2168, line: 66, baseType: !2219)
!2219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2220, size: 64)
!2220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2092, line: 143, size: 192, elements: !2221)
!2221 = !{!2222, !2230, !2231}
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2220, file: !2092, line: 145, baseType: !2223, size: 64)
!2223 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !2168, line: 69, baseType: !2224)
!2224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2225, size: 64)
!2225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !2092, line: 136, size: 192, elements: !2226)
!2226 = !{!2227, !2228, !2229}
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2225, file: !2092, line: 137, baseType: !2167, size: 64)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2225, file: !2092, line: 138, baseType: !2224, size: 64, offset: 64)
!2229 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2225, file: !2092, line: 139, baseType: !2224, size: 64, offset: 128)
!2230 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !2220, file: !2092, line: 146, baseType: !2223, size: 64, offset: 64)
!2231 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2220, file: !2092, line: 152, baseType: !2218, size: 64, offset: 128)
!2232 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2215, file: !133, line: 130, baseType: !2233, size: 64)
!2233 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2168, line: 50, baseType: !2234)
!2234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2235, size: 64)
!2235 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !1949, line: 240, size: 384, elements: !2236)
!2236 = !{!2237, !2238, !2239, !2240, !2241, !2242, !2243, !2244, !2245, !2246, !2247}
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2235, file: !1949, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2235, file: !1949, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2235, file: !1949, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2240 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2235, file: !1949, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2241 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2235, file: !1949, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2242 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2235, file: !1949, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2243 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2235, file: !1949, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2244 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2235, file: !1949, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2245 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2235, file: !1949, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2235, file: !1949, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2247 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2235, file: !1949, line: 321, baseType: !2248, size: 320, offset: 64)
!2248 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !1949, line: 315, size: 320, elements: !2249)
!2249 = !{!2250, !3296, !3298, !3327, !3328}
!2250 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2248, file: !1949, line: 316, baseType: !2251, size: 64)
!2251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2252, size: 64, elements: !2271)
!2252 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !1949, line: 183, baseType: !2253)
!2253 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !1949, line: 166, size: 64, elements: !2254)
!2254 = !{!2255, !2257, !2258, !2262, !2263, !2273, !2274, !2286, !2289, !2353, !3274, !3275, !3286, !3293}
!2255 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2253, file: !1949, line: 168, baseType: !2256, size: 32)
!2256 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2253, file: !1949, line: 169, baseType: !5, size: 32)
!2258 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2253, file: !1949, line: 170, baseType: !2259, size: 64)
!2259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2260, size: 64)
!2260 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2261)
!2261 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2253, file: !1949, line: 171, baseType: !2233, size: 64)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2253, file: !1949, line: 172, baseType: !2264, size: 64)
!2264 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2168, line: 53, baseType: !2265)
!2265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2266, size: 64)
!2266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !1949, line: 359, size: 128, elements: !2267)
!2267 = !{!2268, !2269}
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2266, file: !1949, line: 360, baseType: !2256, size: 32)
!2269 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2266, file: !1949, line: 361, baseType: !2270, size: 64, offset: 64)
!2270 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2233, size: 64, elements: !2271)
!2271 = !{!2272}
!2272 = !DISubrange(count: 1)
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2253, file: !1949, line: 173, baseType: !3, size: 32)
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2253, file: !1949, line: 174, baseType: !2275, size: 32)
!2275 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !1949, line: 133, baseType: !2276)
!2276 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !1949, line: 115, size: 32, elements: !2277)
!2277 = !{!2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285}
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2276, file: !1949, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2279 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2276, file: !1949, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2280 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2276, file: !1949, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2281 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2276, file: !1949, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2276, file: !1949, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2283 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2276, file: !1949, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2284 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2276, file: !1949, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2276, file: !1949, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2253, file: !1949, line: 175, baseType: !2287, size: 64)
!2287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2288, size: 64)
!2288 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !1949, line: 175, flags: DIFlagFwdDecl)
!2289 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2253, file: !1949, line: 176, baseType: !2290, size: 64)
!2290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2291, size: 64)
!2291 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2292, line: 75, size: 256, elements: !2293)
!2292 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2293 = !{!2294, !2309, !2310, !2311}
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2291, file: !2292, line: 76, baseType: !2295, size: 64)
!2295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2296, size: 64)
!2296 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2292, line: 68, baseType: !2297)
!2297 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2292, line: 63, size: 320, elements: !2298)
!2298 = !{!2299, !2301, !2302, !2303}
!2299 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2297, file: !2292, line: 64, baseType: !2300, size: 64)
!2300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2297, size: 64)
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2297, file: !2292, line: 65, baseType: !2300, size: 64, offset: 64)
!2302 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2297, file: !2292, line: 66, baseType: !5, size: 32, offset: 128)
!2303 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2297, file: !2292, line: 67, baseType: !2304, size: 128, offset: 192)
!2304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2305, size: 128, elements: !2307)
!2305 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2292, line: 29, baseType: !2306)
!2306 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2307 = !{!2308}
!2308 = !DISubrange(count: 2)
!2309 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2291, file: !2292, line: 77, baseType: !2295, size: 64, offset: 64)
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2291, file: !2292, line: 78, baseType: !5, size: 32, offset: 128)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2291, file: !2292, line: 79, baseType: !2312, size: 64, offset: 192)
!2312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2313, size: 64)
!2313 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2292, line: 49, baseType: !2314)
!2314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2292, line: 45, size: 832, elements: !2315)
!2315 = !{!2316, !2317, !2318}
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2314, file: !2292, line: 46, baseType: !2300, size: 64)
!2317 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2314, file: !2292, line: 47, baseType: !2290, size: 64, offset: 64)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2314, file: !2292, line: 48, baseType: !2319, size: 704, offset: 128)
!2319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2320, line: 164, size: 704, elements: !2321)
!2320 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2321 = !{!2322, !2324, !2335, !2336, !2337, !2338, !2339, !2340, !2345, !2349, !2350, !2351, !2352}
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2319, file: !2320, line: 166, baseType: !2323, size: 64)
!2323 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2319, file: !2320, line: 167, baseType: !2325, size: 64, offset: 64)
!2325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2326, size: 64)
!2326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2320, line: 157, size: 192, elements: !2327)
!2327 = !{!2328, !2330, !2331}
!2328 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2326, file: !2320, line: 159, baseType: !2329, size: 64)
!2329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2261, size: 64)
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2326, file: !2320, line: 160, baseType: !2325, size: 64, offset: 64)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2326, file: !2320, line: 161, baseType: !2332, size: 32, offset: 128)
!2332 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2261, size: 32, elements: !2333)
!2333 = !{!2334}
!2334 = !DISubrange(count: 4)
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2319, file: !2320, line: 168, baseType: !2329, size: 64, offset: 128)
!2336 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2319, file: !2320, line: 169, baseType: !2329, size: 64, offset: 192)
!2337 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2319, file: !2320, line: 170, baseType: !2329, size: 64, offset: 256)
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2319, file: !2320, line: 171, baseType: !2323, size: 64, offset: 320)
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2319, file: !2320, line: 172, baseType: !2256, size: 32, offset: 384)
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2319, file: !2320, line: 176, baseType: !2341, size: 64, offset: 448)
!2341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2342, size: 64)
!2342 = !DISubroutineType(types: !2343)
!2343 = !{!2325, !2344, !2323}
!2344 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2319, file: !2320, line: 177, baseType: !2346, size: 64, offset: 512)
!2346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2347, size: 64)
!2347 = !DISubroutineType(types: !2348)
!2348 = !{null, !2344, !2325}
!2349 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2319, file: !2320, line: 178, baseType: !2344, size: 64, offset: 576)
!2350 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2319, file: !2320, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2351 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2319, file: !2320, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2319, file: !2320, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2253, file: !1949, line: 177, baseType: !2354, size: 64)
!2354 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2168, line: 56, baseType: !2355)
!2355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2356, size: 64)
!2356 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !2357)
!2357 = !{!2358, !2391, !2397, !2408, !2427, !2438, !2443, !2450, !2456, !2469, !2477, !2515, !2520, !2548, !2565, !2566, !2571, !2580, !2586, !2591, !2595, !2599, !2923, !2972, !2978, !2984, !2991, !3004, !3018, !3035, !3047, !3069, !3084, !3256}
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2356, file: !149, line: 3372, baseType: !2359, size: 64)
!2359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !2360)
!2360 = !{!2361, !2362, !2363, !2364, !2365, !2366, !2367, !2368, !2369, !2370, !2371, !2372, !2373, !2374, !2375, !2376, !2377, !2378, !2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386, !2387, !2388, !2389, !2390}
!2361 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2359, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2362 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2359, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2363 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2359, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2359, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2359, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2359, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2367 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2359, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2368 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2359, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2369 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2359, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2370 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2359, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2371 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2359, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2372 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2359, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2373 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2359, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2359, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2375 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2359, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2376 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2359, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2377 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2359, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2359, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2359, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2359, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2359, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2382 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2359, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2359, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2359, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2359, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2386 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2359, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2387 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2359, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2359, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2359, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2359, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2391 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2356, file: !149, line: 3373, baseType: !2392, size: 192)
!2392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !2393)
!2393 = !{!2394, !2395, !2396}
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2392, file: !149, line: 403, baseType: !2359, size: 64)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2392, file: !149, line: 404, baseType: !2354, size: 64, offset: 64)
!2396 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2392, file: !149, line: 405, baseType: !2354, size: 64, offset: 128)
!2397 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2356, file: !149, line: 3374, baseType: !2398, size: 320)
!2398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !2399)
!2399 = !{!2400, !2401}
!2400 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2398, file: !149, line: 1385, baseType: !2392, size: 192)
!2401 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2398, file: !149, line: 1386, baseType: !2402, size: 128, offset: 192)
!2402 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2403, line: 58, baseType: !2404)
!2403 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2404 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2403, line: 54, size: 128, elements: !2405)
!2405 = !{!2406, !2407}
!2406 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2404, file: !2403, line: 56, baseType: !2306, size: 64)
!2407 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2404, file: !2403, line: 57, baseType: !2323, size: 64, offset: 64)
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2356, file: !149, line: 3375, baseType: !2409, size: 256)
!2409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !2410)
!2410 = !{!2411, !2412}
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2409, file: !149, line: 1398, baseType: !2392, size: 192)
!2412 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2409, file: !149, line: 1399, baseType: !2413, size: 64, offset: 192)
!2413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2414, size: 64)
!2414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2415, line: 52, size: 256, elements: !2416)
!2415 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2416 = !{!2417, !2418, !2419, !2420, !2421, !2422, !2423}
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2414, file: !2415, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2414, file: !2415, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2419 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2414, file: !2415, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2420 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2414, file: !2415, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2421 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2414, file: !2415, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2414, file: !2415, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2414, file: !2415, line: 62, baseType: !2424, size: 192, offset: 64)
!2424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2306, size: 192, elements: !2425)
!2425 = !{!2426}
!2426 = !DISubrange(count: 3)
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2356, file: !149, line: 3376, baseType: !2428, size: 256)
!2428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !2429)
!2429 = !{!2430, !2431}
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2428, file: !149, line: 1409, baseType: !2392, size: 192)
!2431 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2428, file: !149, line: 1410, baseType: !2432, size: 64, offset: 192)
!2432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2433, size: 64)
!2433 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2434, line: 27, size: 192, elements: !2435)
!2434 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2435 = !{!2436, !2437}
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2433, file: !2434, line: 29, baseType: !2402, size: 128)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2433, file: !2434, line: 30, baseType: !3, size: 32, offset: 128)
!2438 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2356, file: !149, line: 3377, baseType: !2439, size: 256)
!2439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !2440)
!2440 = !{!2441, !2442}
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2439, file: !149, line: 1438, baseType: !2392, size: 192)
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2439, file: !149, line: 1439, baseType: !2354, size: 64, offset: 192)
!2443 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2356, file: !149, line: 3378, baseType: !2444, size: 256)
!2444 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !2445)
!2445 = !{!2446, !2447, !2448}
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2444, file: !149, line: 1419, baseType: !2392, size: 192)
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2444, file: !149, line: 1420, baseType: !2256, size: 32, offset: 192)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2444, file: !149, line: 1421, baseType: !2449, size: 8, offset: 224)
!2449 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2261, size: 8, elements: !2271)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2356, file: !149, line: 3379, baseType: !2451, size: 320)
!2451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !2452)
!2452 = !{!2453, !2454, !2455}
!2453 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2451, file: !149, line: 1429, baseType: !2392, size: 192)
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2451, file: !149, line: 1430, baseType: !2354, size: 64, offset: 192)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2451, file: !149, line: 1431, baseType: !2354, size: 64, offset: 256)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2356, file: !149, line: 3380, baseType: !2457, size: 320)
!2457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !2458)
!2458 = !{!2459, !2460}
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2457, file: !149, line: 1461, baseType: !2392, size: 192)
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2457, file: !149, line: 1462, baseType: !2461, size: 128, offset: 192)
!2461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2462, line: 31, size: 128, elements: !2463)
!2462 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2463 = !{!2464, !2467, !2468}
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2461, file: !2462, line: 32, baseType: !2465, size: 64)
!2465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2466, size: 64)
!2466 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2166)
!2467 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2461, file: !2462, line: 33, baseType: !5, size: 32, offset: 64)
!2468 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2461, file: !2462, line: 34, baseType: !5, size: 32, offset: 96)
!2469 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2356, file: !149, line: 3381, baseType: !2470, size: 384)
!2470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !2471)
!2471 = !{!2472, !2473, !2474, !2475, !2476}
!2472 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2470, file: !149, line: 2508, baseType: !2392, size: 192)
!2473 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2470, file: !149, line: 2509, baseType: !2186, size: 32, offset: 192)
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2470, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!2475 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2470, file: !149, line: 2511, baseType: !2354, size: 64, offset: 256)
!2476 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2470, file: !149, line: 2512, baseType: !2354, size: 64, offset: 320)
!2477 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2356, file: !149, line: 3382, baseType: !2478, size: 896)
!2478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !2479)
!2479 = !{!2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487, !2488, !2489, !2490, !2491, !2492, !2493, !2494, !2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508, !2509, !2510, !2511, !2512}
!2480 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2478, file: !149, line: 2653, baseType: !2470, size: 384)
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2478, file: !149, line: 2654, baseType: !2354, size: 64, offset: 384)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2478, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2478, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2478, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2478, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2486 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2478, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2478, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2488 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2478, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2489 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2478, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2478, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2491 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2478, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2492 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2478, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2493 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2478, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2494 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2478, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2478, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2496 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2478, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2497 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2478, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2498 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2478, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2478, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2478, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2478, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2502 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2478, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2503 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2478, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2504 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2478, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2505 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2478, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2506 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2478, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2478, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2478, file: !149, line: 2705, baseType: !2354, size: 64, offset: 576)
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2478, file: !149, line: 2706, baseType: !2354, size: 64, offset: 640)
!2510 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2478, file: !149, line: 2707, baseType: !2354, size: 64, offset: 704)
!2511 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2478, file: !149, line: 2708, baseType: !2354, size: 64, offset: 768)
!2512 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2478, file: !149, line: 2711, baseType: !2513, size: 64, offset: 832)
!2513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2514, size: 64)
!2514 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!2515 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2356, file: !149, line: 3383, baseType: !2516, size: 960)
!2516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !2517)
!2517 = !{!2518, !2519}
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2516, file: !149, line: 2757, baseType: !2478, size: 896)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2516, file: !149, line: 2758, baseType: !2233, size: 64, offset: 896)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2356, file: !149, line: 3384, baseType: !2521, size: 1472)
!2521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !2522)
!2522 = !{!2523, !2544, !2545, !2546, !2547}
!2523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2521, file: !149, line: 3115, baseType: !2524, size: 1216)
!2524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !2525)
!2525 = !{!2526, !2527, !2528, !2529, !2530, !2531, !2532, !2533, !2534, !2535, !2536, !2537, !2538, !2539, !2540, !2541, !2542, !2543}
!2526 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2524, file: !149, line: 2985, baseType: !2516, size: 960)
!2527 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2524, file: !149, line: 2986, baseType: !2354, size: 64, offset: 960)
!2528 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2524, file: !149, line: 2987, baseType: !2354, size: 64, offset: 1024)
!2529 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2524, file: !149, line: 2988, baseType: !2354, size: 64, offset: 1088)
!2530 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2524, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2524, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2532 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2524, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2524, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2524, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2535 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2524, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2536 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2524, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2524, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2538 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2524, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2539 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2524, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2524, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2541 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2524, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2524, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2543 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2524, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2544 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2521, file: !149, line: 3117, baseType: !2354, size: 64, offset: 1216)
!2545 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2521, file: !149, line: 3119, baseType: !2354, size: 64, offset: 1280)
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2521, file: !149, line: 3121, baseType: !2354, size: 64, offset: 1344)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2521, file: !149, line: 3123, baseType: !2354, size: 64, offset: 1408)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2356, file: !149, line: 3385, baseType: !2549, size: 1088)
!2549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !2550)
!2550 = !{!2551, !2552, !2553}
!2551 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2549, file: !149, line: 2875, baseType: !2516, size: 960)
!2552 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2549, file: !149, line: 2876, baseType: !2233, size: 64, offset: 960)
!2553 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2549, file: !149, line: 2877, baseType: !2554, size: 64, offset: 1024)
!2554 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2555, size: 64)
!2555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2556, line: 172, size: 128, elements: !2557)
!2556 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2557 = !{!2558, !2559, !2560, !2561, !2562, !2563, !2564}
!2558 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2555, file: !2556, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2559 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2555, file: !2556, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2560 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2555, file: !2556, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2561 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2555, file: !2556, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2555, file: !2556, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2563 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2555, file: !2556, line: 195, baseType: !5, size: 32, offset: 32)
!2564 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2555, file: !2556, line: 199, baseType: !2354, size: 64, offset: 64)
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2356, file: !149, line: 3386, baseType: !2524, size: 1216)
!2566 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2356, file: !149, line: 3387, baseType: !2567, size: 1280)
!2567 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !2568)
!2568 = !{!2569, !2570}
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2567, file: !149, line: 3094, baseType: !2524, size: 1216)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2567, file: !149, line: 3095, baseType: !2554, size: 64, offset: 1216)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2356, file: !149, line: 3388, baseType: !2572, size: 1216)
!2572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !2573)
!2573 = !{!2574, !2575, !2576, !2577, !2578, !2579}
!2574 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2572, file: !149, line: 2825, baseType: !2478, size: 896)
!2575 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2572, file: !149, line: 2827, baseType: !2354, size: 64, offset: 896)
!2576 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2572, file: !149, line: 2828, baseType: !2354, size: 64, offset: 960)
!2577 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2572, file: !149, line: 2829, baseType: !2354, size: 64, offset: 1024)
!2578 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2572, file: !149, line: 2830, baseType: !2354, size: 64, offset: 1088)
!2579 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2572, file: !149, line: 2831, baseType: !2354, size: 64, offset: 1152)
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2356, file: !149, line: 3389, baseType: !2581, size: 1024)
!2581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !2582)
!2582 = !{!2583, !2584, !2585}
!2583 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2581, file: !149, line: 2851, baseType: !2516, size: 960)
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2581, file: !149, line: 2852, baseType: !2256, size: 32, offset: 960)
!2585 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2581, file: !149, line: 2853, baseType: !2256, size: 32, offset: 992)
!2586 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2356, file: !149, line: 3390, baseType: !2587, size: 1024)
!2587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !2588)
!2588 = !{!2589, !2590}
!2589 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2587, file: !149, line: 2858, baseType: !2516, size: 960)
!2590 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2587, file: !149, line: 2859, baseType: !2554, size: 64, offset: 960)
!2591 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2356, file: !149, line: 3391, baseType: !2592, size: 960)
!2592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !2593)
!2593 = !{!2594}
!2594 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2592, file: !149, line: 2863, baseType: !2516, size: 960)
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2356, file: !149, line: 3392, baseType: !2596, size: 1472)
!2596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !2597)
!2597 = !{!2598}
!2598 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2596, file: !149, line: 3305, baseType: !2521, size: 1472)
!2599 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2356, file: !149, line: 3393, baseType: !2600, size: 1792)
!2600 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !2601)
!2601 = !{!2602, !2603, !2902, !2903, !2904, !2905, !2906, !2907, !2908, !2909, !2910, !2911, !2912, !2913, !2914, !2915, !2916, !2917, !2918, !2919, !2920, !2921, !2922}
!2602 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2600, file: !149, line: 3249, baseType: !2521, size: 1472)
!2603 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2600, file: !149, line: 3251, baseType: !2604, size: 64, offset: 1472)
!2604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2605, size: 64)
!2605 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2606, line: 463, size: 1152, elements: !2607)
!2606 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2607 = !{!2608, !2611, !2642, !2643, !2783, !2846, !2847, !2848, !2849, !2850, !2851, !2875, !2878, !2879, !2880, !2881, !2882, !2883, !2884, !2885, !2886, !2887, !2888, !2889, !2890, !2891, !2892, !2893, !2894, !2895, !2896, !2897, !2898, !2899, !2900, !2901}
!2608 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !2605, file: !2606, line: 464, baseType: !2609, size: 64)
!2609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2610, size: 64)
!2610 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !2606, line: 464, flags: DIFlagFwdDecl)
!2611 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !2605, file: !2606, line: 467, baseType: !2612, size: 64, offset: 64)
!2612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2613, size: 64)
!2613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !2614)
!2614 = !{!2615, !2617, !2618, !2631, !2632, !2633, !2634, !2635, !2636, !2638, !2640, !2641}
!2615 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !2613, file: !133, line: 377, baseType: !2616, size: 64)
!2616 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2168, line: 111, baseType: !2192)
!2617 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !2613, file: !133, line: 378, baseType: !2616, size: 64, offset: 64)
!2618 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !2613, file: !133, line: 381, baseType: !2619, size: 64, offset: 128)
!2619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2620, size: 64)
!2620 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !2621)
!2621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !2622)
!2622 = !{!2623}
!2623 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2621, file: !133, line: 282, baseType: !2624, size: 128)
!2624 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !2625)
!2625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !2626)
!2626 = !{!2627, !2628, !2629}
!2627 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2625, file: !133, line: 281, baseType: !5, size: 32)
!2628 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2625, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!2629 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2625, file: !133, line: 281, baseType: !2630, size: 64, offset: 64)
!2630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2616, size: 64, elements: !2271)
!2631 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !2613, file: !133, line: 384, baseType: !2256, size: 32, offset: 192)
!2632 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !2613, file: !133, line: 387, baseType: !2256, size: 32, offset: 224)
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !2613, file: !133, line: 390, baseType: !2256, size: 32, offset: 256)
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !2613, file: !133, line: 394, baseType: !2619, size: 64, offset: 320)
!2635 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !2613, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!2636 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !2613, file: !133, line: 399, baseType: !2637, size: 64, offset: 416)
!2637 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !2307)
!2638 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !2613, file: !133, line: 402, baseType: !2639, size: 64, offset: 480)
!2639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !2307)
!2640 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !2613, file: !133, line: 406, baseType: !2256, size: 32, offset: 544)
!2641 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !2613, file: !133, line: 409, baseType: !2256, size: 32, offset: 576)
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !2605, file: !2606, line: 470, baseType: !2219, size: 64, offset: 128)
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !2605, file: !2606, line: 473, baseType: !2644, size: 64, offset: 192)
!2644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2645, size: 64)
!2645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2556, line: 39, size: 1152, elements: !2646)
!2646 = !{!2647, !2699, !2712, !2725, !2726, !2738, !2739, !2743, !2744, !2745, !2746, !2747}
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !2645, file: !2556, line: 41, baseType: !2648, size: 64)
!2648 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !2649, line: 144, baseType: !2650)
!2649 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2651, size: 64)
!2651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !2649, line: 100, size: 896, elements: !2652)
!2652 = !{!2653, !2661, !2666, !2671, !2673, !2676, !2677, !2678, !2679, !2680, !2685, !2687, !2688, !2693, !2698}
!2653 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !2651, file: !2649, line: 102, baseType: !2654, size: 64)
!2654 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !2649, line: 52, baseType: !2655)
!2655 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2656, size: 64)
!2656 = !DISubroutineType(types: !2657)
!2657 = !{!2658, !2659}
!2658 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !2649, line: 47, baseType: !5)
!2659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2660, size: 64)
!2660 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!2661 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !2651, file: !2649, line: 105, baseType: !2662, size: 64, offset: 64)
!2662 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !2649, line: 59, baseType: !2663)
!2663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2664, size: 64)
!2664 = !DISubroutineType(types: !2665)
!2665 = !{!2256, !2659, !2659}
!2666 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !2651, file: !2649, line: 108, baseType: !2667, size: 64, offset: 128)
!2667 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !2649, line: 63, baseType: !2668)
!2668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2669, size: 64)
!2669 = !DISubroutineType(types: !2670)
!2670 = !{null, !2344}
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !2651, file: !2649, line: 111, baseType: !2672, size: 64, offset: 192)
!2672 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2344, size: 64)
!2673 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2651, file: !2649, line: 114, baseType: !2674, size: 64, offset: 256)
!2674 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2675, line: 46, baseType: !2306)
!2675 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2676 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !2651, file: !2649, line: 117, baseType: !2674, size: 64, offset: 320)
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !2651, file: !2649, line: 120, baseType: !2674, size: 64, offset: 384)
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !2651, file: !2649, line: 124, baseType: !5, size: 32, offset: 448)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !2651, file: !2649, line: 128, baseType: !5, size: 32, offset: 480)
!2680 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !2651, file: !2649, line: 131, baseType: !2681, size: 64, offset: 512)
!2681 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !2649, line: 75, baseType: !2682)
!2682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2683, size: 64)
!2683 = !DISubroutineType(types: !2684)
!2684 = !{!2344, !2674, !2674}
!2685 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !2651, file: !2649, line: 132, baseType: !2686, size: 64, offset: 576)
!2686 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !2649, line: 78, baseType: !2668)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !2651, file: !2649, line: 135, baseType: !2344, size: 64, offset: 640)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !2651, file: !2649, line: 136, baseType: !2689, size: 64, offset: 704)
!2689 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !2649, line: 82, baseType: !2690)
!2690 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2691, size: 64)
!2691 = !DISubroutineType(types: !2692)
!2692 = !{!2344, !2344, !2674, !2674}
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !2651, file: !2649, line: 137, baseType: !2694, size: 64, offset: 768)
!2694 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !2649, line: 83, baseType: !2695)
!2695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2696, size: 64)
!2696 = !DISubroutineType(types: !2697)
!2697 = !{null, !2344, !2344}
!2698 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !2651, file: !2649, line: 141, baseType: !5, size: 32, offset: 832)
!2699 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !2645, file: !2556, line: 48, baseType: !2700, size: 64, offset: 64)
!2700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2701, size: 64)
!2701 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !2092, line: 35, baseType: !2702)
!2702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !2092, line: 35, size: 128, elements: !2703)
!2703 = !{!2704}
!2704 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2702, file: !2092, line: 35, baseType: !2705, size: 128)
!2705 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !2092, line: 33, baseType: !2706)
!2706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !2092, line: 33, size: 128, elements: !2707)
!2707 = !{!2708, !2709, !2710}
!2708 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2706, file: !2092, line: 33, baseType: !5, size: 32)
!2709 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2706, file: !2092, line: 33, baseType: !5, size: 32, offset: 32)
!2710 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2706, file: !2092, line: 33, baseType: !2711, size: 64, offset: 64)
!2711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2167, size: 64, elements: !2271)
!2712 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !2645, file: !2556, line: 51, baseType: !2713, size: 64, offset: 128)
!2713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2714, size: 64)
!2714 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !2715)
!2715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !2716)
!2716 = !{!2717}
!2717 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2715, file: !149, line: 183, baseType: !2718, size: 128)
!2718 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !2719)
!2719 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !2720)
!2720 = !{!2721, !2722, !2723}
!2721 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2719, file: !149, line: 182, baseType: !5, size: 32)
!2722 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2719, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!2723 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2719, file: !149, line: 182, baseType: !2724, size: 64, offset: 64)
!2724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2354, size: 64, elements: !2271)
!2725 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !2645, file: !2556, line: 54, baseType: !2354, size: 64, offset: 192)
!2726 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2645, file: !2556, line: 57, baseType: !2727, size: 128, offset: 256)
!2727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !2728, line: 31, size: 128, elements: !2729)
!2728 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2729 = !{!2730, !2731, !2732, !2733, !2734, !2735, !2736}
!2730 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !2727, file: !2728, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2731 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !2727, file: !2728, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2732 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !2727, file: !2728, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2733 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !2727, file: !2728, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2734 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !2727, file: !2728, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2735 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !2727, file: !2728, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2736 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2727, file: !2728, line: 56, baseType: !2737, size: 64, offset: 64)
!2737 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !2168, line: 47, baseType: !2290)
!2738 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !2645, file: !2556, line: 60, baseType: !2727, size: 128, offset: 384)
!2739 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !2645, file: !2556, line: 64, baseType: !2740, size: 64, offset: 512)
!2740 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2741, size: 64)
!2741 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !2742, line: 33, flags: DIFlagFwdDecl)
!2742 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2743 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !2645, file: !2556, line: 67, baseType: !2354, size: 64, offset: 576)
!2744 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !2645, file: !2556, line: 73, baseType: !2648, size: 64, offset: 640)
!2745 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !2645, file: !2556, line: 77, baseType: !2737, size: 64, offset: 704)
!2746 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !2645, file: !2556, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!2747 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !2645, file: !2556, line: 82, baseType: !2748, size: 320, offset: 832)
!2748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !428, line: 62, size: 320, elements: !2749)
!2749 = !{!2750, !2756, !2757, !2758, !2759, !2766}
!2750 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !2748, file: !428, line: 63, baseType: !2751, size: 64)
!2751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2752, size: 64)
!2752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !428, line: 56, size: 128, elements: !2753)
!2753 = !{!2754, !2755}
!2754 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2752, file: !428, line: 57, baseType: !2751, size: 64)
!2755 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !2752, file: !428, line: 58, baseType: !2449, size: 8, offset: 64)
!2756 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !2748, file: !428, line: 64, baseType: !5, size: 32, offset: 64)
!2757 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !2748, file: !428, line: 66, baseType: !5, size: 32, offset: 96)
!2758 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !2748, file: !428, line: 68, baseType: !2166, size: 8, offset: 128)
!2759 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !2748, file: !428, line: 70, baseType: !2760, size: 64, offset: 192)
!2760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2761, size: 64)
!2761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !428, line: 37, size: 128, elements: !2762)
!2762 = !{!2763, !2764}
!2763 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2761, file: !428, line: 39, baseType: !2760, size: 64)
!2764 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !2761, file: !428, line: 40, baseType: !2765, size: 64, offset: 64)
!2765 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2354, size: 64)
!2766 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !2748, file: !428, line: 71, baseType: !2767, size: 64, offset: 256)
!2767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2768, size: 64)
!2768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !428, line: 45, size: 320, elements: !2769)
!2769 = !{!2770, !2771}
!2770 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2768, file: !428, line: 47, baseType: !2767, size: 64)
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !2768, file: !428, line: 48, baseType: !2772, size: 256, offset: 64)
!2772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !2773)
!2773 = !{!2774, !2776, !2777, !2782}
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2772, file: !149, line: 1884, baseType: !2775, size: 64)
!2775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2772, size: 64)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2772, file: !149, line: 1885, baseType: !2775, size: 64, offset: 64)
!2777 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2772, file: !149, line: 1891, baseType: !2778, size: 64, offset: 128)
!2778 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2772, file: !149, line: 1891, size: 64, elements: !2779)
!2779 = !{!2780, !2781}
!2780 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2778, file: !149, line: 1891, baseType: !2167, size: 64)
!2781 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2778, file: !149, line: 1891, baseType: !2354, size: 64)
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2772, file: !149, line: 1892, baseType: !2765, size: 64, offset: 192)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !2605, file: !2606, line: 476, baseType: !2784, size: 64, offset: 256)
!2784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2785, size: 64)
!2785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !376, line: 187, size: 256, elements: !2786)
!2786 = !{!2787, !2788, !2844, !2845}
!2787 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !2785, file: !376, line: 189, baseType: !2256, size: 32)
!2788 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !2785, file: !376, line: 192, baseType: !2789, size: 64, offset: 64)
!2789 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2790, size: 64)
!2790 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !376, line: 87, baseType: !2791)
!2791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !376, line: 87, size: 128, elements: !2792)
!2792 = !{!2793}
!2793 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2791, file: !376, line: 87, baseType: !2794, size: 128)
!2794 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !376, line: 85, baseType: !2795)
!2795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !376, line: 85, size: 128, elements: !2796)
!2796 = !{!2797, !2798, !2799}
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2795, file: !376, line: 85, baseType: !5, size: 32)
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2795, file: !376, line: 85, baseType: !5, size: 32, offset: 32)
!2799 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2795, file: !376, line: 85, baseType: !2800, size: 64, offset: 64)
!2800 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2801, size: 64, elements: !2271)
!2801 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !376, line: 84, baseType: !2802)
!2802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2803, size: 64)
!2803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !376, line: 100, size: 1216, elements: !2804)
!2804 = !{!2805, !2806, !2807, !2808, !2809, !2814, !2815, !2816, !2817, !2818, !2819, !2820, !2821, !2822, !2823, !2824, !2825, !2826, !2834, !2842, !2843}
!2805 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2803, file: !376, line: 102, baseType: !2256, size: 32)
!2806 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !2803, file: !376, line: 105, baseType: !5, size: 32, offset: 32)
!2807 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2803, file: !376, line: 108, baseType: !2192, size: 64, offset: 64)
!2808 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !2803, file: !376, line: 111, baseType: !2192, size: 64, offset: 128)
!2809 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !2803, file: !376, line: 114, baseType: !2810, size: 64, offset: 192)
!2810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !376, line: 41, size: 64, elements: !2811)
!2811 = !{!2812, !2813}
!2812 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !2810, file: !376, line: 42, baseType: !375, size: 32)
!2813 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !2810, file: !376, line: 43, baseType: !5, size: 32, offset: 32)
!2814 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !2803, file: !376, line: 117, baseType: !5, size: 32, offset: 256)
!2815 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !2803, file: !376, line: 120, baseType: !5, size: 32, offset: 288)
!2816 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !2803, file: !376, line: 123, baseType: !2789, size: 64, offset: 320)
!2817 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2803, file: !376, line: 126, baseType: !2802, size: 64, offset: 384)
!2818 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2803, file: !376, line: 129, baseType: !2802, size: 64, offset: 448)
!2819 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2803, file: !376, line: 132, baseType: !2344, size: 64, offset: 512)
!2820 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !2803, file: !376, line: 139, baseType: !2354, size: 64, offset: 576)
!2821 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !2803, file: !376, line: 143, baseType: !2402, size: 128, offset: 640)
!2822 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !2803, file: !376, line: 146, baseType: !2402, size: 128, offset: 768)
!2823 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !2803, file: !376, line: 148, baseType: !2166, size: 8, offset: 896)
!2824 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !2803, file: !376, line: 149, baseType: !2166, size: 8, offset: 904)
!2825 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !2803, file: !376, line: 153, baseType: !384, size: 32, offset: 928)
!2826 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !2803, file: !376, line: 156, baseType: !2827, size: 64, offset: 960)
!2827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2828, size: 64)
!2828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !376, line: 48, size: 320, elements: !2829)
!2829 = !{!2830, !2831, !2832, !2833}
!2830 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2828, file: !376, line: 50, baseType: !2167, size: 64)
!2831 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !2828, file: !376, line: 59, baseType: !2402, size: 128, offset: 64)
!2832 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !2828, file: !376, line: 64, baseType: !2166, size: 8, offset: 192)
!2833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2828, file: !376, line: 67, baseType: !2827, size: 64, offset: 256)
!2834 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !2803, file: !376, line: 159, baseType: !2835, size: 64, offset: 1024)
!2835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2836, size: 64)
!2836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !376, line: 72, size: 256, elements: !2837)
!2837 = !{!2838, !2839, !2840, !2841}
!2838 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !2836, file: !376, line: 74, baseType: !2209, size: 64)
!2839 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2836, file: !376, line: 77, baseType: !2835, size: 64, offset: 64)
!2840 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2836, file: !376, line: 78, baseType: !2835, size: 64, offset: 128)
!2841 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !2836, file: !376, line: 81, baseType: !2835, size: 64, offset: 192)
!2842 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !2803, file: !376, line: 162, baseType: !2166, size: 8, offset: 1088)
!2843 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !2803, file: !376, line: 166, baseType: !2354, size: 64, offset: 1152)
!2844 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !2785, file: !376, line: 197, baseType: !2648, size: 64, offset: 128)
!2845 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !2785, file: !376, line: 200, baseType: !2802, size: 64, offset: 192)
!2846 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !2605, file: !2606, line: 479, baseType: !2648, size: 64, offset: 320)
!2847 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2605, file: !2606, line: 484, baseType: !2354, size: 64, offset: 384)
!2848 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !2605, file: !2606, line: 488, baseType: !2354, size: 64, offset: 448)
!2849 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !2605, file: !2606, line: 493, baseType: !2354, size: 64, offset: 512)
!2850 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !2605, file: !2606, line: 496, baseType: !2354, size: 64, offset: 576)
!2851 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !2605, file: !2606, line: 501, baseType: !2852, size: 64, offset: 640)
!2852 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2853, size: 64)
!2853 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !2854)
!2854 = !{!2855, !2858, !2859, !2860, !2861, !2863, !2864, !2869, !2870, !2871, !2872, !2873, !2874}
!2855 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !2853, file: !144, line: 2356, baseType: !2856, size: 64)
!2856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2857, size: 64)
!2857 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!2858 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !2853, file: !144, line: 2357, baseType: !2259, size: 64, offset: 64)
!2859 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !2853, file: !144, line: 2358, baseType: !2256, size: 32, offset: 128)
!2860 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !2853, file: !144, line: 2359, baseType: !2256, size: 32, offset: 160)
!2861 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !2853, file: !144, line: 2360, baseType: !2862, size: 128, offset: 192)
!2862 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2256, size: 128, elements: !2333)
!2863 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !2853, file: !144, line: 2364, baseType: !2256, size: 32, offset: 320)
!2864 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !2853, file: !144, line: 2367, baseType: !2865, size: 128, offset: 384)
!2865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !2866)
!2866 = !{!2867, !2868}
!2867 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !2865, file: !144, line: 2351, baseType: !2233, size: 64)
!2868 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2865, file: !144, line: 2352, baseType: !2323, size: 64, offset: 64)
!2869 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !2853, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!2870 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !2853, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!2871 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !2853, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!2872 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !2853, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!2873 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !2853, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!2874 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !2853, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!2875 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !2605, file: !2606, line: 504, baseType: !2876, size: 64, offset: 704)
!2876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2877, size: 64)
!2877 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !2606, line: 504, flags: DIFlagFwdDecl)
!2878 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !2605, file: !2606, line: 507, baseType: !2648, size: 64, offset: 768)
!2879 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !2605, file: !2606, line: 510, baseType: !2256, size: 32, offset: 832)
!2880 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !2605, file: !2606, line: 513, baseType: !2256, size: 32, offset: 864)
!2881 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !2605, file: !2606, line: 516, baseType: !2186, size: 32, offset: 896)
!2882 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !2605, file: !2606, line: 519, baseType: !2186, size: 32, offset: 928)
!2883 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !2605, file: !2606, line: 522, baseType: !5, size: 32, offset: 960)
!2884 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !2605, file: !2606, line: 523, baseType: !5, size: 32, offset: 992)
!2885 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !2605, file: !2606, line: 528, baseType: !2259, size: 64, offset: 1024)
!2886 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !2605, file: !2606, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!2887 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !2605, file: !2606, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!2888 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !2605, file: !2606, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!2889 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !2605, file: !2606, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!2890 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !2605, file: !2606, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!2891 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !2605, file: !2606, line: 554, baseType: !5, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!2892 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !2605, file: !2606, line: 559, baseType: !5, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!2893 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !2605, file: !2606, line: 562, baseType: !5, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!2894 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !2605, file: !2606, line: 571, baseType: !5, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!2895 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !2605, file: !2606, line: 573, baseType: !5, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!2896 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !2605, file: !2606, line: 574, baseType: !5, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!2897 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !2605, file: !2606, line: 581, baseType: !5, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!2898 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !2605, file: !2606, line: 585, baseType: !5, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!2899 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !2605, file: !2606, line: 588, baseType: !5, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!2900 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !2605, file: !2606, line: 592, baseType: !5, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!2901 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !2605, file: !2606, line: 598, baseType: !5, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!2902 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !2600, file: !149, line: 3254, baseType: !2354, size: 64, offset: 1536)
!2903 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !2600, file: !149, line: 3257, baseType: !2354, size: 64, offset: 1600)
!2904 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !2600, file: !149, line: 3258, baseType: !2354, size: 64, offset: 1664)
!2905 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !2600, file: !149, line: 3264, baseType: !5, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!2906 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !2600, file: !149, line: 3265, baseType: !5, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!2907 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !2600, file: !149, line: 3267, baseType: !5, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!2908 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !2600, file: !149, line: 3268, baseType: !5, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!2909 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !2600, file: !149, line: 3269, baseType: !5, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!2910 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !2600, file: !149, line: 3271, baseType: !5, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!2911 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !2600, file: !149, line: 3272, baseType: !5, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!2912 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !2600, file: !149, line: 3273, baseType: !5, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!2913 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !2600, file: !149, line: 3274, baseType: !5, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!2914 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !2600, file: !149, line: 3275, baseType: !5, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
