; ModuleID = 'tree-ssa.bc'
source_filename = "tree-ssa.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.pointer_map_t = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!580 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!581 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!582 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!583 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!584 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!585 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!586 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!587 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!588 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!589 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!590 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!591 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!592 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!593 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!594 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!605 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!606 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !568, line: 727, baseType: !7, size: 32, elements: !607)
!607 = !{!608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631}
!608 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!609 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!610 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!611 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!612 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!613 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!614 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!615 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!616 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!631 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!632 = !{!633, !634, !635, !636, !639, !640, !642, !660, !183, !1987, !1988, !1989, !1532, !1992, !1998, !1444, !644, !7, !985, !2001, !1018, !637, !2003, !2022, !984, !787}
!633 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !634, size: 64)
!634 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!635 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !637, size: 64)
!637 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !638, size: 64)
!638 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !641, size: 64)
!641 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !638)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge_var_map_vector", file: !643, line: 563, baseType: !644)
!643 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_var_map_heap", file: !643, line: 560, baseType: !646)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_var_map_heap", file: !643, line: 560, size: 256, elements: !647)
!647 = !{!648}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !646, file: !643, line: 560, baseType: !649, size: 256)
!649 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_var_map_base", file: !643, line: 559, baseType: !650)
!650 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_var_map_base", file: !643, line: 559, size: 256, elements: !651)
!651 = !{!652, !653, !654}
!652 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !650, file: !643, line: 559, baseType: !7, size: 32)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !650, file: !643, line: 559, baseType: !7, size: 32, offset: 32)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !650, file: !643, line: 559, baseType: !655, size: 192, offset: 64)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 192, elements: !759)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge_var_map", file: !643, line: 557, baseType: !657)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_edge_var_map", file: !643, line: 552, size: 192, elements: !658)
!658 = !{!659, !1985, !1986}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !657, file: !643, line: 553, baseType: !660, size: 64)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !661, line: 56, baseType: !662)
!661 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!662 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!663 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !664)
!664 = !{!665, !698, !704, !717, !736, !747, !752, !761, !767, !780, !792, !830, !1321, !1349, !1365, !1366, !1371, !1380, !1386, !1391, !1395, !1399, !1636, !1683, !1689, !1695, !1702, !1715, !1729, !1746, !1758, !1780, !1795, !1967}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !663, file: !151, line: 3372, baseType: !666, size: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !666, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !666, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !666, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !666, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !666, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !666, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !666, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !666, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !666, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !666, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !666, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !666, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !666, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !666, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !666, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !666, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !666, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !666, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !666, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !666, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !666, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !666, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !666, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !666, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !666, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !666, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !666, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !666, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !666, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !666, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !663, file: !151, line: 3373, baseType: !699, size: 192)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !700)
!700 = !{!701, !702, !703}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !699, file: !151, line: 403, baseType: !666, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !699, file: !151, line: 404, baseType: !660, size: 64, offset: 64)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !699, file: !151, line: 405, baseType: !660, size: 64, offset: 128)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !663, file: !151, line: 3374, baseType: !705, size: 320)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !705, file: !151, line: 1385, baseType: !699, size: 192)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !705, file: !151, line: 1386, baseType: !709, size: 128, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !710, line: 58, baseType: !711)
!710 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !710, line: 54, size: 128, elements: !712)
!712 = !{!713, !715}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !711, file: !710, line: 56, baseType: !714, size: 64)
!714 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !711, file: !710, line: 57, baseType: !716, size: 64, offset: 64)
!716 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !663, file: !151, line: 3375, baseType: !718, size: 256)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !718, file: !151, line: 1398, baseType: !699, size: 192)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !718, file: !151, line: 1399, baseType: !722, size: 64, offset: 192)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !724, line: 52, size: 256, elements: !725)
!724 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!725 = !{!726, !727, !728, !729, !730, !731, !732}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !723, file: !724, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !723, file: !724, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !723, file: !724, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !723, file: !724, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !723, file: !724, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !723, file: !724, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !723, file: !724, line: 62, baseType: !733, size: 192, offset: 64)
!733 = !DICompositeType(tag: DW_TAG_array_type, baseType: !714, size: 192, elements: !734)
!734 = !{!735}
!735 = !DISubrange(count: 3)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !663, file: !151, line: 3376, baseType: !737, size: 256)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !738)
!738 = !{!739, !740}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !737, file: !151, line: 1409, baseType: !699, size: 192)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !737, file: !151, line: 1410, baseType: !741, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !742, size: 64)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !743, line: 27, size: 192, elements: !744)
!743 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !742, file: !743, line: 29, baseType: !709, size: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !742, file: !743, line: 30, baseType: !5, size: 32, offset: 128)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !663, file: !151, line: 3377, baseType: !748, size: 256)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !749)
!749 = !{!750, !751}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !151, line: 1438, baseType: !699, size: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !748, file: !151, line: 1439, baseType: !660, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !663, file: !151, line: 3378, baseType: !753, size: 256)
!753 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !754)
!754 = !{!755, !756, !757}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !753, file: !151, line: 1419, baseType: !699, size: 192)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !753, file: !151, line: 1420, baseType: !635, size: 32, offset: 192)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !753, file: !151, line: 1421, baseType: !758, size: 8, offset: 224)
!758 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 8, elements: !759)
!759 = !{!760}
!760 = !DISubrange(count: 1)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !663, file: !151, line: 3379, baseType: !762, size: 320)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !763)
!763 = !{!764, !765, !766}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !151, line: 1429, baseType: !699, size: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !762, file: !151, line: 1430, baseType: !660, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !762, file: !151, line: 1431, baseType: !660, size: 64, offset: 256)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !663, file: !151, line: 3380, baseType: !768, size: 320)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !769)
!769 = !{!770, !771}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !768, file: !151, line: 1461, baseType: !699, size: 192)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !768, file: !151, line: 1462, baseType: !772, size: 128, offset: 192)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !773, line: 31, size: 128, elements: !774)
!773 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!774 = !{!775, !778, !779}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !772, file: !773, line: 32, baseType: !776, size: 64)
!776 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !777, size: 64)
!777 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !634)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !772, file: !773, line: 33, baseType: !7, size: 32, offset: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !772, file: !773, line: 34, baseType: !7, size: 32, offset: 96)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !663, file: !151, line: 3381, baseType: !781, size: 384)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !782)
!782 = !{!783, !784, !789, !790, !791}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !151, line: 2508, baseType: !699, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !781, file: !151, line: 2509, baseType: !785, size: 32, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !786, line: 58, baseType: !787)
!786 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!787 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !788, line: 44, baseType: !7)
!788 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!789 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !781, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !781, file: !151, line: 2511, baseType: !660, size: 64, offset: 256)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !781, file: !151, line: 2512, baseType: !660, size: 64, offset: 320)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !663, file: !151, line: 3382, baseType: !793, size: 896)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !794)
!794 = !{!795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822, !823, !824, !825, !826, !827}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !793, file: !151, line: 2653, baseType: !781, size: 384)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !793, file: !151, line: 2654, baseType: !660, size: 64, offset: 384)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !793, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !793, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !793, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !793, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !793, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !793, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !793, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !793, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !793, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !793, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !793, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !793, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !793, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !793, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !793, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !793, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !793, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !793, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !793, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !793, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !793, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !793, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !793, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !793, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !793, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !793, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !793, file: !151, line: 2705, baseType: !660, size: 64, offset: 576)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !793, file: !151, line: 2706, baseType: !660, size: 64, offset: 640)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !793, file: !151, line: 2707, baseType: !660, size: 64, offset: 704)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !793, file: !151, line: 2708, baseType: !660, size: 64, offset: 768)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !793, file: !151, line: 2711, baseType: !828, size: 64, offset: 832)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !663, file: !151, line: 3383, baseType: !831, size: 960)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !831, file: !151, line: 2757, baseType: !793, size: 896)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !831, file: !151, line: 2758, baseType: !835, size: 64, offset: 896)
!835 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !661, line: 50, baseType: !836)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !838, line: 240, size: 384, elements: !839)
!838 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!839 = !{!840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !837, file: !838, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !837, file: !838, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !837, file: !838, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !837, file: !838, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !837, file: !838, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !837, file: !838, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !837, file: !838, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !837, file: !838, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !837, file: !838, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !837, file: !838, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !837, file: !838, line: 321, baseType: !851, size: 320, offset: 64)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !838, line: 315, size: 320, elements: !852)
!852 = !{!853, !1254, !1256, !1319, !1320}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !851, file: !838, line: 316, baseType: !854, size: 64)
!854 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 64, elements: !759)
!855 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !838, line: 183, baseType: !856)
!856 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !838, line: 166, size: 64, elements: !857)
!857 = !{!858, !859, !860, !861, !862, !870, !871, !883, !886, !946, !947, !1231, !1244, !1251}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !856, file: !838, line: 168, baseType: !635, size: 32)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !856, file: !838, line: 169, baseType: !7, size: 32)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !856, file: !838, line: 170, baseType: !640, size: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !856, file: !838, line: 171, baseType: !835, size: 64)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !856, file: !838, line: 172, baseType: !863, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !661, line: 53, baseType: !864)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !865, size: 64)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !838, line: 359, size: 128, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !865, file: !838, line: 360, baseType: !635, size: 32)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !865, file: !838, line: 361, baseType: !869, size: 64, offset: 64)
!869 = !DICompositeType(tag: DW_TAG_array_type, baseType: !835, size: 64, elements: !759)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !856, file: !838, line: 173, baseType: !5, size: 32)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !856, file: !838, line: 174, baseType: !872, size: 32)
!872 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !838, line: 133, baseType: !873)
!873 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !838, line: 115, size: 32, elements: !874)
!874 = !{!875, !876, !877, !878, !879, !880, !881, !882}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !873, file: !838, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !873, file: !838, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !873, file: !838, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !873, file: !838, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !873, file: !838, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !873, file: !838, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !873, file: !838, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !873, file: !838, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !856, file: !838, line: 175, baseType: !884, size: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !838, line: 175, flags: DIFlagFwdDecl)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !856, file: !838, line: 176, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !889, line: 75, size: 256, elements: !890)
!889 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!890 = !{!891, !905, !906, !907}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !888, file: !889, line: 76, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !889, line: 68, baseType: !894)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !889, line: 63, size: 320, elements: !895)
!895 = !{!896, !898, !899, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !894, file: !889, line: 64, baseType: !897, size: 64)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !894, size: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !894, file: !889, line: 65, baseType: !897, size: 64, offset: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !894, file: !889, line: 66, baseType: !7, size: 32, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !894, file: !889, line: 67, baseType: !901, size: 128, offset: 192)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 128, elements: !903)
!902 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !889, line: 29, baseType: !714)
!903 = !{!904}
!904 = !DISubrange(count: 2)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !888, file: !889, line: 77, baseType: !892, size: 64, offset: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !888, file: !889, line: 78, baseType: !7, size: 32, offset: 128)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !888, file: !889, line: 79, baseType: !908, size: 64, offset: 192)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !889, line: 49, baseType: !910)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !889, line: 45, size: 832, elements: !911)
!911 = !{!912, !913, !914}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !910, file: !889, line: 46, baseType: !897, size: 64)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !910, file: !889, line: 47, baseType: !887, size: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !910, file: !889, line: 48, baseType: !915, size: 704, offset: 128)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !916, line: 164, size: 704, elements: !917)
!916 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!917 = !{!918, !919, !929, !930, !931, !932, !933, !934, !938, !942, !943, !944, !945}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !915, file: !916, line: 166, baseType: !716, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !915, file: !916, line: 167, baseType: !920, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !916, line: 157, size: 192, elements: !922)
!922 = !{!923, !924, !925}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !921, file: !916, line: 159, baseType: !637, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !921, file: !916, line: 160, baseType: !920, size: 64, offset: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !921, file: !916, line: 161, baseType: !926, size: 32, offset: 128)
!926 = !DICompositeType(tag: DW_TAG_array_type, baseType: !638, size: 32, elements: !927)
!927 = !{!928}
!928 = !DISubrange(count: 4)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !915, file: !916, line: 168, baseType: !637, size: 64, offset: 128)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !915, file: !916, line: 169, baseType: !637, size: 64, offset: 192)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !915, file: !916, line: 170, baseType: !637, size: 64, offset: 256)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !915, file: !916, line: 171, baseType: !716, size: 64, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !915, file: !916, line: 172, baseType: !635, size: 32, offset: 384)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !915, file: !916, line: 176, baseType: !935, size: 64, offset: 448)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DISubroutineType(types: !937)
!937 = !{!920, !639, !716}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !915, file: !916, line: 177, baseType: !939, size: 64, offset: 512)
!939 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !940, size: 64)
!940 = !DISubroutineType(types: !941)
!941 = !{null, !639, !920}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !915, file: !916, line: 178, baseType: !639, size: 64, offset: 576)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !915, file: !916, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !915, file: !916, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !915, file: !916, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !856, file: !838, line: 177, baseType: !660, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !856, file: !838, line: 178, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !950)
!950 = !{!951, !1196, !1197, !1198, !1201, !1205, !1206, !1207, !1225, !1226, !1227, !1228, !1229, !1230}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !949, file: !135, line: 219, baseType: !952, size: 64)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !955)
!955 = !{!956}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !954, file: !135, line: 151, baseType: !957, size: 128)
!957 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !958)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !959)
!959 = !{!960, !961, !962}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !958, file: !135, line: 150, baseType: !7, size: 32)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !958, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !958, file: !135, line: 150, baseType: !963, size: 64, offset: 64)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 64, elements: !759)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !661, line: 108, baseType: !965)
!965 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !966, size: 64)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !967)
!967 = !{!968, !969, !970, !1188, !1189, !1190, !1191, !1192, !1193, !1194}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !966, file: !135, line: 124, baseType: !948, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !966, file: !135, line: 125, baseType: !948, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !966, file: !135, line: 131, baseType: !971, size: 64, offset: 128)
!971 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !972)
!972 = !{!973, !1187}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !971, file: !135, line: 129, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !661, line: 66, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !568, line: 143, size: 192, elements: !977)
!977 = !{!978, !1185, !1186}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !976, file: !568, line: 145, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !661, line: 69, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !568, line: 136, size: 192, elements: !982)
!982 = !{!983, !1183, !1184}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !981, file: !568, line: 137, baseType: !984, size: 64)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !661, line: 58, baseType: !985)
!985 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !986, size: 64)
!986 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !568, line: 737, size: 768, elements: !987)
!987 = !{!988, !1005, !1038, !1044, !1049, !1054, !1061, !1067, !1073, !1078, !1092, !1097, !1103, !1108, !1118, !1123, !1141, !1148, !1155, !1161, !1166, !1172, !1178}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !986, file: !568, line: 738, baseType: !989, size: 256)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !568, line: 271, size: 256, elements: !990)
!990 = !{!991, !992, !993, !994, !995, !996, !997, !998, !999, !1000, !1001, !1002, !1003, !1004}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !989, file: !568, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !989, file: !568, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !989, file: !568, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !989, file: !568, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !989, file: !568, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !989, file: !568, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !989, file: !568, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !989, file: !568, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !989, file: !568, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !989, file: !568, line: 312, baseType: !7, size: 32, offset: 32)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !989, file: !568, line: 316, baseType: !785, size: 32, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !989, file: !568, line: 319, baseType: !7, size: 32, offset: 96)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !989, file: !568, line: 323, baseType: !948, size: 64, offset: 128)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !989, file: !568, line: 327, baseType: !660, size: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !986, file: !568, line: 739, baseType: !1006, size: 448)
!1006 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !568, line: 350, size: 448, elements: !1007)
!1007 = !{!1008, !1036}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1006, file: !568, line: 353, baseType: !1009, size: 384)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !568, line: 333, size: 384, elements: !1010)
!1010 = !{!1011, !1012, !1019}
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1009, file: !568, line: 336, baseType: !989, size: 256)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1009, file: !568, line: 343, baseType: !1013, size: 64, offset: 256)
!1013 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1014, size: 64)
!1014 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !378, line: 37, size: 128, elements: !1015)
!1015 = !{!1016, !1017}
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1014, file: !378, line: 39, baseType: !1013, size: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1014, file: !378, line: 40, baseType: !1018, size: 64, offset: 64)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1009, file: !568, line: 344, baseType: !1020, size: 64, offset: 320)
!1020 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !378, line: 45, size: 320, elements: !1022)
!1022 = !{!1023, !1024}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1021, file: !378, line: 47, baseType: !1020, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1021, file: !378, line: 48, baseType: !1025, size: 256, offset: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1026)
!1026 = !{!1027, !1029, !1030, !1035}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1025, file: !151, line: 1884, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1025, file: !151, line: 1885, baseType: !1028, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1025, file: !151, line: 1891, baseType: !1031, size: 64, offset: 128)
!1031 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1025, file: !151, line: 1891, size: 64, elements: !1032)
!1032 = !{!1033, !1034}
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1031, file: !151, line: 1891, baseType: !984, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1031, file: !151, line: 1891, baseType: !660, size: 64)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1025, file: !151, line: 1892, baseType: !1018, size: 64, offset: 192)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1006, file: !568, line: 359, baseType: !1037, size: 64, offset: 384)
!1037 = !DICompositeType(tag: DW_TAG_array_type, baseType: !660, size: 64, elements: !759)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !986, file: !568, line: 740, baseType: !1039, size: 512)
!1039 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !568, line: 365, size: 512, elements: !1040)
!1040 = !{!1041, !1042, !1043}
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1039, file: !568, line: 368, baseType: !1009, size: 384)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1039, file: !568, line: 373, baseType: !660, size: 64, offset: 384)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1039, file: !568, line: 374, baseType: !660, size: 64, offset: 448)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !986, file: !568, line: 741, baseType: !1045, size: 576)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !568, line: 380, size: 576, elements: !1046)
!1046 = !{!1047, !1048}
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1045, file: !568, line: 383, baseType: !1039, size: 512)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1045, file: !568, line: 389, baseType: !1037, size: 64, offset: 512)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !986, file: !568, line: 742, baseType: !1050, size: 320)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !568, line: 395, size: 320, elements: !1051)
!1051 = !{!1052, !1053}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1050, file: !568, line: 397, baseType: !989, size: 256)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1050, file: !568, line: 400, baseType: !974, size: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !986, file: !568, line: 743, baseType: !1055, size: 448)
!1055 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !568, line: 406, size: 448, elements: !1056)
!1056 = !{!1057, !1058, !1059, !1060}
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1055, file: !568, line: 408, baseType: !989, size: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1055, file: !568, line: 412, baseType: !660, size: 64, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1055, file: !568, line: 420, baseType: !660, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1055, file: !568, line: 423, baseType: !974, size: 64, offset: 384)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !986, file: !568, line: 744, baseType: !1062, size: 384)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !568, line: 429, size: 384, elements: !1063)
!1063 = !{!1064, !1065, !1066}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1062, file: !568, line: 431, baseType: !989, size: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1062, file: !568, line: 434, baseType: !660, size: 64, offset: 256)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1062, file: !568, line: 437, baseType: !974, size: 64, offset: 320)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !986, file: !568, line: 745, baseType: !1068, size: 384)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !568, line: 443, size: 384, elements: !1069)
!1069 = !{!1070, !1071, !1072}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1068, file: !568, line: 445, baseType: !989, size: 256)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1068, file: !568, line: 449, baseType: !660, size: 64, offset: 256)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1068, file: !568, line: 453, baseType: !974, size: 64, offset: 320)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !986, file: !568, line: 746, baseType: !1074, size: 320)
!1074 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !568, line: 459, size: 320, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1074, file: !568, line: 461, baseType: !989, size: 256)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1074, file: !568, line: 464, baseType: !660, size: 64, offset: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !986, file: !568, line: 747, baseType: !1079, size: 768)
!1079 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !568, line: 469, size: 768, elements: !1080)
!1080 = !{!1081, !1082, !1083, !1084, !1085}
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1079, file: !568, line: 471, baseType: !989, size: 256)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1079, file: !568, line: 474, baseType: !7, size: 32, offset: 256)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1079, file: !568, line: 475, baseType: !7, size: 32, offset: 288)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1079, file: !568, line: 478, baseType: !660, size: 64, offset: 320)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1079, file: !568, line: 481, baseType: !1086, size: 384, offset: 384)
!1086 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1087, size: 384, elements: !759)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !151, line: 1917, size: 384, elements: !1088)
!1088 = !{!1089, !1090, !1091}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1087, file: !151, line: 1920, baseType: !1025, size: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1087, file: !151, line: 1921, baseType: !660, size: 64, offset: 256)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1087, file: !151, line: 1922, baseType: !785, size: 32, offset: 320)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !986, file: !568, line: 748, baseType: !1093, size: 320)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !568, line: 487, size: 320, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1093, file: !568, line: 490, baseType: !989, size: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1093, file: !568, line: 494, baseType: !635, size: 32, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !986, file: !568, line: 749, baseType: !1098, size: 384)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !568, line: 500, size: 384, elements: !1099)
!1099 = !{!1100, !1101, !1102}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1098, file: !568, line: 502, baseType: !989, size: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1098, file: !568, line: 506, baseType: !974, size: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1098, file: !568, line: 510, baseType: !974, size: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !986, file: !568, line: 750, baseType: !1104, size: 320)
!1104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !568, line: 529, size: 320, elements: !1105)
!1105 = !{!1106, !1107}
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1104, file: !568, line: 531, baseType: !989, size: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1104, file: !568, line: 540, baseType: !974, size: 64, offset: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !986, file: !568, line: 751, baseType: !1109, size: 704)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !568, line: 546, size: 704, elements: !1110)
!1110 = !{!1111, !1112, !1113, !1114, !1115, !1116, !1117}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1109, file: !568, line: 549, baseType: !1039, size: 512)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1109, file: !568, line: 553, baseType: !640, size: 64, offset: 512)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1109, file: !568, line: 557, baseType: !634, size: 8, offset: 576)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1109, file: !568, line: 558, baseType: !634, size: 8, offset: 584)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1109, file: !568, line: 559, baseType: !634, size: 8, offset: 592)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1109, file: !568, line: 560, baseType: !634, size: 8, offset: 600)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1109, file: !568, line: 566, baseType: !1037, size: 64, offset: 640)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !986, file: !568, line: 752, baseType: !1119, size: 384)
!1119 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !568, line: 571, size: 384, elements: !1120)
!1120 = !{!1121, !1122}
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1119, file: !568, line: 573, baseType: !1050, size: 320)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1119, file: !568, line: 577, baseType: !660, size: 64, offset: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !986, file: !568, line: 753, baseType: !1124, size: 576)
!1124 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !568, line: 600, size: 576, elements: !1125)
!1125 = !{!1126, !1127, !1128, !1131, !1140}
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1124, file: !568, line: 602, baseType: !1050, size: 320)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1124, file: !568, line: 605, baseType: !660, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1124, file: !568, line: 609, baseType: !1129, size: 64, offset: 384)
!1129 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1130, line: 46, baseType: !714)
!1130 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1124, file: !568, line: 612, baseType: !1132, size: 64, offset: 448)
!1132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1133, size: 64)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !568, line: 581, size: 320, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1139}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1133, file: !568, line: 583, baseType: !183, size: 32)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1133, file: !568, line: 586, baseType: !660, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1133, file: !568, line: 589, baseType: !660, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1133, file: !568, line: 592, baseType: !660, size: 64, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1133, file: !568, line: 595, baseType: !660, size: 64, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1124, file: !568, line: 616, baseType: !974, size: 64, offset: 512)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !986, file: !568, line: 754, baseType: !1142, size: 512)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !568, line: 622, size: 512, elements: !1143)
!1143 = !{!1144, !1145, !1146, !1147}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1142, file: !568, line: 624, baseType: !1050, size: 320)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1142, file: !568, line: 628, baseType: !660, size: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1142, file: !568, line: 632, baseType: !660, size: 64, offset: 384)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1142, file: !568, line: 636, baseType: !660, size: 64, offset: 448)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !986, file: !568, line: 755, baseType: !1149, size: 704)
!1149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !568, line: 642, size: 704, elements: !1150)
!1150 = !{!1151, !1152, !1153, !1154}
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1149, file: !568, line: 644, baseType: !1142, size: 512)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1149, file: !568, line: 648, baseType: !660, size: 64, offset: 512)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1149, file: !568, line: 652, baseType: !660, size: 64, offset: 576)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1149, file: !568, line: 653, baseType: !660, size: 64, offset: 640)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !986, file: !568, line: 756, baseType: !1156, size: 448)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !568, line: 663, size: 448, elements: !1157)
!1157 = !{!1158, !1159, !1160}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1156, file: !568, line: 665, baseType: !1050, size: 320)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1156, file: !568, line: 668, baseType: !660, size: 64, offset: 320)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1156, file: !568, line: 673, baseType: !660, size: 64, offset: 384)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !986, file: !568, line: 757, baseType: !1162, size: 384)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !568, line: 694, size: 384, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1162, file: !568, line: 696, baseType: !1050, size: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1162, file: !568, line: 699, baseType: !660, size: 64, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !986, file: !568, line: 758, baseType: !1167, size: 384)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !568, line: 681, size: 384, elements: !1168)
!1168 = !{!1169, !1170, !1171}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1167, file: !568, line: 683, baseType: !989, size: 256)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1167, file: !568, line: 686, baseType: !660, size: 64, offset: 256)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1167, file: !568, line: 689, baseType: !660, size: 64, offset: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !986, file: !568, line: 759, baseType: !1173, size: 384)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !568, line: 707, size: 384, elements: !1174)
!1174 = !{!1175, !1176, !1177}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1173, file: !568, line: 709, baseType: !989, size: 256)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1173, file: !568, line: 712, baseType: !660, size: 64, offset: 256)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1173, file: !568, line: 712, baseType: !660, size: 64, offset: 320)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !986, file: !568, line: 760, baseType: !1179, size: 320)
!1179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !568, line: 718, size: 320, elements: !1180)
!1180 = !{!1181, !1182}
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1179, file: !568, line: 720, baseType: !989, size: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1179, file: !568, line: 723, baseType: !660, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !981, file: !568, line: 138, baseType: !980, size: 64, offset: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !981, file: !568, line: 139, baseType: !980, size: 64, offset: 128)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !976, file: !568, line: 146, baseType: !979, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !976, file: !568, line: 152, baseType: !974, size: 64, offset: 128)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !971, file: !135, line: 130, baseType: !835, size: 64)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !966, file: !135, line: 134, baseType: !639, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !966, file: !135, line: 137, baseType: !660, size: 64, offset: 256)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !966, file: !135, line: 138, baseType: !785, size: 32, offset: 320)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !966, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !966, file: !135, line: 144, baseType: !635, size: 32, offset: 384)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !966, file: !135, line: 145, baseType: !635, size: 32, offset: 416)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !966, file: !135, line: 146, baseType: !1195, size: 64, offset: 448)
!1195 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !716)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !949, file: !135, line: 220, baseType: !952, size: 64, offset: 64)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !949, file: !135, line: 223, baseType: !639, size: 64, offset: 128)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !949, file: !135, line: 226, baseType: !1199, size: 64, offset: 192)
!1199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1200, size: 64)
!1200 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !135, line: 185, flags: DIFlagFwdDecl)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !949, file: !135, line: 229, baseType: !1202, size: 128, offset: 256)
!1202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1203, size: 128, elements: !903)
!1203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1204, size: 64)
!1204 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !949, file: !135, line: 232, baseType: !948, size: 64, offset: 384)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !949, file: !135, line: 233, baseType: !948, size: 64, offset: 448)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !949, file: !135, line: 238, baseType: !1208, size: 64, offset: 512)
!1208 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1209)
!1209 = !{!1210, !1216}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1208, file: !135, line: 236, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1212, size: 64)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1213)
!1213 = !{!1214, !1215}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1212, file: !135, line: 275, baseType: !974, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1212, file: !135, line: 278, baseType: !974, size: 64, offset: 64)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1208, file: !135, line: 237, baseType: !1217, size: 64)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1218, size: 64)
!1218 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1219)
!1219 = !{!1220, !1221, !1222, !1223, !1224}
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1218, file: !135, line: 261, baseType: !835, size: 64)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1218, file: !135, line: 262, baseType: !835, size: 64, offset: 64)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1218, file: !135, line: 266, baseType: !835, size: 64, offset: 128)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1218, file: !135, line: 267, baseType: !835, size: 64, offset: 192)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1218, file: !135, line: 270, baseType: !635, size: 32, offset: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !949, file: !135, line: 241, baseType: !1195, size: 64, offset: 576)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !949, file: !135, line: 244, baseType: !635, size: 32, offset: 640)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !949, file: !135, line: 247, baseType: !635, size: 32, offset: 672)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !949, file: !135, line: 250, baseType: !635, size: 32, offset: 704)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !949, file: !135, line: 253, baseType: !635, size: 32, offset: 736)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !949, file: !135, line: 256, baseType: !635, size: 32, offset: 768)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !856, file: !838, line: 179, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1233, size: 64)
!1233 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !838, line: 150, baseType: !1234)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !838, line: 142, size: 320, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239, !1242, !1243}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1234, file: !838, line: 144, baseType: !660, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1234, file: !838, line: 145, baseType: !835, size: 64, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1234, file: !838, line: 146, baseType: !835, size: 64, offset: 128)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1234, file: !838, line: 147, baseType: !1240, size: 32, offset: 192)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1241, line: 31, baseType: !635)
!1241 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1234, file: !838, line: 148, baseType: !7, size: 32, offset: 224)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1234, file: !838, line: 149, baseType: !634, size: 8, offset: 256)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !856, file: !838, line: 180, baseType: !1245, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !838, line: 162, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !838, line: 159, size: 128, elements: !1248)
!1248 = !{!1249, !1250}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1247, file: !838, line: 160, baseType: !660, size: 64)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1247, file: !838, line: 161, baseType: !716, size: 64, offset: 64)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !856, file: !838, line: 181, baseType: !1252, size: 64)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !838, line: 181, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !851, file: !838, line: 317, baseType: !1255, size: 64)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !716, size: 64, elements: !759)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !851, file: !838, line: 318, baseType: !1257, size: 320)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !838, line: 188, size: 320, elements: !1258)
!1258 = !{!1259, !1261, !1318}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1257, file: !838, line: 190, baseType: !1260, size: 192)
!1260 = !DICompositeType(tag: DW_TAG_array_type, baseType: !855, size: 192, elements: !734)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1257, file: !838, line: 193, baseType: !1262, size: 64, offset: 192)
!1262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1263, size: 64)
!1263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !838, line: 206, size: 320, elements: !1264)
!1264 = !{!1265, !1303, !1304, !1305, !1317}
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1263, file: !838, line: 208, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !661, line: 62, baseType: !1268)
!1268 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1269, line: 538, size: 256, elements: !1270)
!1269 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1270 = !{!1271, !1275, !1281, !1294}
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1268, file: !1269, line: 539, baseType: !1272, size: 32)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1269, line: 482, size: 32, elements: !1273)
!1273 = !{!1274}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1272, file: !1269, line: 484, baseType: !7, size: 32)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1268, file: !1269, line: 540, baseType: !1276, size: 192)
!1276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1269, line: 488, size: 192, elements: !1277)
!1277 = !{!1278, !1279, !1280}
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1276, file: !1269, line: 489, baseType: !1272, size: 32)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1276, file: !1269, line: 492, baseType: !640, size: 64, offset: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1276, file: !1269, line: 496, baseType: !660, size: 64, offset: 128)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1268, file: !1269, line: 541, baseType: !1282, size: 256)
!1282 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1269, line: 504, size: 256, elements: !1283)
!1283 = !{!1284, !1285, !1292, !1293}
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1282, file: !1269, line: 505, baseType: !1272, size: 32)
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1282, file: !1269, line: 509, baseType: !1286, size: 64, offset: 64)
!1286 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1269, line: 501, baseType: !1287)
!1287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1288, size: 64)
!1288 = !DISubroutineType(types: !1289)
!1289 = !{null, !1290}
!1290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1291, size: 64)
!1291 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1282, file: !1269, line: 510, baseType: !1290, size: 64, offset: 128)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1282, file: !1269, line: 513, baseType: !1266, size: 64, offset: 192)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1268, file: !1269, line: 542, baseType: !1295, size: 128)
!1295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1269, line: 530, size: 128, elements: !1296)
!1296 = !{!1297, !1298}
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1295, file: !1269, line: 531, baseType: !1272, size: 32)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1295, file: !1269, line: 534, baseType: !1299, size: 64, offset: 64)
!1299 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1269, line: 525, baseType: !1300)
!1300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1301, size: 64)
!1301 = !DISubroutineType(types: !1302)
!1302 = !{!634, !660, !640, !714, !714}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1263, file: !838, line: 211, baseType: !7, size: 32, offset: 64)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1263, file: !838, line: 214, baseType: !716, size: 64, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1263, file: !838, line: 224, baseType: !1306, size: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !838, line: 202, baseType: !1308)
!1308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !838, line: 202, size: 128, elements: !1309)
!1309 = !{!1310}
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1308, file: !838, line: 202, baseType: !1311, size: 128)
!1311 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !838, line: 200, baseType: !1312)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !838, line: 200, size: 128, elements: !1313)
!1313 = !{!1314, !1315, !1316}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1312, file: !838, line: 200, baseType: !7, size: 32)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1312, file: !838, line: 200, baseType: !7, size: 32, offset: 32)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1312, file: !838, line: 200, baseType: !869, size: 64, offset: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1263, file: !838, line: 234, baseType: !1306, size: 64, offset: 256)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1257, file: !838, line: 197, baseType: !716, size: 64, offset: 256)
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !851, file: !838, line: 319, baseType: !723, size: 256)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !851, file: !838, line: 320, baseType: !742, size: 192)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !663, file: !151, line: 3384, baseType: !1322, size: 1472)
!1322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1323)
!1323 = !{!1324, !1345, !1346, !1347, !1348}
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1322, file: !151, line: 3115, baseType: !1325, size: 1216)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1326)
!1326 = !{!1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1325, file: !151, line: 2985, baseType: !831, size: 960)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1325, file: !151, line: 2986, baseType: !660, size: 64, offset: 960)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1325, file: !151, line: 2987, baseType: !660, size: 64, offset: 1024)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1325, file: !151, line: 2988, baseType: !660, size: 64, offset: 1088)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1325, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1325, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1325, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1325, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1325, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1325, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1325, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1325, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1325, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1325, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1325, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1325, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1325, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1325, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1322, file: !151, line: 3117, baseType: !660, size: 64, offset: 1216)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1322, file: !151, line: 3119, baseType: !660, size: 64, offset: 1280)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1322, file: !151, line: 3121, baseType: !660, size: 64, offset: 1344)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1322, file: !151, line: 3123, baseType: !660, size: 64, offset: 1408)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !663, file: !151, line: 3385, baseType: !1350, size: 1088)
!1350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1351)
!1351 = !{!1352, !1353, !1354}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1350, file: !151, line: 2875, baseType: !831, size: 960)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1350, file: !151, line: 2876, baseType: !835, size: 64, offset: 960)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1350, file: !151, line: 2877, baseType: !1355, size: 64, offset: 1024)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !643, line: 172, size: 128, elements: !1357)
!1357 = !{!1358, !1359, !1360, !1361, !1362, !1363, !1364}
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1356, file: !643, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1356, file: !643, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1356, file: !643, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1356, file: !643, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1356, file: !643, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1356, file: !643, line: 195, baseType: !7, size: 32, offset: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1356, file: !643, line: 199, baseType: !660, size: 64, offset: 64)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !663, file: !151, line: 3386, baseType: !1325, size: 1216)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !663, file: !151, line: 3387, baseType: !1367, size: 1280)
!1367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1368)
!1368 = !{!1369, !1370}
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1367, file: !151, line: 3094, baseType: !1325, size: 1216)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1367, file: !151, line: 3095, baseType: !1355, size: 64, offset: 1216)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !663, file: !151, line: 3388, baseType: !1372, size: 1216)
!1372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1373)
!1373 = !{!1374, !1375, !1376, !1377, !1378, !1379}
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1372, file: !151, line: 2825, baseType: !793, size: 896)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1372, file: !151, line: 2827, baseType: !660, size: 64, offset: 896)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1372, file: !151, line: 2828, baseType: !660, size: 64, offset: 960)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1372, file: !151, line: 2829, baseType: !660, size: 64, offset: 1024)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1372, file: !151, line: 2830, baseType: !660, size: 64, offset: 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1372, file: !151, line: 2831, baseType: !660, size: 64, offset: 1152)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !663, file: !151, line: 3389, baseType: !1381, size: 1024)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1382)
!1382 = !{!1383, !1384, !1385}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1381, file: !151, line: 2851, baseType: !831, size: 960)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1381, file: !151, line: 2852, baseType: !635, size: 32, offset: 960)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1381, file: !151, line: 2853, baseType: !635, size: 32, offset: 992)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !663, file: !151, line: 3390, baseType: !1387, size: 1024)
!1387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1388)
!1388 = !{!1389, !1390}
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1387, file: !151, line: 2858, baseType: !831, size: 960)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1387, file: !151, line: 2859, baseType: !1355, size: 64, offset: 960)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !663, file: !151, line: 3391, baseType: !1392, size: 960)
!1392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1393)
!1393 = !{!1394}
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1392, file: !151, line: 2863, baseType: !831, size: 960)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !663, file: !151, line: 3392, baseType: !1396, size: 1472)
!1396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1397)
!1397 = !{!1398}
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1396, file: !151, line: 3305, baseType: !1322, size: 1472)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !663, file: !151, line: 3393, baseType: !1400, size: 1792)
!1400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1401)
!1401 = !{!1402, !1403, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631, !1632, !1633, !1634, !1635}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1400, file: !151, line: 3249, baseType: !1322, size: 1472)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1400, file: !151, line: 3251, baseType: !1404, size: 64, offset: 1472)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1406, line: 463, size: 1152, elements: !1407)
!1406 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1407 = !{!1408, !1411, !1442, !1443, !1556, !1559, !1560, !1561, !1562, !1563, !1564, !1588, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610, !1611, !1612, !1613, !1614}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1405, file: !1406, line: 464, baseType: !1409, size: 64)
!1409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1410, size: 64)
!1410 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1406, line: 464, flags: DIFlagFwdDecl)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1405, file: !1406, line: 467, baseType: !1412, size: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1413, size: 64)
!1413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1414)
!1414 = !{!1415, !1417, !1418, !1431, !1432, !1433, !1434, !1435, !1436, !1438, !1440, !1441}
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1413, file: !135, line: 377, baseType: !1416, size: 64)
!1416 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !661, line: 111, baseType: !948)
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1413, file: !135, line: 378, baseType: !1416, size: 64, offset: 64)
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1413, file: !135, line: 381, baseType: !1419, size: 64, offset: 128)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1421)
!1421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1422)
!1422 = !{!1423}
