; ModuleID = 'tree-ssa-loop-niter.bc'
source_filename = "tree-ssa-loop-niter.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!417 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!418 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!422 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!423 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!424 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!426 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!427 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !389, line: 727, baseType: !5, size: 32, elements: !428)
!428 = !{!429, !430, !431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452}
!429 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!430 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!431 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!432 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!433 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!434 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!435 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!436 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!452 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!453 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !389, line: 80, baseType: !5, size: 32, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!456 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!457 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!458 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !460, line: 119, baseType: !5, size: 32, elements: !461)
!460 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!461 = !{!462, !463, !464, !465}
!462 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!463 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!464 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!465 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!466 = !{!467, !468, !469, !470, !473, !474, !476, !132, !603, !5, !801, !1860, !834, !471, !453, !530, !478, !1862, !780, !1053, !1864, !1870, !1042}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!469 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !472)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !477, line: 56, baseType: !478)
!477 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !480)
!480 = !{!481, !514, !520, !533, !552, !563, !568, !577, !583, !596, !608, !646, !1190, !1218, !1235, !1236, !1241, !1250, !1256, !1261, !1265, !1269, !1511, !1558, !1564, !1570, !1577, !1590, !1604, !1621, !1633, !1655, !1670, !1842}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !479, file: !133, line: 3372, baseType: !482, size: 64)
!482 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !483)
!483 = !{!484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512, !513}
!484 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !482, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !482, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !482, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !482, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !482, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !482, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !482, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !482, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !482, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !482, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !482, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !482, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !482, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !482, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !482, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !482, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !482, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !482, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !482, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !482, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !482, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !482, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !482, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !482, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !482, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !482, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !482, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !482, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !482, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !482, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !479, file: !133, line: 3373, baseType: !515, size: 192)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !515, file: !133, line: 403, baseType: !482, size: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !515, file: !133, line: 404, baseType: !476, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !515, file: !133, line: 405, baseType: !476, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !479, file: !133, line: 3374, baseType: !521, size: 320)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !522)
!522 = !{!523, !524}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !521, file: !133, line: 1385, baseType: !515, size: 192)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !521, file: !133, line: 1386, baseType: !525, size: 128, offset: 192)
!525 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !526, line: 58, baseType: !527)
!526 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !526, line: 54, size: 128, elements: !528)
!528 = !{!529, !531}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !527, file: !526, line: 56, baseType: !530, size: 64)
!530 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !527, file: !526, line: 57, baseType: !532, size: 64, offset: 64)
!532 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !479, file: !133, line: 3375, baseType: !534, size: 256)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !535)
!535 = !{!536, !537}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !534, file: !133, line: 1398, baseType: !515, size: 192)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !534, file: !133, line: 1399, baseType: !538, size: 64, offset: 192)
!538 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !539, size: 64)
!539 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !540, line: 52, size: 256, elements: !541)
!540 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!541 = !{!542, !543, !544, !545, !546, !547, !548}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !539, file: !540, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !539, file: !540, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !539, file: !540, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !539, file: !540, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !539, file: !540, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !539, file: !540, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !539, file: !540, line: 62, baseType: !549, size: 192, offset: 64)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !530, size: 192, elements: !550)
!550 = !{!551}
!551 = !DISubrange(count: 3)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !479, file: !133, line: 3376, baseType: !553, size: 256)
!553 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !554)
!554 = !{!555, !556}
!555 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !553, file: !133, line: 1409, baseType: !515, size: 192)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !553, file: !133, line: 1410, baseType: !557, size: 64, offset: 192)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !559, line: 27, size: 192, elements: !560)
!559 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!560 = !{!561, !562}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !558, file: !559, line: 29, baseType: !525, size: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !558, file: !559, line: 30, baseType: !3, size: 32, offset: 128)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !479, file: !133, line: 3377, baseType: !564, size: 256)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !564, file: !133, line: 1438, baseType: !515, size: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !564, file: !133, line: 1439, baseType: !476, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !479, file: !133, line: 3378, baseType: !569, size: 256)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !570)
!570 = !{!571, !572, !573}
!571 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !569, file: !133, line: 1419, baseType: !515, size: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !569, file: !133, line: 1420, baseType: !469, size: 32, offset: 192)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !569, file: !133, line: 1421, baseType: !574, size: 8, offset: 224)
!574 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 8, elements: !575)
!575 = !{!576}
!576 = !DISubrange(count: 1)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !479, file: !133, line: 3379, baseType: !578, size: 320)
!578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !579)
!579 = !{!580, !581, !582}
!580 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !578, file: !133, line: 1429, baseType: !515, size: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !578, file: !133, line: 1430, baseType: !476, size: 64, offset: 192)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !578, file: !133, line: 1431, baseType: !476, size: 64, offset: 256)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !479, file: !133, line: 3380, baseType: !584, size: 320)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !585)
!585 = !{!586, !587}
!586 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !584, file: !133, line: 1461, baseType: !515, size: 192)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !584, file: !133, line: 1462, baseType: !588, size: 128, offset: 192)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !589, line: 31, size: 128, elements: !590)
!589 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!590 = !{!591, !594, !595}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !588, file: !589, line: 32, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !593, size: 64)
!593 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !468)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !588, file: !589, line: 33, baseType: !5, size: 32, offset: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !588, file: !589, line: 34, baseType: !5, size: 32, offset: 96)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !479, file: !133, line: 3381, baseType: !597, size: 384)
!597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !598)
!598 = !{!599, !600, !605, !606, !607}
!599 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !597, file: !133, line: 2508, baseType: !515, size: 192)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !597, file: !133, line: 2509, baseType: !601, size: 32, offset: 192)
!601 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !602, line: 58, baseType: !603)
!602 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !604, line: 44, baseType: !5)
!604 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!605 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !597, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !597, file: !133, line: 2511, baseType: !476, size: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !597, file: !133, line: 2512, baseType: !476, size: 64, offset: 320)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !479, file: !133, line: 3382, baseType: !609, size: 896)
!609 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !610)
!610 = !{!611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !609, file: !133, line: 2653, baseType: !597, size: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !609, file: !133, line: 2654, baseType: !476, size: 64, offset: 384)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !609, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !609, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !609, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !609, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !609, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !609, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !609, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !609, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !609, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !609, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !609, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !609, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !609, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !609, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !609, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !609, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !609, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !609, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !609, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !609, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !609, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !609, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !609, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !609, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !609, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !609, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !609, file: !133, line: 2705, baseType: !476, size: 64, offset: 576)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !609, file: !133, line: 2706, baseType: !476, size: 64, offset: 640)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !609, file: !133, line: 2707, baseType: !476, size: 64, offset: 704)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !609, file: !133, line: 2708, baseType: !476, size: 64, offset: 768)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !609, file: !133, line: 2711, baseType: !644, size: 64, offset: 832)
!644 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !645, size: 64)
!645 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !479, file: !133, line: 3383, baseType: !647, size: 960)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !648)
!648 = !{!649, !650}
!649 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !647, file: !133, line: 2757, baseType: !609, size: 896)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !647, file: !133, line: 2758, baseType: !651, size: 64, offset: 896)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !477, line: 50, baseType: !652)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !653, size: 64)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !654, line: 240, size: 384, elements: !655)
!654 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666}
!656 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !653, file: !654, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !653, file: !654, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !653, file: !654, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !653, file: !654, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !653, file: !654, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !653, file: !654, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !653, file: !654, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !653, file: !654, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !653, file: !654, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !653, file: !654, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !653, file: !654, line: 321, baseType: !667, size: 320, offset: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !654, line: 315, size: 320, elements: !668)
!668 = !{!669, !1123, !1125, !1188, !1189}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !667, file: !654, line: 316, baseType: !670, size: 64)
!670 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 64, elements: !575)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !654, line: 183, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !654, line: 166, size: 64, elements: !673)
!673 = !{!674, !675, !676, !677, !678, !686, !687, !699, !702, !762, !763, !1100, !1113, !1120}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !672, file: !654, line: 168, baseType: !469, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !672, file: !654, line: 169, baseType: !5, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !672, file: !654, line: 170, baseType: !474, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !672, file: !654, line: 171, baseType: !651, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !672, file: !654, line: 172, baseType: !679, size: 64)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !477, line: 53, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !654, line: 359, size: 128, elements: !682)
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !681, file: !654, line: 360, baseType: !469, size: 32)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !681, file: !654, line: 361, baseType: !685, size: 64, offset: 64)
!685 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 64, elements: !575)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !672, file: !654, line: 173, baseType: !3, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !672, file: !654, line: 174, baseType: !688, size: 32)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !654, line: 133, baseType: !689)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !654, line: 115, size: 32, elements: !690)
!690 = !{!691, !692, !693, !694, !695, !696, !697, !698}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !689, file: !654, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !689, file: !654, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !689, file: !654, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !689, file: !654, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !689, file: !654, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !689, file: !654, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !689, file: !654, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !689, file: !654, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !672, file: !654, line: 175, baseType: !700, size: 64)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !701, size: 64)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !654, line: 175, flags: DIFlagFwdDecl)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !672, file: !654, line: 176, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !705, line: 75, size: 256, elements: !706)
!705 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!706 = !{!707, !721, !722, !723}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !704, file: !705, line: 76, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !705, line: 68, baseType: !710)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !705, line: 63, size: 320, elements: !711)
!711 = !{!712, !714, !715, !716}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !710, file: !705, line: 64, baseType: !713, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !710, file: !705, line: 65, baseType: !713, size: 64, offset: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !710, file: !705, line: 66, baseType: !5, size: 32, offset: 128)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !710, file: !705, line: 67, baseType: !717, size: 128, offset: 192)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !718, size: 128, elements: !719)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !705, line: 29, baseType: !530)
!719 = !{!720}
!720 = !DISubrange(count: 2)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !704, file: !705, line: 77, baseType: !708, size: 64, offset: 64)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !704, file: !705, line: 78, baseType: !5, size: 32, offset: 128)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !704, file: !705, line: 79, baseType: !724, size: 64, offset: 192)
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !725, size: 64)
!725 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !705, line: 49, baseType: !726)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !705, line: 45, size: 832, elements: !727)
!727 = !{!728, !729, !730}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !726, file: !705, line: 46, baseType: !713, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !726, file: !705, line: 47, baseType: !703, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !726, file: !705, line: 48, baseType: !731, size: 704, offset: 128)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !732, line: 164, size: 704, elements: !733)
!732 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!733 = !{!734, !735, !745, !746, !747, !748, !749, !750, !754, !758, !759, !760, !761}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !731, file: !732, line: 166, baseType: !532, size: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !731, file: !732, line: 167, baseType: !736, size: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !732, line: 157, size: 192, elements: !738)
!738 = !{!739, !740, !741}
!739 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !737, file: !732, line: 159, baseType: !471, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !737, file: !732, line: 160, baseType: !736, size: 64, offset: 64)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !737, file: !732, line: 161, baseType: !742, size: 32, offset: 128)
!742 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 32, elements: !743)
!743 = !{!744}
!744 = !DISubrange(count: 4)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !731, file: !732, line: 168, baseType: !471, size: 64, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !731, file: !732, line: 169, baseType: !471, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !731, file: !732, line: 170, baseType: !471, size: 64, offset: 256)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !731, file: !732, line: 171, baseType: !532, size: 64, offset: 320)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !731, file: !732, line: 172, baseType: !469, size: 32, offset: 384)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !731, file: !732, line: 176, baseType: !751, size: 64, offset: 448)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = !DISubroutineType(types: !753)
!753 = !{!736, !473, !532}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !731, file: !732, line: 177, baseType: !755, size: 64, offset: 512)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !756, size: 64)
!756 = !DISubroutineType(types: !757)
!757 = !{null, !473, !736}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !731, file: !732, line: 178, baseType: !473, size: 64, offset: 576)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !731, file: !732, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !731, file: !732, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !731, file: !732, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !672, file: !654, line: 177, baseType: !476, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !672, file: !654, line: 178, baseType: !764, size: 64)
!764 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !765, size: 64)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !341, line: 217, size: 832, elements: !766)
!766 = !{!767, !1012, !1013, !1014, !1070, !1074, !1075, !1076, !1094, !1095, !1096, !1097, !1098, !1099}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !765, file: !341, line: 219, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !769, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !341, line: 151, baseType: !770)
!770 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !341, line: 151, size: 128, elements: !771)
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !770, file: !341, line: 151, baseType: !773, size: 128)
!773 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !341, line: 150, baseType: !774)
!774 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !341, line: 150, size: 128, elements: !775)
!775 = !{!776, !777, !778}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !774, file: !341, line: 150, baseType: !5, size: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !774, file: !341, line: 150, baseType: !5, size: 32, offset: 32)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !774, file: !341, line: 150, baseType: !779, size: 64, offset: 64)
!779 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 64, elements: !575)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !477, line: 108, baseType: !781)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !341, line: 122, size: 512, elements: !783)
!783 = !{!784, !785, !786, !1004, !1005, !1006, !1007, !1008, !1009, !1010}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !782, file: !341, line: 124, baseType: !764, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !782, file: !341, line: 125, baseType: !764, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !782, file: !341, line: 131, baseType: !787, size: 64, offset: 128)
!787 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !341, line: 128, size: 64, elements: !788)
!788 = !{!789, !1003}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !787, file: !341, line: 129, baseType: !790, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !477, line: 66, baseType: !791)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !389, line: 143, size: 192, elements: !793)
!793 = !{!794, !1001, !1002}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !792, file: !389, line: 145, baseType: !795, size: 64)
!795 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !477, line: 69, baseType: !796)
!796 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !797, size: 64)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !389, line: 136, size: 192, elements: !798)
!798 = !{!799, !999, !1000}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !797, file: !389, line: 137, baseType: !800, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !477, line: 58, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !389, line: 737, size: 768, elements: !803)
!803 = !{!804, !821, !854, !860, !865, !870, !877, !883, !889, !894, !908, !913, !919, !924, !934, !939, !957, !964, !971, !977, !982, !988, !994}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !802, file: !389, line: 738, baseType: !805, size: 256)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !389, line: 271, size: 256, elements: !806)
!806 = !{!807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !805, file: !389, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !805, file: !389, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !805, file: !389, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !805, file: !389, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !805, file: !389, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !805, file: !389, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !805, file: !389, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !805, file: !389, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !805, file: !389, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !805, file: !389, line: 312, baseType: !5, size: 32, offset: 32)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !805, file: !389, line: 316, baseType: !601, size: 32, offset: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !805, file: !389, line: 319, baseType: !5, size: 32, offset: 96)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !805, file: !389, line: 323, baseType: !764, size: 64, offset: 128)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !805, file: !389, line: 327, baseType: !476, size: 64, offset: 192)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !802, file: !389, line: 739, baseType: !822, size: 448)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !389, line: 350, size: 448, elements: !823)
!823 = !{!824, !852}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !822, file: !389, line: 353, baseType: !825, size: 384)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !389, line: 333, size: 384, elements: !826)
!826 = !{!827, !828, !835}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !825, file: !389, line: 336, baseType: !805, size: 256)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !825, file: !389, line: 343, baseType: !829, size: 64, offset: 256)
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !830, size: 64)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !460, line: 37, size: 128, elements: !831)
!831 = !{!832, !833}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !830, file: !460, line: 39, baseType: !829, size: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !830, file: !460, line: 40, baseType: !834, size: 64, offset: 64)
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !825, file: !389, line: 344, baseType: !836, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !460, line: 45, size: 320, elements: !838)
!838 = !{!839, !840}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !837, file: !460, line: 47, baseType: !836, size: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !837, file: !460, line: 48, baseType: !841, size: 256, offset: 64)
!841 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !842)
!842 = !{!843, !845, !846, !851}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !841, file: !133, line: 1884, baseType: !844, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !841, file: !133, line: 1885, baseType: !844, size: 64, offset: 64)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !841, file: !133, line: 1891, baseType: !847, size: 64, offset: 128)
!847 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !841, file: !133, line: 1891, size: 64, elements: !848)
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !847, file: !133, line: 1891, baseType: !800, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !847, file: !133, line: 1891, baseType: !476, size: 64)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !841, file: !133, line: 1892, baseType: !834, size: 64, offset: 192)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !822, file: !389, line: 359, baseType: !853, size: 64, offset: 384)
!853 = !DICompositeType(tag: DW_TAG_array_type, baseType: !476, size: 64, elements: !575)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !802, file: !389, line: 740, baseType: !855, size: 512)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !389, line: 365, size: 512, elements: !856)
!856 = !{!857, !858, !859}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !855, file: !389, line: 368, baseType: !825, size: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !855, file: !389, line: 373, baseType: !476, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !855, file: !389, line: 374, baseType: !476, size: 64, offset: 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !802, file: !389, line: 741, baseType: !861, size: 576)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !389, line: 380, size: 576, elements: !862)
!862 = !{!863, !864}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !861, file: !389, line: 383, baseType: !855, size: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !861, file: !389, line: 389, baseType: !853, size: 64, offset: 512)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !802, file: !389, line: 742, baseType: !866, size: 320)
!866 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !389, line: 395, size: 320, elements: !867)
!867 = !{!868, !869}
!868 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !866, file: !389, line: 397, baseType: !805, size: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !866, file: !389, line: 400, baseType: !790, size: 64, offset: 256)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !802, file: !389, line: 743, baseType: !871, size: 448)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !389, line: 406, size: 448, elements: !872)
!872 = !{!873, !874, !875, !876}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !871, file: !389, line: 408, baseType: !805, size: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !871, file: !389, line: 412, baseType: !476, size: 64, offset: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !871, file: !389, line: 420, baseType: !476, size: 64, offset: 320)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !871, file: !389, line: 423, baseType: !790, size: 64, offset: 384)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !802, file: !389, line: 744, baseType: !878, size: 384)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !389, line: 429, size: 384, elements: !879)
!879 = !{!880, !881, !882}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !878, file: !389, line: 431, baseType: !805, size: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !878, file: !389, line: 434, baseType: !476, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !878, file: !389, line: 437, baseType: !790, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !802, file: !389, line: 745, baseType: !884, size: 384)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !389, line: 443, size: 384, elements: !885)
!885 = !{!886, !887, !888}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !884, file: !389, line: 445, baseType: !805, size: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !884, file: !389, line: 449, baseType: !476, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !884, file: !389, line: 453, baseType: !790, size: 64, offset: 320)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !802, file: !389, line: 746, baseType: !890, size: 320)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !389, line: 459, size: 320, elements: !891)
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !890, file: !389, line: 461, baseType: !805, size: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !890, file: !389, line: 464, baseType: !476, size: 64, offset: 256)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !802, file: !389, line: 747, baseType: !895, size: 768)
!895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !389, line: 469, size: 768, elements: !896)
!896 = !{!897, !898, !899, !900, !901}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !895, file: !389, line: 471, baseType: !805, size: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !895, file: !389, line: 474, baseType: !5, size: 32, offset: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !895, file: !389, line: 475, baseType: !5, size: 32, offset: 288)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !895, file: !389, line: 478, baseType: !476, size: 64, offset: 320)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !895, file: !389, line: 481, baseType: !902, size: 384, offset: 384)
!902 = !DICompositeType(tag: DW_TAG_array_type, baseType: !903, size: 384, elements: !575)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !904)
!904 = !{!905, !906, !907}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !903, file: !133, line: 1920, baseType: !841, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !903, file: !133, line: 1921, baseType: !476, size: 64, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !903, file: !133, line: 1922, baseType: !601, size: 32, offset: 320)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !802, file: !389, line: 748, baseType: !909, size: 320)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !389, line: 487, size: 320, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !909, file: !389, line: 490, baseType: !805, size: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !909, file: !389, line: 494, baseType: !469, size: 32, offset: 256)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !802, file: !389, line: 749, baseType: !914, size: 384)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !389, line: 500, size: 384, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !914, file: !389, line: 502, baseType: !805, size: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !914, file: !389, line: 506, baseType: !790, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !914, file: !389, line: 510, baseType: !790, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !802, file: !389, line: 750, baseType: !920, size: 320)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !389, line: 529, size: 320, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !920, file: !389, line: 531, baseType: !805, size: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !920, file: !389, line: 540, baseType: !790, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !802, file: !389, line: 751, baseType: !925, size: 704)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !389, line: 546, size: 704, elements: !926)
!926 = !{!927, !928, !929, !930, !931, !932, !933}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !925, file: !389, line: 549, baseType: !855, size: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !925, file: !389, line: 553, baseType: !474, size: 64, offset: 512)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !925, file: !389, line: 557, baseType: !468, size: 8, offset: 576)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !925, file: !389, line: 558, baseType: !468, size: 8, offset: 584)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !925, file: !389, line: 559, baseType: !468, size: 8, offset: 592)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !925, file: !389, line: 560, baseType: !468, size: 8, offset: 600)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !925, file: !389, line: 566, baseType: !853, size: 64, offset: 640)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !802, file: !389, line: 752, baseType: !935, size: 384)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !389, line: 571, size: 384, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !935, file: !389, line: 573, baseType: !866, size: 320)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !935, file: !389, line: 577, baseType: !476, size: 64, offset: 320)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !802, file: !389, line: 753, baseType: !940, size: 576)
!940 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !389, line: 600, size: 576, elements: !941)
!941 = !{!942, !943, !944, !947, !956}
!942 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !940, file: !389, line: 602, baseType: !866, size: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !940, file: !389, line: 605, baseType: !476, size: 64, offset: 320)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !940, file: !389, line: 609, baseType: !945, size: 64, offset: 384)
!945 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !946, line: 46, baseType: !530)
!946 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!947 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !940, file: !389, line: 612, baseType: !948, size: 64, offset: 448)
!948 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !949, size: 64)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !389, line: 581, size: 320, elements: !950)
!950 = !{!951, !952, !953, !954, !955}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !949, file: !389, line: 583, baseType: !132, size: 32)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !949, file: !389, line: 586, baseType: !476, size: 64, offset: 64)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !949, file: !389, line: 589, baseType: !476, size: 64, offset: 128)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !949, file: !389, line: 592, baseType: !476, size: 64, offset: 192)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !949, file: !389, line: 595, baseType: !476, size: 64, offset: 256)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !940, file: !389, line: 616, baseType: !790, size: 64, offset: 512)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !802, file: !389, line: 754, baseType: !958, size: 512)
!958 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !389, line: 622, size: 512, elements: !959)
!959 = !{!960, !961, !962, !963}
!960 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !958, file: !389, line: 624, baseType: !866, size: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !958, file: !389, line: 628, baseType: !476, size: 64, offset: 320)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !958, file: !389, line: 632, baseType: !476, size: 64, offset: 384)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !958, file: !389, line: 636, baseType: !476, size: 64, offset: 448)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !802, file: !389, line: 755, baseType: !965, size: 704)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !389, line: 642, size: 704, elements: !966)
!966 = !{!967, !968, !969, !970}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !965, file: !389, line: 644, baseType: !958, size: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !965, file: !389, line: 648, baseType: !476, size: 64, offset: 512)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !965, file: !389, line: 652, baseType: !476, size: 64, offset: 576)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !965, file: !389, line: 653, baseType: !476, size: 64, offset: 640)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !802, file: !389, line: 756, baseType: !972, size: 448)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !389, line: 663, size: 448, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !972, file: !389, line: 665, baseType: !866, size: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !972, file: !389, line: 668, baseType: !476, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !972, file: !389, line: 673, baseType: !476, size: 64, offset: 384)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !802, file: !389, line: 757, baseType: !978, size: 384)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !389, line: 694, size: 384, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !978, file: !389, line: 696, baseType: !866, size: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !978, file: !389, line: 699, baseType: !476, size: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !802, file: !389, line: 758, baseType: !983, size: 384)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !389, line: 681, size: 384, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !983, file: !389, line: 683, baseType: !805, size: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !983, file: !389, line: 686, baseType: !476, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !983, file: !389, line: 689, baseType: !476, size: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !802, file: !389, line: 759, baseType: !989, size: 384)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !389, line: 707, size: 384, elements: !990)
!990 = !{!991, !992, !993}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !989, file: !389, line: 709, baseType: !805, size: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !989, file: !389, line: 712, baseType: !476, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !989, file: !389, line: 712, baseType: !476, size: 64, offset: 320)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !802, file: !389, line: 760, baseType: !995, size: 320)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !389, line: 718, size: 320, elements: !996)
!996 = !{!997, !998}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !995, file: !389, line: 720, baseType: !805, size: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !995, file: !389, line: 723, baseType: !476, size: 64, offset: 256)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !797, file: !389, line: 138, baseType: !796, size: 64, offset: 64)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !797, file: !389, line: 139, baseType: !796, size: 64, offset: 128)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !792, file: !389, line: 146, baseType: !795, size: 64, offset: 64)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !792, file: !389, line: 152, baseType: !790, size: 64, offset: 128)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !787, file: !341, line: 130, baseType: !651, size: 64)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !782, file: !341, line: 134, baseType: !473, size: 64, offset: 192)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !782, file: !341, line: 137, baseType: !476, size: 64, offset: 256)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !782, file: !341, line: 138, baseType: !601, size: 32, offset: 320)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !782, file: !341, line: 142, baseType: !5, size: 32, offset: 352)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !782, file: !341, line: 144, baseType: !469, size: 32, offset: 384)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !782, file: !341, line: 145, baseType: !469, size: 32, offset: 416)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !782, file: !341, line: 146, baseType: !1011, size: 64, offset: 448)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !341, line: 119, baseType: !532)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !765, file: !341, line: 220, baseType: !768, size: 64, offset: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !765, file: !341, line: 223, baseType: !473, size: 64, offset: 128)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !765, file: !341, line: 226, baseType: !1015, size: 64, offset: 192)
!1015 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1016, size: 64)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 100, size: 1216, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1027, !1028, !1029, !1043, !1044, !1045, !1046, !1047, !1048, !1049, !1050, !1051, !1052, !1060, !1068, !1069}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1016, file: !328, line: 102, baseType: !469, size: 32)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1016, file: !328, line: 105, baseType: !5, size: 32, offset: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1016, file: !328, line: 108, baseType: !764, size: 64, offset: 64)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1016, file: !328, line: 111, baseType: !764, size: 64, offset: 128)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1016, file: !328, line: 114, baseType: !1023, size: 64, offset: 192)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !328, line: 41, size: 64, elements: !1024)
!1024 = !{!1025, !1026}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1023, file: !328, line: 42, baseType: !327, size: 32)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1023, file: !328, line: 43, baseType: !5, size: 32, offset: 32)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1016, file: !328, line: 117, baseType: !5, size: 32, offset: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1016, file: !328, line: 120, baseType: !5, size: 32, offset: 288)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1016, file: !328, line: 123, baseType: !1030, size: 64, offset: 320)
!1030 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !328, line: 87, baseType: !1032)
!1032 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !328, line: 87, size: 128, elements: !1033)
!1033 = !{!1034}
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1032, file: !328, line: 87, baseType: !1035, size: 128)
!1035 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !328, line: 85, baseType: !1036)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !328, line: 85, size: 128, elements: !1037)
!1037 = !{!1038, !1039, !1040}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1036, file: !328, line: 85, baseType: !5, size: 32)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1036, file: !328, line: 85, baseType: !5, size: 32, offset: 32)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1036, file: !328, line: 85, baseType: !1041, size: 64, offset: 64)
!1041 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1042, size: 64, elements: !575)
!1042 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !328, line: 84, baseType: !1015)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1016, file: !328, line: 126, baseType: !1015, size: 64, offset: 384)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1016, file: !328, line: 129, baseType: !1015, size: 64, offset: 448)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1016, file: !328, line: 132, baseType: !473, size: 64, offset: 512)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1016, file: !328, line: 139, baseType: !476, size: 64, offset: 576)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1016, file: !328, line: 143, baseType: !525, size: 128, offset: 640)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1016, file: !328, line: 146, baseType: !525, size: 128, offset: 768)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1016, file: !328, line: 148, baseType: !468, size: 8, offset: 896)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1016, file: !328, line: 149, baseType: !468, size: 8, offset: 904)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1016, file: !328, line: 153, baseType: !336, size: 32, offset: 928)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1016, file: !328, line: 156, baseType: !1053, size: 64, offset: 960)
!1053 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1054, size: 64)
!1054 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !328, line: 48, size: 320, elements: !1055)
!1055 = !{!1056, !1057, !1058, !1059}
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1054, file: !328, line: 50, baseType: !800, size: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1054, file: !328, line: 59, baseType: !525, size: 128, offset: 64)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1054, file: !328, line: 64, baseType: !468, size: 8, offset: 192)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1054, file: !328, line: 67, baseType: !1053, size: 64, offset: 256)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1016, file: !328, line: 159, baseType: !1061, size: 64, offset: 1024)
!1061 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1062, size: 64)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !328, line: 72, size: 256, elements: !1063)
!1063 = !{!1064, !1065, !1066, !1067}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1062, file: !328, line: 74, baseType: !781, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1062, file: !328, line: 77, baseType: !1061, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1062, file: !328, line: 78, baseType: !1061, size: 64, offset: 128)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1062, file: !328, line: 81, baseType: !1061, size: 64, offset: 192)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1016, file: !328, line: 162, baseType: !468, size: 8, offset: 1088)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1016, file: !328, line: 166, baseType: !476, size: 64, offset: 1152)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !765, file: !341, line: 229, baseType: !1071, size: 128, offset: 256)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 128, elements: !719)
!1072 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1073, size: 64)
!1073 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !341, line: 229, flags: DIFlagFwdDecl)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !765, file: !341, line: 232, baseType: !764, size: 64, offset: 384)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !765, file: !341, line: 233, baseType: !764, size: 64, offset: 448)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !765, file: !341, line: 238, baseType: !1077, size: 64, offset: 512)
!1077 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !341, line: 235, size: 64, elements: !1078)
!1078 = !{!1079, !1085}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1077, file: !341, line: 236, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !341, line: 273, size: 128, elements: !1082)
!1082 = !{!1083, !1084}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1081, file: !341, line: 275, baseType: !790, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1081, file: !341, line: 278, baseType: !790, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1077, file: !341, line: 237, baseType: !1086, size: 64)
!1086 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1087, size: 64)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !341, line: 259, size: 320, elements: !1088)
!1088 = !{!1089, !1090, !1091, !1092, !1093}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1087, file: !341, line: 261, baseType: !651, size: 64)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1087, file: !341, line: 262, baseType: !651, size: 64, offset: 64)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1087, file: !341, line: 266, baseType: !651, size: 64, offset: 128)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1087, file: !341, line: 267, baseType: !651, size: 64, offset: 192)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1087, file: !341, line: 270, baseType: !469, size: 32, offset: 256)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !765, file: !341, line: 241, baseType: !1011, size: 64, offset: 576)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !765, file: !341, line: 244, baseType: !469, size: 32, offset: 640)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !765, file: !341, line: 247, baseType: !469, size: 32, offset: 672)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !765, file: !341, line: 250, baseType: !469, size: 32, offset: 704)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !765, file: !341, line: 253, baseType: !469, size: 32, offset: 736)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !765, file: !341, line: 256, baseType: !469, size: 32, offset: 768)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !672, file: !654, line: 179, baseType: !1101, size: 64)
!1101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1102, size: 64)
!1102 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !654, line: 150, baseType: !1103)
!1103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !654, line: 142, size: 320, elements: !1104)
!1104 = !{!1105, !1106, !1107, !1108, !1111, !1112}
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1103, file: !654, line: 144, baseType: !476, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1103, file: !654, line: 145, baseType: !651, size: 64, offset: 64)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1103, file: !654, line: 146, baseType: !651, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1103, file: !654, line: 147, baseType: !1109, size: 32, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1110, line: 31, baseType: !469)
!1110 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1103, file: !654, line: 148, baseType: !5, size: 32, offset: 224)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1103, file: !654, line: 149, baseType: !468, size: 8, offset: 256)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !672, file: !654, line: 180, baseType: !1114, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !654, line: 162, baseType: !1116)
!1116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !654, line: 159, size: 128, elements: !1117)
!1117 = !{!1118, !1119}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1116, file: !654, line: 160, baseType: !476, size: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1116, file: !654, line: 161, baseType: !532, size: 64, offset: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !672, file: !654, line: 181, baseType: !1121, size: 64)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !654, line: 181, flags: DIFlagFwdDecl)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !667, file: !654, line: 317, baseType: !1124, size: 64)
!1124 = !DICompositeType(tag: DW_TAG_array_type, baseType: !532, size: 64, elements: !575)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !667, file: !654, line: 318, baseType: !1126, size: 320)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !654, line: 188, size: 320, elements: !1127)
!1127 = !{!1128, !1130, !1187}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1126, file: !654, line: 190, baseType: !1129, size: 192)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !671, size: 192, elements: !550)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1126, file: !654, line: 193, baseType: !1131, size: 64, offset: 192)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !654, line: 206, size: 320, elements: !1133)
!1133 = !{!1134, !1172, !1173, !1174, !1186}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1132, file: !654, line: 208, baseType: !1135, size: 64)
!1135 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1136, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !477, line: 62, baseType: !1137)
!1137 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1138, line: 538, size: 256, elements: !1139)
!1138 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1139 = !{!1140, !1144, !1150, !1163}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !1138, line: 539, baseType: !1141, size: 32)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1138, line: 482, size: 32, elements: !1142)
!1142 = !{!1143}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1141, file: !1138, line: 484, baseType: !5, size: 32)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1137, file: !1138, line: 540, baseType: !1145, size: 192)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1138, line: 488, size: 192, elements: !1146)
!1146 = !{!1147, !1148, !1149}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1145, file: !1138, line: 489, baseType: !1141, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1145, file: !1138, line: 492, baseType: !474, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1145, file: !1138, line: 496, baseType: !476, size: 64, offset: 128)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1137, file: !1138, line: 541, baseType: !1151, size: 256)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1138, line: 504, size: 256, elements: !1152)
!1152 = !{!1153, !1154, !1161, !1162}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1151, file: !1138, line: 505, baseType: !1141, size: 32)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1151, file: !1138, line: 509, baseType: !1155, size: 64, offset: 64)
!1155 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1138, line: 501, baseType: !1156)
!1156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1157, size: 64)
!1157 = !DISubroutineType(types: !1158)
!1158 = !{null, !1159}
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1151, file: !1138, line: 510, baseType: !1159, size: 64, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1151, file: !1138, line: 513, baseType: !1135, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1137, file: !1138, line: 542, baseType: !1164, size: 128)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1138, line: 530, size: 128, elements: !1165)
!1165 = !{!1166, !1167}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1164, file: !1138, line: 531, baseType: !1141, size: 32)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1164, file: !1138, line: 534, baseType: !1168, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1138, line: 525, baseType: !1169)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DISubroutineType(types: !1171)
!1171 = !{!468, !476, !474, !530, !530}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1132, file: !654, line: 211, baseType: !5, size: 32, offset: 64)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1132, file: !654, line: 214, baseType: !532, size: 64, offset: 128)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1132, file: !654, line: 224, baseType: !1175, size: 64, offset: 192)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !654, line: 202, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !654, line: 202, size: 128, elements: !1178)
!1178 = !{!1179}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1177, file: !654, line: 202, baseType: !1180, size: 128)
!1180 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !654, line: 200, baseType: !1181)
!1181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !654, line: 200, size: 128, elements: !1182)
!1182 = !{!1183, !1184, !1185}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1181, file: !654, line: 200, baseType: !5, size: 32)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1181, file: !654, line: 200, baseType: !5, size: 32, offset: 32)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1181, file: !654, line: 200, baseType: !685, size: 64, offset: 64)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1132, file: !654, line: 234, baseType: !1175, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1126, file: !654, line: 197, baseType: !532, size: 64, offset: 256)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !667, file: !654, line: 319, baseType: !539, size: 256)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !667, file: !654, line: 320, baseType: !558, size: 192)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !479, file: !133, line: 3384, baseType: !1191, size: 1472)
!1191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1192)
!1192 = !{!1193, !1214, !1215, !1216, !1217}
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1191, file: !133, line: 3115, baseType: !1194, size: 1216)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1195)
!1195 = !{!1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209, !1210, !1211, !1212, !1213}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1194, file: !133, line: 2985, baseType: !647, size: 960)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1194, file: !133, line: 2986, baseType: !476, size: 64, offset: 960)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1194, file: !133, line: 2987, baseType: !476, size: 64, offset: 1024)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1194, file: !133, line: 2988, baseType: !476, size: 64, offset: 1088)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1194, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1194, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1194, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1194, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1194, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1194, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1194, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1194, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1194, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1194, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1194, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1194, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1194, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1194, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1191, file: !133, line: 3117, baseType: !476, size: 64, offset: 1216)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1191, file: !133, line: 3119, baseType: !476, size: 64, offset: 1280)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1191, file: !133, line: 3121, baseType: !476, size: 64, offset: 1344)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1191, file: !133, line: 3123, baseType: !476, size: 64, offset: 1408)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !479, file: !133, line: 3385, baseType: !1219, size: 1088)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1220)
!1220 = !{!1221, !1222, !1223}
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1219, file: !133, line: 2875, baseType: !647, size: 960)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1219, file: !133, line: 2876, baseType: !651, size: 64, offset: 960)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1219, file: !133, line: 2877, baseType: !1224, size: 64, offset: 1024)
!1224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1225, size: 64)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1226, line: 172, size: 128, elements: !1227)
!1226 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1227 = !{!1228, !1229, !1230, !1231, !1232, !1233, !1234}
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1225, file: !1226, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1225, file: !1226, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1225, file: !1226, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1225, file: !1226, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1225, file: !1226, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1225, file: !1226, line: 195, baseType: !5, size: 32, offset: 32)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1225, file: !1226, line: 199, baseType: !476, size: 64, offset: 64)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !479, file: !133, line: 3386, baseType: !1194, size: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !479, file: !133, line: 3387, baseType: !1237, size: 1280)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1238)
!1238 = !{!1239, !1240}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1237, file: !133, line: 3094, baseType: !1194, size: 1216)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1237, file: !133, line: 3095, baseType: !1224, size: 64, offset: 1216)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !479, file: !133, line: 3388, baseType: !1242, size: 1216)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247, !1248, !1249}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1242, file: !133, line: 2825, baseType: !609, size: 896)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1242, file: !133, line: 2827, baseType: !476, size: 64, offset: 896)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1242, file: !133, line: 2828, baseType: !476, size: 64, offset: 960)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1242, file: !133, line: 2829, baseType: !476, size: 64, offset: 1024)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1242, file: !133, line: 2830, baseType: !476, size: 64, offset: 1088)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1242, file: !133, line: 2831, baseType: !476, size: 64, offset: 1152)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !479, file: !133, line: 3389, baseType: !1251, size: 1024)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !1252)
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1251, file: !133, line: 2851, baseType: !647, size: 960)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1251, file: !133, line: 2852, baseType: !469, size: 32, offset: 960)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1251, file: !133, line: 2853, baseType: !469, size: 32, offset: 992)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !479, file: !133, line: 3390, baseType: !1257, size: 1024)
!1257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !1258)
!1258 = !{!1259, !1260}
