; ModuleID = 'tree-optimize.bc'
source_filename = "tree-optimize.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.simple_ipa_opt_pass = type { %struct.opt_pass }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }

!594 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!595 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!596 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!597 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!598 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!599 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!600 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!601 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!602 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!603 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!604 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!605 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!606 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!607 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!608 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!609 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!610 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!611 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!612 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!613 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!614 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!615 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!616 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!617 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!618 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!619 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !581, line: 727, baseType: !7, size: 32, elements: !620)
!620 = !{!621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644}
!621 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!624 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!625 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!626 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!627 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!628 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!629 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!630 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!631 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!632 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!633 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!634 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!635 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!636 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!637 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!638 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!639 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!640 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!641 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!642 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!643 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!644 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!645 = !{!646, !647, !648, !649, !652, !653, !386, !655, !980, !2138, !1014, !650}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!648 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!649 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !650, size: 64)
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !651, size: 64)
!651 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!652 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !654, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !651)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !656, line: 56, baseType: !657)
!656 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !354, line: 3371, size: 1792, elements: !659)
!659 = !{!660, !693, !699, !712, !731, !742, !747, !756, !762, !775, !787, !825, !1370, !1398, !1415, !1416, !1421, !1430, !1436, !1441, !1445, !1449, !1789, !1836, !1842, !1848, !1855, !1868, !1882, !1899, !1911, !1933, !1948, !2120}
!660 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !658, file: !354, line: 3372, baseType: !661, size: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !354, line: 360, size: 64, elements: !662)
!662 = !{!663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679, !680, !681, !682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !661, file: !354, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !661, file: !354, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !661, file: !354, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !661, file: !354, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !661, file: !354, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !661, file: !354, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !661, file: !354, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !661, file: !354, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !661, file: !354, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !661, file: !354, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !661, file: !354, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !661, file: !354, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !661, file: !354, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !661, file: !354, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !661, file: !354, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !661, file: !354, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !661, file: !354, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !661, file: !354, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !661, file: !354, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !661, file: !354, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !661, file: !354, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !661, file: !354, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !661, file: !354, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !661, file: !354, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !661, file: !354, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !661, file: !354, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !661, file: !354, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !661, file: !354, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !661, file: !354, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !661, file: !354, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !658, file: !354, line: 3373, baseType: !694, size: 192)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !354, line: 402, size: 192, elements: !695)
!695 = !{!696, !697, !698}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !694, file: !354, line: 403, baseType: !661, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !694, file: !354, line: 404, baseType: !655, size: 64, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !694, file: !354, line: 405, baseType: !655, size: 64, offset: 128)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !658, file: !354, line: 3374, baseType: !700, size: 320)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !354, line: 1384, size: 320, elements: !701)
!701 = !{!702, !703}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !700, file: !354, line: 1385, baseType: !694, size: 192)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !700, file: !354, line: 1386, baseType: !704, size: 128, offset: 192)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !705, line: 58, baseType: !706)
!705 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!706 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !705, line: 54, size: 128, elements: !707)
!707 = !{!708, !710}
!708 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !706, file: !705, line: 56, baseType: !709, size: 64)
!709 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !706, file: !705, line: 57, baseType: !711, size: 64, offset: 64)
!711 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !658, file: !354, line: 3375, baseType: !713, size: 256)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !354, line: 1397, size: 256, elements: !714)
!714 = !{!715, !716}
!715 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !713, file: !354, line: 1398, baseType: !694, size: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !713, file: !354, line: 1399, baseType: !717, size: 64, offset: 192)
!717 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !718, size: 64)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !719, line: 52, size: 256, elements: !720)
!719 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!720 = !{!721, !722, !723, !724, !725, !726, !727}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !718, file: !719, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !718, file: !719, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !718, file: !719, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !718, file: !719, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !718, file: !719, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !718, file: !719, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !718, file: !719, line: 62, baseType: !728, size: 192, offset: 64)
!728 = !DICompositeType(tag: DW_TAG_array_type, baseType: !709, size: 192, elements: !729)
!729 = !{!730}
!730 = !DISubrange(count: 3)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !658, file: !354, line: 3376, baseType: !732, size: 256)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !354, line: 1408, size: 256, elements: !733)
!733 = !{!734, !735}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !732, file: !354, line: 1409, baseType: !694, size: 192)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !732, file: !354, line: 1410, baseType: !736, size: 64, offset: 192)
!736 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !737, size: 64)
!737 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !738, line: 27, size: 192, elements: !739)
!738 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!739 = !{!740, !741}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !737, file: !738, line: 29, baseType: !704, size: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !737, file: !738, line: 30, baseType: !189, size: 32, offset: 128)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !658, file: !354, line: 3377, baseType: !743, size: 256)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !354, line: 1437, size: 256, elements: !744)
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !743, file: !354, line: 1438, baseType: !694, size: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !743, file: !354, line: 1439, baseType: !655, size: 64, offset: 192)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !658, file: !354, line: 3378, baseType: !748, size: 256)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !354, line: 1418, size: 256, elements: !749)
!749 = !{!750, !751, !752}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !748, file: !354, line: 1419, baseType: !694, size: 192)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !748, file: !354, line: 1420, baseType: !648, size: 32, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !748, file: !354, line: 1421, baseType: !753, size: 8, offset: 224)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 8, elements: !754)
!754 = !{!755}
!755 = !DISubrange(count: 1)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !658, file: !354, line: 3379, baseType: !757, size: 320)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !354, line: 1428, size: 320, elements: !758)
!758 = !{!759, !760, !761}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !757, file: !354, line: 1429, baseType: !694, size: 192)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !757, file: !354, line: 1430, baseType: !655, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !757, file: !354, line: 1431, baseType: !655, size: 64, offset: 256)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !658, file: !354, line: 3380, baseType: !763, size: 320)
!763 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !354, line: 1460, size: 320, elements: !764)
!764 = !{!765, !766}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !763, file: !354, line: 1461, baseType: !694, size: 192)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !763, file: !354, line: 1462, baseType: !767, size: 128, offset: 192)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !768, line: 31, size: 128, elements: !769)
!768 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!769 = !{!770, !773, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !767, file: !768, line: 32, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !647)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !767, file: !768, line: 33, baseType: !7, size: 32, offset: 64)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !767, file: !768, line: 34, baseType: !7, size: 32, offset: 96)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !658, file: !354, line: 3381, baseType: !776, size: 384)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !354, line: 2507, size: 384, elements: !777)
!777 = !{!778, !779, !784, !785, !786}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !776, file: !354, line: 2508, baseType: !694, size: 192)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !776, file: !354, line: 2509, baseType: !780, size: 32, offset: 192)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !781, line: 58, baseType: !782)
!781 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!782 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !783, line: 44, baseType: !7)
!783 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!784 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !776, file: !354, line: 2510, baseType: !7, size: 32, offset: 224)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !776, file: !354, line: 2511, baseType: !655, size: 64, offset: 256)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !776, file: !354, line: 2512, baseType: !655, size: 64, offset: 320)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !658, file: !354, line: 3382, baseType: !788, size: 896)
!788 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !354, line: 2652, size: 896, elements: !789)
!789 = !{!790, !791, !792, !793, !794, !795, !796, !797, !798, !799, !800, !801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819, !820, !821, !822}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !788, file: !354, line: 2653, baseType: !776, size: 384)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !788, file: !354, line: 2654, baseType: !655, size: 64, offset: 384)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !788, file: !354, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !788, file: !354, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !788, file: !354, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !788, file: !354, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !788, file: !354, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !788, file: !354, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !788, file: !354, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !788, file: !354, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !788, file: !354, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !788, file: !354, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !788, file: !354, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !788, file: !354, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !788, file: !354, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !788, file: !354, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !788, file: !354, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !788, file: !354, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !788, file: !354, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !788, file: !354, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !788, file: !354, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !788, file: !354, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !788, file: !354, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !788, file: !354, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !788, file: !354, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !788, file: !354, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !788, file: !354, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !788, file: !354, line: 2703, baseType: !7, size: 32, offset: 512)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !788, file: !354, line: 2705, baseType: !655, size: 64, offset: 576)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !788, file: !354, line: 2706, baseType: !655, size: 64, offset: 640)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !788, file: !354, line: 2707, baseType: !655, size: 64, offset: 704)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !788, file: !354, line: 2708, baseType: !655, size: 64, offset: 768)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !788, file: !354, line: 2711, baseType: !823, size: 64, offset: 832)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !354, line: 2711, flags: DIFlagFwdDecl)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !658, file: !354, line: 3383, baseType: !826, size: 960)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !354, line: 2756, size: 960, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !826, file: !354, line: 2757, baseType: !788, size: 896)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !826, file: !354, line: 2758, baseType: !830, size: 64, offset: 896)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !656, line: 50, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !833, line: 240, size: 384, elements: !834)
!833 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!834 = !{!835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845}
!835 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !832, file: !833, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !832, file: !833, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !832, file: !833, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !832, file: !833, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !832, file: !833, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !832, file: !833, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !832, file: !833, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !832, file: !833, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !832, file: !833, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !832, file: !833, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !832, file: !833, line: 321, baseType: !846, size: 320, offset: 64)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !833, line: 315, size: 320, elements: !847)
!847 = !{!848, !1303, !1305, !1368, !1369}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !846, file: !833, line: 316, baseType: !849, size: 64)
!849 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 64, elements: !754)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !833, line: 183, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !833, line: 166, size: 64, elements: !852)
!852 = !{!853, !854, !855, !856, !857, !865, !866, !878, !881, !941, !942, !1280, !1293, !1300}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !851, file: !833, line: 168, baseType: !648, size: 32)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !851, file: !833, line: 169, baseType: !7, size: 32)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !851, file: !833, line: 170, baseType: !653, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !851, file: !833, line: 171, baseType: !830, size: 64)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !851, file: !833, line: 172, baseType: !858, size: 64)
!858 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !656, line: 53, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !833, line: 359, size: 128, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !860, file: !833, line: 360, baseType: !648, size: 32)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !860, file: !833, line: 361, baseType: !864, size: 64, offset: 64)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !830, size: 64, elements: !754)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !851, file: !833, line: 173, baseType: !189, size: 32)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !851, file: !833, line: 174, baseType: !867, size: 32)
!867 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !833, line: 133, baseType: !868)
!868 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !833, line: 115, size: 32, elements: !869)
!869 = !{!870, !871, !872, !873, !874, !875, !876, !877}
!870 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !868, file: !833, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !868, file: !833, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !868, file: !833, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !868, file: !833, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !868, file: !833, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !868, file: !833, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !868, file: !833, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !868, file: !833, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !851, file: !833, line: 175, baseType: !879, size: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !880, size: 64)
!880 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !833, line: 175, flags: DIFlagFwdDecl)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !851, file: !833, line: 176, baseType: !882, size: 64)
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !883, size: 64)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !884, line: 75, size: 256, elements: !885)
!884 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!885 = !{!886, !900, !901, !902}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !883, file: !884, line: 76, baseType: !887, size: 64)
!887 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !888, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !884, line: 68, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !884, line: 63, size: 320, elements: !890)
!890 = !{!891, !893, !894, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !889, file: !884, line: 64, baseType: !892, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !889, file: !884, line: 65, baseType: !892, size: 64, offset: 64)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !889, file: !884, line: 66, baseType: !7, size: 32, offset: 128)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !889, file: !884, line: 67, baseType: !896, size: 128, offset: 192)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 128, elements: !898)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !884, line: 29, baseType: !709)
!898 = !{!899}
!899 = !DISubrange(count: 2)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !883, file: !884, line: 77, baseType: !887, size: 64, offset: 64)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !883, file: !884, line: 78, baseType: !7, size: 32, offset: 128)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !883, file: !884, line: 79, baseType: !903, size: 64, offset: 192)
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !904, size: 64)
!904 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !884, line: 49, baseType: !905)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !884, line: 45, size: 832, elements: !906)
!906 = !{!907, !908, !909}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !905, file: !884, line: 46, baseType: !892, size: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !905, file: !884, line: 47, baseType: !882, size: 64, offset: 64)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !905, file: !884, line: 48, baseType: !910, size: 704, offset: 128)
!910 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !911, line: 164, size: 704, elements: !912)
!911 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!912 = !{!913, !914, !924, !925, !926, !927, !928, !929, !933, !937, !938, !939, !940}
!913 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !910, file: !911, line: 166, baseType: !711, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !910, file: !911, line: 167, baseType: !915, size: 64, offset: 64)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !916, size: 64)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !911, line: 157, size: 192, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !916, file: !911, line: 159, baseType: !650, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !916, file: !911, line: 160, baseType: !915, size: 64, offset: 64)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !916, file: !911, line: 161, baseType: !921, size: 32, offset: 128)
!921 = !DICompositeType(tag: DW_TAG_array_type, baseType: !651, size: 32, elements: !922)
!922 = !{!923}
!923 = !DISubrange(count: 4)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !910, file: !911, line: 168, baseType: !650, size: 64, offset: 128)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !910, file: !911, line: 169, baseType: !650, size: 64, offset: 192)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !910, file: !911, line: 170, baseType: !650, size: 64, offset: 256)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !910, file: !911, line: 171, baseType: !711, size: 64, offset: 320)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !910, file: !911, line: 172, baseType: !648, size: 32, offset: 384)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !910, file: !911, line: 176, baseType: !930, size: 64, offset: 448)
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !931, size: 64)
!931 = !DISubroutineType(types: !932)
!932 = !{!915, !652, !711}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !910, file: !911, line: 177, baseType: !934, size: 64, offset: 512)
!934 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !935, size: 64)
!935 = !DISubroutineType(types: !936)
!936 = !{null, !652, !915}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !910, file: !911, line: 178, baseType: !652, size: 64, offset: 576)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !910, file: !911, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !910, file: !911, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !910, file: !911, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !851, file: !833, line: 177, baseType: !655, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !851, file: !833, line: 178, baseType: !943, size: 64)
!943 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !944, size: 64)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !325, line: 217, size: 832, elements: !945)
!945 = !{!946, !1192, !1193, !1194, !1250, !1254, !1255, !1256, !1274, !1275, !1276, !1277, !1278, !1279}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !944, file: !325, line: 219, baseType: !947, size: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !325, line: 151, baseType: !949)
!949 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !325, line: 151, size: 128, elements: !950)
!950 = !{!951}
!951 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !949, file: !325, line: 151, baseType: !952, size: 128)
!952 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !325, line: 150, baseType: !953)
!953 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !325, line: 150, size: 128, elements: !954)
!954 = !{!955, !956, !957}
!955 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !953, file: !325, line: 150, baseType: !7, size: 32)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !953, file: !325, line: 150, baseType: !7, size: 32, offset: 32)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !953, file: !325, line: 150, baseType: !958, size: 64, offset: 64)
!958 = !DICompositeType(tag: DW_TAG_array_type, baseType: !959, size: 64, elements: !754)
!959 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !656, line: 108, baseType: !960)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64)
!961 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !325, line: 122, size: 512, elements: !962)
!962 = !{!963, !964, !965, !1184, !1185, !1186, !1187, !1188, !1189, !1190}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !961, file: !325, line: 124, baseType: !943, size: 64)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !961, file: !325, line: 125, baseType: !943, size: 64, offset: 64)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !961, file: !325, line: 131, baseType: !966, size: 64, offset: 128)
!966 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !325, line: 128, size: 64, elements: !967)
!967 = !{!968, !1183}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !966, file: !325, line: 129, baseType: !969, size: 64)
!969 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !656, line: 66, baseType: !970)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !581, line: 143, size: 192, elements: !972)
!972 = !{!973, !1181, !1182}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !971, file: !581, line: 145, baseType: !974, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !656, line: 69, baseType: !975)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !581, line: 136, size: 192, elements: !977)
!977 = !{!978, !1179, !1180}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !976, file: !581, line: 137, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !656, line: 58, baseType: !980)
!980 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !981, size: 64)
!981 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !581, line: 737, size: 768, elements: !982)
!982 = !{!983, !1000, !1034, !1040, !1045, !1050, !1057, !1063, !1069, !1074, !1088, !1093, !1099, !1104, !1114, !1119, !1137, !1144, !1151, !1157, !1162, !1168, !1174}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !981, file: !581, line: 738, baseType: !984, size: 256)
!984 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !581, line: 271, size: 256, elements: !985)
!985 = !{!986, !987, !988, !989, !990, !991, !992, !993, !994, !995, !996, !997, !998, !999}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !984, file: !581, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !984, file: !581, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !984, file: !581, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !984, file: !581, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !984, file: !581, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !984, file: !581, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !984, file: !581, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !984, file: !581, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !984, file: !581, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !984, file: !581, line: 312, baseType: !7, size: 32, offset: 32)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !984, file: !581, line: 316, baseType: !780, size: 32, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !984, file: !581, line: 319, baseType: !7, size: 32, offset: 96)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !984, file: !581, line: 323, baseType: !943, size: 64, offset: 128)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !984, file: !581, line: 327, baseType: !655, size: 64, offset: 192)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !981, file: !581, line: 739, baseType: !1001, size: 448)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !581, line: 350, size: 448, elements: !1002)
!1002 = !{!1003, !1032}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1001, file: !581, line: 353, baseType: !1004, size: 384)
!1004 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !581, line: 333, size: 384, elements: !1005)
!1005 = !{!1006, !1007, !1015}
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1004, file: !581, line: 336, baseType: !984, size: 256)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1004, file: !581, line: 343, baseType: !1008, size: 64, offset: 256)
!1008 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1009, size: 64)
!1009 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1010, line: 37, size: 128, elements: !1011)
!1010 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1011 = !{!1012, !1013}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1009, file: !1010, line: 39, baseType: !1008, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1009, file: !1010, line: 40, baseType: !1014, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1004, file: !581, line: 344, baseType: !1016, size: 64, offset: 320)
!1016 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1017, size: 64)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1010, line: 45, size: 320, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1017, file: !1010, line: 47, baseType: !1016, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1017, file: !1010, line: 48, baseType: !1021, size: 256, offset: 64)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !354, line: 1883, size: 256, elements: !1022)
!1022 = !{!1023, !1025, !1026, !1031}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1021, file: !354, line: 1884, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1021, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1021, file: !354, line: 1885, baseType: !1024, size: 64, offset: 64)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1021, file: !354, line: 1891, baseType: !1027, size: 64, offset: 128)
!1027 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1021, file: !354, line: 1891, size: 64, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1027, file: !354, line: 1891, baseType: !979, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1027, file: !354, line: 1891, baseType: !655, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1021, file: !354, line: 1892, baseType: !1014, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1001, file: !581, line: 359, baseType: !1033, size: 64, offset: 384)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !655, size: 64, elements: !754)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !981, file: !581, line: 740, baseType: !1035, size: 512)
!1035 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !581, line: 365, size: 512, elements: !1036)
!1036 = !{!1037, !1038, !1039}
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1035, file: !581, line: 368, baseType: !1004, size: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1035, file: !581, line: 373, baseType: !655, size: 64, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1035, file: !581, line: 374, baseType: !655, size: 64, offset: 448)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !981, file: !581, line: 741, baseType: !1041, size: 576)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !581, line: 380, size: 576, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1041, file: !581, line: 383, baseType: !1035, size: 512)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1041, file: !581, line: 389, baseType: !1033, size: 64, offset: 512)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !981, file: !581, line: 742, baseType: !1046, size: 320)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !581, line: 395, size: 320, elements: !1047)
!1047 = !{!1048, !1049}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1046, file: !581, line: 397, baseType: !984, size: 256)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1046, file: !581, line: 400, baseType: !969, size: 64, offset: 256)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !981, file: !581, line: 743, baseType: !1051, size: 448)
!1051 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !581, line: 406, size: 448, elements: !1052)
!1052 = !{!1053, !1054, !1055, !1056}
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1051, file: !581, line: 408, baseType: !984, size: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1051, file: !581, line: 412, baseType: !655, size: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1051, file: !581, line: 420, baseType: !655, size: 64, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1051, file: !581, line: 423, baseType: !969, size: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !981, file: !581, line: 744, baseType: !1058, size: 384)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !581, line: 429, size: 384, elements: !1059)
!1059 = !{!1060, !1061, !1062}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1058, file: !581, line: 431, baseType: !984, size: 256)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1058, file: !581, line: 434, baseType: !655, size: 64, offset: 256)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1058, file: !581, line: 437, baseType: !969, size: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !981, file: !581, line: 745, baseType: !1064, size: 384)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !581, line: 443, size: 384, elements: !1065)
!1065 = !{!1066, !1067, !1068}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1064, file: !581, line: 445, baseType: !984, size: 256)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1064, file: !581, line: 449, baseType: !655, size: 64, offset: 256)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1064, file: !581, line: 453, baseType: !969, size: 64, offset: 320)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !981, file: !581, line: 746, baseType: !1070, size: 320)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !581, line: 459, size: 320, elements: !1071)
!1071 = !{!1072, !1073}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1070, file: !581, line: 461, baseType: !984, size: 256)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1070, file: !581, line: 464, baseType: !655, size: 64, offset: 256)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !981, file: !581, line: 747, baseType: !1075, size: 768)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !581, line: 469, size: 768, elements: !1076)
!1076 = !{!1077, !1078, !1079, !1080, !1081}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1075, file: !581, line: 471, baseType: !984, size: 256)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1075, file: !581, line: 474, baseType: !7, size: 32, offset: 256)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1075, file: !581, line: 475, baseType: !7, size: 32, offset: 288)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1075, file: !581, line: 478, baseType: !655, size: 64, offset: 320)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1075, file: !581, line: 481, baseType: !1082, size: 384, offset: 384)
!1082 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1083, size: 384, elements: !754)
!1083 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !354, line: 1917, size: 384, elements: !1084)
!1084 = !{!1085, !1086, !1087}
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1083, file: !354, line: 1920, baseType: !1021, size: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1083, file: !354, line: 1921, baseType: !655, size: 64, offset: 256)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1083, file: !354, line: 1922, baseType: !780, size: 32, offset: 320)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !981, file: !581, line: 748, baseType: !1089, size: 320)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !581, line: 487, size: 320, elements: !1090)
!1090 = !{!1091, !1092}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1089, file: !581, line: 490, baseType: !984, size: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1089, file: !581, line: 494, baseType: !648, size: 32, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !981, file: !581, line: 749, baseType: !1094, size: 384)
!1094 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !581, line: 500, size: 384, elements: !1095)
!1095 = !{!1096, !1097, !1098}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1094, file: !581, line: 502, baseType: !984, size: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1094, file: !581, line: 506, baseType: !969, size: 64, offset: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1094, file: !581, line: 510, baseType: !969, size: 64, offset: 320)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !981, file: !581, line: 750, baseType: !1100, size: 320)
!1100 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !581, line: 529, size: 320, elements: !1101)
!1101 = !{!1102, !1103}
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1100, file: !581, line: 531, baseType: !984, size: 256)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1100, file: !581, line: 540, baseType: !969, size: 64, offset: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !981, file: !581, line: 751, baseType: !1105, size: 704)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !581, line: 546, size: 704, elements: !1106)
!1106 = !{!1107, !1108, !1109, !1110, !1111, !1112, !1113}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1105, file: !581, line: 549, baseType: !1035, size: 512)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1105, file: !581, line: 553, baseType: !653, size: 64, offset: 512)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1105, file: !581, line: 557, baseType: !647, size: 8, offset: 576)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1105, file: !581, line: 558, baseType: !647, size: 8, offset: 584)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1105, file: !581, line: 559, baseType: !647, size: 8, offset: 592)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1105, file: !581, line: 560, baseType: !647, size: 8, offset: 600)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1105, file: !581, line: 566, baseType: !1033, size: 64, offset: 640)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !981, file: !581, line: 752, baseType: !1115, size: 384)
!1115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !581, line: 571, size: 384, elements: !1116)
!1116 = !{!1117, !1118}
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1115, file: !581, line: 573, baseType: !1046, size: 320)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1115, file: !581, line: 577, baseType: !655, size: 64, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !981, file: !581, line: 753, baseType: !1120, size: 576)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !581, line: 600, size: 576, elements: !1121)
!1121 = !{!1122, !1123, !1124, !1127, !1136}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1120, file: !581, line: 602, baseType: !1046, size: 320)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1120, file: !581, line: 605, baseType: !655, size: 64, offset: 320)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1120, file: !581, line: 609, baseType: !1125, size: 64, offset: 384)
!1125 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1126, line: 46, baseType: !709)
!1126 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1120, file: !581, line: 612, baseType: !1128, size: 64, offset: 448)
!1128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1129, size: 64)
!1129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !581, line: 581, size: 320, elements: !1130)
!1130 = !{!1131, !1132, !1133, !1134, !1135}
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1129, file: !581, line: 583, baseType: !386, size: 32)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1129, file: !581, line: 586, baseType: !655, size: 64, offset: 64)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1129, file: !581, line: 589, baseType: !655, size: 64, offset: 128)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1129, file: !581, line: 592, baseType: !655, size: 64, offset: 192)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1129, file: !581, line: 595, baseType: !655, size: 64, offset: 256)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1120, file: !581, line: 616, baseType: !969, size: 64, offset: 512)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !981, file: !581, line: 754, baseType: !1138, size: 512)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !581, line: 622, size: 512, elements: !1139)
!1139 = !{!1140, !1141, !1142, !1143}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1138, file: !581, line: 624, baseType: !1046, size: 320)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1138, file: !581, line: 628, baseType: !655, size: 64, offset: 320)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1138, file: !581, line: 632, baseType: !655, size: 64, offset: 384)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1138, file: !581, line: 636, baseType: !655, size: 64, offset: 448)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !981, file: !581, line: 755, baseType: !1145, size: 704)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !581, line: 642, size: 704, elements: !1146)
!1146 = !{!1147, !1148, !1149, !1150}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1145, file: !581, line: 644, baseType: !1138, size: 512)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1145, file: !581, line: 648, baseType: !655, size: 64, offset: 512)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1145, file: !581, line: 652, baseType: !655, size: 64, offset: 576)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1145, file: !581, line: 653, baseType: !655, size: 64, offset: 640)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !981, file: !581, line: 756, baseType: !1152, size: 448)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !581, line: 663, size: 448, elements: !1153)
!1153 = !{!1154, !1155, !1156}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1152, file: !581, line: 665, baseType: !1046, size: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1152, file: !581, line: 668, baseType: !655, size: 64, offset: 320)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1152, file: !581, line: 673, baseType: !655, size: 64, offset: 384)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !981, file: !581, line: 757, baseType: !1158, size: 384)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !581, line: 694, size: 384, elements: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1158, file: !581, line: 696, baseType: !1046, size: 320)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1158, file: !581, line: 699, baseType: !655, size: 64, offset: 320)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !981, file: !581, line: 758, baseType: !1163, size: 384)
!1163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !581, line: 681, size: 384, elements: !1164)
!1164 = !{!1165, !1166, !1167}
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1163, file: !581, line: 683, baseType: !984, size: 256)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1163, file: !581, line: 686, baseType: !655, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1163, file: !581, line: 689, baseType: !655, size: 64, offset: 320)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !981, file: !581, line: 759, baseType: !1169, size: 384)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !581, line: 707, size: 384, elements: !1170)
!1170 = !{!1171, !1172, !1173}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1169, file: !581, line: 709, baseType: !984, size: 256)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1169, file: !581, line: 712, baseType: !655, size: 64, offset: 256)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1169, file: !581, line: 712, baseType: !655, size: 64, offset: 320)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !981, file: !581, line: 760, baseType: !1175, size: 320)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !581, line: 718, size: 320, elements: !1176)
!1176 = !{!1177, !1178}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1175, file: !581, line: 720, baseType: !984, size: 256)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1175, file: !581, line: 723, baseType: !655, size: 64, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !976, file: !581, line: 138, baseType: !975, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !976, file: !581, line: 139, baseType: !975, size: 64, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !971, file: !581, line: 146, baseType: !974, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !971, file: !581, line: 152, baseType: !969, size: 64, offset: 128)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !966, file: !325, line: 130, baseType: !830, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !961, file: !325, line: 134, baseType: !652, size: 64, offset: 192)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !961, file: !325, line: 137, baseType: !655, size: 64, offset: 256)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !961, file: !325, line: 138, baseType: !780, size: 32, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !961, file: !325, line: 142, baseType: !7, size: 32, offset: 352)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !961, file: !325, line: 144, baseType: !648, size: 32, offset: 384)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !961, file: !325, line: 145, baseType: !648, size: 32, offset: 416)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !961, file: !325, line: 146, baseType: !1191, size: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !325, line: 119, baseType: !711)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !944, file: !325, line: 220, baseType: !947, size: 64, offset: 64)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !944, file: !325, line: 223, baseType: !652, size: 64, offset: 128)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !944, file: !325, line: 226, baseType: !1195, size: 64, offset: 192)
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !336, line: 100, size: 1216, elements: !1197)
!1197 = !{!1198, !1199, !1200, !1201, !1202, !1207, !1208, !1209, !1223, !1224, !1225, !1226, !1227, !1228, !1229, !1230, !1231, !1232, !1240, !1248, !1249}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1196, file: !336, line: 102, baseType: !648, size: 32)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1196, file: !336, line: 105, baseType: !7, size: 32, offset: 32)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1196, file: !336, line: 108, baseType: !943, size: 64, offset: 64)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1196, file: !336, line: 111, baseType: !943, size: 64, offset: 128)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1196, file: !336, line: 114, baseType: !1203, size: 64, offset: 192)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !336, line: 41, size: 64, elements: !1204)
!1204 = !{!1205, !1206}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1203, file: !336, line: 42, baseType: !335, size: 32)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1203, file: !336, line: 43, baseType: !7, size: 32, offset: 32)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1196, file: !336, line: 117, baseType: !7, size: 32, offset: 256)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1196, file: !336, line: 120, baseType: !7, size: 32, offset: 288)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1196, file: !336, line: 123, baseType: !1210, size: 64, offset: 320)
!1210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1211, size: 64)
!1211 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !336, line: 87, baseType: !1212)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !336, line: 87, size: 128, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1212, file: !336, line: 87, baseType: !1215, size: 128)
!1215 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !336, line: 85, baseType: !1216)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !336, line: 85, size: 128, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1216, file: !336, line: 85, baseType: !7, size: 32)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1216, file: !336, line: 85, baseType: !7, size: 32, offset: 32)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1216, file: !336, line: 85, baseType: !1221, size: 64, offset: 64)
!1221 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1222, size: 64, elements: !754)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !336, line: 84, baseType: !1195)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1196, file: !336, line: 126, baseType: !1195, size: 64, offset: 384)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1196, file: !336, line: 129, baseType: !1195, size: 64, offset: 448)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1196, file: !336, line: 132, baseType: !652, size: 64, offset: 512)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1196, file: !336, line: 139, baseType: !655, size: 64, offset: 576)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1196, file: !336, line: 143, baseType: !704, size: 128, offset: 640)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1196, file: !336, line: 146, baseType: !704, size: 128, offset: 768)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1196, file: !336, line: 148, baseType: !647, size: 8, offset: 896)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1196, file: !336, line: 149, baseType: !647, size: 8, offset: 904)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1196, file: !336, line: 153, baseType: !344, size: 32, offset: 928)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1196, file: !336, line: 156, baseType: !1233, size: 64, offset: 960)
!1233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1234, size: 64)
!1234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !336, line: 48, size: 320, elements: !1235)
!1235 = !{!1236, !1237, !1238, !1239}
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1234, file: !336, line: 50, baseType: !979, size: 64)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1234, file: !336, line: 59, baseType: !704, size: 128, offset: 64)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1234, file: !336, line: 64, baseType: !647, size: 8, offset: 192)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1234, file: !336, line: 67, baseType: !1233, size: 64, offset: 256)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1196, file: !336, line: 159, baseType: !1241, size: 64, offset: 1024)
!1241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1242, size: 64)
!1242 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !336, line: 72, size: 256, elements: !1243)
!1243 = !{!1244, !1245, !1246, !1247}
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1242, file: !336, line: 74, baseType: !960, size: 64)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1242, file: !336, line: 77, baseType: !1241, size: 64, offset: 64)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1242, file: !336, line: 78, baseType: !1241, size: 64, offset: 128)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1242, file: !336, line: 81, baseType: !1241, size: 64, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1196, file: !336, line: 162, baseType: !647, size: 8, offset: 1088)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1196, file: !336, line: 166, baseType: !655, size: 64, offset: 1152)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !944, file: !325, line: 229, baseType: !1251, size: 128, offset: 256)
!1251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1252, size: 128, elements: !898)
!1252 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1253, size: 64)
!1253 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !325, line: 229, flags: DIFlagFwdDecl)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !944, file: !325, line: 232, baseType: !943, size: 64, offset: 384)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !944, file: !325, line: 233, baseType: !943, size: 64, offset: 448)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !944, file: !325, line: 238, baseType: !1257, size: 64, offset: 512)
!1257 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !325, line: 235, size: 64, elements: !1258)
!1258 = !{!1259, !1265}
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1257, file: !325, line: 236, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !325, line: 273, size: 128, elements: !1262)
!1262 = !{!1263, !1264}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1261, file: !325, line: 275, baseType: !969, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1261, file: !325, line: 278, baseType: !969, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1257, file: !325, line: 237, baseType: !1266, size: 64)
!1266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1267, size: 64)
!1267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !325, line: 259, size: 320, elements: !1268)
!1268 = !{!1269, !1270, !1271, !1272, !1273}
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1267, file: !325, line: 261, baseType: !830, size: 64)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1267, file: !325, line: 262, baseType: !830, size: 64, offset: 64)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1267, file: !325, line: 266, baseType: !830, size: 64, offset: 128)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1267, file: !325, line: 267, baseType: !830, size: 64, offset: 192)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1267, file: !325, line: 270, baseType: !648, size: 32, offset: 256)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !944, file: !325, line: 241, baseType: !1191, size: 64, offset: 576)
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !944, file: !325, line: 244, baseType: !648, size: 32, offset: 640)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !944, file: !325, line: 247, baseType: !648, size: 32, offset: 672)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !944, file: !325, line: 250, baseType: !648, size: 32, offset: 704)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !944, file: !325, line: 253, baseType: !648, size: 32, offset: 736)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !944, file: !325, line: 256, baseType: !648, size: 32, offset: 768)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !851, file: !833, line: 179, baseType: !1281, size: 64)
!1281 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1282, size: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !833, line: 150, baseType: !1283)
!1283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !833, line: 142, size: 320, elements: !1284)
!1284 = !{!1285, !1286, !1287, !1288, !1291, !1292}
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1283, file: !833, line: 144, baseType: !655, size: 64)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1283, file: !833, line: 145, baseType: !830, size: 64, offset: 64)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1283, file: !833, line: 146, baseType: !830, size: 64, offset: 128)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1283, file: !833, line: 147, baseType: !1289, size: 32, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1290, line: 31, baseType: !648)
!1290 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1283, file: !833, line: 148, baseType: !7, size: 32, offset: 224)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1283, file: !833, line: 149, baseType: !647, size: 8, offset: 256)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !851, file: !833, line: 180, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !833, line: 162, baseType: !1296)
!1296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !833, line: 159, size: 128, elements: !1297)
!1297 = !{!1298, !1299}
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1296, file: !833, line: 160, baseType: !655, size: 64)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1296, file: !833, line: 161, baseType: !711, size: 64, offset: 64)
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !851, file: !833, line: 181, baseType: !1301, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1302, size: 64)
!1302 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !833, line: 181, flags: DIFlagFwdDecl)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !846, file: !833, line: 317, baseType: !1304, size: 64)
!1304 = !DICompositeType(tag: DW_TAG_array_type, baseType: !711, size: 64, elements: !754)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !846, file: !833, line: 318, baseType: !1306, size: 320)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !833, line: 188, size: 320, elements: !1307)
!1307 = !{!1308, !1310, !1367}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1306, file: !833, line: 190, baseType: !1309, size: 192)
!1309 = !DICompositeType(tag: DW_TAG_array_type, baseType: !850, size: 192, elements: !729)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1306, file: !833, line: 193, baseType: !1311, size: 64, offset: 192)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1312, size: 64)
!1312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !833, line: 206, size: 320, elements: !1313)
!1313 = !{!1314, !1352, !1353, !1354, !1366}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1312, file: !833, line: 208, baseType: !1315, size: 64)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !656, line: 62, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1318, line: 538, size: 256, elements: !1319)
!1318 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1319 = !{!1320, !1324, !1330, !1343}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1317, file: !1318, line: 539, baseType: !1321, size: 32)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1318, line: 482, size: 32, elements: !1322)
!1322 = !{!1323}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1321, file: !1318, line: 484, baseType: !7, size: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1317, file: !1318, line: 540, baseType: !1325, size: 192)
!1325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1318, line: 488, size: 192, elements: !1326)
!1326 = !{!1327, !1328, !1329}
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1325, file: !1318, line: 489, baseType: !1321, size: 32)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1325, file: !1318, line: 492, baseType: !653, size: 64, offset: 64)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1325, file: !1318, line: 496, baseType: !655, size: 64, offset: 128)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1317, file: !1318, line: 541, baseType: !1331, size: 256)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1318, line: 504, size: 256, elements: !1332)
!1332 = !{!1333, !1334, !1341, !1342}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1331, file: !1318, line: 505, baseType: !1321, size: 32)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1331, file: !1318, line: 509, baseType: !1335, size: 64, offset: 64)
!1335 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1318, line: 501, baseType: !1336)
!1336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1337, size: 64)
!1337 = !DISubroutineType(types: !1338)
!1338 = !{null, !1339}
!1339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1340, size: 64)
!1340 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1331, file: !1318, line: 510, baseType: !1339, size: 64, offset: 128)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1331, file: !1318, line: 513, baseType: !1315, size: 64, offset: 192)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1317, file: !1318, line: 542, baseType: !1344, size: 128)
!1344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1318, line: 530, size: 128, elements: !1345)
!1345 = !{!1346, !1347}
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1344, file: !1318, line: 531, baseType: !1321, size: 32)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1344, file: !1318, line: 534, baseType: !1348, size: 64, offset: 64)
!1348 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1318, line: 525, baseType: !1349)
!1349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1350, size: 64)
!1350 = !DISubroutineType(types: !1351)
!1351 = !{!647, !655, !653, !709, !709}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1312, file: !833, line: 211, baseType: !7, size: 32, offset: 64)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1312, file: !833, line: 214, baseType: !711, size: 64, offset: 128)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1312, file: !833, line: 224, baseType: !1355, size: 64, offset: 192)
!1355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1356, size: 64)
!1356 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !833, line: 202, baseType: !1357)
!1357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !833, line: 202, size: 128, elements: !1358)
!1358 = !{!1359}
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1357, file: !833, line: 202, baseType: !1360, size: 128)
!1360 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !833, line: 200, baseType: !1361)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !833, line: 200, size: 128, elements: !1362)
!1362 = !{!1363, !1364, !1365}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1361, file: !833, line: 200, baseType: !7, size: 32)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1361, file: !833, line: 200, baseType: !7, size: 32, offset: 32)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1361, file: !833, line: 200, baseType: !864, size: 64, offset: 64)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1312, file: !833, line: 234, baseType: !1355, size: 64, offset: 256)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1306, file: !833, line: 197, baseType: !711, size: 64, offset: 256)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !846, file: !833, line: 319, baseType: !718, size: 256)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !846, file: !833, line: 320, baseType: !737, size: 192)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !658, file: !354, line: 3384, baseType: !1371, size: 1472)
!1371 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !354, line: 3114, size: 1472, elements: !1372)
!1372 = !{!1373, !1394, !1395, !1396, !1397}
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1371, file: !354, line: 3115, baseType: !1374, size: 1216)
!1374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !354, line: 2984, size: 1216, elements: !1375)
!1375 = !{!1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387, !1388, !1389, !1390, !1391, !1392, !1393}
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1374, file: !354, line: 2985, baseType: !826, size: 960)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1374, file: !354, line: 2986, baseType: !655, size: 64, offset: 960)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1374, file: !354, line: 2987, baseType: !655, size: 64, offset: 1024)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1374, file: !354, line: 2988, baseType: !655, size: 64, offset: 1088)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1374, file: !354, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1374, file: !354, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1374, file: !354, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1374, file: !354, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1374, file: !354, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1374, file: !354, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1374, file: !354, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1374, file: !354, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1374, file: !354, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1374, file: !354, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1374, file: !354, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1374, file: !354, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1374, file: !354, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1374, file: !354, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1371, file: !354, line: 3117, baseType: !655, size: 64, offset: 1216)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1371, file: !354, line: 3119, baseType: !655, size: 64, offset: 1280)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1371, file: !354, line: 3121, baseType: !655, size: 64, offset: 1344)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1371, file: !354, line: 3123, baseType: !655, size: 64, offset: 1408)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !658, file: !354, line: 3385, baseType: !1399, size: 1088)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !354, line: 2874, size: 1088, elements: !1400)
!1400 = !{!1401, !1402, !1403}
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1399, file: !354, line: 2875, baseType: !826, size: 960)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1399, file: !354, line: 2876, baseType: !830, size: 64, offset: 960)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1399, file: !354, line: 2877, baseType: !1404, size: 64, offset: 1024)
!1404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1405, size: 64)
!1405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1406, line: 172, size: 128, elements: !1407)
!1406 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1407 = !{!1408, !1409, !1410, !1411, !1412, !1413, !1414}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1405, file: !1406, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1405, file: !1406, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1410 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1405, file: !1406, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1405, file: !1406, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1405, file: !1406, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1405, file: !1406, line: 195, baseType: !7, size: 32, offset: 32)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1405, file: !1406, line: 199, baseType: !655, size: 64, offset: 64)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !658, file: !354, line: 3386, baseType: !1374, size: 1216)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !658, file: !354, line: 3387, baseType: !1417, size: 1280)
!1417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !354, line: 3093, size: 1280, elements: !1418)
!1418 = !{!1419, !1420}
!1419 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1417, file: !354, line: 3094, baseType: !1374, size: 1216)
!1420 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1417, file: !354, line: 3095, baseType: !1404, size: 64, offset: 1216)
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !658, file: !354, line: 3388, baseType: !1422, size: 1216)
!1422 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !354, line: 2824, size: 1216, elements: !1423)
!1423 = !{!1424, !1425, !1426, !1427, !1428, !1429}
!1424 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1422, file: !354, line: 2825, baseType: !788, size: 896)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1422, file: !354, line: 2827, baseType: !655, size: 64, offset: 896)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1422, file: !354, line: 2828, baseType: !655, size: 64, offset: 960)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1422, file: !354, line: 2829, baseType: !655, size: 64, offset: 1024)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1422, file: !354, line: 2830, baseType: !655, size: 64, offset: 1088)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1422, file: !354, line: 2831, baseType: !655, size: 64, offset: 1152)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !658, file: !354, line: 3389, baseType: !1431, size: 1024)
!1431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !354, line: 2850, size: 1024, elements: !1432)
!1432 = !{!1433, !1434, !1435}
!1433 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1431, file: !354, line: 2851, baseType: !826, size: 960)
