; ModuleID = 'tree-data-ref.bc'
source_filename = "tree-data-ref.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!447 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !402, line: 727, baseType: !7, size: 32, elements: !448)
!448 = !{!449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459, !460, !461, !462, !463, !464, !465, !466, !467, !468, !469, !470, !471, !472}
!449 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!459 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!460 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!461 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!462 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!463 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!464 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!465 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!466 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!467 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!468 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!469 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!470 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!471 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!472 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!473 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !402, line: 80, baseType: !7, size: 32, elements: !474)
!474 = !{!475, !476, !477, !478}
!475 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!476 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!477 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!478 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!479 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omega_eqn_color", file: !480, line: 55, baseType: !7, size: 32, elements: !481)
!480 = !DIFile(filename: "./omega.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!481 = !{!482, !483}
!482 = !DIEnumerator(name: "omega_black", value: 0, isUnsigned: true)
!483 = !DIEnumerator(name: "omega_red", value: 1, isUnsigned: true)
!484 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "omega_result", file: !480, line: 41, baseType: !7, size: 32, elements: !485)
!485 = !{!486, !487, !488, !489}
!486 = !DIEnumerator(name: "omega_false", value: 0, isUnsigned: true)
!487 = !DIEnumerator(name: "omega_true", value: 1, isUnsigned: true)
!488 = !DIEnumerator(name: "omega_unknown", value: 2, isUnsigned: true)
!489 = !DIEnumerator(name: "omega_simplify", value: 3, isUnsigned: true)
!490 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "rdg_dep_type", file: !391, line: 514, baseType: !7, size: 32, elements: !491)
!491 = !{!492, !493, !494, !495}
!492 = !DIEnumerator(name: "flow_dd", value: 102, isUnsigned: true)
!493 = !DIEnumerator(name: "anti_dd", value: 97, isUnsigned: true)
!494 = !DIEnumerator(name: "output_dd", value: 111, isUnsigned: true)
!495 = !DIEnumerator(name: "input_dd", value: 105, isUnsigned: true)
!496 = !{!497, !498, !499, !500, !503, !504, !390, !506, !508, !1858, !196, !633, !1860, !1918, !1400, !1924, !1929, !1930, !1931, !1916, !1072, !831, !1979, !864, !501, !473, !1880, !7, !1932, !1952, !1939, !1956, !1981, !1951, !1917, !1969, !1993, !2010, !1895, !2022, !830, !2035, !2037, !2042, !2048, !2049, !2052}
!497 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !498, size: 64)
!498 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!499 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!500 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !501, size: 64)
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !505, size: 64)
!505 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !502)
!506 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !507, line: 56, baseType: !508)
!507 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !164, line: 3371, size: 1792, elements: !510)
!510 = !{!511, !544, !550, !563, !582, !593, !598, !607, !613, !626, !638, !676, !1186, !1214, !1231, !1232, !1237, !1246, !1252, !1257, !1261, !1265, !1509, !1556, !1562, !1568, !1575, !1588, !1602, !1619, !1631, !1653, !1668, !1840}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !509, file: !164, line: 3372, baseType: !512, size: 64)
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !164, line: 360, size: 64, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !512, file: !164, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !512, file: !164, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !512, file: !164, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !512, file: !164, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !512, file: !164, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !512, file: !164, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !512, file: !164, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !512, file: !164, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !512, file: !164, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !512, file: !164, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !512, file: !164, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !512, file: !164, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !512, file: !164, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !512, file: !164, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !512, file: !164, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !512, file: !164, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !512, file: !164, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !512, file: !164, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !512, file: !164, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !512, file: !164, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !512, file: !164, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !512, file: !164, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !512, file: !164, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !512, file: !164, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !512, file: !164, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !512, file: !164, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !512, file: !164, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !512, file: !164, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !512, file: !164, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !512, file: !164, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !509, file: !164, line: 3373, baseType: !545, size: 192)
!545 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !164, line: 402, size: 192, elements: !546)
!546 = !{!547, !548, !549}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !545, file: !164, line: 403, baseType: !512, size: 64)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !545, file: !164, line: 404, baseType: !506, size: 64, offset: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !545, file: !164, line: 405, baseType: !506, size: 64, offset: 128)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !509, file: !164, line: 3374, baseType: !551, size: 320)
!551 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !164, line: 1384, size: 320, elements: !552)
!552 = !{!553, !554}
!553 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !551, file: !164, line: 1385, baseType: !545, size: 192)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !551, file: !164, line: 1386, baseType: !555, size: 128, offset: 192)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !556, line: 58, baseType: !557)
!556 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !556, line: 54, size: 128, elements: !558)
!558 = !{!559, !561}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !557, file: !556, line: 56, baseType: !560, size: 64)
!560 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !557, file: !556, line: 57, baseType: !562, size: 64, offset: 64)
!562 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !509, file: !164, line: 3375, baseType: !564, size: 256)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !164, line: 1397, size: 256, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !564, file: !164, line: 1398, baseType: !545, size: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !564, file: !164, line: 1399, baseType: !568, size: 64, offset: 192)
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !570, line: 52, size: 256, elements: !571)
!570 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!571 = !{!572, !573, !574, !575, !576, !577, !578}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !569, file: !570, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !569, file: !570, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !569, file: !570, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !569, file: !570, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !569, file: !570, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !569, file: !570, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !569, file: !570, line: 62, baseType: !579, size: 192, offset: 64)
!579 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 192, elements: !580)
!580 = !{!581}
!581 = !DISubrange(count: 3)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !509, file: !164, line: 3376, baseType: !583, size: 256)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !164, line: 1408, size: 256, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !164, line: 1409, baseType: !545, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !583, file: !164, line: 1410, baseType: !587, size: 64, offset: 192)
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !589, line: 27, size: 192, elements: !590)
!589 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !588, file: !589, line: 29, baseType: !555, size: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !588, file: !589, line: 30, baseType: !5, size: 32, offset: 128)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !509, file: !164, line: 3377, baseType: !594, size: 256)
!594 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !164, line: 1437, size: 256, elements: !595)
!595 = !{!596, !597}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !594, file: !164, line: 1438, baseType: !545, size: 192)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !594, file: !164, line: 1439, baseType: !506, size: 64, offset: 192)
!598 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !509, file: !164, line: 3378, baseType: !599, size: 256)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !164, line: 1418, size: 256, elements: !600)
!600 = !{!601, !602, !603}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !599, file: !164, line: 1419, baseType: !545, size: 192)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !599, file: !164, line: 1420, baseType: !499, size: 32, offset: 192)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !599, file: !164, line: 1421, baseType: !604, size: 8, offset: 224)
!604 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 8, elements: !605)
!605 = !{!606}
!606 = !DISubrange(count: 1)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !509, file: !164, line: 3379, baseType: !608, size: 320)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !164, line: 1428, size: 320, elements: !609)
!609 = !{!610, !611, !612}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !164, line: 1429, baseType: !545, size: 192)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !608, file: !164, line: 1430, baseType: !506, size: 64, offset: 192)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !608, file: !164, line: 1431, baseType: !506, size: 64, offset: 256)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !509, file: !164, line: 3380, baseType: !614, size: 320)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !164, line: 1460, size: 320, elements: !615)
!615 = !{!616, !617}
!616 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !614, file: !164, line: 1461, baseType: !545, size: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !614, file: !164, line: 1462, baseType: !618, size: 128, offset: 192)
!618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !619, line: 31, size: 128, elements: !620)
!619 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!620 = !{!621, !624, !625}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !618, file: !619, line: 32, baseType: !622, size: 64)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !498)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !618, file: !619, line: 33, baseType: !7, size: 32, offset: 64)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !618, file: !619, line: 34, baseType: !7, size: 32, offset: 96)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !509, file: !164, line: 3381, baseType: !627, size: 384)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !164, line: 2507, size: 384, elements: !628)
!628 = !{!629, !630, !635, !636, !637}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !627, file: !164, line: 2508, baseType: !545, size: 192)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !627, file: !164, line: 2509, baseType: !631, size: 32, offset: 192)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !632, line: 58, baseType: !633)
!632 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !634, line: 44, baseType: !7)
!634 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!635 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !627, file: !164, line: 2510, baseType: !7, size: 32, offset: 224)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !627, file: !164, line: 2511, baseType: !506, size: 64, offset: 256)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !627, file: !164, line: 2512, baseType: !506, size: 64, offset: 320)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !509, file: !164, line: 3382, baseType: !639, size: 896)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !164, line: 2652, size: 896, elements: !640)
!640 = !{!641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673}
!641 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !639, file: !164, line: 2653, baseType: !627, size: 384)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !639, file: !164, line: 2654, baseType: !506, size: 64, offset: 384)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !639, file: !164, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !639, file: !164, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !639, file: !164, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !639, file: !164, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !639, file: !164, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !639, file: !164, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !639, file: !164, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !639, file: !164, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !639, file: !164, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !639, file: !164, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !639, file: !164, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !639, file: !164, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !639, file: !164, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !639, file: !164, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !639, file: !164, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !639, file: !164, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !639, file: !164, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !639, file: !164, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !639, file: !164, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !639, file: !164, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !639, file: !164, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !639, file: !164, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !639, file: !164, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !639, file: !164, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !639, file: !164, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !639, file: !164, line: 2703, baseType: !7, size: 32, offset: 512)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !639, file: !164, line: 2705, baseType: !506, size: 64, offset: 576)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !639, file: !164, line: 2706, baseType: !506, size: 64, offset: 640)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !639, file: !164, line: 2707, baseType: !506, size: 64, offset: 704)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !639, file: !164, line: 2708, baseType: !506, size: 64, offset: 768)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !639, file: !164, line: 2711, baseType: !674, size: 64, offset: 832)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !164, line: 2711, flags: DIFlagFwdDecl)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !509, file: !164, line: 3383, baseType: !677, size: 960)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !164, line: 2756, size: 960, elements: !678)
!678 = !{!679, !680}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !677, file: !164, line: 2757, baseType: !639, size: 896)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !677, file: !164, line: 2758, baseType: !681, size: 64, offset: 896)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !507, line: 50, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !684, line: 240, size: 384, elements: !685)
!684 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!685 = !{!686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !683, file: !684, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !683, file: !684, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !683, file: !684, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !683, file: !684, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !683, file: !684, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !683, file: !684, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !683, file: !684, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !683, file: !684, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !683, file: !684, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !683, file: !684, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !683, file: !684, line: 321, baseType: !697, size: 320, offset: 64)
!697 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !684, line: 315, size: 320, elements: !698)
!698 = !{!699, !1153, !1155, !1184, !1185}
!699 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !697, file: !684, line: 316, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 64, elements: !605)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !684, line: 183, baseType: !702)
!702 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !684, line: 166, size: 64, elements: !703)
!703 = !{!704, !705, !706, !707, !708, !716, !717, !729, !732, !792, !793, !1130, !1143, !1150}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !702, file: !684, line: 168, baseType: !499, size: 32)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !702, file: !684, line: 169, baseType: !7, size: 32)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !702, file: !684, line: 170, baseType: !504, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !702, file: !684, line: 171, baseType: !681, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !702, file: !684, line: 172, baseType: !709, size: 64)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !507, line: 53, baseType: !710)
!710 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !711, size: 64)
!711 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !684, line: 359, size: 128, elements: !712)
!712 = !{!713, !714}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !711, file: !684, line: 360, baseType: !499, size: 32)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !711, file: !684, line: 361, baseType: !715, size: 64, offset: 64)
!715 = !DICompositeType(tag: DW_TAG_array_type, baseType: !681, size: 64, elements: !605)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !702, file: !684, line: 173, baseType: !5, size: 32)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !702, file: !684, line: 174, baseType: !718, size: 32)
!718 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !684, line: 133, baseType: !719)
!719 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !684, line: 115, size: 32, elements: !720)
!720 = !{!721, !722, !723, !724, !725, !726, !727, !728}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !719, file: !684, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !719, file: !684, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !719, file: !684, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !719, file: !684, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !719, file: !684, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !719, file: !684, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !719, file: !684, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !719, file: !684, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !702, file: !684, line: 175, baseType: !730, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !684, line: 175, flags: DIFlagFwdDecl)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !702, file: !684, line: 176, baseType: !733, size: 64)
!733 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !734, size: 64)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !735, line: 75, size: 256, elements: !736)
!735 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!736 = !{!737, !751, !752, !753}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !734, file: !735, line: 76, baseType: !738, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !739, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !735, line: 68, baseType: !740)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !735, line: 63, size: 320, elements: !741)
!741 = !{!742, !744, !745, !746}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !740, file: !735, line: 64, baseType: !743, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !740, size: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !740, file: !735, line: 65, baseType: !743, size: 64, offset: 64)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !740, file: !735, line: 66, baseType: !7, size: 32, offset: 128)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !740, file: !735, line: 67, baseType: !747, size: 128, offset: 192)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !748, size: 128, elements: !749)
!748 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !735, line: 29, baseType: !560)
!749 = !{!750}
!750 = !DISubrange(count: 2)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !734, file: !735, line: 77, baseType: !738, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !734, file: !735, line: 78, baseType: !7, size: 32, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !734, file: !735, line: 79, baseType: !754, size: 64, offset: 192)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !735, line: 49, baseType: !756)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !735, line: 45, size: 832, elements: !757)
!757 = !{!758, !759, !760}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !756, file: !735, line: 46, baseType: !743, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !756, file: !735, line: 47, baseType: !733, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !756, file: !735, line: 48, baseType: !761, size: 704, offset: 128)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !762, line: 164, size: 704, elements: !763)
!762 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!763 = !{!764, !765, !775, !776, !777, !778, !779, !780, !784, !788, !789, !790, !791}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !761, file: !762, line: 166, baseType: !562, size: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !761, file: !762, line: 167, baseType: !766, size: 64, offset: 64)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !762, line: 157, size: 192, elements: !768)
!768 = !{!769, !770, !771}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !767, file: !762, line: 159, baseType: !501, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !767, file: !762, line: 160, baseType: !766, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !767, file: !762, line: 161, baseType: !772, size: 32, offset: 128)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !502, size: 32, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 4)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !761, file: !762, line: 168, baseType: !501, size: 64, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !761, file: !762, line: 169, baseType: !501, size: 64, offset: 192)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !761, file: !762, line: 170, baseType: !501, size: 64, offset: 256)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !761, file: !762, line: 171, baseType: !562, size: 64, offset: 320)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !761, file: !762, line: 172, baseType: !499, size: 32, offset: 384)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !761, file: !762, line: 176, baseType: !781, size: 64, offset: 448)
!781 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !782, size: 64)
!782 = !DISubroutineType(types: !783)
!783 = !{!766, !503, !562}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !761, file: !762, line: 177, baseType: !785, size: 64, offset: 512)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !503, !766}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !761, file: !762, line: 178, baseType: !503, size: 64, offset: 576)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !761, file: !762, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !761, file: !762, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !761, file: !762, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !702, file: !684, line: 177, baseType: !506, size: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !702, file: !684, line: 178, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !795, size: 64)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !796)
!796 = !{!797, !1042, !1043, !1044, !1100, !1104, !1105, !1106, !1124, !1125, !1126, !1127, !1128, !1129}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !795, file: !135, line: 219, baseType: !798, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !800)
!800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !801)
!801 = !{!802}
!802 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !800, file: !135, line: 151, baseType: !803, size: 128)
!803 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !804)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !805)
!805 = !{!806, !807, !808}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !804, file: !135, line: 150, baseType: !7, size: 32)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !804, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !804, file: !135, line: 150, baseType: !809, size: 64, offset: 64)
!809 = !DICompositeType(tag: DW_TAG_array_type, baseType: !810, size: 64, elements: !605)
!810 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !507, line: 108, baseType: !811)
!811 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !812, size: 64)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !813)
!813 = !{!814, !815, !816, !1034, !1035, !1036, !1037, !1038, !1039, !1040}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !812, file: !135, line: 124, baseType: !794, size: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !812, file: !135, line: 125, baseType: !794, size: 64, offset: 64)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !812, file: !135, line: 131, baseType: !817, size: 64, offset: 128)
!817 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !818)
!818 = !{!819, !1033}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !817, file: !135, line: 129, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !507, line: 66, baseType: !821)
!821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !822, size: 64)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !402, line: 143, size: 192, elements: !823)
!823 = !{!824, !1031, !1032}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !822, file: !402, line: 145, baseType: !825, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !507, line: 69, baseType: !826)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !402, line: 136, size: 192, elements: !828)
!828 = !{!829, !1029, !1030}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !827, file: !402, line: 137, baseType: !830, size: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !507, line: 58, baseType: !831)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !402, line: 737, size: 768, elements: !833)
!833 = !{!834, !851, !884, !890, !895, !900, !907, !913, !919, !924, !938, !943, !949, !954, !964, !969, !987, !994, !1001, !1007, !1012, !1018, !1024}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !832, file: !402, line: 738, baseType: !835, size: 256)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !402, line: 271, size: 256, elements: !836)
!836 = !{!837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !835, file: !402, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !835, file: !402, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !835, file: !402, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !835, file: !402, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !835, file: !402, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !835, file: !402, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !835, file: !402, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !835, file: !402, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !835, file: !402, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !835, file: !402, line: 312, baseType: !7, size: 32, offset: 32)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !835, file: !402, line: 316, baseType: !631, size: 32, offset: 64)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !835, file: !402, line: 319, baseType: !7, size: 32, offset: 96)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !835, file: !402, line: 323, baseType: !794, size: 64, offset: 128)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !835, file: !402, line: 327, baseType: !506, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !832, file: !402, line: 739, baseType: !852, size: 448)
!852 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !402, line: 350, size: 448, elements: !853)
!853 = !{!854, !882}
!854 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !852, file: !402, line: 353, baseType: !855, size: 384)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !402, line: 333, size: 384, elements: !856)
!856 = !{!857, !858, !865}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !855, file: !402, line: 336, baseType: !835, size: 256)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !855, file: !402, line: 343, baseType: !859, size: 64, offset: 256)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !441, line: 37, size: 128, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !860, file: !441, line: 39, baseType: !859, size: 64)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !860, file: !441, line: 40, baseType: !864, size: 64, offset: 64)
!864 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !506, size: 64)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !855, file: !402, line: 344, baseType: !866, size: 64, offset: 320)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !441, line: 45, size: 320, elements: !868)
!868 = !{!869, !870}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !867, file: !441, line: 47, baseType: !866, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !867, file: !441, line: 48, baseType: !871, size: 256, offset: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !164, line: 1883, size: 256, elements: !872)
!872 = !{!873, !875, !876, !881}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !871, file: !164, line: 1884, baseType: !874, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !871, file: !164, line: 1885, baseType: !874, size: 64, offset: 64)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !871, file: !164, line: 1891, baseType: !877, size: 64, offset: 128)
!877 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !871, file: !164, line: 1891, size: 64, elements: !878)
!878 = !{!879, !880}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !877, file: !164, line: 1891, baseType: !830, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !877, file: !164, line: 1891, baseType: !506, size: 64)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !871, file: !164, line: 1892, baseType: !864, size: 64, offset: 192)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !852, file: !402, line: 359, baseType: !883, size: 64, offset: 384)
!883 = !DICompositeType(tag: DW_TAG_array_type, baseType: !506, size: 64, elements: !605)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !832, file: !402, line: 740, baseType: !885, size: 512)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !402, line: 365, size: 512, elements: !886)
!886 = !{!887, !888, !889}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !885, file: !402, line: 368, baseType: !855, size: 384)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !885, file: !402, line: 373, baseType: !506, size: 64, offset: 384)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !885, file: !402, line: 374, baseType: !506, size: 64, offset: 448)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !832, file: !402, line: 741, baseType: !891, size: 576)
!891 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !402, line: 380, size: 576, elements: !892)
!892 = !{!893, !894}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !891, file: !402, line: 383, baseType: !885, size: 512)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !891, file: !402, line: 389, baseType: !883, size: 64, offset: 512)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !832, file: !402, line: 742, baseType: !896, size: 320)
!896 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !402, line: 395, size: 320, elements: !897)
!897 = !{!898, !899}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !896, file: !402, line: 397, baseType: !835, size: 256)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !896, file: !402, line: 400, baseType: !820, size: 64, offset: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !832, file: !402, line: 743, baseType: !901, size: 448)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !402, line: 406, size: 448, elements: !902)
!902 = !{!903, !904, !905, !906}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !901, file: !402, line: 408, baseType: !835, size: 256)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !901, file: !402, line: 412, baseType: !506, size: 64, offset: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !901, file: !402, line: 420, baseType: !506, size: 64, offset: 320)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !901, file: !402, line: 423, baseType: !820, size: 64, offset: 384)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !832, file: !402, line: 744, baseType: !908, size: 384)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !402, line: 429, size: 384, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !908, file: !402, line: 431, baseType: !835, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !908, file: !402, line: 434, baseType: !506, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !908, file: !402, line: 437, baseType: !820, size: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !832, file: !402, line: 745, baseType: !914, size: 384)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !402, line: 443, size: 384, elements: !915)
!915 = !{!916, !917, !918}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !914, file: !402, line: 445, baseType: !835, size: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !914, file: !402, line: 449, baseType: !506, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !914, file: !402, line: 453, baseType: !820, size: 64, offset: 320)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !832, file: !402, line: 746, baseType: !920, size: 320)
!920 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !402, line: 459, size: 320, elements: !921)
!921 = !{!922, !923}
!922 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !920, file: !402, line: 461, baseType: !835, size: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !920, file: !402, line: 464, baseType: !506, size: 64, offset: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !832, file: !402, line: 747, baseType: !925, size: 768)
!925 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !402, line: 469, size: 768, elements: !926)
!926 = !{!927, !928, !929, !930, !931}
!927 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !925, file: !402, line: 471, baseType: !835, size: 256)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !925, file: !402, line: 474, baseType: !7, size: 32, offset: 256)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !925, file: !402, line: 475, baseType: !7, size: 32, offset: 288)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !925, file: !402, line: 478, baseType: !506, size: 64, offset: 320)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !925, file: !402, line: 481, baseType: !932, size: 384, offset: 384)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !933, size: 384, elements: !605)
!933 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !164, line: 1917, size: 384, elements: !934)
!934 = !{!935, !936, !937}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !933, file: !164, line: 1920, baseType: !871, size: 256)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !933, file: !164, line: 1921, baseType: !506, size: 64, offset: 256)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !933, file: !164, line: 1922, baseType: !631, size: 32, offset: 320)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !832, file: !402, line: 748, baseType: !939, size: 320)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !402, line: 487, size: 320, elements: !940)
!940 = !{!941, !942}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !939, file: !402, line: 490, baseType: !835, size: 256)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !939, file: !402, line: 494, baseType: !499, size: 32, offset: 256)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !832, file: !402, line: 749, baseType: !944, size: 384)
!944 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !402, line: 500, size: 384, elements: !945)
!945 = !{!946, !947, !948}
!946 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !944, file: !402, line: 502, baseType: !835, size: 256)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !944, file: !402, line: 506, baseType: !820, size: 64, offset: 256)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !944, file: !402, line: 510, baseType: !820, size: 64, offset: 320)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !832, file: !402, line: 750, baseType: !950, size: 320)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !402, line: 529, size: 320, elements: !951)
!951 = !{!952, !953}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !950, file: !402, line: 531, baseType: !835, size: 256)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !950, file: !402, line: 540, baseType: !820, size: 64, offset: 256)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !832, file: !402, line: 751, baseType: !955, size: 704)
!955 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !402, line: 546, size: 704, elements: !956)
!956 = !{!957, !958, !959, !960, !961, !962, !963}
!957 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !955, file: !402, line: 549, baseType: !885, size: 512)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !955, file: !402, line: 553, baseType: !504, size: 64, offset: 512)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !955, file: !402, line: 557, baseType: !498, size: 8, offset: 576)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !955, file: !402, line: 558, baseType: !498, size: 8, offset: 584)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !955, file: !402, line: 559, baseType: !498, size: 8, offset: 592)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !955, file: !402, line: 560, baseType: !498, size: 8, offset: 600)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !955, file: !402, line: 566, baseType: !883, size: 64, offset: 640)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !832, file: !402, line: 752, baseType: !965, size: 384)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !402, line: 571, size: 384, elements: !966)
!966 = !{!967, !968}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !965, file: !402, line: 573, baseType: !896, size: 320)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !965, file: !402, line: 577, baseType: !506, size: 64, offset: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !832, file: !402, line: 753, baseType: !970, size: 576)
!970 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !402, line: 600, size: 576, elements: !971)
!971 = !{!972, !973, !974, !977, !986}
!972 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !970, file: !402, line: 602, baseType: !896, size: 320)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !970, file: !402, line: 605, baseType: !506, size: 64, offset: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !970, file: !402, line: 609, baseType: !975, size: 64, offset: 384)
!975 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !976, line: 46, baseType: !560)
!976 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!977 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !970, file: !402, line: 612, baseType: !978, size: 64, offset: 448)
!978 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !979, size: 64)
!979 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !402, line: 581, size: 320, elements: !980)
!980 = !{!981, !982, !983, !984, !985}
!981 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !979, file: !402, line: 583, baseType: !196, size: 32)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !979, file: !402, line: 586, baseType: !506, size: 64, offset: 64)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !979, file: !402, line: 589, baseType: !506, size: 64, offset: 128)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !979, file: !402, line: 592, baseType: !506, size: 64, offset: 192)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !979, file: !402, line: 595, baseType: !506, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !970, file: !402, line: 616, baseType: !820, size: 64, offset: 512)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !832, file: !402, line: 754, baseType: !988, size: 512)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !402, line: 622, size: 512, elements: !989)
!989 = !{!990, !991, !992, !993}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !988, file: !402, line: 624, baseType: !896, size: 320)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !988, file: !402, line: 628, baseType: !506, size: 64, offset: 320)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !988, file: !402, line: 632, baseType: !506, size: 64, offset: 384)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !988, file: !402, line: 636, baseType: !506, size: 64, offset: 448)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !832, file: !402, line: 755, baseType: !995, size: 704)
!995 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !402, line: 642, size: 704, elements: !996)
!996 = !{!997, !998, !999, !1000}
!997 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !995, file: !402, line: 644, baseType: !988, size: 512)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !995, file: !402, line: 648, baseType: !506, size: 64, offset: 512)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !995, file: !402, line: 652, baseType: !506, size: 64, offset: 576)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !995, file: !402, line: 653, baseType: !506, size: 64, offset: 640)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !832, file: !402, line: 756, baseType: !1002, size: 448)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !402, line: 663, size: 448, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1002, file: !402, line: 665, baseType: !896, size: 320)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1002, file: !402, line: 668, baseType: !506, size: 64, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1002, file: !402, line: 673, baseType: !506, size: 64, offset: 384)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !832, file: !402, line: 757, baseType: !1008, size: 384)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !402, line: 694, size: 384, elements: !1009)
!1009 = !{!1010, !1011}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1008, file: !402, line: 696, baseType: !896, size: 320)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1008, file: !402, line: 699, baseType: !506, size: 64, offset: 320)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !832, file: !402, line: 758, baseType: !1013, size: 384)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !402, line: 681, size: 384, elements: !1014)
!1014 = !{!1015, !1016, !1017}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1013, file: !402, line: 683, baseType: !835, size: 256)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1013, file: !402, line: 686, baseType: !506, size: 64, offset: 256)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1013, file: !402, line: 689, baseType: !506, size: 64, offset: 320)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !832, file: !402, line: 759, baseType: !1019, size: 384)
!1019 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !402, line: 707, size: 384, elements: !1020)
!1020 = !{!1021, !1022, !1023}
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1019, file: !402, line: 709, baseType: !835, size: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1019, file: !402, line: 712, baseType: !506, size: 64, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1019, file: !402, line: 712, baseType: !506, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !832, file: !402, line: 760, baseType: !1025, size: 320)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !402, line: 718, size: 320, elements: !1026)
!1026 = !{!1027, !1028}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1025, file: !402, line: 720, baseType: !835, size: 256)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1025, file: !402, line: 723, baseType: !506, size: 64, offset: 256)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !827, file: !402, line: 138, baseType: !826, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !827, file: !402, line: 139, baseType: !826, size: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !822, file: !402, line: 146, baseType: !825, size: 64, offset: 64)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !822, file: !402, line: 152, baseType: !820, size: 64, offset: 128)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !817, file: !135, line: 130, baseType: !681, size: 64)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !812, file: !135, line: 134, baseType: !503, size: 64, offset: 192)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !812, file: !135, line: 137, baseType: !506, size: 64, offset: 256)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !812, file: !135, line: 138, baseType: !631, size: 32, offset: 320)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !812, file: !135, line: 142, baseType: !7, size: 32, offset: 352)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !812, file: !135, line: 144, baseType: !499, size: 32, offset: 384)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !812, file: !135, line: 145, baseType: !499, size: 32, offset: 416)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !812, file: !135, line: 146, baseType: !1041, size: 64, offset: 448)
!1041 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !135, line: 119, baseType: !562)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !795, file: !135, line: 220, baseType: !798, size: 64, offset: 64)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !795, file: !135, line: 223, baseType: !503, size: 64, offset: 128)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !795, file: !135, line: 226, baseType: !1045, size: 64, offset: 192)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !146, line: 100, size: 1216, elements: !1047)
!1047 = !{!1048, !1049, !1050, !1051, !1052, !1057, !1058, !1059, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1090, !1098, !1099}
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1046, file: !146, line: 102, baseType: !499, size: 32)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1046, file: !146, line: 105, baseType: !7, size: 32, offset: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1046, file: !146, line: 108, baseType: !794, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1046, file: !146, line: 111, baseType: !794, size: 64, offset: 128)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1046, file: !146, line: 114, baseType: !1053, size: 64, offset: 192)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !146, line: 41, size: 64, elements: !1054)
!1054 = !{!1055, !1056}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1053, file: !146, line: 42, baseType: !145, size: 32)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1053, file: !146, line: 43, baseType: !7, size: 32, offset: 32)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1046, file: !146, line: 117, baseType: !7, size: 32, offset: 256)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1046, file: !146, line: 120, baseType: !7, size: 32, offset: 288)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1046, file: !146, line: 123, baseType: !1060, size: 64, offset: 320)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !146, line: 87, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !146, line: 87, size: 128, elements: !1063)
!1063 = !{!1064}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1062, file: !146, line: 87, baseType: !1065, size: 128)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !146, line: 85, baseType: !1066)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !146, line: 85, size: 128, elements: !1067)
!1067 = !{!1068, !1069, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1066, file: !146, line: 85, baseType: !7, size: 32)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1066, file: !146, line: 85, baseType: !7, size: 32, offset: 32)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1066, file: !146, line: 85, baseType: !1071, size: 64, offset: 64)
!1071 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1072, size: 64, elements: !605)
!1072 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !146, line: 84, baseType: !1045)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1046, file: !146, line: 126, baseType: !1045, size: 64, offset: 384)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1046, file: !146, line: 129, baseType: !1045, size: 64, offset: 448)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1046, file: !146, line: 132, baseType: !503, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1046, file: !146, line: 139, baseType: !506, size: 64, offset: 576)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1046, file: !146, line: 143, baseType: !555, size: 128, offset: 640)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1046, file: !146, line: 146, baseType: !555, size: 128, offset: 768)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1046, file: !146, line: 148, baseType: !498, size: 8, offset: 896)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1046, file: !146, line: 149, baseType: !498, size: 8, offset: 904)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1046, file: !146, line: 153, baseType: !154, size: 32, offset: 928)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1046, file: !146, line: 156, baseType: !1083, size: 64, offset: 960)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !146, line: 48, size: 320, elements: !1085)
!1085 = !{!1086, !1087, !1088, !1089}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1084, file: !146, line: 50, baseType: !830, size: 64)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1084, file: !146, line: 59, baseType: !555, size: 128, offset: 64)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1084, file: !146, line: 64, baseType: !498, size: 8, offset: 192)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1084, file: !146, line: 67, baseType: !1083, size: 64, offset: 256)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1046, file: !146, line: 159, baseType: !1091, size: 64, offset: 1024)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !146, line: 72, size: 256, elements: !1093)
!1093 = !{!1094, !1095, !1096, !1097}
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1092, file: !146, line: 74, baseType: !811, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1092, file: !146, line: 77, baseType: !1091, size: 64, offset: 64)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1092, file: !146, line: 78, baseType: !1091, size: 64, offset: 128)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1092, file: !146, line: 81, baseType: !1091, size: 64, offset: 192)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1046, file: !146, line: 162, baseType: !498, size: 8, offset: 1088)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1046, file: !146, line: 166, baseType: !506, size: 64, offset: 1152)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !795, file: !135, line: 229, baseType: !1101, size: 128, offset: 256)
!1101 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1102, size: 128, elements: !749)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !135, line: 229, flags: DIFlagFwdDecl)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !795, file: !135, line: 232, baseType: !794, size: 64, offset: 384)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !795, file: !135, line: 233, baseType: !794, size: 64, offset: 448)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !795, file: !135, line: 238, baseType: !1107, size: 64, offset: 512)
!1107 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !135, line: 235, size: 64, elements: !1108)
!1108 = !{!1109, !1115}
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1107, file: !135, line: 236, baseType: !1110, size: 64)
!1110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1111, size: 64)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !135, line: 273, size: 128, elements: !1112)
!1112 = !{!1113, !1114}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1111, file: !135, line: 275, baseType: !820, size: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1111, file: !135, line: 278, baseType: !820, size: 64, offset: 64)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1107, file: !135, line: 237, baseType: !1116, size: 64)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !135, line: 259, size: 320, elements: !1118)
!1118 = !{!1119, !1120, !1121, !1122, !1123}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1117, file: !135, line: 261, baseType: !681, size: 64)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1117, file: !135, line: 262, baseType: !681, size: 64, offset: 64)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1117, file: !135, line: 266, baseType: !681, size: 64, offset: 128)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1117, file: !135, line: 267, baseType: !681, size: 64, offset: 192)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1117, file: !135, line: 270, baseType: !499, size: 32, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !795, file: !135, line: 241, baseType: !1041, size: 64, offset: 576)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !795, file: !135, line: 244, baseType: !499, size: 32, offset: 640)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !795, file: !135, line: 247, baseType: !499, size: 32, offset: 672)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !795, file: !135, line: 250, baseType: !499, size: 32, offset: 704)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !795, file: !135, line: 253, baseType: !499, size: 32, offset: 736)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !795, file: !135, line: 256, baseType: !499, size: 32, offset: 768)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !702, file: !684, line: 179, baseType: !1131, size: 64)
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1132, size: 64)
!1132 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !684, line: 150, baseType: !1133)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !684, line: 142, size: 320, elements: !1134)
!1134 = !{!1135, !1136, !1137, !1138, !1141, !1142}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1133, file: !684, line: 144, baseType: !506, size: 64)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1133, file: !684, line: 145, baseType: !681, size: 64, offset: 64)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1133, file: !684, line: 146, baseType: !681, size: 64, offset: 128)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1133, file: !684, line: 147, baseType: !1139, size: 32, offset: 192)
!1139 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1140, line: 31, baseType: !499)
!1140 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1133, file: !684, line: 148, baseType: !7, size: 32, offset: 224)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1133, file: !684, line: 149, baseType: !498, size: 8, offset: 256)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !702, file: !684, line: 180, baseType: !1144, size: 64)
!1144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1145, size: 64)
!1145 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !684, line: 162, baseType: !1146)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !684, line: 159, size: 128, elements: !1147)
!1147 = !{!1148, !1149}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1146, file: !684, line: 160, baseType: !506, size: 64)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1146, file: !684, line: 161, baseType: !562, size: 64, offset: 64)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !702, file: !684, line: 181, baseType: !1151, size: 64)
!1151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1152, size: 64)
!1152 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !684, line: 181, flags: DIFlagFwdDecl)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !697, file: !684, line: 317, baseType: !1154, size: 64)
!1154 = !DICompositeType(tag: DW_TAG_array_type, baseType: !562, size: 64, elements: !605)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !697, file: !684, line: 318, baseType: !1156, size: 320)
!1156 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !684, line: 188, size: 320, elements: !1157)
!1157 = !{!1158, !1160, !1183}
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1156, file: !684, line: 190, baseType: !1159, size: 192)
!1159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !701, size: 192, elements: !580)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1156, file: !684, line: 193, baseType: !1161, size: 64, offset: 192)
!1161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1162, size: 64)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !684, line: 206, size: 320, elements: !1163)
!1163 = !{!1164, !1168, !1169, !1170, !1182}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1162, file: !684, line: 208, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1166, size: 64)
!1166 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !507, line: 62, baseType: !1167)
!1167 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !507, line: 61, flags: DIFlagFwdDecl)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1162, file: !684, line: 211, baseType: !7, size: 32, offset: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1162, file: !684, line: 214, baseType: !562, size: 64, offset: 128)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1162, file: !684, line: 224, baseType: !1171, size: 64, offset: 192)
!1171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1172, size: 64)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !684, line: 202, baseType: !1173)
!1173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !684, line: 202, size: 128, elements: !1174)
!1174 = !{!1175}
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1173, file: !684, line: 202, baseType: !1176, size: 128)
!1176 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !684, line: 200, baseType: !1177)
!1177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !684, line: 200, size: 128, elements: !1178)
!1178 = !{!1179, !1180, !1181}
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1177, file: !684, line: 200, baseType: !7, size: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1177, file: !684, line: 200, baseType: !7, size: 32, offset: 32)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1177, file: !684, line: 200, baseType: !715, size: 64, offset: 64)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1162, file: !684, line: 234, baseType: !1171, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1156, file: !684, line: 197, baseType: !562, size: 64, offset: 256)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !697, file: !684, line: 319, baseType: !569, size: 256)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !697, file: !684, line: 320, baseType: !588, size: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !509, file: !164, line: 3384, baseType: !1187, size: 1472)
!1187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !164, line: 3114, size: 1472, elements: !1188)
!1188 = !{!1189, !1210, !1211, !1212, !1213}
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1187, file: !164, line: 3115, baseType: !1190, size: 1216)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !164, line: 2984, size: 1216, elements: !1191)
!1191 = !{!1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207, !1208, !1209}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1190, file: !164, line: 2985, baseType: !677, size: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1190, file: !164, line: 2986, baseType: !506, size: 64, offset: 960)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1190, file: !164, line: 2987, baseType: !506, size: 64, offset: 1024)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1190, file: !164, line: 2988, baseType: !506, size: 64, offset: 1088)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1190, file: !164, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1190, file: !164, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1190, file: !164, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1190, file: !164, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1190, file: !164, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1190, file: !164, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1190, file: !164, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1190, file: !164, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1190, file: !164, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1190, file: !164, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1190, file: !164, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1190, file: !164, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1190, file: !164, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1190, file: !164, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1187, file: !164, line: 3117, baseType: !506, size: 64, offset: 1216)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1187, file: !164, line: 3119, baseType: !506, size: 64, offset: 1280)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1187, file: !164, line: 3121, baseType: !506, size: 64, offset: 1344)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1187, file: !164, line: 3123, baseType: !506, size: 64, offset: 1408)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !509, file: !164, line: 3385, baseType: !1215, size: 1088)
!1215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !164, line: 2874, size: 1088, elements: !1216)
!1216 = !{!1217, !1218, !1219}
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1215, file: !164, line: 2875, baseType: !677, size: 960)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1215, file: !164, line: 2876, baseType: !681, size: 64, offset: 960)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1215, file: !164, line: 2877, baseType: !1220, size: 64, offset: 1024)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1222, line: 172, size: 128, elements: !1223)
!1222 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1223 = !{!1224, !1225, !1226, !1227, !1228, !1229, !1230}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1221, file: !1222, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1221, file: !1222, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1221, file: !1222, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1221, file: !1222, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1221, file: !1222, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1221, file: !1222, line: 195, baseType: !7, size: 32, offset: 32)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1221, file: !1222, line: 199, baseType: !506, size: 64, offset: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !509, file: !164, line: 3386, baseType: !1190, size: 1216)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !509, file: !164, line: 3387, baseType: !1233, size: 1280)
!1233 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !164, line: 3093, size: 1280, elements: !1234)
!1234 = !{!1235, !1236}
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1233, file: !164, line: 3094, baseType: !1190, size: 1216)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1233, file: !164, line: 3095, baseType: !1220, size: 64, offset: 1216)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !509, file: !164, line: 3388, baseType: !1238, size: 1216)
!1238 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !164, line: 2824, size: 1216, elements: !1239)
!1239 = !{!1240, !1241, !1242, !1243, !1244, !1245}
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1238, file: !164, line: 2825, baseType: !639, size: 896)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1238, file: !164, line: 2827, baseType: !506, size: 64, offset: 896)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1238, file: !164, line: 2828, baseType: !506, size: 64, offset: 960)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1238, file: !164, line: 2829, baseType: !506, size: 64, offset: 1024)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1238, file: !164, line: 2830, baseType: !506, size: 64, offset: 1088)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1238, file: !164, line: 2831, baseType: !506, size: 64, offset: 1152)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !509, file: !164, line: 3389, baseType: !1247, size: 1024)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !164, line: 2850, size: 1024, elements: !1248)
!1248 = !{!1249, !1250, !1251}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1247, file: !164, line: 2851, baseType: !677, size: 960)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1247, file: !164, line: 2852, baseType: !499, size: 32, offset: 960)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1247, file: !164, line: 2853, baseType: !499, size: 32, offset: 992)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !509, file: !164, line: 3390, baseType: !1253, size: 1024)
!1253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !164, line: 2857, size: 1024, elements: !1254)
!1254 = !{!1255, !1256}
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1253, file: !164, line: 2858, baseType: !677, size: 960)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1253, file: !164, line: 2859, baseType: !1220, size: 64, offset: 960)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !509, file: !164, line: 3391, baseType: !1258, size: 960)
!1258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !164, line: 2862, size: 960, elements: !1259)
!1259 = !{!1260}
!1260 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1258, file: !164, line: 2863, baseType: !677, size: 960)
!1261 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !509, file: !164, line: 3392, baseType: !1262, size: 1472)
!1262 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !164, line: 3304, size: 1472, elements: !1263)
!1263 = !{!1264}
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1262, file: !164, line: 3305, baseType: !1187, size: 1472)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !509, file: !164, line: 3393, baseType: !1266, size: 1792)
!1266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !164, line: 3248, size: 1792, elements: !1267)
!1267 = !{!1268, !1269, !1488, !1489, !1490, !1491, !1492, !1493, !1494, !1495, !1496, !1497, !1498, !1499, !1500, !1501, !1502, !1503, !1504, !1505, !1506, !1507, !1508}
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1266, file: !164, line: 3249, baseType: !1187, size: 1472)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1266, file: !164, line: 3251, baseType: !1270, size: 64, offset: 1472)
!1270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1271, size: 64)
!1271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1272, line: 463, size: 1152, elements: !1273)
!1272 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1273 = !{!1274, !1277, !1308, !1309, !1424, !1432, !1433, !1434, !1435, !1436, !1437, !1461, !1464, !1465, !1466, !1467, !1468, !1469, !1470, !1471, !1472, !1473, !1474, !1475, !1476, !1477, !1478, !1479, !1480, !1481, !1482, !1483, !1484, !1485, !1486, !1487}
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1271, file: !1272, line: 464, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1272, line: 464, flags: DIFlagFwdDecl)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1271, file: !1272, line: 467, baseType: !1278, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1279, size: 64)
!1279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1280)
!1280 = !{!1281, !1283, !1284, !1297, !1298, !1299, !1300, !1301, !1302, !1304, !1306, !1307}
