; ModuleID = 'tree-ssa-loop-unswitch.bc'
source_filename = "tree-ssa-loop-unswitch.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!404 = !DIEnumerator(name: "GIMPLE_ASSIGN", value: 6, isUnsigned: true)
!405 = !DIEnumerator(name: "GIMPLE_ASM", value: 7, isUnsigned: true)
!406 = !DIEnumerator(name: "GIMPLE_CALL", value: 8, isUnsigned: true)
!407 = !DIEnumerator(name: "GIMPLE_RETURN", value: 9, isUnsigned: true)
!408 = !DIEnumerator(name: "GIMPLE_BIND", value: 10, isUnsigned: true)
!409 = !DIEnumerator(name: "GIMPLE_CATCH", value: 11, isUnsigned: true)
!410 = !DIEnumerator(name: "GIMPLE_EH_FILTER", value: 12, isUnsigned: true)
!411 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!412 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!413 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!414 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!415 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!416 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!417 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!418 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!422 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!423 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!424 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!426 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!427 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!428 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!429 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!430 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!431 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!433 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !396, line: 727, baseType: !5, size: 32, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!436 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!459 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!460 = !{!461, !462, !463, !464, !467, !468, !470, !485, !554, !5, !181, !530, !1867, !1168, !465}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!463 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_heap", file: !472, line: 32, baseType: !473)
!472 = !DIFile(filename: "./vecprim.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_heap", file: !472, line: 32, size: 96, elements: !474)
!474 = !{!475}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !473, file: !472, line: 32, baseType: !476, size: 96)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_int_base", file: !472, line: 31, baseType: !477)
!477 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_int_base", file: !472, line: 31, size: 96, elements: !478)
!478 = !{!479, !480, !481}
!479 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !477, file: !472, line: 31, baseType: !5, size: 32)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !477, file: !472, line: 31, baseType: !5, size: 32, offset: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !477, file: !472, line: 31, baseType: !482, size: 32, offset: 64)
!482 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 32, elements: !483)
!483 = !{!484}
!484 = !DISubrange(count: 1)
!485 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !376, line: 84, baseType: !486)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !487, size: 64)
!487 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !376, line: 100, size: 1216, elements: !488)
!488 = !{!489, !490, !491, !1831, !1832, !1837, !1838, !1839, !1840, !1841, !1842, !1843, !1844, !1845, !1846, !1847, !1848, !1849, !1857, !1865, !1866}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !487, file: !376, line: 102, baseType: !463, size: 32)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !487, file: !376, line: 105, baseType: !5, size: 32, offset: 32)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !487, file: !376, line: 108, baseType: !492, size: 64, offset: 64)
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !133, line: 217, size: 832, elements: !494)
!494 = !{!495, !1798, !1799, !1800, !1801, !1805, !1806, !1807, !1825, !1826, !1827, !1828, !1829, !1830}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !493, file: !133, line: 219, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !497, size: 64)
!497 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !133, line: 151, baseType: !498)
!498 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !133, line: 151, size: 128, elements: !499)
!499 = !{!500}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !498, file: !133, line: 151, baseType: !501, size: 128)
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !133, line: 150, baseType: !502)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !133, line: 150, size: 128, elements: !503)
!503 = !{!504, !505, !506}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !502, file: !133, line: 150, baseType: !5, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !502, file: !133, line: 150, baseType: !5, size: 32, offset: 32)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !502, file: !133, line: 150, baseType: !507, size: 64, offset: 64)
!507 = !DICompositeType(tag: DW_TAG_array_type, baseType: !508, size: 64, elements: !483)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !509, line: 108, baseType: !510)
!509 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !133, line: 122, size: 512, elements: !512)
!512 = !{!513, !514, !515, !1790, !1791, !1792, !1793, !1794, !1795, !1796}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !511, file: !133, line: 124, baseType: !492, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !511, file: !133, line: 125, baseType: !492, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !511, file: !133, line: 131, baseType: !516, size: 64, offset: 128)
!516 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !133, line: 128, size: 64, elements: !517)
!517 = !{!518, !1789}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !516, file: !133, line: 129, baseType: !519, size: 64)
!519 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !509, line: 66, baseType: !520)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !396, line: 143, size: 192, elements: !522)
!522 = !{!523, !1787, !1788}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !521, file: !396, line: 145, baseType: !524, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !509, line: 69, baseType: !525)
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !526, size: 64)
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !396, line: 136, size: 192, elements: !527)
!527 = !{!528, !1785, !1786}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !526, file: !396, line: 137, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !509, line: 58, baseType: !530)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !396, line: 737, size: 768, elements: !532)
!532 = !{!533, !1632, !1642, !1648, !1653, !1658, !1665, !1671, !1677, !1682, !1696, !1701, !1707, !1712, !1722, !1727, !1743, !1750, !1757, !1763, !1768, !1774, !1780}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !531, file: !396, line: 738, baseType: !534, size: 256)
!534 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !396, line: 271, size: 256, elements: !535)
!535 = !{!536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !551, !552, !553}
!536 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !534, file: !396, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !534, file: !396, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !534, file: !396, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !534, file: !396, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !534, file: !396, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !534, file: !396, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !534, file: !396, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !534, file: !396, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !534, file: !396, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !534, file: !396, line: 312, baseType: !5, size: 32, offset: 32)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !534, file: !396, line: 316, baseType: !547, size: 32, offset: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !548, line: 58, baseType: !549)
!548 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!549 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !550, line: 44, baseType: !5)
!550 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!551 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !534, file: !396, line: 319, baseType: !5, size: 32, offset: 96)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !534, file: !396, line: 323, baseType: !492, size: 64, offset: 128)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !534, file: !396, line: 327, baseType: !554, size: 64, offset: 192)
!554 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !509, line: 56, baseType: !555)
!555 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !556, size: 64)
!556 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !149, line: 3371, size: 1792, elements: !557)
!557 = !{!558, !591, !597, !610, !629, !640, !645, !652, !658, !671, !679, !717, !925, !953, !970, !971, !976, !985, !991, !996, !1000, !1004, !1283, !1330, !1336, !1342, !1349, !1362, !1376, !1393, !1405, !1427, !1442, !1614}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !556, file: !149, line: 3372, baseType: !559, size: 64)
!559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !149, line: 360, size: 64, elements: !560)
!560 = !{!561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !571, !572, !573, !574, !575, !576, !577, !578, !579, !580, !581, !582, !583, !584, !585, !586, !587, !588, !589, !590}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !559, file: !149, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !559, file: !149, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !559, file: !149, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !559, file: !149, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !559, file: !149, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !559, file: !149, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !559, file: !149, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !559, file: !149, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !559, file: !149, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !559, file: !149, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !559, file: !149, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !559, file: !149, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !559, file: !149, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!574 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !559, file: !149, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !559, file: !149, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !559, file: !149, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !559, file: !149, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !559, file: !149, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !559, file: !149, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !559, file: !149, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !559, file: !149, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !559, file: !149, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !559, file: !149, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !559, file: !149, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !559, file: !149, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !559, file: !149, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !559, file: !149, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !559, file: !149, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!589 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !559, file: !149, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !559, file: !149, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !556, file: !149, line: 3373, baseType: !592, size: 192)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !149, line: 402, size: 192, elements: !593)
!593 = !{!594, !595, !596}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !592, file: !149, line: 403, baseType: !559, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !592, file: !149, line: 404, baseType: !554, size: 64, offset: 64)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !592, file: !149, line: 405, baseType: !554, size: 64, offset: 128)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !556, file: !149, line: 3374, baseType: !598, size: 320)
!598 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !149, line: 1384, size: 320, elements: !599)
!599 = !{!600, !601}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !598, file: !149, line: 1385, baseType: !592, size: 192)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !598, file: !149, line: 1386, baseType: !602, size: 128, offset: 192)
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !603, line: 58, baseType: !604)
!603 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !603, line: 54, size: 128, elements: !605)
!605 = !{!606, !608}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !604, file: !603, line: 56, baseType: !607, size: 64)
!607 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !604, file: !603, line: 57, baseType: !609, size: 64, offset: 64)
!609 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !556, file: !149, line: 3375, baseType: !611, size: 256)
!611 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !149, line: 1397, size: 256, elements: !612)
!612 = !{!613, !614}
!613 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !611, file: !149, line: 1398, baseType: !592, size: 192)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !611, file: !149, line: 1399, baseType: !615, size: 64, offset: 192)
!615 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !616, size: 64)
!616 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !617, line: 52, size: 256, elements: !618)
!617 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!618 = !{!619, !620, !621, !622, !623, !624, !625}
!619 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !616, file: !617, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !616, file: !617, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !616, file: !617, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !616, file: !617, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !616, file: !617, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !616, file: !617, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !616, file: !617, line: 62, baseType: !626, size: 192, offset: 64)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !607, size: 192, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 3)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !556, file: !149, line: 3376, baseType: !630, size: 256)
!630 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !149, line: 1408, size: 256, elements: !631)
!631 = !{!632, !633}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !630, file: !149, line: 1409, baseType: !592, size: 192)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !630, file: !149, line: 1410, baseType: !634, size: 64, offset: 192)
!634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !635, size: 64)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !636, line: 27, size: 192, elements: !637)
!636 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!637 = !{!638, !639}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !635, file: !636, line: 29, baseType: !602, size: 128)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !635, file: !636, line: 30, baseType: !3, size: 32, offset: 128)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !556, file: !149, line: 3377, baseType: !641, size: 256)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !149, line: 1437, size: 256, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !641, file: !149, line: 1438, baseType: !592, size: 192)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !641, file: !149, line: 1439, baseType: !554, size: 64, offset: 192)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !556, file: !149, line: 3378, baseType: !646, size: 256)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !149, line: 1418, size: 256, elements: !647)
!647 = !{!648, !649, !650}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !646, file: !149, line: 1419, baseType: !592, size: 192)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !646, file: !149, line: 1420, baseType: !463, size: 32, offset: 192)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !646, file: !149, line: 1421, baseType: !651, size: 8, offset: 224)
!651 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 8, elements: !483)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !556, file: !149, line: 3379, baseType: !653, size: 320)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !149, line: 1428, size: 320, elements: !654)
!654 = !{!655, !656, !657}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !653, file: !149, line: 1429, baseType: !592, size: 192)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !653, file: !149, line: 1430, baseType: !554, size: 64, offset: 192)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !653, file: !149, line: 1431, baseType: !554, size: 64, offset: 256)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !556, file: !149, line: 3380, baseType: !659, size: 320)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !149, line: 1460, size: 320, elements: !660)
!660 = !{!661, !662}
!661 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !659, file: !149, line: 1461, baseType: !592, size: 192)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !659, file: !149, line: 1462, baseType: !663, size: 128, offset: 192)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !664, line: 31, size: 128, elements: !665)
!664 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!665 = !{!666, !669, !670}
!666 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !663, file: !664, line: 32, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !668, size: 64)
!668 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !663, file: !664, line: 33, baseType: !5, size: 32, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !663, file: !664, line: 34, baseType: !5, size: 32, offset: 96)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !556, file: !149, line: 3381, baseType: !672, size: 384)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !149, line: 2507, size: 384, elements: !673)
!673 = !{!674, !675, !676, !677, !678}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !672, file: !149, line: 2508, baseType: !592, size: 192)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !672, file: !149, line: 2509, baseType: !547, size: 32, offset: 192)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !672, file: !149, line: 2510, baseType: !5, size: 32, offset: 224)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !672, file: !149, line: 2511, baseType: !554, size: 64, offset: 256)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !672, file: !149, line: 2512, baseType: !554, size: 64, offset: 320)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !556, file: !149, line: 3382, baseType: !680, size: 896)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !149, line: 2652, size: 896, elements: !681)
!681 = !{!682, !683, !684, !685, !686, !687, !688, !689, !690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !680, file: !149, line: 2653, baseType: !672, size: 384)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !680, file: !149, line: 2654, baseType: !554, size: 64, offset: 384)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !680, file: !149, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !680, file: !149, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !680, file: !149, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !680, file: !149, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !680, file: !149, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !680, file: !149, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !680, file: !149, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !680, file: !149, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !680, file: !149, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !680, file: !149, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !680, file: !149, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !680, file: !149, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !680, file: !149, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !680, file: !149, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !680, file: !149, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !680, file: !149, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !680, file: !149, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !680, file: !149, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !680, file: !149, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !680, file: !149, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !680, file: !149, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !680, file: !149, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !680, file: !149, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !680, file: !149, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !680, file: !149, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !680, file: !149, line: 2703, baseType: !5, size: 32, offset: 512)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !680, file: !149, line: 2705, baseType: !554, size: 64, offset: 576)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !680, file: !149, line: 2706, baseType: !554, size: 64, offset: 640)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !680, file: !149, line: 2707, baseType: !554, size: 64, offset: 704)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !680, file: !149, line: 2708, baseType: !554, size: 64, offset: 768)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !680, file: !149, line: 2711, baseType: !715, size: 64, offset: 832)
!715 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !716, size: 64)
!716 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !149, line: 2711, flags: DIFlagFwdDecl)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !556, file: !149, line: 3383, baseType: !718, size: 960)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !149, line: 2756, size: 960, elements: !719)
!719 = !{!720, !721}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !718, file: !149, line: 2757, baseType: !680, size: 896)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !718, file: !149, line: 2758, baseType: !722, size: 64, offset: 896)
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !509, line: 50, baseType: !723)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !725, line: 240, size: 384, elements: !726)
!725 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!726 = !{!727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !724, file: !725, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !724, file: !725, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !724, file: !725, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !724, file: !725, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !724, file: !725, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !724, file: !725, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !724, file: !725, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !724, file: !725, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !724, file: !725, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !724, file: !725, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !724, file: !725, line: 321, baseType: !738, size: 320, offset: 64)
!738 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !725, line: 315, size: 320, elements: !739)
!739 = !{!740, !858, !860, !923, !924}
!740 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !738, file: !725, line: 316, baseType: !741, size: 64)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 64, elements: !483)
!742 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !725, line: 183, baseType: !743)
!743 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !725, line: 166, size: 64, elements: !744)
!744 = !{!745, !746, !747, !748, !749, !757, !758, !770, !773, !833, !834, !835, !848, !855}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !743, file: !725, line: 168, baseType: !463, size: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !743, file: !725, line: 169, baseType: !5, size: 32)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !743, file: !725, line: 170, baseType: !468, size: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !743, file: !725, line: 171, baseType: !722, size: 64)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !743, file: !725, line: 172, baseType: !750, size: 64)
!750 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !509, line: 53, baseType: !751)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !725, line: 359, size: 128, elements: !753)
!753 = !{!754, !755}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !752, file: !725, line: 360, baseType: !463, size: 32)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !752, file: !725, line: 361, baseType: !756, size: 64, offset: 64)
!756 = !DICompositeType(tag: DW_TAG_array_type, baseType: !722, size: 64, elements: !483)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !743, file: !725, line: 173, baseType: !3, size: 32)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !743, file: !725, line: 174, baseType: !759, size: 32)
!759 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !725, line: 133, baseType: !760)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !725, line: 115, size: 32, elements: !761)
!761 = !{!762, !763, !764, !765, !766, !767, !768, !769}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !760, file: !725, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !760, file: !725, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !760, file: !725, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !760, file: !725, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!766 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !760, file: !725, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !760, file: !725, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !760, file: !725, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !760, file: !725, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !743, file: !725, line: 175, baseType: !771, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !725, line: 175, flags: DIFlagFwdDecl)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !743, file: !725, line: 176, baseType: !774, size: 64)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !775, size: 64)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !776, line: 75, size: 256, elements: !777)
!776 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!777 = !{!778, !792, !793, !794}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !775, file: !776, line: 76, baseType: !779, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !780, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !776, line: 68, baseType: !781)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !776, line: 63, size: 320, elements: !782)
!782 = !{!783, !785, !786, !787}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !781, file: !776, line: 64, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !781, file: !776, line: 65, baseType: !784, size: 64, offset: 64)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !781, file: !776, line: 66, baseType: !5, size: 32, offset: 128)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !781, file: !776, line: 67, baseType: !788, size: 128, offset: 192)
!788 = !DICompositeType(tag: DW_TAG_array_type, baseType: !789, size: 128, elements: !790)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !776, line: 29, baseType: !607)
!790 = !{!791}
!791 = !DISubrange(count: 2)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !775, file: !776, line: 77, baseType: !779, size: 64, offset: 64)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !775, file: !776, line: 78, baseType: !5, size: 32, offset: 128)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !775, file: !776, line: 79, baseType: !795, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !776, line: 49, baseType: !797)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !776, line: 45, size: 832, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !797, file: !776, line: 46, baseType: !784, size: 64)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !797, file: !776, line: 47, baseType: !774, size: 64, offset: 64)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !797, file: !776, line: 48, baseType: !802, size: 704, offset: 128)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !803, line: 164, size: 704, elements: !804)
!803 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!804 = !{!805, !806, !816, !817, !818, !819, !820, !821, !825, !829, !830, !831, !832}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !802, file: !803, line: 166, baseType: !609, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !802, file: !803, line: 167, baseType: !807, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !803, line: 157, size: 192, elements: !809)
!809 = !{!810, !811, !812}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !808, file: !803, line: 159, baseType: !465, size: 64)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !808, file: !803, line: 160, baseType: !807, size: 64, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !808, file: !803, line: 161, baseType: !813, size: 32, offset: 128)
!813 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 32, elements: !814)
!814 = !{!815}
!815 = !DISubrange(count: 4)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !802, file: !803, line: 168, baseType: !465, size: 64, offset: 128)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !802, file: !803, line: 169, baseType: !465, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !802, file: !803, line: 170, baseType: !465, size: 64, offset: 256)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !802, file: !803, line: 171, baseType: !609, size: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !802, file: !803, line: 172, baseType: !463, size: 32, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !802, file: !803, line: 176, baseType: !822, size: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !823, size: 64)
!823 = !DISubroutineType(types: !824)
!824 = !{!807, !467, !609}
!825 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !802, file: !803, line: 177, baseType: !826, size: 64, offset: 512)
!826 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !827, size: 64)
!827 = !DISubroutineType(types: !828)
!828 = !{null, !467, !807}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !802, file: !803, line: 178, baseType: !467, size: 64, offset: 576)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !802, file: !803, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !802, file: !803, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !802, file: !803, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !743, file: !725, line: 177, baseType: !554, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !743, file: !725, line: 178, baseType: !492, size: 64)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !743, file: !725, line: 179, baseType: !836, size: 64)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !725, line: 150, baseType: !838)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !725, line: 142, size: 320, elements: !839)
!839 = !{!840, !841, !842, !843, !846, !847}
!840 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !838, file: !725, line: 144, baseType: !554, size: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !838, file: !725, line: 145, baseType: !722, size: 64, offset: 64)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !838, file: !725, line: 146, baseType: !722, size: 64, offset: 128)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !838, file: !725, line: 147, baseType: !844, size: 32, offset: 192)
!844 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !845, line: 31, baseType: !463)
!845 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!846 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !838, file: !725, line: 148, baseType: !5, size: 32, offset: 224)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !838, file: !725, line: 149, baseType: !462, size: 8, offset: 256)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !743, file: !725, line: 180, baseType: !849, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !725, line: 162, baseType: !851)
!851 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !725, line: 159, size: 128, elements: !852)
!852 = !{!853, !854}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !851, file: !725, line: 160, baseType: !554, size: 64)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !851, file: !725, line: 161, baseType: !609, size: 64, offset: 64)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !743, file: !725, line: 181, baseType: !856, size: 64)
!856 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !857, size: 64)
!857 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !725, line: 181, flags: DIFlagFwdDecl)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !738, file: !725, line: 317, baseType: !859, size: 64)
!859 = !DICompositeType(tag: DW_TAG_array_type, baseType: !609, size: 64, elements: !483)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !738, file: !725, line: 318, baseType: !861, size: 320)
!861 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !725, line: 188, size: 320, elements: !862)
!862 = !{!863, !865, !922}
!863 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !861, file: !725, line: 190, baseType: !864, size: 192)
!864 = !DICompositeType(tag: DW_TAG_array_type, baseType: !742, size: 192, elements: !627)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !861, file: !725, line: 193, baseType: !866, size: 64, offset: 192)
!866 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !867, size: 64)
!867 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !725, line: 206, size: 320, elements: !868)
!868 = !{!869, !907, !908, !909, !921}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !867, file: !725, line: 208, baseType: !870, size: 64)
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !509, line: 62, baseType: !872)
!872 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !873, line: 538, size: 256, elements: !874)
!873 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!874 = !{!875, !879, !885, !898}
!875 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !872, file: !873, line: 539, baseType: !876, size: 32)
!876 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !873, line: 482, size: 32, elements: !877)
!877 = !{!878}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !876, file: !873, line: 484, baseType: !5, size: 32)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !872, file: !873, line: 540, baseType: !880, size: 192)
!880 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !873, line: 488, size: 192, elements: !881)
!881 = !{!882, !883, !884}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !880, file: !873, line: 489, baseType: !876, size: 32)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !880, file: !873, line: 492, baseType: !468, size: 64, offset: 64)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !880, file: !873, line: 496, baseType: !554, size: 64, offset: 128)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !872, file: !873, line: 541, baseType: !886, size: 256)
!886 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !873, line: 504, size: 256, elements: !887)
!887 = !{!888, !889, !896, !897}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !886, file: !873, line: 505, baseType: !876, size: 32)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !886, file: !873, line: 509, baseType: !890, size: 64, offset: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !873, line: 501, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = !DISubroutineType(types: !893)
!893 = !{null, !894}
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !886, file: !873, line: 510, baseType: !894, size: 64, offset: 128)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !886, file: !873, line: 513, baseType: !870, size: 64, offset: 192)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !872, file: !873, line: 542, baseType: !899, size: 128)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !873, line: 530, size: 128, elements: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !899, file: !873, line: 531, baseType: !876, size: 32)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !899, file: !873, line: 534, baseType: !903, size: 64, offset: 64)
!903 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !873, line: 525, baseType: !904)
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = !DISubroutineType(types: !906)
!906 = !{!462, !554, !468, !607, !607}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !867, file: !725, line: 211, baseType: !5, size: 32, offset: 64)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !867, file: !725, line: 214, baseType: !609, size: 64, offset: 128)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !867, file: !725, line: 224, baseType: !910, size: 64, offset: 192)
!910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !725, line: 202, baseType: !912)
!912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !725, line: 202, size: 128, elements: !913)
!913 = !{!914}
!914 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !912, file: !725, line: 202, baseType: !915, size: 128)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !725, line: 200, baseType: !916)
!916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !725, line: 200, size: 128, elements: !917)
!917 = !{!918, !919, !920}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !916, file: !725, line: 200, baseType: !5, size: 32)
!919 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !916, file: !725, line: 200, baseType: !5, size: 32, offset: 32)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !916, file: !725, line: 200, baseType: !756, size: 64, offset: 64)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !867, file: !725, line: 234, baseType: !910, size: 64, offset: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !861, file: !725, line: 197, baseType: !609, size: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !738, file: !725, line: 319, baseType: !616, size: 256)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !738, file: !725, line: 320, baseType: !635, size: 192)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !556, file: !149, line: 3384, baseType: !926, size: 1472)
!926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !149, line: 3114, size: 1472, elements: !927)
!927 = !{!928, !949, !950, !951, !952}
!928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !926, file: !149, line: 3115, baseType: !929, size: 1216)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !149, line: 2984, size: 1216, elements: !930)
!930 = !{!931, !932, !933, !934, !935, !936, !937, !938, !939, !940, !941, !942, !943, !944, !945, !946, !947, !948}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !929, file: !149, line: 2985, baseType: !718, size: 960)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !929, file: !149, line: 2986, baseType: !554, size: 64, offset: 960)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !929, file: !149, line: 2987, baseType: !554, size: 64, offset: 1024)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !929, file: !149, line: 2988, baseType: !554, size: 64, offset: 1088)
!935 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !929, file: !149, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !929, file: !149, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !929, file: !149, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !929, file: !149, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !929, file: !149, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !929, file: !149, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !929, file: !149, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !929, file: !149, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !929, file: !149, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !929, file: !149, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !929, file: !149, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !929, file: !149, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !929, file: !149, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !929, file: !149, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !926, file: !149, line: 3117, baseType: !554, size: 64, offset: 1216)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !926, file: !149, line: 3119, baseType: !554, size: 64, offset: 1280)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !926, file: !149, line: 3121, baseType: !554, size: 64, offset: 1344)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !926, file: !149, line: 3123, baseType: !554, size: 64, offset: 1408)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !556, file: !149, line: 3385, baseType: !954, size: 1088)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !149, line: 2874, size: 1088, elements: !955)
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !954, file: !149, line: 2875, baseType: !718, size: 960)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !954, file: !149, line: 2876, baseType: !722, size: 64, offset: 960)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !954, file: !149, line: 2877, baseType: !959, size: 64, offset: 1024)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !960, size: 64)
!960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !961, line: 172, size: 128, elements: !962)
!961 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!962 = !{!963, !964, !965, !966, !967, !968, !969}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !960, file: !961, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !960, file: !961, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !960, file: !961, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!966 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !960, file: !961, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !960, file: !961, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !960, file: !961, line: 195, baseType: !5, size: 32, offset: 32)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !960, file: !961, line: 199, baseType: !554, size: 64, offset: 64)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !556, file: !149, line: 3386, baseType: !929, size: 1216)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !556, file: !149, line: 3387, baseType: !972, size: 1280)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !149, line: 3093, size: 1280, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !972, file: !149, line: 3094, baseType: !929, size: 1216)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !972, file: !149, line: 3095, baseType: !959, size: 64, offset: 1216)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !556, file: !149, line: 3388, baseType: !977, size: 1216)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !149, line: 2824, size: 1216, elements: !978)
!978 = !{!979, !980, !981, !982, !983, !984}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !977, file: !149, line: 2825, baseType: !680, size: 896)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !977, file: !149, line: 2827, baseType: !554, size: 64, offset: 896)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !977, file: !149, line: 2828, baseType: !554, size: 64, offset: 960)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !977, file: !149, line: 2829, baseType: !554, size: 64, offset: 1024)
!983 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !977, file: !149, line: 2830, baseType: !554, size: 64, offset: 1088)
!984 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !977, file: !149, line: 2831, baseType: !554, size: 64, offset: 1152)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !556, file: !149, line: 3389, baseType: !986, size: 1024)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !149, line: 2850, size: 1024, elements: !987)
!987 = !{!988, !989, !990}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !986, file: !149, line: 2851, baseType: !718, size: 960)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !986, file: !149, line: 2852, baseType: !463, size: 32, offset: 960)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !986, file: !149, line: 2853, baseType: !463, size: 32, offset: 992)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !556, file: !149, line: 3390, baseType: !992, size: 1024)
!992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !149, line: 2857, size: 1024, elements: !993)
!993 = !{!994, !995}
!994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !992, file: !149, line: 2858, baseType: !718, size: 960)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !992, file: !149, line: 2859, baseType: !959, size: 64, offset: 960)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !556, file: !149, line: 3391, baseType: !997, size: 960)
!997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !149, line: 2862, size: 960, elements: !998)
!998 = !{!999}
!999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !997, file: !149, line: 2863, baseType: !718, size: 960)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !556, file: !149, line: 3392, baseType: !1001, size: 1472)
!1001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !149, line: 3304, size: 1472, elements: !1002)
!1002 = !{!1003}
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1001, file: !149, line: 3305, baseType: !926, size: 1472)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !556, file: !149, line: 3393, baseType: !1005, size: 1792)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !149, line: 3248, size: 1792, elements: !1006)
!1006 = !{!1007, !1008, !1262, !1263, !1264, !1265, !1266, !1267, !1268, !1269, !1270, !1271, !1272, !1273, !1274, !1275, !1276, !1277, !1278, !1279, !1280, !1281, !1282}
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1005, file: !149, line: 3249, baseType: !926, size: 1472)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1005, file: !149, line: 3251, baseType: !1009, size: 64, offset: 1472)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1011, line: 463, size: 1152, elements: !1012)
!1011 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1012 = !{!1013, !1016, !1047, !1048, !1186, !1206, !1207, !1208, !1209, !1210, !1211, !1235, !1238, !1239, !1240, !1241, !1242, !1243, !1244, !1245, !1246, !1247, !1248, !1249, !1250, !1251, !1252, !1253, !1254, !1255, !1256, !1257, !1258, !1259, !1260, !1261}
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1010, file: !1011, line: 464, baseType: !1014, size: 64)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1011, line: 464, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1010, file: !1011, line: 467, baseType: !1017, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1018, size: 64)
!1018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !133, line: 374, size: 640, elements: !1019)
!1019 = !{!1020, !1022, !1023, !1036, !1037, !1038, !1039, !1040, !1041, !1043, !1045, !1046}
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1018, file: !133, line: 377, baseType: !1021, size: 64)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !509, line: 111, baseType: !492)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1018, file: !133, line: 378, baseType: !1021, size: 64, offset: 64)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1018, file: !133, line: 381, baseType: !1024, size: 64, offset: 128)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !133, line: 282, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !133, line: 282, size: 128, elements: !1027)
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1026, file: !133, line: 282, baseType: !1029, size: 128)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !133, line: 281, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !133, line: 281, size: 128, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1030, file: !133, line: 281, baseType: !5, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1030, file: !133, line: 281, baseType: !5, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1030, file: !133, line: 281, baseType: !1035, size: 64, offset: 64)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1021, size: 64, elements: !483)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1018, file: !133, line: 384, baseType: !463, size: 32, offset: 192)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1018, file: !133, line: 387, baseType: !463, size: 32, offset: 224)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1018, file: !133, line: 390, baseType: !463, size: 32, offset: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1018, file: !133, line: 394, baseType: !1024, size: 64, offset: 320)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1018, file: !133, line: 396, baseType: !132, size: 32, offset: 384)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1018, file: !133, line: 399, baseType: !1042, size: 64, offset: 416)
!1042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !138, size: 64, elements: !790)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1018, file: !133, line: 402, baseType: !1044, size: 64, offset: 480)
!1044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 64, elements: !790)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1018, file: !133, line: 406, baseType: !463, size: 32, offset: 544)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1018, file: !133, line: 409, baseType: !463, size: 32, offset: 576)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1010, file: !1011, line: 470, baseType: !520, size: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1010, file: !1011, line: 473, baseType: !1049, size: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1050, size: 64)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !961, line: 39, size: 1152, elements: !1051)
!1051 = !{!1052, !1102, !1115, !1128, !1129, !1141, !1142, !1146, !1147, !1148, !1149, !1150}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1050, file: !961, line: 41, baseType: !1053, size: 64)
!1053 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1054, line: 144, baseType: !1055)
!1054 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1054, line: 100, size: 896, elements: !1057)
!1057 = !{!1058, !1064, !1069, !1074, !1076, !1079, !1080, !1081, !1082, !1083, !1088, !1090, !1091, !1096, !1101}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1056, file: !1054, line: 102, baseType: !1059, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1054, line: 52, baseType: !1060)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DISubroutineType(types: !1062)
!1062 = !{!1063, !894}
!1063 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1054, line: 47, baseType: !5)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1056, file: !1054, line: 105, baseType: !1065, size: 64, offset: 64)
!1065 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1054, line: 59, baseType: !1066)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DISubroutineType(types: !1068)
!1068 = !{!463, !894, !894}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1056, file: !1054, line: 108, baseType: !1070, size: 64, offset: 128)
!1070 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1054, line: 63, baseType: !1071)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1072, size: 64)
!1072 = !DISubroutineType(types: !1073)
!1073 = !{null, !467}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1056, file: !1054, line: 111, baseType: !1075, size: 64, offset: 192)
!1075 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1056, file: !1054, line: 114, baseType: !1077, size: 64, offset: 256)
!1077 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1078, line: 46, baseType: !607)
!1078 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1056, file: !1054, line: 117, baseType: !1077, size: 64, offset: 320)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1056, file: !1054, line: 120, baseType: !1077, size: 64, offset: 384)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1056, file: !1054, line: 124, baseType: !5, size: 32, offset: 448)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1056, file: !1054, line: 128, baseType: !5, size: 32, offset: 480)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1056, file: !1054, line: 131, baseType: !1084, size: 64, offset: 512)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1054, line: 75, baseType: !1085)
!1085 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1086, size: 64)
!1086 = !DISubroutineType(types: !1087)
!1087 = !{!467, !1077, !1077}
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1056, file: !1054, line: 132, baseType: !1089, size: 64, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1054, line: 78, baseType: !1071)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1056, file: !1054, line: 135, baseType: !467, size: 64, offset: 640)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1056, file: !1054, line: 136, baseType: !1092, size: 64, offset: 704)
!1092 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1054, line: 82, baseType: !1093)
!1093 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1094, size: 64)
!1094 = !DISubroutineType(types: !1095)
!1095 = !{!467, !467, !1077, !1077}
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1056, file: !1054, line: 137, baseType: !1097, size: 64, offset: 768)
!1097 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1054, line: 83, baseType: !1098)
!1098 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1099, size: 64)
!1099 = !DISubroutineType(types: !1100)
!1100 = !{null, !467, !467}
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1056, file: !1054, line: 141, baseType: !5, size: 32, offset: 832)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1050, file: !961, line: 48, baseType: !1103, size: 64, offset: 64)
!1103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1104, size: 64)
!1104 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !396, line: 35, baseType: !1105)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !396, line: 35, size: 128, elements: !1106)
!1106 = !{!1107}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1105, file: !396, line: 35, baseType: !1108, size: 128)
!1108 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !396, line: 33, baseType: !1109)
!1109 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !396, line: 33, size: 128, elements: !1110)
!1110 = !{!1111, !1112, !1113}
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1109, file: !396, line: 33, baseType: !5, size: 32)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1109, file: !396, line: 33, baseType: !5, size: 32, offset: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1109, file: !396, line: 33, baseType: !1114, size: 64, offset: 64)
!1114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 64, elements: !483)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1050, file: !961, line: 51, baseType: !1116, size: 64, offset: 128)
!1116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1117, size: 64)
!1117 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !149, line: 183, baseType: !1118)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !149, line: 183, size: 128, elements: !1119)
!1119 = !{!1120}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1118, file: !149, line: 183, baseType: !1121, size: 128)
!1121 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !149, line: 182, baseType: !1122)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !149, line: 182, size: 128, elements: !1123)
!1123 = !{!1124, !1125, !1126}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1122, file: !149, line: 182, baseType: !5, size: 32)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1122, file: !149, line: 182, baseType: !5, size: 32, offset: 32)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1122, file: !149, line: 182, baseType: !1127, size: 64, offset: 64)
!1127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !554, size: 64, elements: !483)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1050, file: !961, line: 54, baseType: !554, size: 64, offset: 192)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1050, file: !961, line: 57, baseType: !1130, size: 128, offset: 256)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1131, line: 31, size: 128, elements: !1132)
!1131 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1132 = !{!1133, !1134, !1135, !1136, !1137, !1138, !1139}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1130, file: !1131, line: 35, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1130, file: !1131, line: 39, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1130, file: !1131, line: 42, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1130, file: !1131, line: 46, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1130, file: !1131, line: 50, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1130, file: !1131, line: 53, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1130, file: !1131, line: 56, baseType: !1140, size: 64, offset: 64)
!1140 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !509, line: 47, baseType: !774)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1050, file: !961, line: 60, baseType: !1130, size: 128, offset: 384)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1050, file: !961, line: 64, baseType: !1143, size: 64, offset: 512)
!1143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1144, size: 64)
!1144 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1145, line: 33, flags: DIFlagFwdDecl)
!1145 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1050, file: !961, line: 67, baseType: !554, size: 64, offset: 576)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1050, file: !961, line: 73, baseType: !1053, size: 64, offset: 640)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1050, file: !961, line: 77, baseType: !1140, size: 64, offset: 704)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1050, file: !961, line: 80, baseType: !5, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1050, file: !961, line: 82, baseType: !1151, size: 320, offset: 832)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !389, line: 62, size: 320, elements: !1152)
!1152 = !{!1153, !1159, !1160, !1161, !1162, !1169}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1151, file: !389, line: 63, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1155, size: 64)
!1155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !389, line: 56, size: 128, elements: !1156)
!1156 = !{!1157, !1158}
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1155, file: !389, line: 57, baseType: !1154, size: 64)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1155, file: !389, line: 58, baseType: !651, size: 8, offset: 64)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1151, file: !389, line: 64, baseType: !5, size: 32, offset: 64)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1151, file: !389, line: 66, baseType: !5, size: 32, offset: 96)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1151, file: !389, line: 68, baseType: !462, size: 8, offset: 128)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1151, file: !389, line: 70, baseType: !1163, size: 64, offset: 192)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !389, line: 37, size: 128, elements: !1165)
!1165 = !{!1166, !1167}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1164, file: !389, line: 39, baseType: !1163, size: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1164, file: !389, line: 40, baseType: !1168, size: 64, offset: 64)
!1168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1151, file: !389, line: 71, baseType: !1170, size: 64, offset: 256)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !389, line: 45, size: 320, elements: !1172)
!1172 = !{!1173, !1174}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1171, file: !389, line: 47, baseType: !1170, size: 64)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1171, file: !389, line: 48, baseType: !1175, size: 256, offset: 64)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !149, line: 1883, size: 256, elements: !1176)
!1176 = !{!1177, !1179, !1180, !1185}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1175, file: !149, line: 1884, baseType: !1178, size: 64)
!1178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1175, size: 64)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1175, file: !149, line: 1885, baseType: !1178, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1175, file: !149, line: 1891, baseType: !1181, size: 64, offset: 128)
!1181 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1175, file: !149, line: 1891, size: 64, elements: !1182)
!1182 = !{!1183, !1184}
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1181, file: !149, line: 1891, baseType: !529, size: 64)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1181, file: !149, line: 1891, baseType: !554, size: 64)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1175, file: !149, line: 1892, baseType: !1168, size: 64, offset: 192)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1010, file: !1011, line: 476, baseType: !1187, size: 64, offset: 256)
!1187 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1188, size: 64)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !376, line: 187, size: 256, elements: !1189)
!1189 = !{!1190, !1191, !1204, !1205}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !1188, file: !376, line: 189, baseType: !463, size: 32)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "larray", scope: !1188, file: !376, line: 192, baseType: !1192, size: 64, offset: 64)
!1192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !376, line: 87, baseType: !1194)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !376, line: 87, size: 128, elements: !1195)
!1195 = !{!1196}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1194, file: !376, line: 87, baseType: !1197, size: 128)
!1197 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !376, line: 85, baseType: !1198)
!1198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !376, line: 85, size: 128, elements: !1199)
!1199 = !{!1200, !1201, !1202}
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1198, file: !376, line: 85, baseType: !5, size: 32)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1198, file: !376, line: 85, baseType: !5, size: 32, offset: 32)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1198, file: !376, line: 85, baseType: !1203, size: 64, offset: 64)
!1203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !485, size: 64, elements: !483)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1188, file: !376, line: 197, baseType: !1053, size: 64, offset: 128)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "tree_root", scope: !1188, file: !376, line: 200, baseType: !486, size: 64, offset: 192)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1010, file: !1011, line: 479, baseType: !1053, size: 64, offset: 320)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1010, file: !1011, line: 484, baseType: !554, size: 64, offset: 384)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1010, file: !1011, line: 488, baseType: !554, size: 64, offset: 448)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1010, file: !1011, line: 493, baseType: !554, size: 64, offset: 512)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1010, file: !1011, line: 496, baseType: !554, size: 64, offset: 576)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1010, file: !1011, line: 501, baseType: !1212, size: 64, offset: 640)
!1212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1213, size: 64)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !144, line: 2355, size: 576, elements: !1214)
!1214 = !{!1215, !1218, !1219, !1220, !1221, !1223, !1224, !1229, !1230, !1231, !1232, !1233, !1234}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1213, file: !144, line: 2356, baseType: !1216, size: 64)
!1216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1217, size: 64)
!1217 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !144, line: 2356, flags: DIFlagFwdDecl)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1213, file: !144, line: 2357, baseType: !468, size: 64, offset: 64)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1213, file: !144, line: 2358, baseType: !463, size: 32, offset: 128)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1213, file: !144, line: 2359, baseType: !463, size: 32, offset: 160)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1213, file: !144, line: 2360, baseType: !1222, size: 128, offset: 192)
!1222 = !DICompositeType(tag: DW_TAG_array_type, baseType: !463, size: 128, elements: !814)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1213, file: !144, line: 2364, baseType: !463, size: 32, offset: 320)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1213, file: !144, line: 2367, baseType: !1225, size: 128, offset: 384)
!1225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !144, line: 2349, size: 128, elements: !1226)
!1226 = !{!1227, !1228}
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1225, file: !144, line: 2351, baseType: !722, size: 64)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1225, file: !144, line: 2352, baseType: !609, size: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1213, file: !144, line: 2371, baseType: !143, size: 32, offset: 512)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1213, file: !144, line: 2374, baseType: !5, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1213, file: !144, line: 2377, baseType: !5, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1213, file: !144, line: 2381, baseType: !5, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1213, file: !144, line: 2392, baseType: !5, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1213, file: !144, line: 2396, baseType: !5, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1010, file: !1011, line: 504, baseType: !1236, size: 64, offset: 704)
!1236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1237, size: 64)
!1237 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1011, line: 504, flags: DIFlagFwdDecl)
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1010, file: !1011, line: 507, baseType: !1053, size: 64, offset: 768)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1010, file: !1011, line: 510, baseType: !463, size: 32, offset: 832)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1010, file: !1011, line: 513, baseType: !463, size: 32, offset: 864)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1010, file: !1011, line: 516, baseType: !547, size: 32, offset: 896)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1010, file: !1011, line: 519, baseType: !547, size: 32, offset: 928)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1010, file: !1011, line: 522, baseType: !5, size: 32, offset: 960)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1010, file: !1011, line: 523, baseType: !5, size: 32, offset: 992)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1010, file: !1011, line: 528, baseType: !468, size: 64, offset: 1024)
!1246 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1010, file: !1011, line: 535, baseType: !5, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1010, file: !1011, line: 539, baseType: !5, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1010, file: !1011, line: 543, baseType: !5, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1010, file: !1011, line: 546, baseType: !5, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1010, file: !1011, line: 550, baseType: !5, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
