; ModuleID = 'tree-vect-generic.bc'
source_filename = "tree-vect-generic.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }

!2239 = !DIEnumerator(name: "GIMPLE_EH_MUST_NOT_THROW", value: 13, isUnsigned: true)
!2240 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!2241 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!2242 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!2243 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!2244 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!2245 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!2246 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!2247 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!2248 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!2249 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!2250 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!2251 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!2252 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!2253 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!2254 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!2255 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!2256 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!2257 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!2258 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!2259 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!2260 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!2261 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!2262 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !2196, line: 727, baseType: !7, size: 32, elements: !2263)
!2263 = !{!2264, !2265, !2266, !2267, !2268, !2269, !2270, !2271, !2272, !2273, !2274, !2275, !2276, !2277, !2278, !2279, !2280, !2281, !2282, !2283, !2284, !2285, !2286, !2287}
!2264 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!2265 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!2266 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!2267 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!2268 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!2269 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!2270 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!2271 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!2272 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!2273 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!2274 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!2275 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!2276 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!2277 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!2278 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!2279 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!2280 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!2281 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!2282 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!2283 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!2284 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!2285 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!2286 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!2287 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!2288 = !{!2289, !2290, !2291, !2292, !2295, !2296, !317, !2202, !2298, !2352, !2195, !2622, !3592, !2656, !2293, !189, !2354, !3370}
!2289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2290, size: 64)
!2290 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2291 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2292 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2293, size: 64)
!2293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2294, size: 64)
!2294 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2296 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2297, size: 64)
!2297 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2294)
!2298 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2299, line: 56, baseType: !2300)
!2299 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2301, size: 64)
!2301 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !318, line: 3371, size: 1792, elements: !2302)
!2302 = !{!2303, !2336, !2342, !2355, !2374, !2385, !2390, !2399, !2405, !2418, !2430, !2468, !2925, !2953, !2970, !2971, !2976, !2985, !2991, !2996, !3000, !3004, !3243, !3290, !3296, !3302, !3309, !3322, !3336, !3353, !3365, !3387, !3402, !3574}
!2303 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2301, file: !318, line: 3372, baseType: !2304, size: 64)
!2304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !318, line: 360, size: 64, elements: !2305)
!2305 = !{!2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332, !2333, !2334, !2335}
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2304, file: !318, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2304, file: !318, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2308 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2304, file: !318, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2309 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2304, file: !318, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2304, file: !318, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2304, file: !318, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2312 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2304, file: !318, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2304, file: !318, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2314 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2304, file: !318, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2304, file: !318, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2304, file: !318, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2317 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2304, file: !318, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2304, file: !318, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2304, file: !318, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2304, file: !318, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2304, file: !318, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2304, file: !318, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2304, file: !318, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2304, file: !318, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2304, file: !318, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2304, file: !318, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2327 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2304, file: !318, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2328 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2304, file: !318, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2329 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2304, file: !318, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2304, file: !318, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2304, file: !318, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2332 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2304, file: !318, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2333 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2304, file: !318, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2334 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2304, file: !318, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2304, file: !318, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2336 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2301, file: !318, line: 3373, baseType: !2337, size: 192)
!2337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !318, line: 402, size: 192, elements: !2338)
!2338 = !{!2339, !2340, !2341}
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2337, file: !318, line: 403, baseType: !2304, size: 64)
!2340 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2337, file: !318, line: 404, baseType: !2298, size: 64, offset: 64)
!2341 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2337, file: !318, line: 405, baseType: !2298, size: 64, offset: 128)
!2342 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2301, file: !318, line: 3374, baseType: !2343, size: 320)
!2343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !318, line: 1384, size: 320, elements: !2344)
!2344 = !{!2345, !2346}
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2343, file: !318, line: 1385, baseType: !2337, size: 192)
!2346 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2343, file: !318, line: 1386, baseType: !2347, size: 128, offset: 192)
!2347 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2348, line: 58, baseType: !2349)
!2348 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2349 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2348, line: 54, size: 128, elements: !2350)
!2350 = !{!2351, !2353}
!2351 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2349, file: !2348, line: 56, baseType: !2352, size: 64)
!2352 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2349, file: !2348, line: 57, baseType: !2354, size: 64, offset: 64)
!2354 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2355 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2301, file: !318, line: 3375, baseType: !2356, size: 256)
!2356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !318, line: 1397, size: 256, elements: !2357)
!2357 = !{!2358, !2359}
!2358 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2356, file: !318, line: 1398, baseType: !2337, size: 192)
!2359 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2356, file: !318, line: 1399, baseType: !2360, size: 64, offset: 192)
!2360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2361, size: 64)
!2361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2362, line: 52, size: 256, elements: !2363)
!2362 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2363 = !{!2364, !2365, !2366, !2367, !2368, !2369, !2370}
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2361, file: !2362, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2361, file: !2362, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2361, file: !2362, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2367 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2361, file: !2362, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2368 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2361, file: !2362, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2369 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2361, file: !2362, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2370 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2361, file: !2362, line: 62, baseType: !2371, size: 192, offset: 64)
!2371 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2352, size: 192, elements: !2372)
!2372 = !{!2373}
!2373 = !DISubrange(count: 3)
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2301, file: !318, line: 3376, baseType: !2375, size: 256)
!2375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !318, line: 1408, size: 256, elements: !2376)
!2376 = !{!2377, !2378}
!2377 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2375, file: !318, line: 1409, baseType: !2337, size: 192)
!2378 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2375, file: !318, line: 1410, baseType: !2379, size: 64, offset: 192)
!2379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2380, size: 64)
!2380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2381, line: 27, size: 192, elements: !2382)
!2381 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2382 = !{!2383, !2384}
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2380, file: !2381, line: 29, baseType: !2347, size: 128)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2380, file: !2381, line: 30, baseType: !189, size: 32, offset: 128)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2301, file: !318, line: 3377, baseType: !2386, size: 256)
!2386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !318, line: 1437, size: 256, elements: !2387)
!2387 = !{!2388, !2389}
!2388 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2386, file: !318, line: 1438, baseType: !2337, size: 192)
!2389 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2386, file: !318, line: 1439, baseType: !2298, size: 64, offset: 192)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2301, file: !318, line: 3378, baseType: !2391, size: 256)
!2391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !318, line: 1418, size: 256, elements: !2392)
!2392 = !{!2393, !2394, !2395}
!2393 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2391, file: !318, line: 1419, baseType: !2337, size: 192)
!2394 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2391, file: !318, line: 1420, baseType: !2291, size: 32, offset: 192)
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2391, file: !318, line: 1421, baseType: !2396, size: 8, offset: 224)
!2396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2294, size: 8, elements: !2397)
!2397 = !{!2398}
!2398 = !DISubrange(count: 1)
!2399 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2301, file: !318, line: 3379, baseType: !2400, size: 320)
!2400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !318, line: 1428, size: 320, elements: !2401)
!2401 = !{!2402, !2403, !2404}
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2400, file: !318, line: 1429, baseType: !2337, size: 192)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2400, file: !318, line: 1430, baseType: !2298, size: 64, offset: 192)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2400, file: !318, line: 1431, baseType: !2298, size: 64, offset: 256)
!2405 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2301, file: !318, line: 3380, baseType: !2406, size: 320)
!2406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !318, line: 1460, size: 320, elements: !2407)
!2407 = !{!2408, !2409}
!2408 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2406, file: !318, line: 1461, baseType: !2337, size: 192)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2406, file: !318, line: 1462, baseType: !2410, size: 128, offset: 192)
!2410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2411, line: 31, size: 128, elements: !2412)
!2411 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2412 = !{!2413, !2416, !2417}
!2413 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2410, file: !2411, line: 32, baseType: !2414, size: 64)
!2414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2415, size: 64)
!2415 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2290)
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2410, file: !2411, line: 33, baseType: !7, size: 32, offset: 64)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2410, file: !2411, line: 34, baseType: !7, size: 32, offset: 96)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2301, file: !318, line: 3381, baseType: !2419, size: 384)
!2419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !318, line: 2507, size: 384, elements: !2420)
!2420 = !{!2421, !2422, !2427, !2428, !2429}
!2421 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2419, file: !318, line: 2508, baseType: !2337, size: 192)
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2419, file: !318, line: 2509, baseType: !2423, size: 32, offset: 192)
!2423 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2424, line: 58, baseType: !2425)
!2424 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2425 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2426, line: 44, baseType: !7)
!2426 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2419, file: !318, line: 2510, baseType: !7, size: 32, offset: 224)
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2419, file: !318, line: 2511, baseType: !2298, size: 64, offset: 256)
!2429 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2419, file: !318, line: 2512, baseType: !2298, size: 64, offset: 320)
!2430 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2301, file: !318, line: 3382, baseType: !2431, size: 896)
!2431 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !318, line: 2652, size: 896, elements: !2432)
!2432 = !{!2433, !2434, !2435, !2436, !2437, !2438, !2439, !2440, !2441, !2442, !2443, !2444, !2445, !2446, !2447, !2448, !2449, !2450, !2451, !2452, !2453, !2454, !2455, !2456, !2457, !2458, !2459, !2460, !2461, !2462, !2463, !2464, !2465}
!2433 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2431, file: !318, line: 2653, baseType: !2419, size: 384)
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2431, file: !318, line: 2654, baseType: !2298, size: 64, offset: 384)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2431, file: !318, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2431, file: !318, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2431, file: !318, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2438 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2431, file: !318, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2439 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2431, file: !318, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2440 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2431, file: !318, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2441 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2431, file: !318, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2431, file: !318, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2443 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2431, file: !318, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2444 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2431, file: !318, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2445 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2431, file: !318, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2431, file: !318, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2431, file: !318, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2431, file: !318, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2431, file: !318, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2431, file: !318, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2431, file: !318, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2452 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2431, file: !318, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2453 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2431, file: !318, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2454 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2431, file: !318, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2431, file: !318, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2456 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2431, file: !318, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2457 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2431, file: !318, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2458 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2431, file: !318, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2459 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2431, file: !318, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2431, file: !318, line: 2703, baseType: !7, size: 32, offset: 512)
!2461 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2431, file: !318, line: 2705, baseType: !2298, size: 64, offset: 576)
!2462 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2431, file: !318, line: 2706, baseType: !2298, size: 64, offset: 640)
!2463 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2431, file: !318, line: 2707, baseType: !2298, size: 64, offset: 704)
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2431, file: !318, line: 2708, baseType: !2298, size: 64, offset: 768)
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2431, file: !318, line: 2711, baseType: !2466, size: 64, offset: 832)
!2466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2467, size: 64)
!2467 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !318, line: 2711, flags: DIFlagFwdDecl)
!2468 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2301, file: !318, line: 3383, baseType: !2469, size: 960)
!2469 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !318, line: 2756, size: 960, elements: !2470)
!2470 = !{!2471, !2472}
!2471 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2469, file: !318, line: 2757, baseType: !2431, size: 896)
!2472 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2469, file: !318, line: 2758, baseType: !2473, size: 64, offset: 896)
!2473 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2299, line: 50, baseType: !2474)
!2474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2475, size: 64)
!2475 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !561, line: 240, size: 384, elements: !2476)
!2476 = !{!2477, !2478, !2479, !2480, !2481, !2482, !2483, !2484, !2485, !2486, !2487}
!2477 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2475, file: !561, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2478 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2475, file: !561, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2479 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2475, file: !561, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2480 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2475, file: !561, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2481 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2475, file: !561, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2475, file: !561, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2483 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2475, file: !561, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2484 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2475, file: !561, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2485 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2475, file: !561, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2486 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2475, file: !561, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2475, file: !561, line: 321, baseType: !2488, size: 320, offset: 64)
!2488 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !561, line: 315, size: 320, elements: !2489)
!2489 = !{!2490, !2892, !2894, !2923, !2924}
!2490 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2488, file: !561, line: 316, baseType: !2491, size: 64)
!2491 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2492, size: 64, elements: !2397)
!2492 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !561, line: 183, baseType: !2493)
!2493 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !561, line: 166, size: 64, elements: !2494)
!2494 = !{!2495, !2496, !2497, !2498, !2499, !2507, !2508, !2520, !2523, !2583, !2584, !2869, !2882, !2889}
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2493, file: !561, line: 168, baseType: !2291, size: 32)
!2496 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2493, file: !561, line: 169, baseType: !7, size: 32)
!2497 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2493, file: !561, line: 170, baseType: !2296, size: 64)
!2498 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2493, file: !561, line: 171, baseType: !2473, size: 64)
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2493, file: !561, line: 172, baseType: !2500, size: 64)
!2500 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2299, line: 53, baseType: !2501)
!2501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2502, size: 64)
!2502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !561, line: 359, size: 128, elements: !2503)
!2503 = !{!2504, !2505}
!2504 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2502, file: !561, line: 360, baseType: !2291, size: 32)
!2505 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2502, file: !561, line: 361, baseType: !2506, size: 64, offset: 64)
!2506 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2473, size: 64, elements: !2397)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2493, file: !561, line: 173, baseType: !189, size: 32)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2493, file: !561, line: 174, baseType: !2509, size: 32)
!2509 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !561, line: 133, baseType: !2510)
!2510 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !561, line: 115, size: 32, elements: !2511)
!2511 = !{!2512, !2513, !2514, !2515, !2516, !2517, !2518, !2519}
!2512 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2510, file: !561, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2513 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2510, file: !561, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2514 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2510, file: !561, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2515 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2510, file: !561, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2516 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2510, file: !561, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2517 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2510, file: !561, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2518 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2510, file: !561, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2519 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2510, file: !561, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2493, file: !561, line: 175, baseType: !2521, size: 64)
!2521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2522, size: 64)
!2522 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !561, line: 175, flags: DIFlagFwdDecl)
!2523 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2493, file: !561, line: 176, baseType: !2524, size: 64)
!2524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2525, size: 64)
!2525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2526, line: 75, size: 256, elements: !2527)
!2526 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2527 = !{!2528, !2542, !2543, !2544}
!2528 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2525, file: !2526, line: 76, baseType: !2529, size: 64)
!2529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2530, size: 64)
!2530 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2526, line: 68, baseType: !2531)
!2531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2526, line: 63, size: 320, elements: !2532)
!2532 = !{!2533, !2535, !2536, !2537}
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2531, file: !2526, line: 64, baseType: !2534, size: 64)
!2534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2531, size: 64)
!2535 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2531, file: !2526, line: 65, baseType: !2534, size: 64, offset: 64)
!2536 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2531, file: !2526, line: 66, baseType: !7, size: 32, offset: 128)
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2531, file: !2526, line: 67, baseType: !2538, size: 128, offset: 192)
!2538 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2539, size: 128, elements: !2540)
!2539 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2526, line: 29, baseType: !2352)
!2540 = !{!2541}
!2541 = !DISubrange(count: 2)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2525, file: !2526, line: 77, baseType: !2529, size: 64, offset: 64)
!2543 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2525, file: !2526, line: 78, baseType: !7, size: 32, offset: 128)
!2544 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2525, file: !2526, line: 79, baseType: !2545, size: 64, offset: 192)
!2545 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2546, size: 64)
!2546 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2526, line: 49, baseType: !2547)
!2547 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2526, line: 45, size: 832, elements: !2548)
!2548 = !{!2549, !2550, !2551}
!2549 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2547, file: !2526, line: 46, baseType: !2534, size: 64)
!2550 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2547, file: !2526, line: 47, baseType: !2524, size: 64, offset: 64)
!2551 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2547, file: !2526, line: 48, baseType: !2552, size: 704, offset: 128)
!2552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2553, line: 164, size: 704, elements: !2554)
!2553 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2554 = !{!2555, !2556, !2566, !2567, !2568, !2569, !2570, !2571, !2575, !2579, !2580, !2581, !2582}
!2555 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2552, file: !2553, line: 166, baseType: !2354, size: 64)
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2552, file: !2553, line: 167, baseType: !2557, size: 64, offset: 64)
!2557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2558, size: 64)
!2558 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2553, line: 157, size: 192, elements: !2559)
!2559 = !{!2560, !2561, !2562}
!2560 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2558, file: !2553, line: 159, baseType: !2293, size: 64)
!2561 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2558, file: !2553, line: 160, baseType: !2557, size: 64, offset: 64)
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2558, file: !2553, line: 161, baseType: !2563, size: 32, offset: 128)
!2563 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2294, size: 32, elements: !2564)
!2564 = !{!2565}
!2565 = !DISubrange(count: 4)
!2566 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2552, file: !2553, line: 168, baseType: !2293, size: 64, offset: 128)
!2567 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2552, file: !2553, line: 169, baseType: !2293, size: 64, offset: 192)
!2568 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2552, file: !2553, line: 170, baseType: !2293, size: 64, offset: 256)
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2552, file: !2553, line: 171, baseType: !2354, size: 64, offset: 320)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2552, file: !2553, line: 172, baseType: !2291, size: 32, offset: 384)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2552, file: !2553, line: 176, baseType: !2572, size: 64, offset: 448)
!2572 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2573, size: 64)
!2573 = !DISubroutineType(types: !2574)
!2574 = !{!2557, !2295, !2354}
!2575 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2552, file: !2553, line: 177, baseType: !2576, size: 64, offset: 512)
!2576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2577, size: 64)
!2577 = !DISubroutineType(types: !2578)
!2578 = !{null, !2295, !2557}
!2579 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2552, file: !2553, line: 178, baseType: !2295, size: 64, offset: 576)
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2552, file: !2553, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2581 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2552, file: !2553, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2582 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2552, file: !2553, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2583 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2493, file: !561, line: 177, baseType: !2298, size: 64)
!2584 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !2493, file: !561, line: 178, baseType: !2585, size: 64)
!2585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2586, size: 64)
!2586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !513, line: 217, size: 832, elements: !2587)
!2587 = !{!2588, !2834, !2835, !2836, !2839, !2843, !2844, !2845, !2863, !2864, !2865, !2866, !2867, !2868}
!2588 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2586, file: !513, line: 219, baseType: !2589, size: 64)
!2589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2590, size: 64)
!2590 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !513, line: 151, baseType: !2591)
!2591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !513, line: 151, size: 128, elements: !2592)
!2592 = !{!2593}
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2591, file: !513, line: 151, baseType: !2594, size: 128)
!2594 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !513, line: 150, baseType: !2595)
!2595 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !513, line: 150, size: 128, elements: !2596)
!2596 = !{!2597, !2598, !2599}
!2597 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2595, file: !513, line: 150, baseType: !7, size: 32)
!2598 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2595, file: !513, line: 150, baseType: !7, size: 32, offset: 32)
!2599 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2595, file: !513, line: 150, baseType: !2600, size: 64, offset: 64)
!2600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2601, size: 64, elements: !2397)
!2601 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2299, line: 108, baseType: !2602)
!2602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2603, size: 64)
!2603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !513, line: 122, size: 512, elements: !2604)
!2604 = !{!2605, !2606, !2607, !2826, !2827, !2828, !2829, !2830, !2831, !2832}
!2605 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2603, file: !513, line: 124, baseType: !2585, size: 64)
!2606 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2603, file: !513, line: 125, baseType: !2585, size: 64, offset: 64)
!2607 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2603, file: !513, line: 131, baseType: !2608, size: 64, offset: 128)
!2608 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !513, line: 128, size: 64, elements: !2609)
!2609 = !{!2610, !2825}
!2610 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2608, file: !513, line: 129, baseType: !2611, size: 64)
!2611 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2299, line: 66, baseType: !2612)
!2612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2613, size: 64)
!2613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2196, line: 143, size: 192, elements: !2614)
!2614 = !{!2615, !2823, !2824}
!2615 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2613, file: !2196, line: 145, baseType: !2616, size: 64)
!2616 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !2299, line: 69, baseType: !2617)
!2617 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2618, size: 64)
!2618 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !2196, line: 136, size: 192, elements: !2619)
!2619 = !{!2620, !2821, !2822}
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2618, file: !2196, line: 137, baseType: !2621, size: 64)
!2621 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2299, line: 58, baseType: !2622)
!2622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2623, size: 64)
!2623 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !2196, line: 737, size: 768, elements: !2624)
!2624 = !{!2625, !2642, !2676, !2682, !2687, !2692, !2699, !2705, !2711, !2716, !2730, !2735, !2741, !2746, !2756, !2761, !2779, !2786, !2793, !2799, !2804, !2810, !2816}
!2625 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2623, file: !2196, line: 738, baseType: !2626, size: 256)
!2626 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !2196, line: 271, size: 256, elements: !2627)
!2627 = !{!2628, !2629, !2630, !2631, !2632, !2633, !2634, !2635, !2636, !2637, !2638, !2639, !2640, !2641}
!2628 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2626, file: !2196, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2629 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !2626, file: !2196, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2630 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2626, file: !2196, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2631 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !2626, file: !2196, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2632 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !2626, file: !2196, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !2626, file: !2196, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2634 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !2626, file: !2196, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!2635 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2626, file: !2196, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!2636 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !2626, file: !2196, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2637 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2626, file: !2196, line: 312, baseType: !7, size: 32, offset: 32)
!2638 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !2626, file: !2196, line: 316, baseType: !2423, size: 32, offset: 64)
!2639 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !2626, file: !2196, line: 319, baseType: !7, size: 32, offset: 96)
!2640 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !2626, file: !2196, line: 323, baseType: !2585, size: 64, offset: 128)
!2641 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2626, file: !2196, line: 327, baseType: !2298, size: 64, offset: 192)
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !2623, file: !2196, line: 739, baseType: !2643, size: 448)
!2643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !2196, line: 350, size: 448, elements: !2644)
!2644 = !{!2645, !2674}
!2645 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !2643, file: !2196, line: 353, baseType: !2646, size: 384)
!2646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !2196, line: 333, size: 384, elements: !2647)
!2647 = !{!2648, !2649, !2657}
!2648 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2646, file: !2196, line: 336, baseType: !2626, size: 256)
!2649 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !2646, file: !2196, line: 343, baseType: !2650, size: 64, offset: 256)
!2650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2651, size: 64)
!2651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !2652, line: 37, size: 128, elements: !2653)
!2652 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2653 = !{!2654, !2655}
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2651, file: !2652, line: 39, baseType: !2650, size: 64)
!2655 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !2651, file: !2652, line: 40, baseType: !2656, size: 64, offset: 64)
!2656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2298, size: 64)
!2657 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !2646, file: !2196, line: 344, baseType: !2658, size: 64, offset: 320)
!2658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2659, size: 64)
!2659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !2652, line: 45, size: 320, elements: !2660)
!2660 = !{!2661, !2662}
!2661 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2659, file: !2652, line: 47, baseType: !2658, size: 64)
!2662 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !2659, file: !2652, line: 48, baseType: !2663, size: 256, offset: 64)
!2663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !318, line: 1883, size: 256, elements: !2664)
!2664 = !{!2665, !2667, !2668, !2673}
!2665 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2663, file: !318, line: 1884, baseType: !2666, size: 64)
!2666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2663, size: 64)
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2663, file: !318, line: 1885, baseType: !2666, size: 64, offset: 64)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2663, file: !318, line: 1891, baseType: !2669, size: 64, offset: 128)
!2669 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2663, file: !318, line: 1891, size: 64, elements: !2670)
!2670 = !{!2671, !2672}
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2669, file: !318, line: 1891, baseType: !2621, size: 64)
!2672 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2669, file: !318, line: 1891, baseType: !2298, size: 64)
!2673 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2663, file: !318, line: 1892, baseType: !2656, size: 64, offset: 192)
!2674 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2643, file: !2196, line: 359, baseType: !2675, size: 64, offset: 384)
!2675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2298, size: 64, elements: !2397)
!2676 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !2623, file: !2196, line: 740, baseType: !2677, size: 512)
!2677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !2196, line: 365, size: 512, elements: !2678)
!2678 = !{!2679, !2680, !2681}
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !2677, file: !2196, line: 368, baseType: !2646, size: 384)
!2680 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !2677, file: !2196, line: 373, baseType: !2298, size: 64, offset: 384)
!2681 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !2677, file: !2196, line: 374, baseType: !2298, size: 64, offset: 448)
!2682 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !2623, file: !2196, line: 741, baseType: !2683, size: 576)
!2683 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !2196, line: 380, size: 576, elements: !2684)
!2684 = !{!2685, !2686}
!2685 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2683, file: !2196, line: 383, baseType: !2677, size: 512)
!2686 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2683, file: !2196, line: 389, baseType: !2675, size: 64, offset: 512)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2623, file: !2196, line: 742, baseType: !2688, size: 320)
!2688 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !2196, line: 395, size: 320, elements: !2689)
!2689 = !{!2690, !2691}
!2690 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2688, file: !2196, line: 397, baseType: !2626, size: 256)
!2691 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2688, file: !2196, line: 400, baseType: !2611, size: 64, offset: 256)
!2692 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !2623, file: !2196, line: 743, baseType: !2693, size: 448)
!2693 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !2196, line: 406, size: 448, elements: !2694)
!2694 = !{!2695, !2696, !2697, !2698}
!2695 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2693, file: !2196, line: 408, baseType: !2626, size: 256)
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2693, file: !2196, line: 412, baseType: !2298, size: 64, offset: 256)
!2697 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2693, file: !2196, line: 420, baseType: !2298, size: 64, offset: 320)
!2698 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2693, file: !2196, line: 423, baseType: !2611, size: 64, offset: 384)
!2699 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !2623, file: !2196, line: 744, baseType: !2700, size: 384)
!2700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !2196, line: 429, size: 384, elements: !2701)
!2701 = !{!2702, !2703, !2704}
!2702 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2700, file: !2196, line: 431, baseType: !2626, size: 256)
!2703 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2700, file: !2196, line: 434, baseType: !2298, size: 64, offset: 256)
!2704 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !2700, file: !2196, line: 437, baseType: !2611, size: 64, offset: 320)
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !2623, file: !2196, line: 745, baseType: !2706, size: 384)
!2706 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !2196, line: 443, size: 384, elements: !2707)
!2707 = !{!2708, !2709, !2710}
!2708 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2706, file: !2196, line: 445, baseType: !2626, size: 256)
!2709 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2706, file: !2196, line: 449, baseType: !2298, size: 64, offset: 256)
!2710 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !2706, file: !2196, line: 453, baseType: !2611, size: 64, offset: 320)
!2711 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !2623, file: !2196, line: 746, baseType: !2712, size: 320)
!2712 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !2196, line: 459, size: 320, elements: !2713)
!2713 = !{!2714, !2715}
!2714 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2712, file: !2196, line: 461, baseType: !2626, size: 256)
!2715 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !2712, file: !2196, line: 464, baseType: !2298, size: 64, offset: 256)
!2716 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !2623, file: !2196, line: 747, baseType: !2717, size: 768)
!2717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !2196, line: 469, size: 768, elements: !2718)
!2718 = !{!2719, !2720, !2721, !2722, !2723}
!2719 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2717, file: !2196, line: 471, baseType: !2626, size: 256)
!2720 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !2717, file: !2196, line: 474, baseType: !7, size: 32, offset: 256)
!2721 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !2717, file: !2196, line: 475, baseType: !7, size: 32, offset: 288)
!2722 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2717, file: !2196, line: 478, baseType: !2298, size: 64, offset: 320)
!2723 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !2717, file: !2196, line: 481, baseType: !2724, size: 384, offset: 384)
!2724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2725, size: 384, elements: !2397)
!2725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !318, line: 1917, size: 384, elements: !2726)
!2726 = !{!2727, !2728, !2729}
!2727 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !2725, file: !318, line: 1920, baseType: !2663, size: 256)
!2728 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !2725, file: !318, line: 1921, baseType: !2298, size: 64, offset: 256)
!2729 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2725, file: !318, line: 1922, baseType: !2423, size: 32, offset: 320)
!2730 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !2623, file: !2196, line: 748, baseType: !2731, size: 320)
!2731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !2196, line: 487, size: 320, elements: !2732)
!2732 = !{!2733, !2734}
!2733 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2731, file: !2196, line: 490, baseType: !2626, size: 256)
!2734 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2731, file: !2196, line: 494, baseType: !2291, size: 32, offset: 256)
!2735 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !2623, file: !2196, line: 749, baseType: !2736, size: 384)
!2736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !2196, line: 500, size: 384, elements: !2737)
!2737 = !{!2738, !2739, !2740}
!2738 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2736, file: !2196, line: 502, baseType: !2626, size: 256)
!2739 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !2736, file: !2196, line: 506, baseType: !2611, size: 64, offset: 256)
!2740 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2736, file: !2196, line: 510, baseType: !2611, size: 64, offset: 320)
!2741 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !2623, file: !2196, line: 750, baseType: !2742, size: 320)
!2742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !2196, line: 529, size: 320, elements: !2743)
!2743 = !{!2744, !2745}
!2744 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2742, file: !2196, line: 531, baseType: !2626, size: 256)
!2745 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2742, file: !2196, line: 540, baseType: !2611, size: 64, offset: 256)
!2746 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !2623, file: !2196, line: 751, baseType: !2747, size: 704)
!2747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !2196, line: 546, size: 704, elements: !2748)
!2748 = !{!2749, !2750, !2751, !2752, !2753, !2754, !2755}
!2749 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2747, file: !2196, line: 549, baseType: !2677, size: 512)
!2750 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2747, file: !2196, line: 553, baseType: !2296, size: 64, offset: 512)
!2751 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !2747, file: !2196, line: 557, baseType: !2290, size: 8, offset: 576)
!2752 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !2747, file: !2196, line: 558, baseType: !2290, size: 8, offset: 584)
!2753 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !2747, file: !2196, line: 559, baseType: !2290, size: 8, offset: 592)
!2754 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !2747, file: !2196, line: 560, baseType: !2290, size: 8, offset: 600)
!2755 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2747, file: !2196, line: 566, baseType: !2675, size: 64, offset: 640)
!2756 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !2623, file: !2196, line: 752, baseType: !2757, size: 384)
!2757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !2196, line: 571, size: 384, elements: !2758)
!2758 = !{!2759, !2760}
!2759 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2757, file: !2196, line: 573, baseType: !2688, size: 320)
!2760 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2757, file: !2196, line: 577, baseType: !2298, size: 64, offset: 320)
!2761 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !2623, file: !2196, line: 753, baseType: !2762, size: 576)
!2762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !2196, line: 600, size: 576, elements: !2763)
!2763 = !{!2764, !2765, !2766, !2769, !2778}
!2764 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2762, file: !2196, line: 602, baseType: !2688, size: 320)
!2765 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2762, file: !2196, line: 605, baseType: !2298, size: 64, offset: 320)
!2766 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !2762, file: !2196, line: 609, baseType: !2767, size: 64, offset: 384)
!2767 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2768, line: 46, baseType: !2352)
!2768 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2769 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !2762, file: !2196, line: 612, baseType: !2770, size: 64, offset: 448)
!2770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2771, size: 64)
!2771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !2196, line: 581, size: 320, elements: !2772)
!2772 = !{!2773, !2774, !2775, !2776, !2777}
!2773 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !2771, file: !2196, line: 583, baseType: !317, size: 32)
!2774 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2771, file: !2196, line: 586, baseType: !2298, size: 64, offset: 64)
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2771, file: !2196, line: 589, baseType: !2298, size: 64, offset: 128)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !2771, file: !2196, line: 592, baseType: !2298, size: 64, offset: 192)
!2777 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !2771, file: !2196, line: 595, baseType: !2298, size: 64, offset: 256)
!2778 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !2762, file: !2196, line: 616, baseType: !2611, size: 64, offset: 512)
!2779 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !2623, file: !2196, line: 754, baseType: !2780, size: 512)
!2780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !2196, line: 622, size: 512, elements: !2781)
!2781 = !{!2782, !2783, !2784, !2785}
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2780, file: !2196, line: 624, baseType: !2688, size: 320)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2780, file: !2196, line: 628, baseType: !2298, size: 64, offset: 320)
!2784 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !2780, file: !2196, line: 632, baseType: !2298, size: 64, offset: 384)
!2785 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !2780, file: !2196, line: 636, baseType: !2298, size: 64, offset: 448)
!2786 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !2623, file: !2196, line: 755, baseType: !2787, size: 704)
!2787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !2196, line: 642, size: 704, elements: !2788)
!2788 = !{!2789, !2790, !2791, !2792}
!2789 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !2787, file: !2196, line: 644, baseType: !2780, size: 512)
!2790 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !2787, file: !2196, line: 648, baseType: !2298, size: 64, offset: 512)
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !2787, file: !2196, line: 652, baseType: !2298, size: 64, offset: 576)
!2792 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !2787, file: !2196, line: 653, baseType: !2298, size: 64, offset: 640)
!2793 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !2623, file: !2196, line: 756, baseType: !2794, size: 448)
!2794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !2196, line: 663, size: 448, elements: !2795)
!2795 = !{!2796, !2797, !2798}
!2796 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2794, file: !2196, line: 665, baseType: !2688, size: 320)
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2794, file: !2196, line: 668, baseType: !2298, size: 64, offset: 320)
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !2794, file: !2196, line: 673, baseType: !2298, size: 64, offset: 384)
!2799 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !2623, file: !2196, line: 757, baseType: !2800, size: 384)
!2800 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !2196, line: 694, size: 384, elements: !2801)
!2801 = !{!2802, !2803}
!2802 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2800, file: !2196, line: 696, baseType: !2688, size: 320)
!2803 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2800, file: !2196, line: 699, baseType: !2298, size: 64, offset: 320)
!2804 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !2623, file: !2196, line: 758, baseType: !2805, size: 384)
!2805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !2196, line: 681, size: 384, elements: !2806)
!2806 = !{!2807, !2808, !2809}
!2807 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2805, file: !2196, line: 683, baseType: !2626, size: 256)
!2808 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !2805, file: !2196, line: 686, baseType: !2298, size: 64, offset: 256)
!2809 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !2805, file: !2196, line: 689, baseType: !2298, size: 64, offset: 320)
!2810 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !2623, file: !2196, line: 759, baseType: !2811, size: 384)
!2811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !2196, line: 707, size: 384, elements: !2812)
!2812 = !{!2813, !2814, !2815}
!2813 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2811, file: !2196, line: 709, baseType: !2626, size: 256)
!2814 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !2811, file: !2196, line: 712, baseType: !2298, size: 64, offset: 256)
!2815 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !2811, file: !2196, line: 712, baseType: !2298, size: 64, offset: 320)
!2816 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !2623, file: !2196, line: 760, baseType: !2817, size: 320)
!2817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !2196, line: 718, size: 320, elements: !2818)
!2818 = !{!2819, !2820}
!2819 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2817, file: !2196, line: 720, baseType: !2626, size: 256)
!2820 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !2817, file: !2196, line: 723, baseType: !2298, size: 64, offset: 256)
!2821 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2618, file: !2196, line: 138, baseType: !2617, size: 64, offset: 64)
!2822 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2618, file: !2196, line: 139, baseType: !2617, size: 64, offset: 128)
!2823 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !2613, file: !2196, line: 146, baseType: !2616, size: 64, offset: 64)
!2824 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2613, file: !2196, line: 152, baseType: !2611, size: 64, offset: 128)
!2825 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2608, file: !513, line: 130, baseType: !2473, size: 64)
!2826 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2603, file: !513, line: 134, baseType: !2295, size: 64, offset: 192)
!2827 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !2603, file: !513, line: 137, baseType: !2298, size: 64, offset: 256)
!2828 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !2603, file: !513, line: 138, baseType: !2423, size: 32, offset: 320)
!2829 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !2603, file: !513, line: 142, baseType: !7, size: 32, offset: 352)
!2830 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2603, file: !513, line: 144, baseType: !2291, size: 32, offset: 384)
!2831 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !2603, file: !513, line: 145, baseType: !2291, size: 32, offset: 416)
!2832 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2603, file: !513, line: 146, baseType: !2833, size: 64, offset: 448)
!2833 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !513, line: 119, baseType: !2354)
!2834 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !2586, file: !513, line: 220, baseType: !2589, size: 64, offset: 64)
!2835 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2586, file: !513, line: 223, baseType: !2295, size: 64, offset: 128)
!2836 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !2586, file: !513, line: 226, baseType: !2837, size: 64, offset: 192)
!2837 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2838, size: 64)
!2838 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !513, line: 185, flags: DIFlagFwdDecl)
!2839 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !2586, file: !513, line: 229, baseType: !2840, size: 128, offset: 256)
!2840 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2841, size: 128, elements: !2540)
!2841 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2842, size: 64)
!2842 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !513, line: 229, flags: DIFlagFwdDecl)
!2843 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !2586, file: !513, line: 232, baseType: !2585, size: 64, offset: 384)
!2844 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !2586, file: !513, line: 233, baseType: !2585, size: 64, offset: 448)
!2845 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !2586, file: !513, line: 238, baseType: !2846, size: 64, offset: 512)
!2846 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !513, line: 235, size: 64, elements: !2847)
!2847 = !{!2848, !2854}
!2848 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2846, file: !513, line: 236, baseType: !2849, size: 64)
!2849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2850, size: 64)
!2850 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !513, line: 273, size: 128, elements: !2851)
!2851 = !{!2852, !2853}
!2852 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2850, file: !513, line: 275, baseType: !2611, size: 64)
!2853 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2850, file: !513, line: 278, baseType: !2611, size: 64, offset: 64)
!2854 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2846, file: !513, line: 237, baseType: !2855, size: 64)
!2855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2856, size: 64)
!2856 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !513, line: 259, size: 320, elements: !2857)
!2857 = !{!2858, !2859, !2860, !2861, !2862}
!2858 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2856, file: !513, line: 261, baseType: !2473, size: 64)
!2859 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2856, file: !513, line: 262, baseType: !2473, size: 64, offset: 64)
!2860 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2856, file: !513, line: 266, baseType: !2473, size: 64, offset: 128)
!2861 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2856, file: !513, line: 267, baseType: !2473, size: 64, offset: 192)
!2862 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2856, file: !513, line: 270, baseType: !2291, size: 32, offset: 256)
!2863 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2586, file: !513, line: 241, baseType: !2833, size: 64, offset: 576)
!2864 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2586, file: !513, line: 244, baseType: !2291, size: 32, offset: 640)
!2865 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !2586, file: !513, line: 247, baseType: !2291, size: 32, offset: 672)
!2866 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !2586, file: !513, line: 250, baseType: !2291, size: 32, offset: 704)
!2867 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !2586, file: !513, line: 253, baseType: !2291, size: 32, offset: 736)
!2868 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2586, file: !513, line: 256, baseType: !2291, size: 32, offset: 768)
!2869 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !2493, file: !561, line: 179, baseType: !2870, size: 64)
!2870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2871, size: 64)
!2871 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !561, line: 150, baseType: !2872)
!2872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !561, line: 142, size: 320, elements: !2873)
!2873 = !{!2874, !2875, !2876, !2877, !2880, !2881}
!2874 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !2872, file: !561, line: 144, baseType: !2298, size: 64)
!2875 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2872, file: !561, line: 145, baseType: !2473, size: 64, offset: 64)
!2876 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2872, file: !561, line: 146, baseType: !2473, size: 64, offset: 128)
!2877 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !2872, file: !561, line: 147, baseType: !2878, size: 32, offset: 192)
!2878 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2879, line: 31, baseType: !2291)
!2879 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2880 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2872, file: !561, line: 148, baseType: !7, size: 32, offset: 224)
!2881 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !2872, file: !561, line: 149, baseType: !2290, size: 8, offset: 256)
!2882 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !2493, file: !561, line: 180, baseType: !2883, size: 64)
!2883 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2884, size: 64)
!2884 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !561, line: 162, baseType: !2885)
!2885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !561, line: 159, size: 128, elements: !2886)
!2886 = !{!2887, !2888}
!2887 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2885, file: !561, line: 160, baseType: !2298, size: 64)
!2888 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2885, file: !561, line: 161, baseType: !2354, size: 64, offset: 64)
!2889 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !2493, file: !561, line: 181, baseType: !2890, size: 64)
!2890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2891, size: 64)
!2891 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !561, line: 181, flags: DIFlagFwdDecl)
!2892 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !2488, file: !561, line: 317, baseType: !2893, size: 64)
!2893 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2354, size: 64, elements: !2397)
!2894 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !2488, file: !561, line: 318, baseType: !2895, size: 320)
!2895 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !561, line: 188, size: 320, elements: !2896)
!2896 = !{!2897, !2899, !2922}
!2897 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2895, file: !561, line: 190, baseType: !2898, size: 192)
!2898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2492, size: 192, elements: !2372)
!2899 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2895, file: !561, line: 193, baseType: !2900, size: 64, offset: 192)
!2900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2901, size: 64)
!2901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !561, line: 206, size: 320, elements: !2902)
!2902 = !{!2903, !2907, !2908, !2909, !2921}
!2903 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2901, file: !561, line: 208, baseType: !2904, size: 64)
!2904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2905, size: 64)
!2905 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !2299, line: 62, baseType: !2906)
!2906 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2299, line: 61, flags: DIFlagFwdDecl)
!2907 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2901, file: !561, line: 211, baseType: !7, size: 32, offset: 64)
!2908 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2901, file: !561, line: 214, baseType: !2354, size: 64, offset: 128)
!2909 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2901, file: !561, line: 224, baseType: !2910, size: 64, offset: 192)
!2910 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2911, size: 64)
!2911 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !561, line: 202, baseType: !2912)
!2912 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !561, line: 202, size: 128, elements: !2913)
!2913 = !{!2914}
!2914 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2912, file: !561, line: 202, baseType: !2915, size: 128)
!2915 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !561, line: 200, baseType: !2916)
!2916 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !561, line: 200, size: 128, elements: !2917)
!2917 = !{!2918, !2919, !2920}
!2918 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2916, file: !561, line: 200, baseType: !7, size: 32)
!2919 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2916, file: !561, line: 200, baseType: !7, size: 32, offset: 32)
!2920 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2916, file: !561, line: 200, baseType: !2506, size: 64, offset: 64)
!2921 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2901, file: !561, line: 234, baseType: !2910, size: 64, offset: 256)
!2922 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2895, file: !561, line: 197, baseType: !2354, size: 64, offset: 256)
!2923 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !2488, file: !561, line: 319, baseType: !2361, size: 256)
!2924 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !2488, file: !561, line: 320, baseType: !2380, size: 192)
!2925 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2301, file: !318, line: 3384, baseType: !2926, size: 1472)
!2926 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !318, line: 3114, size: 1472, elements: !2927)
!2927 = !{!2928, !2949, !2950, !2951, !2952}
!2928 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2926, file: !318, line: 3115, baseType: !2929, size: 1216)
!2929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !318, line: 2984, size: 1216, elements: !2930)
!2930 = !{!2931, !2932, !2933, !2934, !2935, !2936, !2937, !2938, !2939, !2940, !2941, !2942, !2943, !2944, !2945, !2946, !2947, !2948}
!2931 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2929, file: !318, line: 2985, baseType: !2469, size: 960)
!2932 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2929, file: !318, line: 2986, baseType: !2298, size: 64, offset: 960)
!2933 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2929, file: !318, line: 2987, baseType: !2298, size: 64, offset: 1024)
!2934 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2929, file: !318, line: 2988, baseType: !2298, size: 64, offset: 1088)
!2935 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2929, file: !318, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2936 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2929, file: !318, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2937 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2929, file: !318, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2938 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2929, file: !318, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2939 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2929, file: !318, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2940 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2929, file: !318, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2941 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2929, file: !318, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2942 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2929, file: !318, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2943 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2929, file: !318, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2944 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2929, file: !318, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2945 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2929, file: !318, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2946 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2929, file: !318, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2947 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2929, file: !318, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2948 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2929, file: !318, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2949 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2926, file: !318, line: 3117, baseType: !2298, size: 64, offset: 1216)
!2950 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2926, file: !318, line: 3119, baseType: !2298, size: 64, offset: 1280)
!2951 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2926, file: !318, line: 3121, baseType: !2298, size: 64, offset: 1344)
!2952 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2926, file: !318, line: 3123, baseType: !2298, size: 64, offset: 1408)
!2953 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2301, file: !318, line: 3385, baseType: !2954, size: 1088)
!2954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !318, line: 2874, size: 1088, elements: !2955)
!2955 = !{!2956, !2957, !2958}
!2956 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2954, file: !318, line: 2875, baseType: !2469, size: 960)
!2957 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2954, file: !318, line: 2876, baseType: !2473, size: 64, offset: 960)
!2958 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2954, file: !318, line: 2877, baseType: !2959, size: 64, offset: 1024)
!2959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2960, size: 64)
!2960 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2961, line: 172, size: 128, elements: !2962)
!2961 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2962 = !{!2963, !2964, !2965, !2966, !2967, !2968, !2969}
!2963 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2960, file: !2961, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2964 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2960, file: !2961, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2965 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2960, file: !2961, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2966 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2960, file: !2961, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2967 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2960, file: !2961, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2968 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2960, file: !2961, line: 195, baseType: !7, size: 32, offset: 32)
!2969 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2960, file: !2961, line: 199, baseType: !2298, size: 64, offset: 64)
!2970 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2301, file: !318, line: 3386, baseType: !2929, size: 1216)
!2971 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2301, file: !318, line: 3387, baseType: !2972, size: 1280)
!2972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !318, line: 3093, size: 1280, elements: !2973)
!2973 = !{!2974, !2975}
!2974 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2972, file: !318, line: 3094, baseType: !2929, size: 1216)
!2975 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2972, file: !318, line: 3095, baseType: !2959, size: 64, offset: 1216)
!2976 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2301, file: !318, line: 3388, baseType: !2977, size: 1216)
!2977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !318, line: 2824, size: 1216, elements: !2978)
!2978 = !{!2979, !2980, !2981, !2982, !2983, !2984}
!2979 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2977, file: !318, line: 2825, baseType: !2431, size: 896)
!2980 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2977, file: !318, line: 2827, baseType: !2298, size: 64, offset: 896)
!2981 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2977, file: !318, line: 2828, baseType: !2298, size: 64, offset: 960)
!2982 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2977, file: !318, line: 2829, baseType: !2298, size: 64, offset: 1024)
!2983 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2977, file: !318, line: 2830, baseType: !2298, size: 64, offset: 1088)
!2984 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2977, file: !318, line: 2831, baseType: !2298, size: 64, offset: 1152)
!2985 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2301, file: !318, line: 3389, baseType: !2986, size: 1024)
!2986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !318, line: 2850, size: 1024, elements: !2987)
!2987 = !{!2988, !2989, !2990}
!2988 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2986, file: !318, line: 2851, baseType: !2469, size: 960)
!2989 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2986, file: !318, line: 2852, baseType: !2291, size: 32, offset: 960)
!2990 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2986, file: !318, line: 2853, baseType: !2291, size: 32, offset: 992)
!2991 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2301, file: !318, line: 3390, baseType: !2992, size: 1024)
!2992 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !318, line: 2857, size: 1024, elements: !2993)
!2993 = !{!2994, !2995}
!2994 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2992, file: !318, line: 2858, baseType: !2469, size: 960)
!2995 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2992, file: !318, line: 2859, baseType: !2959, size: 64, offset: 960)
!2996 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2301, file: !318, line: 3391, baseType: !2997, size: 960)
!2997 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !318, line: 2862, size: 960, elements: !2998)
!2998 = !{!2999}
!2999 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2997, file: !318, line: 2863, baseType: !2469, size: 960)
!3000 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2301, file: !318, line: 3392, baseType: !3001, size: 1472)
!3001 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !318, line: 3304, size: 1472, elements: !3002)
!3002 = !{!3003}
!3003 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3001, file: !318, line: 3305, baseType: !2926, size: 1472)
!3004 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2301, file: !318, line: 3393, baseType: !3005, size: 1792)
!3005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !318, line: 3248, size: 1792, elements: !3006)
!3006 = !{!3007, !3008, !3222, !3223, !3224, !3225, !3226, !3227, !3228, !3229, !3230, !3231, !3232, !3233, !3234, !3235, !3236, !3237, !3238, !3239, !3240, !3241, !3242}
!3007 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !3005, file: !318, line: 3249, baseType: !2926, size: 1472)
!3008 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !3005, file: !318, line: 3251, baseType: !3009, size: 64, offset: 1472)
!3009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3010, size: 64)
!3010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !3011, line: 463, size: 1152, elements: !3012)
!3011 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3012 = !{!3013, !3016, !3047, !3048, !3163, !3166, !3167, !3168, !3169, !3170, !3171, !3195, !3198, !3199, !3200, !3201, !3202, !3203, !3204, !3205, !3206, !3207, !3208, !3209, !3210, !3211, !3212, !3213, !3214, !3215, !3216, !3217, !3218, !3219, !3220, !3221}
!3013 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !3010, file: !3011, line: 464, baseType: !3014, size: 64)
!3014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3015, size: 64)
!3015 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !3011, line: 464, flags: DIFlagFwdDecl)
!3016 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !3010, file: !3011, line: 467, baseType: !3017, size: 64, offset: 64)
!3017 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3018, size: 64)
!3018 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !513, line: 374, size: 640, elements: !3019)
!3019 = !{!3020, !3022, !3023, !3036, !3037, !3038, !3039, !3040, !3041, !3043, !3045, !3046}
!3020 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !3018, file: !513, line: 377, baseType: !3021, size: 64)
!3021 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !2299, line: 111, baseType: !2585)
!3022 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !3018, file: !513, line: 378, baseType: !3021, size: 64, offset: 64)
!3023 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !3018, file: !513, line: 381, baseType: !3024, size: 64, offset: 128)
!3024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3025, size: 64)
!3025 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !513, line: 282, baseType: !3026)
!3026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !513, line: 282, size: 128, elements: !3027)
!3027 = !{!3028}
!3028 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !3026, file: !513, line: 282, baseType: !3029, size: 128)
!3029 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !513, line: 281, baseType: !3030)
!3030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !513, line: 281, size: 128, elements: !3031)
!3031 = !{!3032, !3033, !3034}
!3032 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !3030, file: !513, line: 281, baseType: !7, size: 32)
!3033 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !3030, file: !513, line: 281, baseType: !7, size: 32, offset: 32)
!3034 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !3030, file: !513, line: 281, baseType: !3035, size: 64, offset: 64)
!3035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !3021, size: 64, elements: !2397)
!3036 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !3018, file: !513, line: 384, baseType: !2291, size: 32, offset: 192)
!3037 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !3018, file: !513, line: 387, baseType: !2291, size: 32, offset: 224)
!3038 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !3018, file: !513, line: 390, baseType: !2291, size: 32, offset: 256)
!3039 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !3018, file: !513, line: 394, baseType: !3024, size: 64, offset: 320)
!3040 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !3018, file: !513, line: 396, baseType: !512, size: 32, offset: 384)
!3041 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !3018, file: !513, line: 399, baseType: !3042, size: 64, offset: 416)
!3042 = !DICompositeType(tag: DW_TAG_array_type, baseType: !518, size: 64, elements: !2540)
!3043 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !3018, file: !513, line: 402, baseType: !3044, size: 64, offset: 480)
!3044 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !2540)
!3045 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !3018, file: !513, line: 406, baseType: !2291, size: 32, offset: 544)
!3046 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !3018, file: !513, line: 409, baseType: !2291, size: 32, offset: 576)
!3047 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !3010, file: !3011, line: 470, baseType: !2612, size: 64, offset: 128)
!3048 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !3010, file: !3011, line: 473, baseType: !3049, size: 64, offset: 192)
!3049 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3050, size: 64)
!3050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !2961, line: 39, size: 1152, elements: !3051)
!3051 = !{!3052, !3102, !3115, !3127, !3128, !3140, !3141, !3145, !3146, !3147, !3148, !3149}
!3052 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !3050, file: !2961, line: 41, baseType: !3053, size: 64)
!3053 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !3054, line: 144, baseType: !3055)
!3054 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!3055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3056, size: 64)
!3056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !3054, line: 100, size: 896, elements: !3057)
!3057 = !{!3058, !3066, !3071, !3076, !3078, !3079, !3080, !3081, !3082, !3083, !3088, !3090, !3091, !3096, !3101}
!3058 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !3056, file: !3054, line: 102, baseType: !3059, size: 64)
!3059 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !3054, line: 52, baseType: !3060)
