; ModuleID = 'tree-ssa-phiopt.bc'
source_filename = "tree-ssa-phiopt.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!606 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!607 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!608 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!609 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!610 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!611 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!612 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!613 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!614 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!615 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!616 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!617 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!618 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!619 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!620 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!621 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!622 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!623 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!624 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!625 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !561, line: 80, baseType: !7, size: 32, elements: !626)
!626 = !{!627, !628, !629, !630}
!627 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!628 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!629 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!630 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "mode_class", file: !632, line: 36, baseType: !7, size: 32, elements: !633)
!632 = !DIFile(filename: "./machmode.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!633 = !{!634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652}
!634 = !DIEnumerator(name: "MODE_RANDOM", value: 0, isUnsigned: true)
!635 = !DIEnumerator(name: "MODE_CC", value: 1, isUnsigned: true)
!636 = !DIEnumerator(name: "MODE_INT", value: 2, isUnsigned: true)
!637 = !DIEnumerator(name: "MODE_PARTIAL_INT", value: 3, isUnsigned: true)
!638 = !DIEnumerator(name: "MODE_FRACT", value: 4, isUnsigned: true)
!639 = !DIEnumerator(name: "MODE_UFRACT", value: 5, isUnsigned: true)
!640 = !DIEnumerator(name: "MODE_ACCUM", value: 6, isUnsigned: true)
!641 = !DIEnumerator(name: "MODE_UACCUM", value: 7, isUnsigned: true)
!642 = !DIEnumerator(name: "MODE_FLOAT", value: 8, isUnsigned: true)
!643 = !DIEnumerator(name: "MODE_DECIMAL_FLOAT", value: 9, isUnsigned: true)
!644 = !DIEnumerator(name: "MODE_COMPLEX_INT", value: 10, isUnsigned: true)
!645 = !DIEnumerator(name: "MODE_COMPLEX_FLOAT", value: 11, isUnsigned: true)
!646 = !DIEnumerator(name: "MODE_VECTOR_INT", value: 12, isUnsigned: true)
!647 = !DIEnumerator(name: "MODE_VECTOR_FRACT", value: 13, isUnsigned: true)
!648 = !DIEnumerator(name: "MODE_VECTOR_UFRACT", value: 14, isUnsigned: true)
!649 = !DIEnumerator(name: "MODE_VECTOR_ACCUM", value: 15, isUnsigned: true)
!650 = !DIEnumerator(name: "MODE_VECTOR_UACCUM", value: 16, isUnsigned: true)
!651 = !DIEnumerator(name: "MODE_VECTOR_FLOAT", value: 17, isUnsigned: true)
!652 = !DIEnumerator(name: "MAX_MODE_CLASS", value: 18, isUnsigned: true)
!653 = !{!654, !655, !656, !657, !660, !661, !663, !7, !780, !727, !1959, !183, !1966, !703, !1967, !1311, !658, !625, !722, !631, !5}
!654 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !655, size: 64)
!655 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!656 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!657 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !658, size: 64)
!658 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !659, size: 64)
!659 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!660 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !662, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !659)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !665, line: 111, baseType: !666)
!665 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !135, line: 217, size: 832, elements: !668)
!668 = !{!669, !1924, !1925, !1926, !1929, !1933, !1934, !1935, !1953, !1954, !1955, !1956, !1957, !1958}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !667, file: !135, line: 219, baseType: !670, size: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !135, line: 151, baseType: !672)
!672 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !135, line: 151, size: 128, elements: !673)
!673 = !{!674}
!674 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !672, file: !135, line: 151, baseType: !675, size: 128)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !135, line: 150, baseType: !676)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !135, line: 150, size: 128, elements: !677)
!677 = !{!678, !679, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !676, file: !135, line: 150, baseType: !7, size: 32)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !676, file: !135, line: 150, baseType: !7, size: 32, offset: 32)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !676, file: !135, line: 150, baseType: !681, size: 64, offset: 64)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !682, size: 64, elements: !825)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !665, line: 108, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !135, line: 122, size: 512, elements: !685)
!685 = !{!686, !687, !688, !1916, !1917, !1918, !1919, !1920, !1921, !1922}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !684, file: !135, line: 124, baseType: !666, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !684, file: !135, line: 125, baseType: !666, size: 64, offset: 64)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !684, file: !135, line: 131, baseType: !689, size: 64, offset: 128)
!689 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !135, line: 128, size: 64, elements: !690)
!690 = !{!691, !1915}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !689, file: !135, line: 129, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !665, line: 66, baseType: !693)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !561, line: 143, size: 192, elements: !695)
!695 = !{!696, !1913, !1914}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !694, file: !561, line: 145, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !665, line: 69, baseType: !698)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !561, line: 136, size: 192, elements: !700)
!700 = !{!701, !1911, !1912}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !699, file: !561, line: 137, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !665, line: 58, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !561, line: 737, size: 768, elements: !705)
!705 = !{!706, !1758, !1768, !1774, !1779, !1784, !1791, !1797, !1803, !1808, !1822, !1827, !1833, !1838, !1848, !1853, !1869, !1876, !1883, !1889, !1894, !1900, !1906}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !704, file: !561, line: 738, baseType: !707, size: 256)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !561, line: 271, size: 256, elements: !708)
!708 = !{!709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !724, !725, !726}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !707, file: !561, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !707, file: !561, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !707, file: !561, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !707, file: !561, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !707, file: !561, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !707, file: !561, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !707, file: !561, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !707, file: !561, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !707, file: !561, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !707, file: !561, line: 312, baseType: !7, size: 32, offset: 32)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !707, file: !561, line: 316, baseType: !720, size: 32, offset: 64)
!720 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !721, line: 58, baseType: !722)
!721 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!722 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !723, line: 44, baseType: !7)
!723 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!724 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !707, file: !561, line: 319, baseType: !7, size: 32, offset: 96)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !707, file: !561, line: 323, baseType: !666, size: 64, offset: 128)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !707, file: !561, line: 327, baseType: !727, size: 64, offset: 192)
!727 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !665, line: 56, baseType: !728)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !151, line: 3371, size: 1792, elements: !730)
!730 = !{!731, !764, !770, !783, !802, !813, !818, !827, !833, !846, !854, !892, !1066, !1094, !1111, !1112, !1117, !1126, !1132, !1137, !1141, !1145, !1409, !1456, !1462, !1468, !1475, !1488, !1502, !1519, !1531, !1553, !1568, !1740}
!731 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !729, file: !151, line: 3372, baseType: !732, size: 64)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !151, line: 360, size: 64, elements: !733)
!733 = !{!734, !735, !736, !737, !738, !739, !740, !741, !742, !743, !744, !745, !746, !747, !748, !749, !750, !751, !752, !753, !754, !755, !756, !757, !758, !759, !760, !761, !762, !763}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !732, file: !151, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !732, file: !151, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !732, file: !151, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !732, file: !151, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !732, file: !151, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !732, file: !151, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !732, file: !151, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !732, file: !151, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !732, file: !151, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !732, file: !151, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !732, file: !151, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !732, file: !151, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !732, file: !151, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !732, file: !151, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !732, file: !151, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !732, file: !151, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !732, file: !151, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !732, file: !151, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !732, file: !151, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !732, file: !151, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !732, file: !151, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !732, file: !151, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !732, file: !151, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !732, file: !151, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !732, file: !151, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !732, file: !151, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !732, file: !151, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !732, file: !151, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !732, file: !151, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!763 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !732, file: !151, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !729, file: !151, line: 3373, baseType: !765, size: 192)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !151, line: 402, size: 192, elements: !766)
!766 = !{!767, !768, !769}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !765, file: !151, line: 403, baseType: !732, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !765, file: !151, line: 404, baseType: !727, size: 64, offset: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !765, file: !151, line: 405, baseType: !727, size: 64, offset: 128)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !729, file: !151, line: 3374, baseType: !771, size: 320)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !151, line: 1384, size: 320, elements: !772)
!772 = !{!773, !774}
!773 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !771, file: !151, line: 1385, baseType: !765, size: 192)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !771, file: !151, line: 1386, baseType: !775, size: 128, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !776, line: 58, baseType: !777)
!776 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !776, line: 54, size: 128, elements: !778)
!778 = !{!779, !781}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !777, file: !776, line: 56, baseType: !780, size: 64)
!780 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !777, file: !776, line: 57, baseType: !782, size: 64, offset: 64)
!782 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !729, file: !151, line: 3375, baseType: !784, size: 256)
!784 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !151, line: 1397, size: 256, elements: !785)
!785 = !{!786, !787}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !784, file: !151, line: 1398, baseType: !765, size: 192)
!787 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !784, file: !151, line: 1399, baseType: !788, size: 64, offset: 192)
!788 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !789, size: 64)
!789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !790, line: 52, size: 256, elements: !791)
!790 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!791 = !{!792, !793, !794, !795, !796, !797, !798}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !789, file: !790, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !789, file: !790, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !789, file: !790, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !789, file: !790, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !789, file: !790, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !789, file: !790, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !789, file: !790, line: 62, baseType: !799, size: 192, offset: 64)
!799 = !DICompositeType(tag: DW_TAG_array_type, baseType: !780, size: 192, elements: !800)
!800 = !{!801}
!801 = !DISubrange(count: 3)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !729, file: !151, line: 3376, baseType: !803, size: 256)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !151, line: 1408, size: 256, elements: !804)
!804 = !{!805, !806}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !803, file: !151, line: 1409, baseType: !765, size: 192)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !803, file: !151, line: 1410, baseType: !807, size: 64, offset: 192)
!807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !808, size: 64)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !809, line: 27, size: 192, elements: !810)
!809 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!810 = !{!811, !812}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !808, file: !809, line: 29, baseType: !775, size: 128)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !808, file: !809, line: 30, baseType: !5, size: 32, offset: 128)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !729, file: !151, line: 3377, baseType: !814, size: 256)
!814 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !151, line: 1437, size: 256, elements: !815)
!815 = !{!816, !817}
!816 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !814, file: !151, line: 1438, baseType: !765, size: 192)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !814, file: !151, line: 1439, baseType: !727, size: 64, offset: 192)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !729, file: !151, line: 3378, baseType: !819, size: 256)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !151, line: 1418, size: 256, elements: !820)
!820 = !{!821, !822, !823}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !819, file: !151, line: 1419, baseType: !765, size: 192)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !819, file: !151, line: 1420, baseType: !656, size: 32, offset: 192)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !819, file: !151, line: 1421, baseType: !824, size: 8, offset: 224)
!824 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 8, elements: !825)
!825 = !{!826}
!826 = !DISubrange(count: 1)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !729, file: !151, line: 3379, baseType: !828, size: 320)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !151, line: 1428, size: 320, elements: !829)
!829 = !{!830, !831, !832}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !828, file: !151, line: 1429, baseType: !765, size: 192)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !828, file: !151, line: 1430, baseType: !727, size: 64, offset: 192)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !828, file: !151, line: 1431, baseType: !727, size: 64, offset: 256)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !729, file: !151, line: 3380, baseType: !834, size: 320)
!834 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !151, line: 1460, size: 320, elements: !835)
!835 = !{!836, !837}
!836 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !834, file: !151, line: 1461, baseType: !765, size: 192)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !834, file: !151, line: 1462, baseType: !838, size: 128, offset: 192)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !839, line: 31, size: 128, elements: !840)
!839 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!840 = !{!841, !844, !845}
!841 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !838, file: !839, line: 32, baseType: !842, size: 64)
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !655)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !838, file: !839, line: 33, baseType: !7, size: 32, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !838, file: !839, line: 34, baseType: !7, size: 32, offset: 96)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !729, file: !151, line: 3381, baseType: !847, size: 384)
!847 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !151, line: 2507, size: 384, elements: !848)
!848 = !{!849, !850, !851, !852, !853}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !847, file: !151, line: 2508, baseType: !765, size: 192)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !847, file: !151, line: 2509, baseType: !720, size: 32, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !847, file: !151, line: 2510, baseType: !7, size: 32, offset: 224)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !847, file: !151, line: 2511, baseType: !727, size: 64, offset: 256)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !847, file: !151, line: 2512, baseType: !727, size: 64, offset: 320)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !729, file: !151, line: 3382, baseType: !855, size: 896)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !151, line: 2652, size: 896, elements: !856)
!856 = !{!857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !889}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !855, file: !151, line: 2653, baseType: !847, size: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !855, file: !151, line: 2654, baseType: !727, size: 64, offset: 384)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !855, file: !151, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !855, file: !151, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !855, file: !151, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !855, file: !151, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !855, file: !151, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !855, file: !151, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !855, file: !151, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !855, file: !151, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !855, file: !151, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !855, file: !151, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !855, file: !151, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !855, file: !151, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !855, file: !151, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !855, file: !151, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !855, file: !151, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !855, file: !151, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !855, file: !151, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !855, file: !151, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !855, file: !151, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !855, file: !151, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !855, file: !151, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !855, file: !151, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !855, file: !151, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !855, file: !151, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !855, file: !151, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !855, file: !151, line: 2703, baseType: !7, size: 32, offset: 512)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !855, file: !151, line: 2705, baseType: !727, size: 64, offset: 576)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !855, file: !151, line: 2706, baseType: !727, size: 64, offset: 640)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !855, file: !151, line: 2707, baseType: !727, size: 64, offset: 704)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !855, file: !151, line: 2708, baseType: !727, size: 64, offset: 768)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !855, file: !151, line: 2711, baseType: !890, size: 64, offset: 832)
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !891, size: 64)
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !151, line: 2711, flags: DIFlagFwdDecl)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !729, file: !151, line: 3383, baseType: !893, size: 960)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !151, line: 2756, size: 960, elements: !894)
!894 = !{!895, !896}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !893, file: !151, line: 2757, baseType: !855, size: 896)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !893, file: !151, line: 2758, baseType: !897, size: 64, offset: 896)
!897 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !665, line: 50, baseType: !898)
!898 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !899, size: 64)
!899 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !900, line: 240, size: 384, elements: !901)
!900 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!901 = !{!902, !903, !904, !905, !906, !907, !908, !909, !910, !911, !912}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !899, file: !900, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !899, file: !900, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !899, file: !900, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !899, file: !900, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !899, file: !900, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !899, file: !900, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !899, file: !900, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !899, file: !900, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !899, file: !900, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !899, file: !900, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !899, file: !900, line: 321, baseType: !913, size: 320, offset: 64)
!913 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !900, line: 315, size: 320, elements: !914)
!914 = !{!915, !1033, !1035, !1064, !1065}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !913, file: !900, line: 316, baseType: !916, size: 64)
!916 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 64, elements: !825)
!917 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !900, line: 183, baseType: !918)
!918 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !900, line: 166, size: 64, elements: !919)
!919 = !{!920, !921, !922, !923, !924, !932, !933, !945, !948, !1008, !1009, !1010, !1023, !1030}
!920 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !918, file: !900, line: 168, baseType: !656, size: 32)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !918, file: !900, line: 169, baseType: !7, size: 32)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !918, file: !900, line: 170, baseType: !661, size: 64)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !918, file: !900, line: 171, baseType: !897, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !918, file: !900, line: 172, baseType: !925, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !665, line: 53, baseType: !926)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64)
!927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !900, line: 359, size: 128, elements: !928)
!928 = !{!929, !930}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !927, file: !900, line: 360, baseType: !656, size: 32)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !927, file: !900, line: 361, baseType: !931, size: 64, offset: 64)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 64, elements: !825)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !918, file: !900, line: 173, baseType: !5, size: 32)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !918, file: !900, line: 174, baseType: !934, size: 32)
!934 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !900, line: 133, baseType: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !900, line: 115, size: 32, elements: !936)
!936 = !{!937, !938, !939, !940, !941, !942, !943, !944}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !935, file: !900, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !935, file: !900, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!939 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !935, file: !900, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !935, file: !900, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !935, file: !900, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !935, file: !900, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !935, file: !900, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !935, file: !900, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!945 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !918, file: !900, line: 175, baseType: !946, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !947, size: 64)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !900, line: 175, flags: DIFlagFwdDecl)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !918, file: !900, line: 176, baseType: !949, size: 64)
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !951, line: 75, size: 256, elements: !952)
!951 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!952 = !{!953, !967, !968, !969}
!953 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !950, file: !951, line: 76, baseType: !954, size: 64)
!954 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !955, size: 64)
!955 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !951, line: 68, baseType: !956)
!956 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !951, line: 63, size: 320, elements: !957)
!957 = !{!958, !960, !961, !962}
!958 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !956, file: !951, line: 64, baseType: !959, size: 64)
!959 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !956, size: 64)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !956, file: !951, line: 65, baseType: !959, size: 64, offset: 64)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !956, file: !951, line: 66, baseType: !7, size: 32, offset: 128)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !956, file: !951, line: 67, baseType: !963, size: 128, offset: 192)
!963 = !DICompositeType(tag: DW_TAG_array_type, baseType: !964, size: 128, elements: !965)
!964 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !951, line: 29, baseType: !780)
!965 = !{!966}
!966 = !DISubrange(count: 2)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !950, file: !951, line: 77, baseType: !954, size: 64, offset: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !950, file: !951, line: 78, baseType: !7, size: 32, offset: 128)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !950, file: !951, line: 79, baseType: !970, size: 64, offset: 192)
!970 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !971, size: 64)
!971 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !951, line: 49, baseType: !972)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !951, line: 45, size: 832, elements: !973)
!973 = !{!974, !975, !976}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !972, file: !951, line: 46, baseType: !959, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !972, file: !951, line: 47, baseType: !949, size: 64, offset: 64)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !972, file: !951, line: 48, baseType: !977, size: 704, offset: 128)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !978, line: 164, size: 704, elements: !979)
!978 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!979 = !{!980, !981, !991, !992, !993, !994, !995, !996, !1000, !1004, !1005, !1006, !1007}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !977, file: !978, line: 166, baseType: !782, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !977, file: !978, line: 167, baseType: !982, size: 64, offset: 64)
!982 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !983, size: 64)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !978, line: 157, size: 192, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !983, file: !978, line: 159, baseType: !658, size: 64)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !983, file: !978, line: 160, baseType: !982, size: 64, offset: 64)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !983, file: !978, line: 161, baseType: !988, size: 32, offset: 128)
!988 = !DICompositeType(tag: DW_TAG_array_type, baseType: !659, size: 32, elements: !989)
!989 = !{!990}
!990 = !DISubrange(count: 4)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !977, file: !978, line: 168, baseType: !658, size: 64, offset: 128)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !977, file: !978, line: 169, baseType: !658, size: 64, offset: 192)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !977, file: !978, line: 170, baseType: !658, size: 64, offset: 256)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !977, file: !978, line: 171, baseType: !782, size: 64, offset: 320)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !977, file: !978, line: 172, baseType: !656, size: 32, offset: 384)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !977, file: !978, line: 176, baseType: !997, size: 64, offset: 448)
!997 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !998, size: 64)
!998 = !DISubroutineType(types: !999)
!999 = !{!982, !660, !782}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !977, file: !978, line: 177, baseType: !1001, size: 64, offset: 512)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{null, !660, !982}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !977, file: !978, line: 178, baseType: !660, size: 64, offset: 576)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !977, file: !978, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !977, file: !978, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !977, file: !978, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !918, file: !900, line: 177, baseType: !727, size: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !918, file: !900, line: 178, baseType: !666, size: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !918, file: !900, line: 179, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1012, size: 64)
!1012 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !900, line: 150, baseType: !1013)
!1013 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !900, line: 142, size: 320, elements: !1014)
!1014 = !{!1015, !1016, !1017, !1018, !1021, !1022}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1013, file: !900, line: 144, baseType: !727, size: 64)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1013, file: !900, line: 145, baseType: !897, size: 64, offset: 64)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1013, file: !900, line: 146, baseType: !897, size: 64, offset: 128)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1013, file: !900, line: 147, baseType: !1019, size: 32, offset: 192)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1020, line: 31, baseType: !656)
!1020 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1013, file: !900, line: 148, baseType: !7, size: 32, offset: 224)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1013, file: !900, line: 149, baseType: !655, size: 8, offset: 256)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !918, file: !900, line: 180, baseType: !1024, size: 64)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !900, line: 162, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !900, line: 159, size: 128, elements: !1027)
!1027 = !{!1028, !1029}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1026, file: !900, line: 160, baseType: !727, size: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1026, file: !900, line: 161, baseType: !782, size: 64, offset: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !918, file: !900, line: 181, baseType: !1031, size: 64)
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !900, line: 181, flags: DIFlagFwdDecl)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !913, file: !900, line: 317, baseType: !1034, size: 64)
!1034 = !DICompositeType(tag: DW_TAG_array_type, baseType: !782, size: 64, elements: !825)
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !913, file: !900, line: 318, baseType: !1036, size: 320)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !900, line: 188, size: 320, elements: !1037)
!1037 = !{!1038, !1040, !1063}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1036, file: !900, line: 190, baseType: !1039, size: 192)
!1039 = !DICompositeType(tag: DW_TAG_array_type, baseType: !917, size: 192, elements: !800)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1036, file: !900, line: 193, baseType: !1041, size: 64, offset: 192)
!1041 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1042, size: 64)
!1042 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !900, line: 206, size: 320, elements: !1043)
!1043 = !{!1044, !1048, !1049, !1050, !1062}
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1042, file: !900, line: 208, baseType: !1045, size: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !665, line: 62, baseType: !1047)
!1047 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !665, line: 61, flags: DIFlagFwdDecl)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1042, file: !900, line: 211, baseType: !7, size: 32, offset: 64)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1042, file: !900, line: 214, baseType: !782, size: 64, offset: 128)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1042, file: !900, line: 224, baseType: !1051, size: 64, offset: 192)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !900, line: 202, baseType: !1053)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !900, line: 202, size: 128, elements: !1054)
!1054 = !{!1055}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1053, file: !900, line: 202, baseType: !1056, size: 128)
!1056 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !900, line: 200, baseType: !1057)
!1057 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !900, line: 200, size: 128, elements: !1058)
!1058 = !{!1059, !1060, !1061}
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1057, file: !900, line: 200, baseType: !7, size: 32)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1057, file: !900, line: 200, baseType: !7, size: 32, offset: 32)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1057, file: !900, line: 200, baseType: !931, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1042, file: !900, line: 234, baseType: !1051, size: 64, offset: 256)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1036, file: !900, line: 197, baseType: !782, size: 64, offset: 256)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !913, file: !900, line: 319, baseType: !789, size: 256)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !913, file: !900, line: 320, baseType: !808, size: 192)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !729, file: !151, line: 3384, baseType: !1067, size: 1472)
!1067 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !151, line: 3114, size: 1472, elements: !1068)
!1068 = !{!1069, !1090, !1091, !1092, !1093}
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1067, file: !151, line: 3115, baseType: !1070, size: 1216)
!1070 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !151, line: 2984, size: 1216, elements: !1071)
!1071 = !{!1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1080, !1081, !1082, !1083, !1084, !1085, !1086, !1087, !1088, !1089}
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1070, file: !151, line: 2985, baseType: !893, size: 960)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1070, file: !151, line: 2986, baseType: !727, size: 64, offset: 960)
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1070, file: !151, line: 2987, baseType: !727, size: 64, offset: 1024)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1070, file: !151, line: 2988, baseType: !727, size: 64, offset: 1088)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1070, file: !151, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1070, file: !151, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1070, file: !151, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1070, file: !151, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1070, file: !151, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1070, file: !151, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1070, file: !151, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1070, file: !151, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1070, file: !151, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1070, file: !151, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1070, file: !151, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1070, file: !151, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1070, file: !151, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1070, file: !151, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1067, file: !151, line: 3117, baseType: !727, size: 64, offset: 1216)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1067, file: !151, line: 3119, baseType: !727, size: 64, offset: 1280)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1067, file: !151, line: 3121, baseType: !727, size: 64, offset: 1344)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1067, file: !151, line: 3123, baseType: !727, size: 64, offset: 1408)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !729, file: !151, line: 3385, baseType: !1095, size: 1088)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !151, line: 2874, size: 1088, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1095, file: !151, line: 2875, baseType: !893, size: 960)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1095, file: !151, line: 2876, baseType: !897, size: 64, offset: 960)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1095, file: !151, line: 2877, baseType: !1100, size: 64, offset: 1024)
!1100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1101, size: 64)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1102, line: 172, size: 128, elements: !1103)
!1102 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1103 = !{!1104, !1105, !1106, !1107, !1108, !1109, !1110}
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1101, file: !1102, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1101, file: !1102, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1101, file: !1102, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1101, file: !1102, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1101, file: !1102, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1101, file: !1102, line: 195, baseType: !7, size: 32, offset: 32)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1101, file: !1102, line: 199, baseType: !727, size: 64, offset: 64)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !729, file: !151, line: 3386, baseType: !1070, size: 1216)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !729, file: !151, line: 3387, baseType: !1113, size: 1280)
!1113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !151, line: 3093, size: 1280, elements: !1114)
!1114 = !{!1115, !1116}
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1113, file: !151, line: 3094, baseType: !1070, size: 1216)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1113, file: !151, line: 3095, baseType: !1100, size: 64, offset: 1216)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !729, file: !151, line: 3388, baseType: !1118, size: 1216)
!1118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !151, line: 2824, size: 1216, elements: !1119)
!1119 = !{!1120, !1121, !1122, !1123, !1124, !1125}
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1118, file: !151, line: 2825, baseType: !855, size: 896)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1118, file: !151, line: 2827, baseType: !727, size: 64, offset: 896)
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1118, file: !151, line: 2828, baseType: !727, size: 64, offset: 960)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1118, file: !151, line: 2829, baseType: !727, size: 64, offset: 1024)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1118, file: !151, line: 2830, baseType: !727, size: 64, offset: 1088)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1118, file: !151, line: 2831, baseType: !727, size: 64, offset: 1152)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !729, file: !151, line: 3389, baseType: !1127, size: 1024)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !151, line: 2850, size: 1024, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1127, file: !151, line: 2851, baseType: !893, size: 960)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1127, file: !151, line: 2852, baseType: !656, size: 32, offset: 960)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1127, file: !151, line: 2853, baseType: !656, size: 32, offset: 992)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !729, file: !151, line: 3390, baseType: !1133, size: 1024)
!1133 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !151, line: 2857, size: 1024, elements: !1134)
!1134 = !{!1135, !1136}
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1133, file: !151, line: 2858, baseType: !893, size: 960)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1133, file: !151, line: 2859, baseType: !1100, size: 64, offset: 960)
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !729, file: !151, line: 3391, baseType: !1138, size: 960)
!1138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !151, line: 2862, size: 960, elements: !1139)
!1139 = !{!1140}
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1138, file: !151, line: 2863, baseType: !893, size: 960)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !729, file: !151, line: 3392, baseType: !1142, size: 1472)
!1142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !151, line: 3304, size: 1472, elements: !1143)
!1143 = !{!1144}
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1142, file: !151, line: 3305, baseType: !1067, size: 1472)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !729, file: !151, line: 3393, baseType: !1146, size: 1792)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !151, line: 3248, size: 1792, elements: !1147)
!1147 = !{!1148, !1149, !1388, !1389, !1390, !1391, !1392, !1393, !1394, !1395, !1396, !1397, !1398, !1399, !1400, !1401, !1402, !1403, !1404, !1405, !1406, !1407, !1408}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1146, file: !151, line: 3249, baseType: !1067, size: 1472)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1146, file: !151, line: 3251, baseType: !1150, size: 64, offset: 1472)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1152, line: 463, size: 1152, elements: !1153)
!1152 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1153 = !{!1154, !1157, !1187, !1188, !1329, !1332, !1333, !1334, !1335, !1336, !1337, !1361, !1364, !1365, !1366, !1367, !1368, !1369, !1370, !1371, !1372, !1373, !1374, !1375, !1376, !1377, !1378, !1379, !1380, !1381, !1382, !1383, !1384, !1385, !1386, !1387}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1151, file: !1152, line: 464, baseType: !1155, size: 64)
!1155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1156, size: 64)
!1156 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1152, line: 464, flags: DIFlagFwdDecl)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1151, file: !1152, line: 467, baseType: !1158, size: 64, offset: 64)
!1158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1159, size: 64)
!1159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !135, line: 374, size: 640, elements: !1160)
!1160 = !{!1161, !1162, !1163, !1176, !1177, !1178, !1179, !1180, !1181, !1183, !1185, !1186}
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1159, file: !135, line: 377, baseType: !664, size: 64)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1159, file: !135, line: 378, baseType: !664, size: 64, offset: 64)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1159, file: !135, line: 381, baseType: !1164, size: 64, offset: 128)
!1164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1165, size: 64)
!1165 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !135, line: 282, baseType: !1166)
!1166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !135, line: 282, size: 128, elements: !1167)
!1167 = !{!1168}
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1166, file: !135, line: 282, baseType: !1169, size: 128)
!1169 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !135, line: 281, baseType: !1170)
!1170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !135, line: 281, size: 128, elements: !1171)
!1171 = !{!1172, !1173, !1174}
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1170, file: !135, line: 281, baseType: !7, size: 32)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1170, file: !135, line: 281, baseType: !7, size: 32, offset: 32)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1170, file: !135, line: 281, baseType: !1175, size: 64, offset: 64)
!1175 = !DICompositeType(tag: DW_TAG_array_type, baseType: !664, size: 64, elements: !825)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1159, file: !135, line: 384, baseType: !656, size: 32, offset: 192)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1159, file: !135, line: 387, baseType: !656, size: 32, offset: 224)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1159, file: !135, line: 390, baseType: !656, size: 32, offset: 256)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1159, file: !135, line: 394, baseType: !1164, size: 64, offset: 320)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1159, file: !135, line: 396, baseType: !134, size: 32, offset: 384)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1159, file: !135, line: 399, baseType: !1182, size: 64, offset: 416)
!1182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !140, size: 64, elements: !965)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1159, file: !135, line: 402, baseType: !1184, size: 64, offset: 480)
!1184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !965)
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1159, file: !135, line: 406, baseType: !656, size: 32, offset: 544)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1159, file: !135, line: 409, baseType: !656, size: 32, offset: 576)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1151, file: !1152, line: 470, baseType: !693, size: 64, offset: 128)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1151, file: !1152, line: 473, baseType: !1189, size: 64, offset: 192)
!1189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1190, size: 64)
!1190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1102, line: 39, size: 1152, elements: !1191)
!1191 = !{!1192, !1244, !1257, !1270, !1271, !1283, !1284, !1288, !1289, !1290, !1291, !1292}
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1190, file: !1102, line: 41, baseType: !1193, size: 64)
!1193 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1194, line: 144, baseType: !1195)
!1194 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1196, size: 64)
!1196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1194, line: 100, size: 896, elements: !1197)
!1197 = !{!1198, !1206, !1211, !1216, !1218, !1221, !1222, !1223, !1224, !1225, !1230, !1232, !1233, !1238, !1243}
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1196, file: !1194, line: 102, baseType: !1199, size: 64)
!1199 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1194, line: 52, baseType: !1200)
!1200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1201, size: 64)
!1201 = !DISubroutineType(types: !1202)
!1202 = !{!1203, !1204}
!1203 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1194, line: 47, baseType: !7)
!1204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1205, size: 64)
!1205 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1196, file: !1194, line: 105, baseType: !1207, size: 64, offset: 64)
!1207 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1194, line: 59, baseType: !1208)
!1208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1209, size: 64)
!1209 = !DISubroutineType(types: !1210)
!1210 = !{!656, !1204, !1204}
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1196, file: !1194, line: 108, baseType: !1212, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1194, line: 63, baseType: !1213)
!1213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1214, size: 64)
!1214 = !DISubroutineType(types: !1215)
!1215 = !{null, !660}
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1196, file: !1194, line: 111, baseType: !1217, size: 64, offset: 192)
!1217 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1196, file: !1194, line: 114, baseType: !1219, size: 64, offset: 256)
!1219 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1220, line: 46, baseType: !780)
!1220 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1196, file: !1194, line: 117, baseType: !1219, size: 64, offset: 320)
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "n_deleted", scope: !1196, file: !1194, line: 120, baseType: !1219, size: 64, offset: 384)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "searches", scope: !1196, file: !1194, line: 124, baseType: !7, size: 32, offset: 448)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "collisions", scope: !1196, file: !1194, line: 128, baseType: !7, size: 32, offset: 480)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_f", scope: !1196, file: !1194, line: 131, baseType: !1226, size: 64, offset: 512)
!1226 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc", file: !1194, line: 75, baseType: !1227)
!1227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1228, size: 64)
!1228 = !DISubroutineType(types: !1229)
!1229 = !{!660, !1219, !1219}
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "free_f", scope: !1196, file: !1194, line: 132, baseType: !1231, size: 64, offset: 576)
!1231 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free", file: !1194, line: 78, baseType: !1213)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_arg", scope: !1196, file: !1194, line: 135, baseType: !660, size: 64, offset: 640)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_with_arg_f", scope: !1196, file: !1194, line: 136, baseType: !1234, size: 64, offset: 704)
!1234 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_alloc_with_arg", file: !1194, line: 82, baseType: !1235)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DISubroutineType(types: !1237)
!1237 = !{!660, !660, !1219, !1219}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "free_with_arg_f", scope: !1196, file: !1194, line: 137, baseType: !1239, size: 64, offset: 768)
!1239 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_free_with_arg", file: !1194, line: 83, baseType: !1240)
!1240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1241, size: 64)
!1241 = !DISubroutineType(types: !1242)
!1242 = !{null, !660, !660}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "size_prime_index", scope: !1196, file: !1194, line: 141, baseType: !7, size: 32, offset: 832)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "modified_noreturn_calls", scope: !1190, file: !1102, line: 48, baseType: !1245, size: 64, offset: 64)
!1245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1246, size: 64)
!1246 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_gc", file: !561, line: 35, baseType: !1247)
!1247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_gc", file: !561, line: 35, size: 128, elements: !1248)
!1248 = !{!1249}
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1247, file: !561, line: 35, baseType: !1250, size: 128)
!1250 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_gimple_base", file: !561, line: 33, baseType: !1251)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_gimple_base", file: !561, line: 33, size: 128, elements: !1252)
!1252 = !{!1253, !1254, !1255}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1251, file: !561, line: 33, baseType: !7, size: 32)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1251, file: !561, line: 33, baseType: !7, size: 32, offset: 32)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1251, file: !561, line: 33, baseType: !1256, size: 64, offset: 64)
!1256 = !DICompositeType(tag: DW_TAG_array_type, baseType: !702, size: 64, elements: !825)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_names", scope: !1190, file: !1102, line: 51, baseType: !1258, size: 64, offset: 128)
!1258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_gc", file: !151, line: 183, baseType: !1260)
!1260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_gc", file: !151, line: 183, size: 128, elements: !1261)
!1261 = !{!1262}
!1262 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1260, file: !151, line: 183, baseType: !1263, size: 128)
!1263 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_tree_base", file: !151, line: 182, baseType: !1264)
!1264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_tree_base", file: !151, line: 182, size: 128, elements: !1265)
!1265 = !{!1266, !1267, !1268}
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1264, file: !151, line: 182, baseType: !7, size: 32)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1264, file: !151, line: 182, baseType: !7, size: 32, offset: 32)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1264, file: !151, line: 182, baseType: !1269, size: 64, offset: 64)
!1269 = !DICompositeType(tag: DW_TAG_array_type, baseType: !727, size: 64, elements: !825)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "vop", scope: !1190, file: !1102, line: 54, baseType: !727, size: 64, offset: 192)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1190, file: !1102, line: 57, baseType: !1272, size: 128, offset: 256)
!1272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pt_solution", file: !1273, line: 31, size: 128, elements: !1274)
!1273 = !DIFile(filename: "./tree-ssa-alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1274 = !{!1275, !1276, !1277, !1278, !1279, !1280, !1281}
!1275 = !DIDerivedType(tag: DW_TAG_member, name: "anything", scope: !1272, file: !1273, line: 35, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal", scope: !1272, file: !1273, line: 39, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "escaped", scope: !1272, file: !1273, line: 42, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "null", scope: !1272, file: !1273, line: 46, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_global", scope: !1272, file: !1273, line: 50, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "vars_contains_restrict", scope: !1272, file: !1273, line: 53, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1272, file: !1273, line: 56, baseType: !1282, size: 64, offset: 64)
!1282 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap", file: !665, line: 47, baseType: !949)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "callused", scope: !1190, file: !1102, line: 60, baseType: !1272, size: 128, offset: 384)
!1284 = !DIDerivedType(tag: DW_TAG_member, name: "decls_to_pointers", scope: !1190, file: !1102, line: 64, baseType: !1285, size: 64, offset: 512)
!1285 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1286, size: 64)
!1286 = !DICompositeType(tag: DW_TAG_structure_type, name: "pointer_map_t", file: !1287, line: 33, flags: DIFlagFwdDecl)
!1287 = !DIFile(filename: "./pointer-set.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "free_ssanames", scope: !1190, file: !1102, line: 67, baseType: !727, size: 64, offset: 576)
!1289 = !DIDerivedType(tag: DW_TAG_member, name: "default_defs", scope: !1190, file: !1102, line: 73, baseType: !1193, size: 64, offset: 640)
!1290 = !DIDerivedType(tag: DW_TAG_member, name: "syms_to_rename", scope: !1190, file: !1102, line: 77, baseType: !1282, size: 64, offset: 704)
!1291 = !DIDerivedType(tag: DW_TAG_member, name: "in_ssa_p", scope: !1190, file: !1102, line: 80, baseType: !7, size: 1, offset: 768, flags: DIFlagBitField, extraData: i64 768)
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operands", scope: !1190, file: !1102, line: 82, baseType: !1293, size: 320, offset: 832)
!1293 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operands", file: !1294, line: 62, size: 320, elements: !1295)
!1294 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1295 = !{!1296, !1302, !1303, !1304, !1305, !1312}
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory", scope: !1293, file: !1294, line: 63, baseType: !1297, size: 64)
!1297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1298, size: 64)
!1298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_operand_memory_d", file: !1294, line: 56, size: 128, elements: !1299)
!1299 = !{!1300, !1301}
!1300 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1298, file: !1294, line: 57, baseType: !1297, size: 64)
!1301 = !DIDerivedType(tag: DW_TAG_member, name: "mem", scope: !1298, file: !1294, line: 58, baseType: !824, size: 8, offset: 64)
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "operand_memory_index", scope: !1293, file: !1294, line: 64, baseType: !7, size: 32, offset: 64)
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_operand_mem_size", scope: !1293, file: !1294, line: 66, baseType: !7, size: 32, offset: 96)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "ops_active", scope: !1293, file: !1294, line: 68, baseType: !655, size: 8, offset: 128)
!1305 = !DIDerivedType(tag: DW_TAG_member, name: "free_defs", scope: !1293, file: !1294, line: 70, baseType: !1306, size: 64, offset: 192)
!1306 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1307, size: 64)
!1307 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !1294, line: 37, size: 128, elements: !1308)
!1308 = !{!1309, !1310}
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1307, file: !1294, line: 39, baseType: !1306, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1307, file: !1294, line: 40, baseType: !1311, size: 64, offset: 64)
!1311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "free_uses", scope: !1293, file: !1294, line: 71, baseType: !1313, size: 64, offset: 256)
!1313 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1314, size: 64)
!1314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !1294, line: 45, size: 320, elements: !1315)
!1315 = !{!1316, !1317}
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1314, file: !1294, line: 47, baseType: !1313, size: 64)
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1314, file: !1294, line: 48, baseType: !1318, size: 256, offset: 64)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !151, line: 1883, size: 256, elements: !1319)
!1319 = !{!1320, !1322, !1323, !1328}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1318, file: !151, line: 1884, baseType: !1321, size: 64)
!1321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1318, size: 64)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1318, file: !151, line: 1885, baseType: !1321, size: 64, offset: 64)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1318, file: !151, line: 1891, baseType: !1324, size: 64, offset: 128)
!1324 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1318, file: !151, line: 1891, size: 64, elements: !1325)
!1325 = !{!1326, !1327}
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1324, file: !151, line: 1891, baseType: !702, size: 64)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1324, file: !151, line: 1891, baseType: !727, size: 64)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1318, file: !151, line: 1892, baseType: !1311, size: 64, offset: 192)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "x_current_loops", scope: !1151, file: !1152, line: 476, baseType: !1330, size: 64, offset: 256)
!1330 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1331, size: 64)
!1331 = !DICompositeType(tag: DW_TAG_structure_type, name: "loops", file: !1152, line: 476, flags: DIFlagFwdDecl)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "value_histograms", scope: !1151, file: !1152, line: 479, baseType: !1193, size: 64, offset: 320)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1151, file: !1152, line: 484, baseType: !727, size: 64, offset: 384)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_decl", scope: !1151, file: !1152, line: 488, baseType: !727, size: 64, offset: 448)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_goto_save_area", scope: !1151, file: !1152, line: 493, baseType: !727, size: 64, offset: 512)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "local_decls", scope: !1151, file: !1152, line: 496, baseType: !727, size: 64, offset: 576)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !1151, file: !1152, line: 501, baseType: !1338, size: 64, offset: 640)
!1338 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1339, size: 64)
!1339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_function", file: !146, line: 2355, size: 576, elements: !1340)
!1340 = !{!1341, !1344, !1345, !1346, !1347, !1349, !1350, !1355, !1356, !1357, !1358, !1359, !1360}
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "stack_locals", scope: !1339, file: !146, line: 2356, baseType: !1342, size: 64)
!1342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1343, size: 64)
!1343 = !DICompositeType(tag: DW_TAG_structure_type, name: "stack_local_entry", file: !146, line: 2356, flags: DIFlagFwdDecl)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "some_ld_name", scope: !1339, file: !146, line: 2357, baseType: !661, size: 64, offset: 64)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_gpr_size", scope: !1339, file: !146, line: 2358, baseType: !656, size: 32, offset: 128)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "varargs_fpr_size", scope: !1339, file: !146, line: 2359, baseType: !656, size: 32, offset: 160)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "optimize_mode_switching", scope: !1339, file: !146, line: 2360, baseType: !1348, size: 128, offset: 192)
!1348 = !DICompositeType(tag: DW_TAG_array_type, baseType: !656, size: 128, elements: !989)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue_nregs", scope: !1339, file: !146, line: 2364, baseType: !656, size: 32, offset: 320)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "cfa", scope: !1339, file: !146, line: 2367, baseType: !1351, size: 128, offset: 384)
!1351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "machine_cfa_state", file: !146, line: 2349, size: 128, elements: !1352)
!1352 = !{!1353, !1354}
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "reg", scope: !1351, file: !146, line: 2351, baseType: !897, size: 64)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1351, file: !146, line: 2352, baseType: !782, size: 64, offset: 64)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "call_abi", scope: !1339, file: !146, line: 2371, baseType: !145, size: 32, offset: 512)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "accesses_prev_frame", scope: !1339, file: !146, line: 2374, baseType: !7, size: 1, offset: 544, flags: DIFlagBitField, extraData: i64 544)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "needs_cld", scope: !1339, file: !146, line: 2377, baseType: !7, size: 1, offset: 545, flags: DIFlagBitField, extraData: i64 544)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "use_fast_prologue_epilogue", scope: !1339, file: !146, line: 2381, baseType: !7, size: 1, offset: 546, flags: DIFlagBitField, extraData: i64 544)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "tls_descriptor_call_expanded_p", scope: !1339, file: !146, line: 2392, baseType: !7, size: 1, offset: 547, flags: DIFlagBitField, extraData: i64 544)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "static_chain_on_stack", scope: !1339, file: !146, line: 2396, baseType: !7, size: 1, offset: 548, flags: DIFlagBitField, extraData: i64 544)
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "language", scope: !1151, file: !1152, line: 504, baseType: !1362, size: 64, offset: 704)
!1362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1363, size: 64)
!1363 = !DICompositeType(tag: DW_TAG_structure_type, name: "language_function", file: !1152, line: 504, flags: DIFlagFwdDecl)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "used_types_hash", scope: !1151, file: !1152, line: 507, baseType: !1193, size: 64, offset: 768)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "last_stmt_uid", scope: !1151, file: !1152, line: 510, baseType: !656, size: 32, offset: 832)
!1366 = !DIDerivedType(tag: DW_TAG_member, name: "funcdef_no", scope: !1151, file: !1152, line: 513, baseType: !656, size: 32, offset: 864)
!1367 = !DIDerivedType(tag: DW_TAG_member, name: "function_start_locus", scope: !1151, file: !1152, line: 516, baseType: !720, size: 32, offset: 896)
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "function_end_locus", scope: !1151, file: !1152, line: 519, baseType: !720, size: 32, offset: 928)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "curr_properties", scope: !1151, file: !1152, line: 522, baseType: !7, size: 32, offset: 960)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "last_verified", scope: !1151, file: !1152, line: 523, baseType: !7, size: 32, offset: 992)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_reason", scope: !1151, file: !1152, line: 528, baseType: !661, size: 64, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_gpr_size", scope: !1151, file: !1152, line: 535, baseType: !7, size: 8, offset: 1088, flags: DIFlagBitField, extraData: i64 1088)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "va_list_fpr_size", scope: !1151, file: !1152, line: 539, baseType: !7, size: 8, offset: 1096, flags: DIFlagBitField, extraData: i64 1088)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "function_frequency", scope: !1151, file: !1152, line: 543, baseType: !7, size: 2, offset: 1104, flags: DIFlagBitField, extraData: i64 1088)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "calls_setjmp", scope: !1151, file: !1152, line: 546, baseType: !7, size: 1, offset: 1106, flags: DIFlagBitField, extraData: i64 1088)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "calls_alloca", scope: !1151, file: !1152, line: 550, baseType: !7, size: 1, offset: 1107, flags: DIFlagBitField, extraData: i64 1088)
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "has_nonlocal_label", scope: !1151, file: !1152, line: 554, baseType: !7, size: 1, offset: 1108, flags: DIFlagBitField, extraData: i64 1088)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "cannot_be_copied_set", scope: !1151, file: !1152, line: 559, baseType: !7, size: 1, offset: 1109, flags: DIFlagBitField, extraData: i64 1088)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "stdarg", scope: !1151, file: !1152, line: 562, baseType: !7, size: 1, offset: 1110, flags: DIFlagBitField, extraData: i64 1088)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "dont_save_pending_sizes_p", scope: !1151, file: !1152, line: 571, baseType: !7, size: 1, offset: 1111, flags: DIFlagBitField, extraData: i64 1088)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "after_inlining", scope: !1151, file: !1152, line: 573, baseType: !7, size: 1, offset: 1112, flags: DIFlagBitField, extraData: i64 1088)
!1382 = !DIDerivedType(tag: DW_TAG_member, name: "always_inline_functions_inlined", scope: !1151, file: !1152, line: 574, baseType: !7, size: 1, offset: 1113, flags: DIFlagBitField, extraData: i64 1088)
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "returns_struct", scope: !1151, file: !1152, line: 581, baseType: !7, size: 1, offset: 1114, flags: DIFlagBitField, extraData: i64 1088)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "returns_pcc_struct", scope: !1151, file: !1152, line: 585, baseType: !7, size: 1, offset: 1115, flags: DIFlagBitField, extraData: i64 1088)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "after_tree_profile", scope: !1151, file: !1152, line: 588, baseType: !7, size: 1, offset: 1116, flags: DIFlagBitField, extraData: i64 1088)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "has_local_explicit_reg_vars", scope: !1151, file: !1152, line: 592, baseType: !7, size: 1, offset: 1117, flags: DIFlagBitField, extraData: i64 1088)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "is_thunk", scope: !1151, file: !1152, line: 598, baseType: !7, size: 1, offset: 1118, flags: DIFlagBitField, extraData: i64 1088)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "personality", scope: !1146, file: !151, line: 3254, baseType: !727, size: 64, offset: 1536)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_target", scope: !1146, file: !151, line: 3257, baseType: !727, size: 64, offset: 1600)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "function_specific_optimization", scope: !1146, file: !151, line: 3258, baseType: !727, size: 64, offset: 1664)
!1391 = !DIDerivedType(tag: DW_TAG_member, name: "function_code", scope: !1146, file: !151, line: 3264, baseType: !7, size: 11, offset: 1728, flags: DIFlagBitField, extraData: i64 1728)
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "built_in_class", scope: !1146, file: !151, line: 3265, baseType: !7, size: 2, offset: 1739, flags: DIFlagBitField, extraData: i64 1728)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "static_ctor_flag", scope: !1146, file: !151, line: 3267, baseType: !7, size: 1, offset: 1741, flags: DIFlagBitField, extraData: i64 1728)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "static_dtor_flag", scope: !1146, file: !151, line: 3268, baseType: !7, size: 1, offset: 1742, flags: DIFlagBitField, extraData: i64 1728)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "uninlinable", scope: !1146, file: !151, line: 3269, baseType: !7, size: 1, offset: 1743, flags: DIFlagBitField, extraData: i64 1728)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "possibly_inlined", scope: !1146, file: !151, line: 3271, baseType: !7, size: 1, offset: 1744, flags: DIFlagBitField, extraData: i64 1728)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "novops_flag", scope: !1146, file: !151, line: 3272, baseType: !7, size: 1, offset: 1745, flags: DIFlagBitField, extraData: i64 1728)
!1398 = !DIDerivedType(tag: DW_TAG_member, name: "returns_twice_flag", scope: !1146, file: !151, line: 3273, baseType: !7, size: 1, offset: 1746, flags: DIFlagBitField, extraData: i64 1728)
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "malloc_flag", scope: !1146, file: !151, line: 3274, baseType: !7, size: 1, offset: 1747, flags: DIFlagBitField, extraData: i64 1728)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "operator_new_flag", scope: !1146, file: !151, line: 3275, baseType: !7, size: 1, offset: 1748, flags: DIFlagBitField, extraData: i64 1728)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "declared_inline_flag", scope: !1146, file: !151, line: 3276, baseType: !7, size: 1, offset: 1749, flags: DIFlagBitField, extraData: i64 1728)
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "regdecl_flag", scope: !1146, file: !151, line: 3277, baseType: !7, size: 1, offset: 1750, flags: DIFlagBitField, extraData: i64 1728)
!1403 = !DIDerivedType(tag: DW_TAG_member, name: "no_inline_warning_flag", scope: !1146, file: !151, line: 3279, baseType: !7, size: 1, offset: 1751, flags: DIFlagBitField, extraData: i64 1728)
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "no_instrument_function_entry_exit", scope: !1146, file: !151, line: 3280, baseType: !7, size: 1, offset: 1752, flags: DIFlagBitField, extraData: i64 1728)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "no_limit_stack", scope: !1146, file: !151, line: 3281, baseType: !7, size: 1, offset: 1753, flags: DIFlagBitField, extraData: i64 1728)
!1406 = !DIDerivedType(tag: DW_TAG_member, name: "disregard_inline_limits", scope: !1146, file: !151, line: 3282, baseType: !7, size: 1, offset: 1754, flags: DIFlagBitField, extraData: i64 1728)
!1407 = !DIDerivedType(tag: DW_TAG_member, name: "pure_flag", scope: !1146, file: !151, line: 3283, baseType: !7, size: 1, offset: 1755, flags: DIFlagBitField, extraData: i64 1728)
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "looping_const_or_pure_flag", scope: !1146, file: !151, line: 3284, baseType: !7, size: 1, offset: 1756, flags: DIFlagBitField, extraData: i64 1728)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !729, file: !151, line: 3394, baseType: !1410, size: 1344)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type", file: !151, line: 2279, size: 1344, elements: !1411)
!1411 = !{!1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1445, !1446, !1447, !1448, !1449, !1450, !1451, !1452, !1453}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1410, file: !151, line: 2280, baseType: !765, size: 192)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "values", scope: !1410, file: !151, line: 2281, baseType: !727, size: 64, offset: 192)
!1414 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1410, file: !151, line: 2282, baseType: !727, size: 64, offset: 256)
!1415 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !1410, file: !151, line: 2283, baseType: !727, size: 64, offset: 320)
!1416 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !1410, file: !151, line: 2284, baseType: !727, size: 64, offset: 384)
