; ModuleID = 'tree-ssa-loop-manip.bc'
source_filename = "tree-ssa-loop-manip.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }
%struct.tree_common = type { %struct.tree_base, %union.tree_node*, %union.tree_node* }

!412 = !DIEnumerator(name: "GIMPLE_RESX", value: 14, isUnsigned: true)
!413 = !DIEnumerator(name: "GIMPLE_EH_DISPATCH", value: 15, isUnsigned: true)
!414 = !DIEnumerator(name: "GIMPLE_PHI", value: 16, isUnsigned: true)
!415 = !DIEnumerator(name: "GIMPLE_TRY", value: 17, isUnsigned: true)
!416 = !DIEnumerator(name: "GIMPLE_NOP", value: 18, isUnsigned: true)
!417 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_LOAD", value: 19, isUnsigned: true)
!418 = !DIEnumerator(name: "GIMPLE_OMP_ATOMIC_STORE", value: 20, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!422 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!423 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!424 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!426 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!427 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!428 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!429 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!430 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!431 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!432 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!433 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !396, line: 727, baseType: !5, size: 32, elements: !435)
!435 = !{!436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454, !455, !456, !457, !458, !459}
!436 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!454 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!455 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!456 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!457 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!458 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!459 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!460 = !{!461, !462, !463, !464, !467, !468, !132, !470, !472, !1854, !1396, !5, !526, !774, !828, !465}
!461 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!462 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!463 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!464 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !465, size: 64)
!465 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !466, size: 64)
!466 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !469, size: 64)
!469 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !466)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !471, line: 44, baseType: !5)
!471 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !473, line: 56, baseType: !474)
!473 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!475 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !476)
!476 = !{!477, !510, !516, !529, !548, !559, !564, !573, !579, !592, !602, !640, !1184, !1212, !1229, !1230, !1235, !1244, !1250, !1255, !1259, !1263, !1505, !1552, !1558, !1564, !1571, !1584, !1598, !1615, !1627, !1649, !1664, !1836}
!477 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !475, file: !133, line: 3372, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !478, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !478, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !478, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !478, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !478, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !478, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !478, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !478, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !478, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !478, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !478, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !478, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !478, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !478, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !478, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !478, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !478, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !478, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !478, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !478, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !478, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !478, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !478, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !478, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !478, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !478, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !478, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !478, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !478, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !478, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !475, file: !133, line: 3373, baseType: !511, size: 192)
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !512)
!512 = !{!513, !514, !515}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !511, file: !133, line: 403, baseType: !478, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !511, file: !133, line: 404, baseType: !472, size: 64, offset: 64)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !511, file: !133, line: 405, baseType: !472, size: 64, offset: 128)
!516 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !475, file: !133, line: 3374, baseType: !517, size: 320)
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !517, file: !133, line: 1385, baseType: !511, size: 192)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !517, file: !133, line: 1386, baseType: !521, size: 128, offset: 192)
!521 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !522, line: 58, baseType: !523)
!522 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !522, line: 54, size: 128, elements: !524)
!524 = !{!525, !527}
!525 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !523, file: !522, line: 56, baseType: !526, size: 64)
!526 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !523, file: !522, line: 57, baseType: !528, size: 64, offset: 64)
!528 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !475, file: !133, line: 3375, baseType: !530, size: 256)
!530 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !531)
!531 = !{!532, !533}
!532 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !530, file: !133, line: 1398, baseType: !511, size: 192)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !530, file: !133, line: 1399, baseType: !534, size: 64, offset: 192)
!534 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !535, size: 64)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !536, line: 52, size: 256, elements: !537)
!536 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!537 = !{!538, !539, !540, !541, !542, !543, !544}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !535, file: !536, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !535, file: !536, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !535, file: !536, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !535, file: !536, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !535, file: !536, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !535, file: !536, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !535, file: !536, line: 62, baseType: !545, size: 192, offset: 64)
!545 = !DICompositeType(tag: DW_TAG_array_type, baseType: !526, size: 192, elements: !546)
!546 = !{!547}
!547 = !DISubrange(count: 3)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !475, file: !133, line: 3376, baseType: !549, size: 256)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !550)
!550 = !{!551, !552}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !549, file: !133, line: 1409, baseType: !511, size: 192)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !549, file: !133, line: 1410, baseType: !553, size: 64, offset: 192)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !555, line: 27, size: 192, elements: !556)
!555 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!556 = !{!557, !558}
!557 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !554, file: !555, line: 29, baseType: !521, size: 128)
!558 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !554, file: !555, line: 30, baseType: !3, size: 32, offset: 128)
!559 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !475, file: !133, line: 3377, baseType: !560, size: 256)
!560 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !560, file: !133, line: 1438, baseType: !511, size: 192)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !560, file: !133, line: 1439, baseType: !472, size: 64, offset: 192)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !475, file: !133, line: 3378, baseType: !565, size: 256)
!565 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !566)
!566 = !{!567, !568, !569}
!567 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !565, file: !133, line: 1419, baseType: !511, size: 192)
!568 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !565, file: !133, line: 1420, baseType: !463, size: 32, offset: 192)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !565, file: !133, line: 1421, baseType: !570, size: 8, offset: 224)
!570 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 8, elements: !571)
!571 = !{!572}
!572 = !DISubrange(count: 1)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !475, file: !133, line: 3379, baseType: !574, size: 320)
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !575)
!575 = !{!576, !577, !578}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !574, file: !133, line: 1429, baseType: !511, size: 192)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !574, file: !133, line: 1430, baseType: !472, size: 64, offset: 192)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !574, file: !133, line: 1431, baseType: !472, size: 64, offset: 256)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !475, file: !133, line: 3380, baseType: !580, size: 320)
!580 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !581)
!581 = !{!582, !583}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !580, file: !133, line: 1461, baseType: !511, size: 192)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !580, file: !133, line: 1462, baseType: !584, size: 128, offset: 192)
!584 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !585, line: 31, size: 128, elements: !586)
!585 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!586 = !{!587, !590, !591}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !584, file: !585, line: 32, baseType: !588, size: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !462)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !584, file: !585, line: 33, baseType: !5, size: 32, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !584, file: !585, line: 34, baseType: !5, size: 32, offset: 96)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !475, file: !133, line: 3381, baseType: !593, size: 384)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !594)
!594 = !{!595, !596, !599, !600, !601}
!595 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !593, file: !133, line: 2508, baseType: !511, size: 192)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !593, file: !133, line: 2509, baseType: !597, size: 32, offset: 192)
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !598, line: 58, baseType: !470)
!598 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!599 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !593, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !593, file: !133, line: 2511, baseType: !472, size: 64, offset: 256)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !593, file: !133, line: 2512, baseType: !472, size: 64, offset: 320)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !475, file: !133, line: 3382, baseType: !603, size: 896)
!603 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !604)
!604 = !{!605, !606, !607, !608, !609, !610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637}
!605 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !603, file: !133, line: 2653, baseType: !593, size: 384)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !603, file: !133, line: 2654, baseType: !472, size: 64, offset: 384)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !603, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !603, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!609 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !603, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!610 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !603, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !603, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !603, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !603, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !603, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !603, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !603, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !603, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !603, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !603, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !603, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !603, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !603, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !603, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !603, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !603, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !603, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !603, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !603, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !603, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !603, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !603, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !603, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !603, file: !133, line: 2705, baseType: !472, size: 64, offset: 576)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !603, file: !133, line: 2706, baseType: !472, size: 64, offset: 640)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !603, file: !133, line: 2707, baseType: !472, size: 64, offset: 704)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !603, file: !133, line: 2708, baseType: !472, size: 64, offset: 768)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !603, file: !133, line: 2711, baseType: !638, size: 64, offset: 832)
!638 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !639, size: 64)
!639 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !475, file: !133, line: 3383, baseType: !641, size: 960)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !642)
!642 = !{!643, !644}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !641, file: !133, line: 2757, baseType: !603, size: 896)
!644 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !641, file: !133, line: 2758, baseType: !645, size: 64, offset: 896)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !473, line: 50, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !647, size: 64)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !648, line: 240, size: 384, elements: !649)
!648 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!649 = !{!650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660}
!650 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !647, file: !648, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !647, file: !648, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !647, file: !648, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !647, file: !648, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !647, file: !648, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !647, file: !648, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !647, file: !648, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !647, file: !648, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !647, file: !648, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !647, file: !648, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !647, file: !648, line: 321, baseType: !661, size: 320, offset: 64)
!661 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !648, line: 315, size: 320, elements: !662)
!662 = !{!663, !1117, !1119, !1182, !1183}
!663 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !661, file: !648, line: 316, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 64, elements: !571)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !648, line: 183, baseType: !666)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !648, line: 166, size: 64, elements: !667)
!667 = !{!668, !669, !670, !671, !672, !680, !681, !693, !696, !756, !757, !1094, !1107, !1114}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !666, file: !648, line: 168, baseType: !463, size: 32)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !666, file: !648, line: 169, baseType: !5, size: 32)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !666, file: !648, line: 170, baseType: !468, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !666, file: !648, line: 171, baseType: !645, size: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !666, file: !648, line: 172, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !473, line: 53, baseType: !674)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !648, line: 359, size: 128, elements: !676)
!676 = !{!677, !678}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !675, file: !648, line: 360, baseType: !463, size: 32)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !675, file: !648, line: 361, baseType: !679, size: 64, offset: 64)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !645, size: 64, elements: !571)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !666, file: !648, line: 173, baseType: !3, size: 32)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !666, file: !648, line: 174, baseType: !682, size: 32)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !648, line: 133, baseType: !683)
!683 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !648, line: 115, size: 32, elements: !684)
!684 = !{!685, !686, !687, !688, !689, !690, !691, !692}
!685 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !683, file: !648, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !683, file: !648, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !683, file: !648, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !683, file: !648, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !683, file: !648, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !683, file: !648, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !683, file: !648, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !683, file: !648, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !666, file: !648, line: 175, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !648, line: 175, flags: DIFlagFwdDecl)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !666, file: !648, line: 176, baseType: !697, size: 64)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !699, line: 75, size: 256, elements: !700)
!699 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!700 = !{!701, !715, !716, !717}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !698, file: !699, line: 76, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !699, line: 68, baseType: !704)
!704 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !699, line: 63, size: 320, elements: !705)
!705 = !{!706, !708, !709, !710}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !704, file: !699, line: 64, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !704, file: !699, line: 65, baseType: !707, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !704, file: !699, line: 66, baseType: !5, size: 32, offset: 128)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !704, file: !699, line: 67, baseType: !711, size: 128, offset: 192)
!711 = !DICompositeType(tag: DW_TAG_array_type, baseType: !712, size: 128, elements: !713)
!712 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !699, line: 29, baseType: !526)
!713 = !{!714}
!714 = !DISubrange(count: 2)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !698, file: !699, line: 77, baseType: !702, size: 64, offset: 64)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !698, file: !699, line: 78, baseType: !5, size: 32, offset: 128)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !698, file: !699, line: 79, baseType: !718, size: 64, offset: 192)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !699, line: 49, baseType: !720)
!720 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !699, line: 45, size: 832, elements: !721)
!721 = !{!722, !723, !724}
!722 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !720, file: !699, line: 46, baseType: !707, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !720, file: !699, line: 47, baseType: !697, size: 64, offset: 64)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !720, file: !699, line: 48, baseType: !725, size: 704, offset: 128)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !726, line: 164, size: 704, elements: !727)
!726 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!727 = !{!728, !729, !739, !740, !741, !742, !743, !744, !748, !752, !753, !754, !755}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !725, file: !726, line: 166, baseType: !528, size: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !725, file: !726, line: 167, baseType: !730, size: 64, offset: 64)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !726, line: 157, size: 192, elements: !732)
!732 = !{!733, !734, !735}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !731, file: !726, line: 159, baseType: !465, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !731, file: !726, line: 160, baseType: !730, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !731, file: !726, line: 161, baseType: !736, size: 32, offset: 128)
!736 = !DICompositeType(tag: DW_TAG_array_type, baseType: !466, size: 32, elements: !737)
!737 = !{!738}
!738 = !DISubrange(count: 4)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !725, file: !726, line: 168, baseType: !465, size: 64, offset: 128)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !725, file: !726, line: 169, baseType: !465, size: 64, offset: 192)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !725, file: !726, line: 170, baseType: !465, size: 64, offset: 256)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !725, file: !726, line: 171, baseType: !528, size: 64, offset: 320)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !725, file: !726, line: 172, baseType: !463, size: 32, offset: 384)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !725, file: !726, line: 176, baseType: !745, size: 64, offset: 448)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DISubroutineType(types: !747)
!747 = !{!730, !467, !528}
!748 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !725, file: !726, line: 177, baseType: !749, size: 64, offset: 512)
!749 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !750, size: 64)
!750 = !DISubroutineType(types: !751)
!751 = !{null, !467, !730}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !725, file: !726, line: 178, baseType: !467, size: 64, offset: 576)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !725, file: !726, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !725, file: !726, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !725, file: !726, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !666, file: !648, line: 177, baseType: !472, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !666, file: !648, line: 178, baseType: !758, size: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !759, size: 64)
!759 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !341, line: 217, size: 832, elements: !760)
!760 = !{!761, !1006, !1007, !1008, !1064, !1068, !1069, !1070, !1088, !1089, !1090, !1091, !1092, !1093}
!761 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !759, file: !341, line: 219, baseType: !762, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !341, line: 151, baseType: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !341, line: 151, size: 128, elements: !765)
!765 = !{!766}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !764, file: !341, line: 151, baseType: !767, size: 128)
!767 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !341, line: 150, baseType: !768)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !341, line: 150, size: 128, elements: !769)
!769 = !{!770, !771, !772}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !768, file: !341, line: 150, baseType: !5, size: 32)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !768, file: !341, line: 150, baseType: !5, size: 32, offset: 32)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !768, file: !341, line: 150, baseType: !773, size: 64, offset: 64)
!773 = !DICompositeType(tag: DW_TAG_array_type, baseType: !774, size: 64, elements: !571)
!774 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !473, line: 108, baseType: !775)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !341, line: 122, size: 512, elements: !777)
!777 = !{!778, !779, !780, !998, !999, !1000, !1001, !1002, !1003, !1004}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !776, file: !341, line: 124, baseType: !758, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !776, file: !341, line: 125, baseType: !758, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !776, file: !341, line: 131, baseType: !781, size: 64, offset: 128)
!781 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !341, line: 128, size: 64, elements: !782)
!782 = !{!783, !997}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !781, file: !341, line: 129, baseType: !784, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !473, line: 66, baseType: !785)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !396, line: 143, size: 192, elements: !787)
!787 = !{!788, !995, !996}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !786, file: !396, line: 145, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !473, line: 69, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !396, line: 136, size: 192, elements: !792)
!792 = !{!793, !993, !994}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !791, file: !396, line: 137, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !473, line: 58, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !396, line: 737, size: 768, elements: !797)
!797 = !{!798, !815, !848, !854, !859, !864, !871, !877, !883, !888, !902, !907, !913, !918, !928, !933, !951, !958, !965, !971, !976, !982, !988}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !796, file: !396, line: 738, baseType: !799, size: 256)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !396, line: 271, size: 256, elements: !800)
!800 = !{!801, !802, !803, !804, !805, !806, !807, !808, !809, !810, !811, !812, !813, !814}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !799, file: !396, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!802 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !799, file: !396, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!803 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !799, file: !396, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !799, file: !396, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !799, file: !396, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !799, file: !396, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !799, file: !396, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !799, file: !396, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !799, file: !396, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !799, file: !396, line: 312, baseType: !5, size: 32, offset: 32)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !799, file: !396, line: 316, baseType: !597, size: 32, offset: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !799, file: !396, line: 319, baseType: !5, size: 32, offset: 96)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !799, file: !396, line: 323, baseType: !758, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !799, file: !396, line: 327, baseType: !472, size: 64, offset: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !796, file: !396, line: 739, baseType: !816, size: 448)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !396, line: 350, size: 448, elements: !817)
!817 = !{!818, !846}
!818 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !816, file: !396, line: 353, baseType: !819, size: 384)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !396, line: 333, size: 384, elements: !820)
!820 = !{!821, !822, !829}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !819, file: !396, line: 336, baseType: !799, size: 256)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !819, file: !396, line: 343, baseType: !823, size: 64, offset: 256)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !389, line: 37, size: 128, elements: !825)
!825 = !{!826, !827}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !824, file: !389, line: 39, baseType: !823, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !824, file: !389, line: 40, baseType: !828, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !819, file: !396, line: 344, baseType: !830, size: 64, offset: 320)
!830 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !831, size: 64)
!831 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !389, line: 45, size: 320, elements: !832)
!832 = !{!833, !834}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !831, file: !389, line: 47, baseType: !830, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !831, file: !389, line: 48, baseType: !835, size: 256, offset: 64)
!835 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !836)
!836 = !{!837, !839, !840, !845}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !835, file: !133, line: 1884, baseType: !838, size: 64)
!838 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !835, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !835, file: !133, line: 1885, baseType: !838, size: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !835, file: !133, line: 1891, baseType: !841, size: 64, offset: 128)
!841 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !835, file: !133, line: 1891, size: 64, elements: !842)
!842 = !{!843, !844}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !841, file: !133, line: 1891, baseType: !794, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !841, file: !133, line: 1891, baseType: !472, size: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !835, file: !133, line: 1892, baseType: !828, size: 64, offset: 192)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !816, file: !396, line: 359, baseType: !847, size: 64, offset: 384)
!847 = !DICompositeType(tag: DW_TAG_array_type, baseType: !472, size: 64, elements: !571)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !796, file: !396, line: 740, baseType: !849, size: 512)
!849 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !396, line: 365, size: 512, elements: !850)
!850 = !{!851, !852, !853}
!851 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !849, file: !396, line: 368, baseType: !819, size: 384)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !849, file: !396, line: 373, baseType: !472, size: 64, offset: 384)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !849, file: !396, line: 374, baseType: !472, size: 64, offset: 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !796, file: !396, line: 741, baseType: !855, size: 576)
!855 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !396, line: 380, size: 576, elements: !856)
!856 = !{!857, !858}
!857 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !855, file: !396, line: 383, baseType: !849, size: 512)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !855, file: !396, line: 389, baseType: !847, size: 64, offset: 512)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !796, file: !396, line: 742, baseType: !860, size: 320)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !396, line: 395, size: 320, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !860, file: !396, line: 397, baseType: !799, size: 256)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !860, file: !396, line: 400, baseType: !784, size: 64, offset: 256)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !796, file: !396, line: 743, baseType: !865, size: 448)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !396, line: 406, size: 448, elements: !866)
!866 = !{!867, !868, !869, !870}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !865, file: !396, line: 408, baseType: !799, size: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !865, file: !396, line: 412, baseType: !472, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !865, file: !396, line: 420, baseType: !472, size: 64, offset: 320)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !865, file: !396, line: 423, baseType: !784, size: 64, offset: 384)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !796, file: !396, line: 744, baseType: !872, size: 384)
!872 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !396, line: 429, size: 384, elements: !873)
!873 = !{!874, !875, !876}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !872, file: !396, line: 431, baseType: !799, size: 256)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !872, file: !396, line: 434, baseType: !472, size: 64, offset: 256)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !872, file: !396, line: 437, baseType: !784, size: 64, offset: 320)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !796, file: !396, line: 745, baseType: !878, size: 384)
!878 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !396, line: 443, size: 384, elements: !879)
!879 = !{!880, !881, !882}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !878, file: !396, line: 445, baseType: !799, size: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !878, file: !396, line: 449, baseType: !472, size: 64, offset: 256)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !878, file: !396, line: 453, baseType: !784, size: 64, offset: 320)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !796, file: !396, line: 746, baseType: !884, size: 320)
!884 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !396, line: 459, size: 320, elements: !885)
!885 = !{!886, !887}
!886 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !884, file: !396, line: 461, baseType: !799, size: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !884, file: !396, line: 464, baseType: !472, size: 64, offset: 256)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !796, file: !396, line: 747, baseType: !889, size: 768)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !396, line: 469, size: 768, elements: !890)
!890 = !{!891, !892, !893, !894, !895}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !889, file: !396, line: 471, baseType: !799, size: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !889, file: !396, line: 474, baseType: !5, size: 32, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !889, file: !396, line: 475, baseType: !5, size: 32, offset: 288)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !889, file: !396, line: 478, baseType: !472, size: 64, offset: 320)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !889, file: !396, line: 481, baseType: !896, size: 384, offset: 384)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !897, size: 384, elements: !571)
!897 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !898)
!898 = !{!899, !900, !901}
!899 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !897, file: !133, line: 1920, baseType: !835, size: 256)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !897, file: !133, line: 1921, baseType: !472, size: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !897, file: !133, line: 1922, baseType: !597, size: 32, offset: 320)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !796, file: !396, line: 748, baseType: !903, size: 320)
!903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !396, line: 487, size: 320, elements: !904)
!904 = !{!905, !906}
!905 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !903, file: !396, line: 490, baseType: !799, size: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !903, file: !396, line: 494, baseType: !463, size: 32, offset: 256)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !796, file: !396, line: 749, baseType: !908, size: 384)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !396, line: 500, size: 384, elements: !909)
!909 = !{!910, !911, !912}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !908, file: !396, line: 502, baseType: !799, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !908, file: !396, line: 506, baseType: !784, size: 64, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !908, file: !396, line: 510, baseType: !784, size: 64, offset: 320)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !796, file: !396, line: 750, baseType: !914, size: 320)
!914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !396, line: 529, size: 320, elements: !915)
!915 = !{!916, !917}
!916 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !914, file: !396, line: 531, baseType: !799, size: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !914, file: !396, line: 540, baseType: !784, size: 64, offset: 256)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !796, file: !396, line: 751, baseType: !919, size: 704)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !396, line: 546, size: 704, elements: !920)
!920 = !{!921, !922, !923, !924, !925, !926, !927}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !919, file: !396, line: 549, baseType: !849, size: 512)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !919, file: !396, line: 553, baseType: !468, size: 64, offset: 512)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !919, file: !396, line: 557, baseType: !462, size: 8, offset: 576)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !919, file: !396, line: 558, baseType: !462, size: 8, offset: 584)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !919, file: !396, line: 559, baseType: !462, size: 8, offset: 592)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !919, file: !396, line: 560, baseType: !462, size: 8, offset: 600)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !919, file: !396, line: 566, baseType: !847, size: 64, offset: 640)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !796, file: !396, line: 752, baseType: !929, size: 384)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !396, line: 571, size: 384, elements: !930)
!930 = !{!931, !932}
!931 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !929, file: !396, line: 573, baseType: !860, size: 320)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !929, file: !396, line: 577, baseType: !472, size: 64, offset: 320)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !796, file: !396, line: 753, baseType: !934, size: 576)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !396, line: 600, size: 576, elements: !935)
!935 = !{!936, !937, !938, !941, !950}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !934, file: !396, line: 602, baseType: !860, size: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !934, file: !396, line: 605, baseType: !472, size: 64, offset: 320)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !934, file: !396, line: 609, baseType: !939, size: 64, offset: 384)
!939 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !940, line: 46, baseType: !526)
!940 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!941 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !934, file: !396, line: 612, baseType: !942, size: 64, offset: 448)
!942 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !943, size: 64)
!943 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !396, line: 581, size: 320, elements: !944)
!944 = !{!945, !946, !947, !948, !949}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !943, file: !396, line: 583, baseType: !132, size: 32)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !943, file: !396, line: 586, baseType: !472, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !943, file: !396, line: 589, baseType: !472, size: 64, offset: 128)
!948 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !943, file: !396, line: 592, baseType: !472, size: 64, offset: 192)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !943, file: !396, line: 595, baseType: !472, size: 64, offset: 256)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !934, file: !396, line: 616, baseType: !784, size: 64, offset: 512)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !796, file: !396, line: 754, baseType: !952, size: 512)
!952 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !396, line: 622, size: 512, elements: !953)
!953 = !{!954, !955, !956, !957}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !952, file: !396, line: 624, baseType: !860, size: 320)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !952, file: !396, line: 628, baseType: !472, size: 64, offset: 320)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !952, file: !396, line: 632, baseType: !472, size: 64, offset: 384)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !952, file: !396, line: 636, baseType: !472, size: 64, offset: 448)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !796, file: !396, line: 755, baseType: !959, size: 704)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !396, line: 642, size: 704, elements: !960)
!960 = !{!961, !962, !963, !964}
!961 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !959, file: !396, line: 644, baseType: !952, size: 512)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !959, file: !396, line: 648, baseType: !472, size: 64, offset: 512)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !959, file: !396, line: 652, baseType: !472, size: 64, offset: 576)
!964 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !959, file: !396, line: 653, baseType: !472, size: 64, offset: 640)
!965 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !796, file: !396, line: 756, baseType: !966, size: 448)
!966 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !396, line: 663, size: 448, elements: !967)
!967 = !{!968, !969, !970}
!968 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !966, file: !396, line: 665, baseType: !860, size: 320)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !966, file: !396, line: 668, baseType: !472, size: 64, offset: 320)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !966, file: !396, line: 673, baseType: !472, size: 64, offset: 384)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !796, file: !396, line: 757, baseType: !972, size: 384)
!972 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !396, line: 694, size: 384, elements: !973)
!973 = !{!974, !975}
!974 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !972, file: !396, line: 696, baseType: !860, size: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !972, file: !396, line: 699, baseType: !472, size: 64, offset: 320)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !796, file: !396, line: 758, baseType: !977, size: 384)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !396, line: 681, size: 384, elements: !978)
!978 = !{!979, !980, !981}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !977, file: !396, line: 683, baseType: !799, size: 256)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !977, file: !396, line: 686, baseType: !472, size: 64, offset: 256)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !977, file: !396, line: 689, baseType: !472, size: 64, offset: 320)
!982 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !796, file: !396, line: 759, baseType: !983, size: 384)
!983 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !396, line: 707, size: 384, elements: !984)
!984 = !{!985, !986, !987}
!985 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !983, file: !396, line: 709, baseType: !799, size: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !983, file: !396, line: 712, baseType: !472, size: 64, offset: 256)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !983, file: !396, line: 712, baseType: !472, size: 64, offset: 320)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !796, file: !396, line: 760, baseType: !989, size: 320)
!989 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !396, line: 718, size: 320, elements: !990)
!990 = !{!991, !992}
!991 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !989, file: !396, line: 720, baseType: !799, size: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !989, file: !396, line: 723, baseType: !472, size: 64, offset: 256)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !791, file: !396, line: 138, baseType: !790, size: 64, offset: 64)
!994 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !791, file: !396, line: 139, baseType: !790, size: 64, offset: 128)
!995 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !786, file: !396, line: 146, baseType: !789, size: 64, offset: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !786, file: !396, line: 152, baseType: !784, size: 64, offset: 128)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !781, file: !341, line: 130, baseType: !645, size: 64)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !776, file: !341, line: 134, baseType: !467, size: 64, offset: 192)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !776, file: !341, line: 137, baseType: !472, size: 64, offset: 256)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !776, file: !341, line: 138, baseType: !597, size: 32, offset: 320)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !776, file: !341, line: 142, baseType: !5, size: 32, offset: 352)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !776, file: !341, line: 144, baseType: !463, size: 32, offset: 384)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !776, file: !341, line: 145, baseType: !463, size: 32, offset: 416)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !776, file: !341, line: 146, baseType: !1005, size: 64, offset: 448)
!1005 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !341, line: 119, baseType: !528)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !759, file: !341, line: 220, baseType: !762, size: 64, offset: 64)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !759, file: !341, line: 223, baseType: !467, size: 64, offset: 128)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !759, file: !341, line: 226, baseType: !1009, size: 64, offset: 192)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 100, size: 1216, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1015, !1016, !1021, !1022, !1023, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1054, !1062, !1063}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1010, file: !328, line: 102, baseType: !463, size: 32)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !1010, file: !328, line: 105, baseType: !5, size: 32, offset: 32)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1010, file: !328, line: 108, baseType: !758, size: 64, offset: 64)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !1010, file: !328, line: 111, baseType: !758, size: 64, offset: 128)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !1010, file: !328, line: 114, baseType: !1017, size: 64, offset: 192)
!1017 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !328, line: 41, size: 64, elements: !1018)
!1018 = !{!1019, !1020}
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !1017, file: !328, line: 42, baseType: !327, size: 32)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !1017, file: !328, line: 43, baseType: !5, size: 32, offset: 32)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !1010, file: !328, line: 117, baseType: !5, size: 32, offset: 256)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !1010, file: !328, line: 120, baseType: !5, size: 32, offset: 288)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !1010, file: !328, line: 123, baseType: !1024, size: 64, offset: 320)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !328, line: 87, baseType: !1026)
!1026 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !328, line: 87, size: 128, elements: !1027)
!1027 = !{!1028}
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1026, file: !328, line: 87, baseType: !1029, size: 128)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !328, line: 85, baseType: !1030)
!1030 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !328, line: 85, size: 128, elements: !1031)
!1031 = !{!1032, !1033, !1034}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1030, file: !328, line: 85, baseType: !5, size: 32)
!1033 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1030, file: !328, line: 85, baseType: !5, size: 32, offset: 32)
!1034 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1030, file: !328, line: 85, baseType: !1035, size: 64, offset: 64)
!1035 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1036, size: 64, elements: !571)
!1036 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !328, line: 84, baseType: !1009)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1010, file: !328, line: 126, baseType: !1009, size: 64, offset: 384)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1010, file: !328, line: 129, baseType: !1009, size: 64, offset: 448)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1010, file: !328, line: 132, baseType: !467, size: 64, offset: 512)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !1010, file: !328, line: 139, baseType: !472, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !1010, file: !328, line: 143, baseType: !521, size: 128, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !1010, file: !328, line: 146, baseType: !521, size: 128, offset: 768)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !1010, file: !328, line: 148, baseType: !462, size: 8, offset: 896)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !1010, file: !328, line: 149, baseType: !462, size: 8, offset: 904)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !1010, file: !328, line: 153, baseType: !336, size: 32, offset: 928)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !1010, file: !328, line: 156, baseType: !1047, size: 64, offset: 960)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !328, line: 48, size: 320, elements: !1049)
!1049 = !{!1050, !1051, !1052, !1053}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1048, file: !328, line: 50, baseType: !794, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !1048, file: !328, line: 59, baseType: !521, size: 128, offset: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !1048, file: !328, line: 64, baseType: !462, size: 8, offset: 192)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !328, line: 67, baseType: !1047, size: 64, offset: 256)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !1010, file: !328, line: 159, baseType: !1055, size: 64, offset: 1024)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1056, size: 64)
!1056 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !328, line: 72, size: 256, elements: !1057)
!1057 = !{!1058, !1059, !1060, !1061}
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !1056, file: !328, line: 74, baseType: !775, size: 64)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1056, file: !328, line: 77, baseType: !1055, size: 64, offset: 64)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1056, file: !328, line: 78, baseType: !1055, size: 64, offset: 128)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !1056, file: !328, line: 81, baseType: !1055, size: 64, offset: 192)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !1010, file: !328, line: 162, baseType: !462, size: 8, offset: 1088)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !1010, file: !328, line: 166, baseType: !472, size: 64, offset: 1152)
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !759, file: !341, line: 229, baseType: !1065, size: 128, offset: 256)
!1065 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1066, size: 128, elements: !713)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1067, size: 64)
!1067 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !341, line: 229, flags: DIFlagFwdDecl)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !759, file: !341, line: 232, baseType: !758, size: 64, offset: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !759, file: !341, line: 233, baseType: !758, size: 64, offset: 448)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !759, file: !341, line: 238, baseType: !1071, size: 64, offset: 512)
!1071 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !341, line: 235, size: 64, elements: !1072)
!1072 = !{!1073, !1079}
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1071, file: !341, line: 236, baseType: !1074, size: 64)
!1074 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1075, size: 64)
!1075 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !341, line: 273, size: 128, elements: !1076)
!1076 = !{!1077, !1078}
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1075, file: !341, line: 275, baseType: !784, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1075, file: !341, line: 278, baseType: !784, size: 64, offset: 64)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1071, file: !341, line: 237, baseType: !1080, size: 64)
!1080 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1081, size: 64)
!1081 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !341, line: 259, size: 320, elements: !1082)
!1082 = !{!1083, !1084, !1085, !1086, !1087}
!1083 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1081, file: !341, line: 261, baseType: !645, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1081, file: !341, line: 262, baseType: !645, size: 64, offset: 64)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1081, file: !341, line: 266, baseType: !645, size: 64, offset: 128)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1081, file: !341, line: 267, baseType: !645, size: 64, offset: 192)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1081, file: !341, line: 270, baseType: !463, size: 32, offset: 256)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !759, file: !341, line: 241, baseType: !1005, size: 64, offset: 576)
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !759, file: !341, line: 244, baseType: !463, size: 32, offset: 640)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !759, file: !341, line: 247, baseType: !463, size: 32, offset: 672)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !759, file: !341, line: 250, baseType: !463, size: 32, offset: 704)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !759, file: !341, line: 253, baseType: !463, size: 32, offset: 736)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !759, file: !341, line: 256, baseType: !463, size: 32, offset: 768)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !666, file: !648, line: 179, baseType: !1095, size: 64)
!1095 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1096, size: 64)
!1096 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !648, line: 150, baseType: !1097)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !648, line: 142, size: 320, elements: !1098)
!1098 = !{!1099, !1100, !1101, !1102, !1105, !1106}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1097, file: !648, line: 144, baseType: !472, size: 64)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1097, file: !648, line: 145, baseType: !645, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1097, file: !648, line: 146, baseType: !645, size: 64, offset: 128)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1097, file: !648, line: 147, baseType: !1103, size: 32, offset: 192)
!1103 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1104, line: 31, baseType: !463)
!1104 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1097, file: !648, line: 148, baseType: !5, size: 32, offset: 224)
!1106 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1097, file: !648, line: 149, baseType: !462, size: 8, offset: 256)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !666, file: !648, line: 180, baseType: !1108, size: 64)
!1108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1109, size: 64)
!1109 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !648, line: 162, baseType: !1110)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !648, line: 159, size: 128, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1110, file: !648, line: 160, baseType: !472, size: 64)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1110, file: !648, line: 161, baseType: !528, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !666, file: !648, line: 181, baseType: !1115, size: 64)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !648, line: 181, flags: DIFlagFwdDecl)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !661, file: !648, line: 317, baseType: !1118, size: 64)
!1118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !528, size: 64, elements: !571)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !661, file: !648, line: 318, baseType: !1120, size: 320)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !648, line: 188, size: 320, elements: !1121)
!1121 = !{!1122, !1124, !1181}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1120, file: !648, line: 190, baseType: !1123, size: 192)
!1123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !665, size: 192, elements: !546)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1120, file: !648, line: 193, baseType: !1125, size: 64, offset: 192)
!1125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1126, size: 64)
!1126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !648, line: 206, size: 320, elements: !1127)
!1127 = !{!1128, !1166, !1167, !1168, !1180}
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1126, file: !648, line: 208, baseType: !1129, size: 64)
!1129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1130, size: 64)
!1130 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !473, line: 62, baseType: !1131)
!1131 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1132, line: 538, size: 256, elements: !1133)
!1132 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1133 = !{!1134, !1138, !1144, !1157}
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1131, file: !1132, line: 539, baseType: !1135, size: 32)
!1135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1132, line: 482, size: 32, elements: !1136)
!1136 = !{!1137}
!1137 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1135, file: !1132, line: 484, baseType: !5, size: 32)
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1131, file: !1132, line: 540, baseType: !1139, size: 192)
!1139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1132, line: 488, size: 192, elements: !1140)
!1140 = !{!1141, !1142, !1143}
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1139, file: !1132, line: 489, baseType: !1135, size: 32)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1139, file: !1132, line: 492, baseType: !468, size: 64, offset: 64)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1139, file: !1132, line: 496, baseType: !472, size: 64, offset: 128)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1131, file: !1132, line: 541, baseType: !1145, size: 256)
!1145 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1132, line: 504, size: 256, elements: !1146)
!1146 = !{!1147, !1148, !1155, !1156}
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1145, file: !1132, line: 505, baseType: !1135, size: 32)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1145, file: !1132, line: 509, baseType: !1149, size: 64, offset: 64)
!1149 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1132, line: 501, baseType: !1150)
!1150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1151, size: 64)
!1151 = !DISubroutineType(types: !1152)
!1152 = !{null, !1153}
!1153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1154, size: 64)
!1154 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1145, file: !1132, line: 510, baseType: !1153, size: 64, offset: 128)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1145, file: !1132, line: 513, baseType: !1129, size: 64, offset: 192)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1131, file: !1132, line: 542, baseType: !1158, size: 128)
!1158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1132, line: 530, size: 128, elements: !1159)
!1159 = !{!1160, !1161}
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1158, file: !1132, line: 531, baseType: !1135, size: 32)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1158, file: !1132, line: 534, baseType: !1162, size: 64, offset: 64)
!1162 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1132, line: 525, baseType: !1163)
!1163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1164, size: 64)
!1164 = !DISubroutineType(types: !1165)
!1165 = !{!462, !472, !468, !526, !526}
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1126, file: !648, line: 211, baseType: !5, size: 32, offset: 64)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1126, file: !648, line: 214, baseType: !528, size: 64, offset: 128)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1126, file: !648, line: 224, baseType: !1169, size: 64, offset: 192)
!1169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1170, size: 64)
!1170 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !648, line: 202, baseType: !1171)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !648, line: 202, size: 128, elements: !1172)
!1172 = !{!1173}
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1171, file: !648, line: 202, baseType: !1174, size: 128)
!1174 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !648, line: 200, baseType: !1175)
!1175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !648, line: 200, size: 128, elements: !1176)
!1176 = !{!1177, !1178, !1179}
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1175, file: !648, line: 200, baseType: !5, size: 32)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1175, file: !648, line: 200, baseType: !5, size: 32, offset: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1175, file: !648, line: 200, baseType: !679, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1126, file: !648, line: 234, baseType: !1169, size: 64, offset: 256)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1120, file: !648, line: 197, baseType: !528, size: 64, offset: 256)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !661, file: !648, line: 319, baseType: !535, size: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !661, file: !648, line: 320, baseType: !554, size: 192)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !475, file: !133, line: 3384, baseType: !1185, size: 1472)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !1186)
!1186 = !{!1187, !1208, !1209, !1210, !1211}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1185, file: !133, line: 3115, baseType: !1188, size: 1216)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194, !1195, !1196, !1197, !1198, !1199, !1200, !1201, !1202, !1203, !1204, !1205, !1206, !1207}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1188, file: !133, line: 2985, baseType: !641, size: 960)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1188, file: !133, line: 2986, baseType: !472, size: 64, offset: 960)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1188, file: !133, line: 2987, baseType: !472, size: 64, offset: 1024)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1188, file: !133, line: 2988, baseType: !472, size: 64, offset: 1088)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1188, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1188, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1188, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1188, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1188, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1188, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1188, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1188, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1188, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1188, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1188, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1188, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1188, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1188, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1185, file: !133, line: 3117, baseType: !472, size: 64, offset: 1216)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1185, file: !133, line: 3119, baseType: !472, size: 64, offset: 1280)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1185, file: !133, line: 3121, baseType: !472, size: 64, offset: 1344)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1185, file: !133, line: 3123, baseType: !472, size: 64, offset: 1408)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !475, file: !133, line: 3385, baseType: !1213, size: 1088)
!1213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !1214)
!1214 = !{!1215, !1216, !1217}
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1213, file: !133, line: 2875, baseType: !641, size: 960)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1213, file: !133, line: 2876, baseType: !645, size: 64, offset: 960)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1213, file: !133, line: 2877, baseType: !1218, size: 64, offset: 1024)
!1218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1219, size: 64)
!1219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1220, line: 172, size: 128, elements: !1221)
!1220 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1221 = !{!1222, !1223, !1224, !1225, !1226, !1227, !1228}
!1222 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1219, file: !1220, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1219, file: !1220, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1219, file: !1220, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1219, file: !1220, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1219, file: !1220, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1219, file: !1220, line: 195, baseType: !5, size: 32, offset: 32)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1219, file: !1220, line: 199, baseType: !472, size: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !475, file: !133, line: 3386, baseType: !1188, size: 1216)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !475, file: !133, line: 3387, baseType: !1231, size: 1280)
!1231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !1232)
!1232 = !{!1233, !1234}
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1231, file: !133, line: 3094, baseType: !1188, size: 1216)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1231, file: !133, line: 3095, baseType: !1218, size: 64, offset: 1216)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !475, file: !133, line: 3388, baseType: !1236, size: 1216)
!1236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !1237)
!1237 = !{!1238, !1239, !1240, !1241, !1242, !1243}
!1238 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1236, file: !133, line: 2825, baseType: !603, size: 896)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1236, file: !133, line: 2827, baseType: !472, size: 64, offset: 896)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1236, file: !133, line: 2828, baseType: !472, size: 64, offset: 960)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1236, file: !133, line: 2829, baseType: !472, size: 64, offset: 1024)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1236, file: !133, line: 2830, baseType: !472, size: 64, offset: 1088)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1236, file: !133, line: 2831, baseType: !472, size: 64, offset: 1152)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !475, file: !133, line: 3389, baseType: !1245, size: 1024)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !1246)
!1246 = !{!1247, !1248, !1249}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1245, file: !133, line: 2851, baseType: !641, size: 960)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1245, file: !133, line: 2852, baseType: !463, size: 32, offset: 960)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1245, file: !133, line: 2853, baseType: !463, size: 32, offset: 992)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !475, file: !133, line: 3390, baseType: !1251, size: 1024)
!1251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !1252)
!1252 = !{!1253, !1254}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1251, file: !133, line: 2858, baseType: !641, size: 960)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1251, file: !133, line: 2859, baseType: !1218, size: 64, offset: 960)
