; ModuleID = 'tree-sra.bc'
source_filename = "tree-sra.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.gimple_opt_pass = type { %struct.opt_pass }
%struct.opt_pass = type { i32, i8*, i8 ()*, i32 ()*, %struct.opt_pass*, %struct.opt_pass*, i32, i32, i32, i32, i32, i32, i32 }
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }

!635 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "unscalarized_data_handling", file: !3, line: 2384, baseType: !7, size: 32, elements: !636)
!636 = !{!637, !638, !639}
!637 = !DIEnumerator(name: "SRA_UDH_NONE", value: 0, isUnsigned: true)
!638 = !DIEnumerator(name: "SRA_UDH_RIGHT", value: 1, isUnsigned: true)
!639 = !DIEnumerator(name: "SRA_UDH_LEFT", value: 2, isUnsigned: true)
!640 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !641, line: 309, baseType: !7, size: 32, elements: !642)
!641 = !DIFile(filename: "./cgraph.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!642 = !{!643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662}
!643 = !DIEnumerator(name: "CIF_OK", value: 0, isUnsigned: true)
!644 = !DIEnumerator(name: "CIF_UNSPECIFIED", value: 1, isUnsigned: true)
!645 = !DIEnumerator(name: "CIF_FUNCTION_NOT_CONSIDERED", value: 2, isUnsigned: true)
!646 = !DIEnumerator(name: "CIF_BODY_NOT_AVAILABLE", value: 3, isUnsigned: true)
!647 = !DIEnumerator(name: "CIF_REDEFINED_EXTERN_INLINE", value: 4, isUnsigned: true)
!648 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINABLE", value: 5, isUnsigned: true)
!649 = !DIEnumerator(name: "CIF_FUNCTION_NOT_INLINE_CANDIDATE", value: 6, isUnsigned: true)
!650 = !DIEnumerator(name: "CIF_LARGE_FUNCTION_GROWTH_LIMIT", value: 7, isUnsigned: true)
!651 = !DIEnumerator(name: "CIF_LARGE_STACK_FRAME_GROWTH_LIMIT", value: 8, isUnsigned: true)
!652 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_SINGLE_LIMIT", value: 9, isUnsigned: true)
!653 = !DIEnumerator(name: "CIF_MAX_INLINE_INSNS_AUTO_LIMIT", value: 10, isUnsigned: true)
!654 = !DIEnumerator(name: "CIF_INLINE_UNIT_GROWTH_LIMIT", value: 11, isUnsigned: true)
!655 = !DIEnumerator(name: "CIF_RECURSIVE_INLINING", value: 12, isUnsigned: true)
!656 = !DIEnumerator(name: "CIF_UNLIKELY_CALL", value: 13, isUnsigned: true)
!657 = !DIEnumerator(name: "CIF_NOT_DECLARED_INLINED", value: 14, isUnsigned: true)
!658 = !DIEnumerator(name: "CIF_OPTIMIZING_FOR_SIZE", value: 15, isUnsigned: true)
!659 = !DIEnumerator(name: "CIF_TARGET_OPTION_MISMATCH", value: 16, isUnsigned: true)
!660 = !DIEnumerator(name: "CIF_MISMATCHED_ARGUMENTS", value: 17, isUnsigned: true)
!661 = !DIEnumerator(name: "CIF_ORIGINALLY_INDIRECT_CALL", value: 18, isUnsigned: true)
!662 = !DIEnumerator(name: "CIF_N_REASONS", value: 19, isUnsigned: true)
!663 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !664, line: 119, baseType: !7, size: 32, elements: !665)
!664 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!665 = !{!666, !667, !668, !669}
!666 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!667 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!668 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!669 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!670 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ipa_splicing_result", file: !3, line: 3471, baseType: !7, size: 32, elements: !671)
!671 = !{!672, !673, !674, !675, !676}
!672 = !DIEnumerator(name: "NO_GOOD_ACCESS", value: 0, isUnsigned: true)
!673 = !DIEnumerator(name: "UNUSED_PARAMS", value: 1, isUnsigned: true)
!674 = !DIEnumerator(name: "BY_VAL_ACCESSES", value: 2, isUnsigned: true)
!675 = !DIEnumerator(name: "MODIF_BY_REF_ACCESSES", value: 3, isUnsigned: true)
!676 = !DIEnumerator(name: "UNMODIF_BY_REF_ACCESSES", value: 4, isUnsigned: true)
!677 = !{!678, !679, !680, !681, !684, !685, !134, !687, !689, !1981, !1462, !1012, !1984, !1045, !682, !7, !1986, !2023, !2036, !2000, !1528, !2038, !2039, !2041, !2042, !2043, !2046, !2051}
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!680 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !683, size: 64)
!683 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !683)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !688, line: 44, baseType: !7)
!688 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !690, line: 56, baseType: !691)
!690 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!691 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !692, size: 64)
!692 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !693)
!693 = !{!694, !727, !733, !746, !765, !776, !781, !790, !796, !809, !819, !857, !1314, !1342, !1359, !1360, !1365, !1374, !1380, !1385, !1389, !1393, !1632, !1679, !1685, !1691, !1698, !1711, !1725, !1742, !1754, !1776, !1791, !1963}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !692, file: !135, line: 3372, baseType: !695, size: 64)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !696)
!696 = !{!697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !695, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !695, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !695, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !695, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !695, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !695, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !695, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !695, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !695, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !695, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !695, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !695, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !695, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !695, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !695, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !695, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !695, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !695, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !695, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !695, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !695, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !695, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !695, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !695, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !695, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !695, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !695, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !695, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !695, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !695, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !692, file: !135, line: 3373, baseType: !728, size: 192)
!728 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !729)
!729 = !{!730, !731, !732}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !728, file: !135, line: 403, baseType: !695, size: 64)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !728, file: !135, line: 404, baseType: !689, size: 64, offset: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !728, file: !135, line: 405, baseType: !689, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !692, file: !135, line: 3374, baseType: !734, size: 320)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !735)
!735 = !{!736, !737}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !734, file: !135, line: 1385, baseType: !728, size: 192)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !734, file: !135, line: 1386, baseType: !738, size: 128, offset: 192)
!738 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !739, line: 58, baseType: !740)
!739 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !739, line: 54, size: 128, elements: !741)
!741 = !{!742, !744}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !740, file: !739, line: 56, baseType: !743, size: 64)
!743 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !740, file: !739, line: 57, baseType: !745, size: 64, offset: 64)
!745 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !692, file: !135, line: 3375, baseType: !747, size: 256)
!747 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !748)
!748 = !{!749, !750}
!749 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !747, file: !135, line: 1398, baseType: !728, size: 192)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !747, file: !135, line: 1399, baseType: !751, size: 64, offset: 192)
!751 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !752, size: 64)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !753, line: 52, size: 256, elements: !754)
!753 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!754 = !{!755, !756, !757, !758, !759, !760, !761}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !752, file: !753, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !752, file: !753, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !752, file: !753, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !752, file: !753, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !752, file: !753, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !752, file: !753, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !752, file: !753, line: 62, baseType: !762, size: 192, offset: 64)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !743, size: 192, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 3)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !692, file: !135, line: 3376, baseType: !766, size: 256)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !767)
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !766, file: !135, line: 1409, baseType: !728, size: 192)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !766, file: !135, line: 1410, baseType: !770, size: 64, offset: 192)
!770 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !771, size: 64)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !772, line: 27, size: 192, elements: !773)
!772 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!773 = !{!774, !775}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !771, file: !772, line: 29, baseType: !738, size: 128)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !771, file: !772, line: 30, baseType: !5, size: 32, offset: 128)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !692, file: !135, line: 3377, baseType: !777, size: 256)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !778)
!778 = !{!779, !780}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !777, file: !135, line: 1438, baseType: !728, size: 192)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !777, file: !135, line: 1439, baseType: !689, size: 64, offset: 192)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !692, file: !135, line: 3378, baseType: !782, size: 256)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !783)
!783 = !{!784, !785, !786}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !782, file: !135, line: 1419, baseType: !728, size: 192)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !782, file: !135, line: 1420, baseType: !680, size: 32, offset: 192)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !782, file: !135, line: 1421, baseType: !787, size: 8, offset: 224)
!787 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 8, elements: !788)
!788 = !{!789}
!789 = !DISubrange(count: 1)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !692, file: !135, line: 3379, baseType: !791, size: 320)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !792)
!792 = !{!793, !794, !795}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !791, file: !135, line: 1429, baseType: !728, size: 192)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !791, file: !135, line: 1430, baseType: !689, size: 64, offset: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !791, file: !135, line: 1431, baseType: !689, size: 64, offset: 256)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !692, file: !135, line: 3380, baseType: !797, size: 320)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !798)
!798 = !{!799, !800}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !135, line: 1461, baseType: !728, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !797, file: !135, line: 1462, baseType: !801, size: 128, offset: 192)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !802, line: 31, size: 128, elements: !803)
!802 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!803 = !{!804, !807, !808}
!804 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !801, file: !802, line: 32, baseType: !805, size: 64)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !806, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !679)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !801, file: !802, line: 33, baseType: !7, size: 32, offset: 64)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !801, file: !802, line: 34, baseType: !7, size: 32, offset: 96)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !692, file: !135, line: 3381, baseType: !810, size: 384)
!810 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !811)
!811 = !{!812, !813, !816, !817, !818}
!812 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !810, file: !135, line: 2508, baseType: !728, size: 192)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !810, file: !135, line: 2509, baseType: !814, size: 32, offset: 192)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !815, line: 58, baseType: !687)
!815 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!816 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !810, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !810, file: !135, line: 2511, baseType: !689, size: 64, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !810, file: !135, line: 2512, baseType: !689, size: 64, offset: 320)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !692, file: !135, line: 3382, baseType: !820, size: 896)
!820 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !821)
!821 = !{!822, !823, !824, !825, !826, !827, !828, !829, !830, !831, !832, !833, !834, !835, !836, !837, !838, !839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !820, file: !135, line: 2653, baseType: !810, size: 384)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !820, file: !135, line: 2654, baseType: !689, size: 64, offset: 384)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !820, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !820, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !820, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !820, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !820, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !820, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !820, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !820, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !820, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !820, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !820, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !820, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !820, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !820, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !820, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !820, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !820, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !820, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !820, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !820, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !820, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !820, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !820, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !820, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !820, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !820, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !820, file: !135, line: 2705, baseType: !689, size: 64, offset: 576)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !820, file: !135, line: 2706, baseType: !689, size: 64, offset: 640)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !820, file: !135, line: 2707, baseType: !689, size: 64, offset: 704)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !820, file: !135, line: 2708, baseType: !689, size: 64, offset: 768)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !820, file: !135, line: 2711, baseType: !855, size: 64, offset: 832)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !692, file: !135, line: 3383, baseType: !858, size: 960)
!858 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !859)
!859 = !{!860, !861}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !858, file: !135, line: 2757, baseType: !820, size: 896)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !858, file: !135, line: 2758, baseType: !862, size: 64, offset: 896)
!862 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !690, line: 50, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !865, line: 240, size: 384, elements: !866)
!865 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!866 = !{!867, !868, !869, !870, !871, !872, !873, !874, !875, !876, !877}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !864, file: !865, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !864, file: !865, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !864, file: !865, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !864, file: !865, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !864, file: !865, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !864, file: !865, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !864, file: !865, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !864, file: !865, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !864, file: !865, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !864, file: !865, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !864, file: !865, line: 321, baseType: !878, size: 320, offset: 64)
!878 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !865, line: 315, size: 320, elements: !879)
!879 = !{!880, !1281, !1283, !1312, !1313}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !878, file: !865, line: 316, baseType: !881, size: 64)
!881 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 64, elements: !788)
!882 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !865, line: 183, baseType: !883)
!883 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !865, line: 166, size: 64, elements: !884)
!884 = !{!885, !886, !887, !888, !889, !897, !898, !910, !913, !973, !974, !1258, !1271, !1278}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !883, file: !865, line: 168, baseType: !680, size: 32)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !883, file: !865, line: 169, baseType: !7, size: 32)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !883, file: !865, line: 170, baseType: !685, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !883, file: !865, line: 171, baseType: !862, size: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !883, file: !865, line: 172, baseType: !890, size: 64)
!890 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !690, line: 53, baseType: !891)
!891 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !892, size: 64)
!892 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !865, line: 359, size: 128, elements: !893)
!893 = !{!894, !895}
!894 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !892, file: !865, line: 360, baseType: !680, size: 32)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !892, file: !865, line: 361, baseType: !896, size: 64, offset: 64)
!896 = !DICompositeType(tag: DW_TAG_array_type, baseType: !862, size: 64, elements: !788)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !883, file: !865, line: 173, baseType: !5, size: 32)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !883, file: !865, line: 174, baseType: !899, size: 32)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !865, line: 133, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !865, line: 115, size: 32, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !907, !908, !909}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !900, file: !865, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !900, file: !865, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !900, file: !865, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !900, file: !865, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !900, file: !865, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !900, file: !865, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !900, file: !865, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !900, file: !865, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !883, file: !865, line: 175, baseType: !911, size: 64)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !912, size: 64)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !865, line: 175, flags: DIFlagFwdDecl)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !883, file: !865, line: 176, baseType: !914, size: 64)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !916, line: 75, size: 256, elements: !917)
!916 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!917 = !{!918, !932, !933, !934}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !915, file: !916, line: 76, baseType: !919, size: 64)
!919 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !920, size: 64)
!920 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !916, line: 68, baseType: !921)
!921 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !916, line: 63, size: 320, elements: !922)
!922 = !{!923, !925, !926, !927}
!923 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !921, file: !916, line: 64, baseType: !924, size: 64)
!924 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !921, size: 64)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !921, file: !916, line: 65, baseType: !924, size: 64, offset: 64)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !921, file: !916, line: 66, baseType: !7, size: 32, offset: 128)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !921, file: !916, line: 67, baseType: !928, size: 128, offset: 192)
!928 = !DICompositeType(tag: DW_TAG_array_type, baseType: !929, size: 128, elements: !930)
!929 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !916, line: 29, baseType: !743)
!930 = !{!931}
!931 = !DISubrange(count: 2)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !915, file: !916, line: 77, baseType: !919, size: 64, offset: 64)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !915, file: !916, line: 78, baseType: !7, size: 32, offset: 128)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !915, file: !916, line: 79, baseType: !935, size: 64, offset: 192)
!935 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !916, line: 49, baseType: !937)
!937 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !916, line: 45, size: 832, elements: !938)
!938 = !{!939, !940, !941}
!939 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !937, file: !916, line: 46, baseType: !924, size: 64)
!940 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !937, file: !916, line: 47, baseType: !914, size: 64, offset: 64)
!941 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !937, file: !916, line: 48, baseType: !942, size: 704, offset: 128)
!942 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !943, line: 164, size: 704, elements: !944)
!943 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!944 = !{!945, !946, !956, !957, !958, !959, !960, !961, !965, !969, !970, !971, !972}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !942, file: !943, line: 166, baseType: !745, size: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !942, file: !943, line: 167, baseType: !947, size: 64, offset: 64)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !943, line: 157, size: 192, elements: !949)
!949 = !{!950, !951, !952}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !948, file: !943, line: 159, baseType: !682, size: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !948, file: !943, line: 160, baseType: !947, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !948, file: !943, line: 161, baseType: !953, size: 32, offset: 128)
!953 = !DICompositeType(tag: DW_TAG_array_type, baseType: !683, size: 32, elements: !954)
!954 = !{!955}
!955 = !DISubrange(count: 4)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !942, file: !943, line: 168, baseType: !682, size: 64, offset: 128)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !942, file: !943, line: 169, baseType: !682, size: 64, offset: 192)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !942, file: !943, line: 170, baseType: !682, size: 64, offset: 256)
!959 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !942, file: !943, line: 171, baseType: !745, size: 64, offset: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !942, file: !943, line: 172, baseType: !680, size: 32, offset: 384)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !942, file: !943, line: 176, baseType: !962, size: 64, offset: 448)
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !963, size: 64)
!963 = !DISubroutineType(types: !964)
!964 = !{!947, !684, !745}
!965 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !942, file: !943, line: 177, baseType: !966, size: 64, offset: 512)
!966 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !967, size: 64)
!967 = !DISubroutineType(types: !968)
!968 = !{null, !684, !947}
!969 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !942, file: !943, line: 178, baseType: !684, size: 64, offset: 576)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !942, file: !943, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !942, file: !943, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !942, file: !943, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !883, file: !865, line: 177, baseType: !689, size: 64)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !883, file: !865, line: 178, baseType: !975, size: 64)
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !976, size: 64)
!976 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !977)
!977 = !{!978, !1223, !1224, !1225, !1228, !1232, !1233, !1234, !1252, !1253, !1254, !1255, !1256, !1257}
!978 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !976, file: !330, line: 219, baseType: !979, size: 64)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !981)
!981 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !982)
!982 = !{!983}
!983 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !981, file: !330, line: 151, baseType: !984, size: 128)
!984 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !985)
!985 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !986)
!986 = !{!987, !988, !989}
!987 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !985, file: !330, line: 150, baseType: !7, size: 32)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !985, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !985, file: !330, line: 150, baseType: !990, size: 64, offset: 64)
!990 = !DICompositeType(tag: DW_TAG_array_type, baseType: !991, size: 64, elements: !788)
!991 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !690, line: 108, baseType: !992)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !994)
!994 = !{!995, !996, !997, !1215, !1216, !1217, !1218, !1219, !1220, !1221}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !993, file: !330, line: 124, baseType: !975, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !993, file: !330, line: 125, baseType: !975, size: 64, offset: 64)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !993, file: !330, line: 131, baseType: !998, size: 64, offset: 128)
!998 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !999)
!999 = !{!1000, !1214}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !998, file: !330, line: 129, baseType: !1001, size: 64)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !690, line: 66, baseType: !1002)
!1002 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1003, size: 64)
!1003 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !571, line: 143, size: 192, elements: !1004)
!1004 = !{!1005, !1212, !1213}
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1003, file: !571, line: 145, baseType: !1006, size: 64)
!1006 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !690, line: 69, baseType: !1007)
!1007 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1008, size: 64)
!1008 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !571, line: 136, size: 192, elements: !1009)
!1009 = !{!1010, !1210, !1211}
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1008, file: !571, line: 137, baseType: !1011, size: 64)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !690, line: 58, baseType: !1012)
!1012 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1013, size: 64)
!1013 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !571, line: 737, size: 768, elements: !1014)
!1014 = !{!1015, !1032, !1065, !1071, !1076, !1081, !1088, !1094, !1100, !1105, !1119, !1124, !1130, !1135, !1145, !1150, !1168, !1175, !1182, !1188, !1193, !1199, !1205}
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1013, file: !571, line: 738, baseType: !1016, size: 256)
!1016 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !571, line: 271, size: 256, elements: !1017)
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1030, !1031}
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1016, file: !571, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1019 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1016, file: !571, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1016, file: !571, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1016, file: !571, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1016, file: !571, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1016, file: !571, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1024 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1016, file: !571, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1016, file: !571, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1016, file: !571, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1016, file: !571, line: 312, baseType: !7, size: 32, offset: 32)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1016, file: !571, line: 316, baseType: !814, size: 32, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1016, file: !571, line: 319, baseType: !7, size: 32, offset: 96)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1016, file: !571, line: 323, baseType: !975, size: 64, offset: 128)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1016, file: !571, line: 327, baseType: !689, size: 64, offset: 192)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1013, file: !571, line: 739, baseType: !1033, size: 448)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !571, line: 350, size: 448, elements: !1034)
!1034 = !{!1035, !1063}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1033, file: !571, line: 353, baseType: !1036, size: 384)
!1036 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !571, line: 333, size: 384, elements: !1037)
!1037 = !{!1038, !1039, !1046}
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1036, file: !571, line: 336, baseType: !1016, size: 256)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1036, file: !571, line: 343, baseType: !1040, size: 64, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1041, size: 64)
!1041 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !664, line: 37, size: 128, elements: !1042)
!1042 = !{!1043, !1044}
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1041, file: !664, line: 39, baseType: !1040, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1041, file: !664, line: 40, baseType: !1045, size: 64, offset: 64)
!1045 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !689, size: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1036, file: !571, line: 344, baseType: !1047, size: 64, offset: 320)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !664, line: 45, size: 320, elements: !1049)
!1049 = !{!1050, !1051}
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1048, file: !664, line: 47, baseType: !1047, size: 64)
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1048, file: !664, line: 48, baseType: !1052, size: 256, offset: 64)
!1052 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1053)
!1053 = !{!1054, !1056, !1057, !1062}
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1052, file: !135, line: 1884, baseType: !1055, size: 64)
!1055 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1052, size: 64)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1052, file: !135, line: 1885, baseType: !1055, size: 64, offset: 64)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1052, file: !135, line: 1891, baseType: !1058, size: 64, offset: 128)
!1058 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1052, file: !135, line: 1891, size: 64, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1058, file: !135, line: 1891, baseType: !1011, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1058, file: !135, line: 1891, baseType: !689, size: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1052, file: !135, line: 1892, baseType: !1045, size: 64, offset: 192)
!1063 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1033, file: !571, line: 359, baseType: !1064, size: 64, offset: 384)
!1064 = !DICompositeType(tag: DW_TAG_array_type, baseType: !689, size: 64, elements: !788)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1013, file: !571, line: 740, baseType: !1066, size: 512)
!1066 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !571, line: 365, size: 512, elements: !1067)
!1067 = !{!1068, !1069, !1070}
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1066, file: !571, line: 368, baseType: !1036, size: 384)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1066, file: !571, line: 373, baseType: !689, size: 64, offset: 384)
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1066, file: !571, line: 374, baseType: !689, size: 64, offset: 448)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1013, file: !571, line: 741, baseType: !1072, size: 576)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !571, line: 380, size: 576, elements: !1073)
!1073 = !{!1074, !1075}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1072, file: !571, line: 383, baseType: !1066, size: 512)
!1075 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1072, file: !571, line: 389, baseType: !1064, size: 64, offset: 512)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1013, file: !571, line: 742, baseType: !1077, size: 320)
!1077 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !571, line: 395, size: 320, elements: !1078)
!1078 = !{!1079, !1080}
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1077, file: !571, line: 397, baseType: !1016, size: 256)
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1077, file: !571, line: 400, baseType: !1001, size: 64, offset: 256)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1013, file: !571, line: 743, baseType: !1082, size: 448)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !571, line: 406, size: 448, elements: !1083)
!1083 = !{!1084, !1085, !1086, !1087}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1082, file: !571, line: 408, baseType: !1016, size: 256)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1082, file: !571, line: 412, baseType: !689, size: 64, offset: 256)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1082, file: !571, line: 420, baseType: !689, size: 64, offset: 320)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1082, file: !571, line: 423, baseType: !1001, size: 64, offset: 384)
!1088 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1013, file: !571, line: 744, baseType: !1089, size: 384)
!1089 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !571, line: 429, size: 384, elements: !1090)
!1090 = !{!1091, !1092, !1093}
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1089, file: !571, line: 431, baseType: !1016, size: 256)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1089, file: !571, line: 434, baseType: !689, size: 64, offset: 256)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1089, file: !571, line: 437, baseType: !1001, size: 64, offset: 320)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1013, file: !571, line: 745, baseType: !1095, size: 384)
!1095 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !571, line: 443, size: 384, elements: !1096)
!1096 = !{!1097, !1098, !1099}
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1095, file: !571, line: 445, baseType: !1016, size: 256)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1095, file: !571, line: 449, baseType: !689, size: 64, offset: 256)
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1095, file: !571, line: 453, baseType: !1001, size: 64, offset: 320)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1013, file: !571, line: 746, baseType: !1101, size: 320)
!1101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !571, line: 459, size: 320, elements: !1102)
!1102 = !{!1103, !1104}
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1101, file: !571, line: 461, baseType: !1016, size: 256)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1101, file: !571, line: 464, baseType: !689, size: 64, offset: 256)
!1105 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1013, file: !571, line: 747, baseType: !1106, size: 768)
!1106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !571, line: 469, size: 768, elements: !1107)
!1107 = !{!1108, !1109, !1110, !1111, !1112}
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1106, file: !571, line: 471, baseType: !1016, size: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1106, file: !571, line: 474, baseType: !7, size: 32, offset: 256)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1106, file: !571, line: 475, baseType: !7, size: 32, offset: 288)
!1111 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1106, file: !571, line: 478, baseType: !689, size: 64, offset: 320)
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1106, file: !571, line: 481, baseType: !1113, size: 384, offset: 384)
!1113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1114, size: 384, elements: !788)
!1114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1115)
!1115 = !{!1116, !1117, !1118}
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1114, file: !135, line: 1920, baseType: !1052, size: 256)
!1117 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1114, file: !135, line: 1921, baseType: !689, size: 64, offset: 256)
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1114, file: !135, line: 1922, baseType: !814, size: 32, offset: 320)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1013, file: !571, line: 748, baseType: !1120, size: 320)
!1120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !571, line: 487, size: 320, elements: !1121)
!1121 = !{!1122, !1123}
!1122 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1120, file: !571, line: 490, baseType: !1016, size: 256)
!1123 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1120, file: !571, line: 494, baseType: !680, size: 32, offset: 256)
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1013, file: !571, line: 749, baseType: !1125, size: 384)
!1125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !571, line: 500, size: 384, elements: !1126)
!1126 = !{!1127, !1128, !1129}
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1125, file: !571, line: 502, baseType: !1016, size: 256)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1125, file: !571, line: 506, baseType: !1001, size: 64, offset: 256)
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1125, file: !571, line: 510, baseType: !1001, size: 64, offset: 320)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1013, file: !571, line: 750, baseType: !1131, size: 320)
!1131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !571, line: 529, size: 320, elements: !1132)
!1132 = !{!1133, !1134}
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1131, file: !571, line: 531, baseType: !1016, size: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1131, file: !571, line: 540, baseType: !1001, size: 64, offset: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1013, file: !571, line: 751, baseType: !1136, size: 704)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !571, line: 546, size: 704, elements: !1137)
!1137 = !{!1138, !1139, !1140, !1141, !1142, !1143, !1144}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1136, file: !571, line: 549, baseType: !1066, size: 512)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1136, file: !571, line: 553, baseType: !685, size: 64, offset: 512)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1136, file: !571, line: 557, baseType: !679, size: 8, offset: 576)
!1141 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1136, file: !571, line: 558, baseType: !679, size: 8, offset: 584)
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1136, file: !571, line: 559, baseType: !679, size: 8, offset: 592)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1136, file: !571, line: 560, baseType: !679, size: 8, offset: 600)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1136, file: !571, line: 566, baseType: !1064, size: 64, offset: 640)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1013, file: !571, line: 752, baseType: !1146, size: 384)
!1146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !571, line: 571, size: 384, elements: !1147)
!1147 = !{!1148, !1149}
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1146, file: !571, line: 573, baseType: !1077, size: 320)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1146, file: !571, line: 577, baseType: !689, size: 64, offset: 320)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1013, file: !571, line: 753, baseType: !1151, size: 576)
!1151 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !571, line: 600, size: 576, elements: !1152)
!1152 = !{!1153, !1154, !1155, !1158, !1167}
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1151, file: !571, line: 602, baseType: !1077, size: 320)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1151, file: !571, line: 605, baseType: !689, size: 64, offset: 320)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1151, file: !571, line: 609, baseType: !1156, size: 64, offset: 384)
!1156 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1157, line: 46, baseType: !743)
!1157 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1151, file: !571, line: 612, baseType: !1159, size: 64, offset: 448)
!1159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1160, size: 64)
!1160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !571, line: 581, size: 320, elements: !1161)
!1161 = !{!1162, !1163, !1164, !1165, !1166}
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1160, file: !571, line: 583, baseType: !134, size: 32)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1160, file: !571, line: 586, baseType: !689, size: 64, offset: 64)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1160, file: !571, line: 589, baseType: !689, size: 64, offset: 128)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1160, file: !571, line: 592, baseType: !689, size: 64, offset: 192)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1160, file: !571, line: 595, baseType: !689, size: 64, offset: 256)
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1151, file: !571, line: 616, baseType: !1001, size: 64, offset: 512)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1013, file: !571, line: 754, baseType: !1169, size: 512)
!1169 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !571, line: 622, size: 512, elements: !1170)
!1170 = !{!1171, !1172, !1173, !1174}
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1169, file: !571, line: 624, baseType: !1077, size: 320)
!1172 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1169, file: !571, line: 628, baseType: !689, size: 64, offset: 320)
!1173 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1169, file: !571, line: 632, baseType: !689, size: 64, offset: 384)
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1169, file: !571, line: 636, baseType: !689, size: 64, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1013, file: !571, line: 755, baseType: !1176, size: 704)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !571, line: 642, size: 704, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1176, file: !571, line: 644, baseType: !1169, size: 512)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1176, file: !571, line: 648, baseType: !689, size: 64, offset: 512)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1176, file: !571, line: 652, baseType: !689, size: 64, offset: 576)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1176, file: !571, line: 653, baseType: !689, size: 64, offset: 640)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1013, file: !571, line: 756, baseType: !1183, size: 448)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !571, line: 663, size: 448, elements: !1184)
!1184 = !{!1185, !1186, !1187}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1183, file: !571, line: 665, baseType: !1077, size: 320)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1183, file: !571, line: 668, baseType: !689, size: 64, offset: 320)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1183, file: !571, line: 673, baseType: !689, size: 64, offset: 384)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1013, file: !571, line: 757, baseType: !1189, size: 384)
!1189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !571, line: 694, size: 384, elements: !1190)
!1190 = !{!1191, !1192}
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1189, file: !571, line: 696, baseType: !1077, size: 320)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1189, file: !571, line: 699, baseType: !689, size: 64, offset: 320)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1013, file: !571, line: 758, baseType: !1194, size: 384)
!1194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !571, line: 681, size: 384, elements: !1195)
!1195 = !{!1196, !1197, !1198}
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1194, file: !571, line: 683, baseType: !1016, size: 256)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1194, file: !571, line: 686, baseType: !689, size: 64, offset: 256)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1194, file: !571, line: 689, baseType: !689, size: 64, offset: 320)
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1013, file: !571, line: 759, baseType: !1200, size: 384)
!1200 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !571, line: 707, size: 384, elements: !1201)
!1201 = !{!1202, !1203, !1204}
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1200, file: !571, line: 709, baseType: !1016, size: 256)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1200, file: !571, line: 712, baseType: !689, size: 64, offset: 256)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1200, file: !571, line: 712, baseType: !689, size: 64, offset: 320)
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1013, file: !571, line: 760, baseType: !1206, size: 320)
!1206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !571, line: 718, size: 320, elements: !1207)
!1207 = !{!1208, !1209}
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1206, file: !571, line: 720, baseType: !1016, size: 256)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1206, file: !571, line: 723, baseType: !689, size: 64, offset: 256)
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1008, file: !571, line: 138, baseType: !1007, size: 64, offset: 64)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1008, file: !571, line: 139, baseType: !1007, size: 64, offset: 128)
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1003, file: !571, line: 146, baseType: !1006, size: 64, offset: 64)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1003, file: !571, line: 152, baseType: !1001, size: 64, offset: 128)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !998, file: !330, line: 130, baseType: !862, size: 64)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !993, file: !330, line: 134, baseType: !684, size: 64, offset: 192)
!1216 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !993, file: !330, line: 137, baseType: !689, size: 64, offset: 256)
!1217 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !993, file: !330, line: 138, baseType: !814, size: 32, offset: 320)
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !993, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !330, line: 144, baseType: !680, size: 32, offset: 384)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !993, file: !330, line: 145, baseType: !680, size: 32, offset: 416)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !993, file: !330, line: 146, baseType: !1222, size: 64, offset: 448)
!1222 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !745)
!1223 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !976, file: !330, line: 220, baseType: !979, size: 64, offset: 64)
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !976, file: !330, line: 223, baseType: !684, size: 64, offset: 128)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !976, file: !330, line: 226, baseType: !1226, size: 64, offset: 192)
!1226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1227, size: 64)
!1227 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !976, file: !330, line: 229, baseType: !1229, size: 128, offset: 256)
!1229 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1230, size: 128, elements: !930)
!1230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1231, size: 64)
!1231 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !976, file: !330, line: 232, baseType: !975, size: 64, offset: 384)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !976, file: !330, line: 233, baseType: !975, size: 64, offset: 448)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !976, file: !330, line: 238, baseType: !1235, size: 64, offset: 512)
!1235 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1236)
!1236 = !{!1237, !1243}
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1235, file: !330, line: 236, baseType: !1238, size: 64)
!1238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1239, size: 64)
!1239 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1240)
!1240 = !{!1241, !1242}
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1239, file: !330, line: 275, baseType: !1001, size: 64)
!1242 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1239, file: !330, line: 278, baseType: !1001, size: 64, offset: 64)
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1235, file: !330, line: 237, baseType: !1244, size: 64)
!1244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1245, size: 64)
!1245 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1246)
!1246 = !{!1247, !1248, !1249, !1250, !1251}
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1245, file: !330, line: 261, baseType: !862, size: 64)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1245, file: !330, line: 262, baseType: !862, size: 64, offset: 64)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1245, file: !330, line: 266, baseType: !862, size: 64, offset: 128)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1245, file: !330, line: 267, baseType: !862, size: 64, offset: 192)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1245, file: !330, line: 270, baseType: !680, size: 32, offset: 256)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !976, file: !330, line: 241, baseType: !1222, size: 64, offset: 576)
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !976, file: !330, line: 244, baseType: !680, size: 32, offset: 640)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !976, file: !330, line: 247, baseType: !680, size: 32, offset: 672)
!1255 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !976, file: !330, line: 250, baseType: !680, size: 32, offset: 704)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !976, file: !330, line: 253, baseType: !680, size: 32, offset: 736)
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !976, file: !330, line: 256, baseType: !680, size: 32, offset: 768)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !883, file: !865, line: 179, baseType: !1259, size: 64)
!1259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !865, line: 150, baseType: !1261)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !865, line: 142, size: 320, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1269, !1270}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1261, file: !865, line: 144, baseType: !689, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1261, file: !865, line: 145, baseType: !862, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1261, file: !865, line: 146, baseType: !862, size: 64, offset: 128)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1261, file: !865, line: 147, baseType: !1267, size: 32, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1268, line: 31, baseType: !680)
!1268 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1261, file: !865, line: 148, baseType: !7, size: 32, offset: 224)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1261, file: !865, line: 149, baseType: !679, size: 8, offset: 256)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !883, file: !865, line: 180, baseType: !1272, size: 64)
!1272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1273, size: 64)
!1273 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !865, line: 162, baseType: !1274)
!1274 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !865, line: 159, size: 128, elements: !1275)
!1275 = !{!1276, !1277}
!1276 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1274, file: !865, line: 160, baseType: !689, size: 64)
!1277 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1274, file: !865, line: 161, baseType: !745, size: 64, offset: 64)
!1278 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !883, file: !865, line: 181, baseType: !1279, size: 64)
!1279 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1280, size: 64)
!1280 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !865, line: 181, flags: DIFlagFwdDecl)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !878, file: !865, line: 317, baseType: !1282, size: 64)
!1282 = !DICompositeType(tag: DW_TAG_array_type, baseType: !745, size: 64, elements: !788)
!1283 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !878, file: !865, line: 318, baseType: !1284, size: 320)
!1284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !865, line: 188, size: 320, elements: !1285)
!1285 = !{!1286, !1288, !1311}
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1284, file: !865, line: 190, baseType: !1287, size: 192)
!1287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !882, size: 192, elements: !763)
!1288 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1284, file: !865, line: 193, baseType: !1289, size: 64, offset: 192)
!1289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1290, size: 64)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !865, line: 206, size: 320, elements: !1291)
!1291 = !{!1292, !1296, !1297, !1298, !1310}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1290, file: !865, line: 208, baseType: !1293, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1294, size: 64)
!1294 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !690, line: 62, baseType: !1295)
!1295 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !690, line: 61, flags: DIFlagFwdDecl)
!1296 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1290, file: !865, line: 211, baseType: !7, size: 32, offset: 64)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1290, file: !865, line: 214, baseType: !745, size: 64, offset: 128)
!1298 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1290, file: !865, line: 224, baseType: !1299, size: 64, offset: 192)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1300, size: 64)
!1300 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !865, line: 202, baseType: !1301)
!1301 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !865, line: 202, size: 128, elements: !1302)
!1302 = !{!1303}
!1303 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1301, file: !865, line: 202, baseType: !1304, size: 128)
!1304 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !865, line: 200, baseType: !1305)
!1305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !865, line: 200, size: 128, elements: !1306)
!1306 = !{!1307, !1308, !1309}
!1307 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1305, file: !865, line: 200, baseType: !7, size: 32)
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1305, file: !865, line: 200, baseType: !7, size: 32, offset: 32)
!1309 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1305, file: !865, line: 200, baseType: !896, size: 64, offset: 64)
!1310 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1290, file: !865, line: 234, baseType: !1299, size: 64, offset: 256)
!1311 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1284, file: !865, line: 197, baseType: !745, size: 64, offset: 256)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !878, file: !865, line: 319, baseType: !752, size: 256)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !878, file: !865, line: 320, baseType: !771, size: 192)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !692, file: !135, line: 3384, baseType: !1315, size: 1472)
!1315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1316)
!1316 = !{!1317, !1338, !1339, !1340, !1341}
!1317 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1315, file: !135, line: 3115, baseType: !1318, size: 1216)
!1318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1319)
!1319 = !{!1320, !1321, !1322, !1323, !1324, !1325, !1326, !1327, !1328, !1329, !1330, !1331, !1332, !1333, !1334, !1335, !1336, !1337}
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1318, file: !135, line: 2985, baseType: !858, size: 960)
!1321 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1318, file: !135, line: 2986, baseType: !689, size: 64, offset: 960)
!1322 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1318, file: !135, line: 2987, baseType: !689, size: 64, offset: 1024)
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1318, file: !135, line: 2988, baseType: !689, size: 64, offset: 1088)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1318, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1318, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1318, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1318, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1318, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1318, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1318, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1331 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1318, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1332 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1318, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1318, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1334 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1318, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1335 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1318, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1318, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1318, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1315, file: !135, line: 3117, baseType: !689, size: 64, offset: 1216)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1315, file: !135, line: 3119, baseType: !689, size: 64, offset: 1280)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1315, file: !135, line: 3121, baseType: !689, size: 64, offset: 1344)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1315, file: !135, line: 3123, baseType: !689, size: 64, offset: 1408)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !692, file: !135, line: 3385, baseType: !1343, size: 1088)
!1343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1344)
!1344 = !{!1345, !1346, !1347}
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1343, file: !135, line: 2875, baseType: !858, size: 960)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1343, file: !135, line: 2876, baseType: !862, size: 64, offset: 960)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1343, file: !135, line: 2877, baseType: !1348, size: 64, offset: 1024)
!1348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1349, size: 64)
!1349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1350, line: 172, size: 128, elements: !1351)
!1350 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1351 = !{!1352, !1353, !1354, !1355, !1356, !1357, !1358}
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1349, file: !1350, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1349, file: !1350, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1349, file: !1350, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1349, file: !1350, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1349, file: !1350, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1349, file: !1350, line: 195, baseType: !7, size: 32, offset: 32)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1349, file: !1350, line: 199, baseType: !689, size: 64, offset: 64)
!1359 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !692, file: !135, line: 3386, baseType: !1318, size: 1216)
!1360 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !692, file: !135, line: 3387, baseType: !1361, size: 1280)
!1361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1362)
!1362 = !{!1363, !1364}
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1361, file: !135, line: 3094, baseType: !1318, size: 1216)
!1364 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1361, file: !135, line: 3095, baseType: !1348, size: 64, offset: 1216)
!1365 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !692, file: !135, line: 3388, baseType: !1366, size: 1216)
!1366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1367)
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1373}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1366, file: !135, line: 2825, baseType: !820, size: 896)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1366, file: !135, line: 2827, baseType: !689, size: 64, offset: 896)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1366, file: !135, line: 2828, baseType: !689, size: 64, offset: 960)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1366, file: !135, line: 2829, baseType: !689, size: 64, offset: 1024)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1366, file: !135, line: 2830, baseType: !689, size: 64, offset: 1088)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1366, file: !135, line: 2831, baseType: !689, size: 64, offset: 1152)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !692, file: !135, line: 3389, baseType: !1375, size: 1024)
!1375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1376)
!1376 = !{!1377, !1378, !1379}
!1377 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1375, file: !135, line: 2851, baseType: !858, size: 960)
!1378 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1375, file: !135, line: 2852, baseType: !680, size: 32, offset: 960)
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1375, file: !135, line: 2853, baseType: !680, size: 32, offset: 992)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !692, file: !135, line: 3390, baseType: !1381, size: 1024)
!1381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1382)
!1382 = !{!1383, !1384}
!1383 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1381, file: !135, line: 2858, baseType: !858, size: 960)
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1381, file: !135, line: 2859, baseType: !1348, size: 64, offset: 960)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !692, file: !135, line: 3391, baseType: !1386, size: 960)
!1386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1387)
!1387 = !{!1388}
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1386, file: !135, line: 2863, baseType: !858, size: 960)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !692, file: !135, line: 3392, baseType: !1390, size: 1472)
!1390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1391)
!1391 = !{!1392}
!1392 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1390, file: !135, line: 3305, baseType: !1315, size: 1472)
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !692, file: !135, line: 3393, baseType: !1394, size: 1792)
!1394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1395)
!1395 = !{!1396, !1397, !1611, !1612, !1613, !1614, !1615, !1616, !1617, !1618, !1619, !1620, !1621, !1622, !1623, !1624, !1625, !1626, !1627, !1628, !1629, !1630, !1631}
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1394, file: !135, line: 3249, baseType: !1315, size: 1472)
!1397 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1394, file: !135, line: 3251, baseType: !1398, size: 64, offset: 1472)
!1398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1399, size: 64)
!1399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1400, line: 463, size: 1152, elements: !1401)
!1400 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1401 = !{!1402, !1405, !1436, !1437, !1552, !1555, !1556, !1557, !1558, !1559, !1560, !1584, !1587, !1588, !1589, !1590, !1591, !1592, !1593, !1594, !1595, !1596, !1597, !1598, !1599, !1600, !1601, !1602, !1603, !1604, !1605, !1606, !1607, !1608, !1609, !1610}
!1402 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1399, file: !1400, line: 464, baseType: !1403, size: 64)
!1403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1404, size: 64)
!1404 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1400, line: 464, flags: DIFlagFwdDecl)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1399, file: !1400, line: 467, baseType: !1406, size: 64, offset: 64)
!1406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1407, size: 64)
!1407 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1408)
!1408 = !{!1409, !1411, !1412, !1425, !1426, !1427, !1428, !1429, !1430, !1432, !1434, !1435}
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1407, file: !330, line: 377, baseType: !1410, size: 64)
!1410 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !690, line: 111, baseType: !975)
!1411 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1407, file: !330, line: 378, baseType: !1410, size: 64, offset: 64)
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1407, file: !330, line: 381, baseType: !1413, size: 64, offset: 128)
!1413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1414, size: 64)
!1414 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1415)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1416)
!1416 = !{!1417}
!1417 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1415, file: !330, line: 282, baseType: !1418, size: 128)
!1418 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1419)
!1419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1420)
!1420 = !{!1421, !1422, !1423}
!1421 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1419, file: !330, line: 281, baseType: !7, size: 32)
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1419, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1423 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1419, file: !330, line: 281, baseType: !1424, size: 64, offset: 64)
!1424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1410, size: 64, elements: !788)
!1425 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1407, file: !330, line: 384, baseType: !680, size: 32, offset: 192)
!1426 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1407, file: !330, line: 387, baseType: !680, size: 32, offset: 224)
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1407, file: !330, line: 390, baseType: !680, size: 32, offset: 256)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1407, file: !330, line: 394, baseType: !1413, size: 64, offset: 320)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1407, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1407, file: !330, line: 399, baseType: !1431, size: 64, offset: 416)
!1431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !930)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1407, file: !330, line: 402, baseType: !1433, size: 64, offset: 480)
!1433 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !930)
!1434 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1407, file: !330, line: 406, baseType: !680, size: 32, offset: 544)
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "last_label_uid", scope: !1407, file: !330, line: 409, baseType: !680, size: 32, offset: 576)
!1436 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_body", scope: !1399, file: !1400, line: 470, baseType: !1002, size: 64, offset: 128)
!1437 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_df", scope: !1399, file: !1400, line: 473, baseType: !1438, size: 64, offset: 192)
!1438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1439, size: 64)
!1439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_df", file: !1350, line: 39, size: 1152, elements: !1440)
!1440 = !{!1441, !1491, !1504, !1516, !1517, !1529, !1530, !1534, !1535, !1536, !1537, !1538}
!1441 = !DIDerivedType(tag: DW_TAG_member, name: "referenced_vars", scope: !1439, file: !1350, line: 41, baseType: !1442, size: 64)
!1442 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_t", file: !1443, line: 144, baseType: !1444)
!1443 = !DIFile(filename: "./include/hashtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1445, size: 64)
!1445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "htab", file: !1443, line: 100, size: 896, elements: !1446)
!1446 = !{!1447, !1455, !1460, !1465, !1467, !1468, !1469, !1470, !1471, !1472, !1477, !1479, !1480, !1485, !1490}
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "hash_f", scope: !1445, file: !1443, line: 102, baseType: !1448, size: 64)
!1448 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_hash", file: !1443, line: 52, baseType: !1449)
!1449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1450, size: 64)
!1450 = !DISubroutineType(types: !1451)
!1451 = !{!1452, !1453}
!1452 = !DIDerivedType(tag: DW_TAG_typedef, name: "hashval_t", file: !1443, line: 47, baseType: !7)
!1453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1454, size: 64)
!1454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "eq_f", scope: !1445, file: !1443, line: 105, baseType: !1456, size: 64, offset: 64)
!1456 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_eq", file: !1443, line: 59, baseType: !1457)
!1457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1458, size: 64)
!1458 = !DISubroutineType(types: !1459)
!1459 = !{!680, !1453, !1453}
!1460 = !DIDerivedType(tag: DW_TAG_member, name: "del_f", scope: !1445, file: !1443, line: 108, baseType: !1461, size: 64, offset: 128)
!1461 = !DIDerivedType(tag: DW_TAG_typedef, name: "htab_del", file: !1443, line: 63, baseType: !1462)
!1462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1463, size: 64)
!1463 = !DISubroutineType(types: !1464)
!1464 = !{null, !684}
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !1445, file: !1443, line: 111, baseType: !1466, size: 64, offset: 192)
!1466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1445, file: !1443, line: 114, baseType: !1156, size: 64, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "n_elements", scope: !1445, file: !1443, line: 117, baseType: !1156, size: 64, offset: 320)
