; ModuleID = 'tree-inline.bc'
source_filename = "tree-inline.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type { %struct.eh_region_d*, %struct.VEC_eh_region_gc*, %struct.VEC_eh_landing_pad_gc*, %struct.htab*, %struct.VEC_tree_gc*, %union.eh_status_u }
%struct.eh_region_d = type { %struct.eh_region_d*, %struct.eh_region_d*, %struct.eh_region_d*, i32, i32, %union.eh_region_u, %struct.eh_landing_pad_d*, %struct.rtx_def*, %struct.rtx_def*, i8 }
%union.eh_region_u = type { %struct.eh_region_u_allowed }
%struct.eh_region_u_allowed = type { %union.tree_node*, %union.tree_node*, i32 }
%struct.eh_landing_pad_d = type { %struct.eh_landing_pad_d*, %struct.eh_region_d*, %union.tree_node*, %struct.rtx_def*, i32 }

!645 = !DIEnumerator(name: "tcc_statement", value: 8, isUnsigned: true)
!646 = !DIEnumerator(name: "tcc_vl_exp", value: 9, isUnsigned: true)
!647 = !DIEnumerator(name: "tcc_expression", value: 10, isUnsigned: true)
!648 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_try_flags", file: !597, line: 514, baseType: !7, size: 32, elements: !649)
!649 = !{!650, !651, !652, !653}
!650 = !DIEnumerator(name: "GIMPLE_TRY_CATCH", value: 1, isUnsigned: true)
!651 = !DIEnumerator(name: "GIMPLE_TRY_FINALLY", value: 2, isUnsigned: true)
!652 = !DIEnumerator(name: "GIMPLE_TRY_KIND", value: 3, isUnsigned: true)
!653 = !DIEnumerator(name: "GIMPLE_TRY_CATCH_IS_CLEANUP", value: 4, isUnsigned: true)
!654 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !597, line: 727, baseType: !7, size: 32, elements: !655)
!655 = !{!656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674, !675, !676, !677, !678, !679}
!656 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!657 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!658 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!659 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!660 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!661 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!662 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!663 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!664 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!665 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!666 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!667 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!668 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!669 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!670 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!671 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!672 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!673 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!674 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!675 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!676 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!677 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!678 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!679 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!680 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !597, line: 80, baseType: !7, size: 32, elements: !681)
!681 = !{!682, !683, !684, !685}
!682 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!683 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!684 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!685 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!686 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ssa_op_iter_type", file: !687, line: 119, baseType: !7, size: 32, elements: !688)
!687 = !DIFile(filename: "./tree-ssa-operands.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!688 = !{!689, !690, !691, !692}
!689 = !DIEnumerator(name: "ssa_op_iter_none", value: 0, isUnsigned: true)
!690 = !DIEnumerator(name: "ssa_op_iter_tree", value: 1, isUnsigned: true)
!691 = !DIEnumerator(name: "ssa_op_iter_use", value: 2, isUnsigned: true)
!692 = !DIEnumerator(name: "ssa_op_iter_def", value: 3, isUnsigned: true)
!693 = !{!694, !695, !696, !697, !700, !701, !703, !134, !2095, !704, !831, !706, !2365, !1549, !7, !648, !698, !1423, !1029, !2367, !680, !1873, !1645, !2369, !879, !2359, !2145, !1584, !1238, !2386, !1028}
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!696 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!697 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !698, size: 64)
!698 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !699, size: 64)
!699 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!700 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !699)
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !704, size: 64)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !705, line: 56, baseType: !706)
!705 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!706 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !707, size: 64)
!707 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !708)
!708 = !{!709, !742, !748, !761, !780, !791, !796, !805, !811, !824, !836, !874, !1330, !1358, !1375, !1376, !1381, !1390, !1396, !1401, !1405, !1409, !1746, !1793, !1799, !1805, !1812, !1825, !1839, !1856, !1868, !1890, !1905, !2077}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !707, file: !135, line: 3372, baseType: !710, size: 64)
!710 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !711)
!711 = !{!712, !713, !714, !715, !716, !717, !718, !719, !720, !721, !722, !723, !724, !725, !726, !727, !728, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !741}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !710, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !710, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !710, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !710, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !710, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !710, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !710, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !710, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !710, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !710, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !710, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !710, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !710, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !710, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !710, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !710, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !710, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !710, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !710, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !710, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !710, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !710, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !710, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !710, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !710, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !710, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !710, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !710, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !710, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !710, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!742 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !707, file: !135, line: 3373, baseType: !743, size: 192)
!743 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !744)
!744 = !{!745, !746, !747}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !743, file: !135, line: 403, baseType: !710, size: 64)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !743, file: !135, line: 404, baseType: !704, size: 64, offset: 64)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !743, file: !135, line: 405, baseType: !704, size: 64, offset: 128)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !707, file: !135, line: 3374, baseType: !749, size: 320)
!749 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !750)
!750 = !{!751, !752}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !749, file: !135, line: 1385, baseType: !743, size: 192)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !749, file: !135, line: 1386, baseType: !753, size: 128, offset: 192)
!753 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !754, line: 58, baseType: !755)
!754 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!755 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !754, line: 54, size: 128, elements: !756)
!756 = !{!757, !759}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !755, file: !754, line: 56, baseType: !758, size: 64)
!758 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !755, file: !754, line: 57, baseType: !760, size: 64, offset: 64)
!760 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !707, file: !135, line: 3375, baseType: !762, size: 256)
!762 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !762, file: !135, line: 1398, baseType: !743, size: 192)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !762, file: !135, line: 1399, baseType: !766, size: 64, offset: 192)
!766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !767, size: 64)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !768, line: 52, size: 256, elements: !769)
!768 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!769 = !{!770, !771, !772, !773, !774, !775, !776}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !767, file: !768, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !767, file: !768, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !767, file: !768, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !767, file: !768, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !767, file: !768, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !767, file: !768, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !767, file: !768, line: 62, baseType: !777, size: 192, offset: 64)
!777 = !DICompositeType(tag: DW_TAG_array_type, baseType: !758, size: 192, elements: !778)
!778 = !{!779}
!779 = !DISubrange(count: 3)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !707, file: !135, line: 3376, baseType: !781, size: 256)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !782)
!782 = !{!783, !784}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !781, file: !135, line: 1409, baseType: !743, size: 192)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !781, file: !135, line: 1410, baseType: !785, size: 64, offset: 192)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !787, line: 27, size: 192, elements: !788)
!787 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!788 = !{!789, !790}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !786, file: !787, line: 29, baseType: !753, size: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !786, file: !787, line: 30, baseType: !5, size: 32, offset: 128)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !707, file: !135, line: 3377, baseType: !792, size: 256)
!792 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !793)
!793 = !{!794, !795}
!794 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !792, file: !135, line: 1438, baseType: !743, size: 192)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !792, file: !135, line: 1439, baseType: !704, size: 64, offset: 192)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !707, file: !135, line: 3378, baseType: !797, size: 256)
!797 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !798)
!798 = !{!799, !800, !801}
!799 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !797, file: !135, line: 1419, baseType: !743, size: 192)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !797, file: !135, line: 1420, baseType: !696, size: 32, offset: 192)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !797, file: !135, line: 1421, baseType: !802, size: 8, offset: 224)
!802 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 8, elements: !803)
!803 = !{!804}
!804 = !DISubrange(count: 1)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !707, file: !135, line: 3379, baseType: !806, size: 320)
!806 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !807)
!807 = !{!808, !809, !810}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !806, file: !135, line: 1429, baseType: !743, size: 192)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !806, file: !135, line: 1430, baseType: !704, size: 64, offset: 192)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !806, file: !135, line: 1431, baseType: !704, size: 64, offset: 256)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !707, file: !135, line: 3380, baseType: !812, size: 320)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !813)
!813 = !{!814, !815}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !812, file: !135, line: 1461, baseType: !743, size: 192)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !812, file: !135, line: 1462, baseType: !816, size: 128, offset: 192)
!816 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !817, line: 31, size: 128, elements: !818)
!817 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!818 = !{!819, !822, !823}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !816, file: !817, line: 32, baseType: !820, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !695)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !816, file: !817, line: 33, baseType: !7, size: 32, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !816, file: !817, line: 34, baseType: !7, size: 32, offset: 96)
!824 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !707, file: !135, line: 3381, baseType: !825, size: 384)
!825 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !826)
!826 = !{!827, !828, !833, !834, !835}
!827 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !825, file: !135, line: 2508, baseType: !743, size: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !825, file: !135, line: 2509, baseType: !829, size: 32, offset: 192)
!829 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !830, line: 58, baseType: !831)
!830 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!831 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !832, line: 44, baseType: !7)
!832 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!833 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !825, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !825, file: !135, line: 2511, baseType: !704, size: 64, offset: 256)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !825, file: !135, line: 2512, baseType: !704, size: 64, offset: 320)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !707, file: !135, line: 3382, baseType: !837, size: 896)
!837 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !838)
!838 = !{!839, !840, !841, !842, !843, !844, !845, !846, !847, !848, !849, !850, !851, !852, !853, !854, !855, !856, !857, !858, !859, !860, !861, !862, !863, !864, !865, !866, !867, !868, !869, !870, !871}
!839 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !837, file: !135, line: 2653, baseType: !825, size: 384)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !837, file: !135, line: 2654, baseType: !704, size: 64, offset: 384)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !837, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!842 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !837, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!843 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !837, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !837, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !837, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!846 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !837, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!847 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !837, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!848 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !837, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !837, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !837, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !837, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !837, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !837, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !837, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !837, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !837, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !837, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !837, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !837, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !837, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !837, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!862 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !837, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !837, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !837, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!865 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !837, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!866 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !837, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !837, file: !135, line: 2705, baseType: !704, size: 64, offset: 576)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !837, file: !135, line: 2706, baseType: !704, size: 64, offset: 640)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !837, file: !135, line: 2707, baseType: !704, size: 64, offset: 704)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !837, file: !135, line: 2708, baseType: !704, size: 64, offset: 768)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !837, file: !135, line: 2711, baseType: !872, size: 64, offset: 832)
!872 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !873, size: 64)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !707, file: !135, line: 3383, baseType: !875, size: 960)
!875 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !876)
!876 = !{!877, !878}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !875, file: !135, line: 2757, baseType: !837, size: 896)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !875, file: !135, line: 2758, baseType: !879, size: 64, offset: 896)
!879 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !705, line: 50, baseType: !880)
!880 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !881, size: 64)
!881 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !882, line: 240, size: 384, elements: !883)
!882 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!883 = !{!884, !885, !886, !887, !888, !889, !890, !891, !892, !893, !894}
!884 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !881, file: !882, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!885 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !881, file: !882, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !881, file: !882, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !881, file: !882, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !881, file: !882, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !881, file: !882, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !881, file: !882, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !881, file: !882, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !881, file: !882, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !881, file: !882, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !881, file: !882, line: 321, baseType: !895, size: 320, offset: 64)
!895 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !882, line: 315, size: 320, elements: !896)
!896 = !{!897, !1297, !1299, !1328, !1329}
!897 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !895, file: !882, line: 316, baseType: !898, size: 64)
!898 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 64, elements: !803)
!899 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !882, line: 183, baseType: !900)
!900 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !882, line: 166, size: 64, elements: !901)
!901 = !{!902, !903, !904, !905, !906, !914, !915, !927, !930, !990, !991, !1274, !1287, !1294}
!902 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !900, file: !882, line: 168, baseType: !696, size: 32)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !900, file: !882, line: 169, baseType: !7, size: 32)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !900, file: !882, line: 170, baseType: !701, size: 64)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !900, file: !882, line: 171, baseType: !879, size: 64)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !900, file: !882, line: 172, baseType: !907, size: 64)
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !705, line: 53, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !882, line: 359, size: 128, elements: !910)
!910 = !{!911, !912}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !909, file: !882, line: 360, baseType: !696, size: 32)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !909, file: !882, line: 361, baseType: !913, size: 64, offset: 64)
!913 = !DICompositeType(tag: DW_TAG_array_type, baseType: !879, size: 64, elements: !803)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !900, file: !882, line: 173, baseType: !5, size: 32)
!915 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !900, file: !882, line: 174, baseType: !916, size: 32)
!916 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !882, line: 133, baseType: !917)
!917 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !882, line: 115, size: 32, elements: !918)
!918 = !{!919, !920, !921, !922, !923, !924, !925, !926}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !917, file: !882, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !917, file: !882, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !917, file: !882, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !917, file: !882, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !917, file: !882, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!924 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !917, file: !882, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!925 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !917, file: !882, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !917, file: !882, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !900, file: !882, line: 175, baseType: !928, size: 64)
!928 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !929, size: 64)
!929 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !882, line: 175, flags: DIFlagFwdDecl)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !900, file: !882, line: 176, baseType: !931, size: 64)
!931 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !932, size: 64)
!932 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !933, line: 75, size: 256, elements: !934)
!933 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!934 = !{!935, !949, !950, !951}
!935 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !932, file: !933, line: 76, baseType: !936, size: 64)
!936 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !937, size: 64)
!937 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !933, line: 68, baseType: !938)
!938 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !933, line: 63, size: 320, elements: !939)
!939 = !{!940, !942, !943, !944}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !938, file: !933, line: 64, baseType: !941, size: 64)
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !938, size: 64)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !938, file: !933, line: 65, baseType: !941, size: 64, offset: 64)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !938, file: !933, line: 66, baseType: !7, size: 32, offset: 128)
!944 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !938, file: !933, line: 67, baseType: !945, size: 128, offset: 192)
!945 = !DICompositeType(tag: DW_TAG_array_type, baseType: !946, size: 128, elements: !947)
!946 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !933, line: 29, baseType: !758)
!947 = !{!948}
!948 = !DISubrange(count: 2)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !932, file: !933, line: 77, baseType: !936, size: 64, offset: 64)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !932, file: !933, line: 78, baseType: !7, size: 32, offset: 128)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !932, file: !933, line: 79, baseType: !952, size: 64, offset: 192)
!952 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !953, size: 64)
!953 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !933, line: 49, baseType: !954)
!954 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !933, line: 45, size: 832, elements: !955)
!955 = !{!956, !957, !958}
!956 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !954, file: !933, line: 46, baseType: !941, size: 64)
!957 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !954, file: !933, line: 47, baseType: !931, size: 64, offset: 64)
!958 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !954, file: !933, line: 48, baseType: !959, size: 704, offset: 128)
!959 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !960, line: 164, size: 704, elements: !961)
!960 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!961 = !{!962, !963, !973, !974, !975, !976, !977, !978, !982, !986, !987, !988, !989}
!962 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !959, file: !960, line: 166, baseType: !760, size: 64)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !959, file: !960, line: 167, baseType: !964, size: 64, offset: 64)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !965, size: 64)
!965 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !960, line: 157, size: 192, elements: !966)
!966 = !{!967, !968, !969}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !965, file: !960, line: 159, baseType: !698, size: 64)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !965, file: !960, line: 160, baseType: !964, size: 64, offset: 64)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !965, file: !960, line: 161, baseType: !970, size: 32, offset: 128)
!970 = !DICompositeType(tag: DW_TAG_array_type, baseType: !699, size: 32, elements: !971)
!971 = !{!972}
!972 = !DISubrange(count: 4)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !959, file: !960, line: 168, baseType: !698, size: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !959, file: !960, line: 169, baseType: !698, size: 64, offset: 192)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !959, file: !960, line: 170, baseType: !698, size: 64, offset: 256)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !959, file: !960, line: 171, baseType: !760, size: 64, offset: 320)
!977 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !959, file: !960, line: 172, baseType: !696, size: 32, offset: 384)
!978 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !959, file: !960, line: 176, baseType: !979, size: 64, offset: 448)
!979 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !980, size: 64)
!980 = !DISubroutineType(types: !981)
!981 = !{!964, !700, !760}
!982 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !959, file: !960, line: 177, baseType: !983, size: 64, offset: 512)
!983 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !984, size: 64)
!984 = !DISubroutineType(types: !985)
!985 = !{null, !700, !964}
!986 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !959, file: !960, line: 178, baseType: !700, size: 64, offset: 576)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !959, file: !960, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!988 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !959, file: !960, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !959, file: !960, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!990 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !900, file: !882, line: 177, baseType: !704, size: 64)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !900, file: !882, line: 178, baseType: !992, size: 64)
!992 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !993, size: 64)
!993 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !337, line: 217, size: 832, elements: !994)
!994 = !{!995, !1239, !1240, !1241, !1244, !1248, !1249, !1250, !1268, !1269, !1270, !1271, !1272, !1273}
!995 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !993, file: !337, line: 219, baseType: !996, size: 64)
!996 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !997, size: 64)
!997 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !337, line: 151, baseType: !998)
!998 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !337, line: 151, size: 128, elements: !999)
!999 = !{!1000}
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !998, file: !337, line: 151, baseType: !1001, size: 128)
!1001 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !337, line: 150, baseType: !1002)
!1002 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !337, line: 150, size: 128, elements: !1003)
!1003 = !{!1004, !1005, !1006}
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1002, file: !337, line: 150, baseType: !7, size: 32)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1002, file: !337, line: 150, baseType: !7, size: 32, offset: 32)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1002, file: !337, line: 150, baseType: !1007, size: 64, offset: 64)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1008, size: 64, elements: !803)
!1008 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !705, line: 108, baseType: !1009)
!1009 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1010, size: 64)
!1010 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !337, line: 122, size: 512, elements: !1011)
!1011 = !{!1012, !1013, !1014, !1231, !1232, !1233, !1234, !1235, !1236, !1237}
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !1010, file: !337, line: 124, baseType: !992, size: 64)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !1010, file: !337, line: 125, baseType: !992, size: 64, offset: 64)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !1010, file: !337, line: 131, baseType: !1015, size: 64, offset: 128)
!1015 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !337, line: 128, size: 64, elements: !1016)
!1016 = !{!1017, !1230}
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !1015, file: !337, line: 129, baseType: !1018, size: 64)
!1018 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !705, line: 66, baseType: !1019)
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !597, line: 143, size: 192, elements: !1021)
!1021 = !{!1022, !1228, !1229}
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !1020, file: !597, line: 145, baseType: !1023, size: 64)
!1023 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !705, line: 69, baseType: !1024)
!1024 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1025, size: 64)
!1025 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !597, line: 136, size: 192, elements: !1026)
!1026 = !{!1027, !1226, !1227}
!1027 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1025, file: !597, line: 137, baseType: !1028, size: 64)
!1028 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !705, line: 58, baseType: !1029)
!1029 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1030, size: 64)
!1030 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !597, line: 737, size: 768, elements: !1031)
!1031 = !{!1032, !1049, !1081, !1087, !1092, !1097, !1104, !1110, !1116, !1121, !1135, !1140, !1146, !1151, !1161, !1166, !1184, !1191, !1198, !1204, !1209, !1215, !1221}
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1030, file: !597, line: 738, baseType: !1033, size: 256)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !597, line: 271, size: 256, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039, !1040, !1041, !1042, !1043, !1044, !1045, !1046, !1047, !1048}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !1033, file: !597, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !1033, file: !597, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1033, file: !597, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !1033, file: !597, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !1033, file: !597, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !1033, file: !597, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !1033, file: !597, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !1033, file: !597, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !1033, file: !597, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !1033, file: !597, line: 312, baseType: !7, size: 32, offset: 32)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !1033, file: !597, line: 316, baseType: !829, size: 32, offset: 64)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !1033, file: !597, line: 319, baseType: !7, size: 32, offset: 96)
!1047 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !1033, file: !597, line: 323, baseType: !992, size: 64, offset: 128)
!1048 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1033, file: !597, line: 327, baseType: !704, size: 64, offset: 192)
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !1030, file: !597, line: 739, baseType: !1050, size: 448)
!1050 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !597, line: 350, size: 448, elements: !1051)
!1051 = !{!1052, !1079}
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1050, file: !597, line: 353, baseType: !1053, size: 384)
!1053 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !597, line: 333, size: 384, elements: !1054)
!1054 = !{!1055, !1056, !1062}
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1053, file: !597, line: 336, baseType: !1033, size: 256)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !1053, file: !597, line: 343, baseType: !1057, size: 64, offset: 256)
!1057 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1058, size: 64)
!1058 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !687, line: 37, size: 128, elements: !1059)
!1059 = !{!1060, !1061}
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1058, file: !687, line: 39, baseType: !1057, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !1058, file: !687, line: 40, baseType: !703, size: 64, offset: 64)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !1053, file: !597, line: 344, baseType: !1063, size: 64, offset: 320)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !687, line: 45, size: 320, elements: !1065)
!1065 = !{!1066, !1067}
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1064, file: !687, line: 47, baseType: !1063, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !1064, file: !687, line: 48, baseType: !1068, size: 256, offset: 64)
!1068 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !1069)
!1069 = !{!1070, !1072, !1073, !1078}
!1070 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1068, file: !135, line: 1884, baseType: !1071, size: 64)
!1071 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1072 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1068, file: !135, line: 1885, baseType: !1071, size: 64, offset: 64)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !1068, file: !135, line: 1891, baseType: !1074, size: 64, offset: 128)
!1074 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !1068, file: !135, line: 1891, size: 64, elements: !1075)
!1075 = !{!1076, !1077}
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !1074, file: !135, line: 1891, baseType: !1028, size: 64)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !1074, file: !135, line: 1891, baseType: !704, size: 64)
!1078 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !1068, file: !135, line: 1892, baseType: !703, size: 64, offset: 192)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1050, file: !597, line: 359, baseType: !1080, size: 64, offset: 384)
!1080 = !DICompositeType(tag: DW_TAG_array_type, baseType: !704, size: 64, elements: !803)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !1030, file: !597, line: 740, baseType: !1082, size: 512)
!1082 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !597, line: 365, size: 512, elements: !1083)
!1083 = !{!1084, !1085, !1086}
!1084 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !1082, file: !597, line: 368, baseType: !1053, size: 384)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !1082, file: !597, line: 373, baseType: !704, size: 64, offset: 384)
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !1082, file: !597, line: 374, baseType: !704, size: 64, offset: 448)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !1030, file: !597, line: 741, baseType: !1088, size: 576)
!1088 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !597, line: 380, size: 576, elements: !1089)
!1089 = !{!1090, !1091}
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1088, file: !597, line: 383, baseType: !1082, size: 512)
!1091 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1088, file: !597, line: 389, baseType: !1080, size: 64, offset: 512)
!1092 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1030, file: !597, line: 742, baseType: !1093, size: 320)
!1093 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !597, line: 395, size: 320, elements: !1094)
!1094 = !{!1095, !1096}
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1093, file: !597, line: 397, baseType: !1033, size: 256)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1093, file: !597, line: 400, baseType: !1018, size: 64, offset: 256)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !1030, file: !597, line: 743, baseType: !1098, size: 448)
!1098 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !597, line: 406, size: 448, elements: !1099)
!1099 = !{!1100, !1101, !1102, !1103}
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1098, file: !597, line: 408, baseType: !1033, size: 256)
!1101 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !1098, file: !597, line: 412, baseType: !704, size: 64, offset: 256)
!1102 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1098, file: !597, line: 420, baseType: !704, size: 64, offset: 320)
!1103 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !1098, file: !597, line: 423, baseType: !1018, size: 64, offset: 384)
!1104 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !1030, file: !597, line: 744, baseType: !1105, size: 384)
!1105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !597, line: 429, size: 384, elements: !1106)
!1106 = !{!1107, !1108, !1109}
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1105, file: !597, line: 431, baseType: !1033, size: 256)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1105, file: !597, line: 434, baseType: !704, size: 64, offset: 256)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !1105, file: !597, line: 437, baseType: !1018, size: 64, offset: 320)
!1110 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !1030, file: !597, line: 745, baseType: !1111, size: 384)
!1111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !597, line: 443, size: 384, elements: !1112)
!1112 = !{!1113, !1114, !1115}
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1111, file: !597, line: 445, baseType: !1033, size: 256)
!1114 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !1111, file: !597, line: 449, baseType: !704, size: 64, offset: 256)
!1115 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !1111, file: !597, line: 453, baseType: !1018, size: 64, offset: 320)
!1116 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !1030, file: !597, line: 746, baseType: !1117, size: 320)
!1117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !597, line: 459, size: 320, elements: !1118)
!1118 = !{!1119, !1120}
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1117, file: !597, line: 461, baseType: !1033, size: 256)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !1117, file: !597, line: 464, baseType: !704, size: 64, offset: 256)
!1121 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !1030, file: !597, line: 747, baseType: !1122, size: 768)
!1122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !597, line: 469, size: 768, elements: !1123)
!1123 = !{!1124, !1125, !1126, !1127, !1128}
!1124 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1122, file: !597, line: 471, baseType: !1033, size: 256)
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !1122, file: !597, line: 474, baseType: !7, size: 32, offset: 256)
!1126 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !1122, file: !597, line: 475, baseType: !7, size: 32, offset: 288)
!1127 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1122, file: !597, line: 478, baseType: !704, size: 64, offset: 320)
!1128 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !1122, file: !597, line: 481, baseType: !1129, size: 384, offset: 384)
!1129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1130, size: 384, elements: !803)
!1130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !1131)
!1131 = !{!1132, !1133, !1134}
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !1130, file: !135, line: 1920, baseType: !1068, size: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !1130, file: !135, line: 1921, baseType: !704, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !1130, file: !135, line: 1922, baseType: !829, size: 32, offset: 320)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !1030, file: !597, line: 748, baseType: !1136, size: 320)
!1136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !597, line: 487, size: 320, elements: !1137)
!1137 = !{!1138, !1139}
!1138 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1136, file: !597, line: 490, baseType: !1033, size: 256)
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1136, file: !597, line: 494, baseType: !696, size: 32, offset: 256)
!1140 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !1030, file: !597, line: 749, baseType: !1141, size: 384)
!1141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !597, line: 500, size: 384, elements: !1142)
!1142 = !{!1143, !1144, !1145}
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1141, file: !597, line: 502, baseType: !1033, size: 256)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !1141, file: !597, line: 506, baseType: !1018, size: 64, offset: 256)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1141, file: !597, line: 510, baseType: !1018, size: 64, offset: 320)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !1030, file: !597, line: 750, baseType: !1147, size: 320)
!1147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !597, line: 529, size: 320, elements: !1148)
!1148 = !{!1149, !1150}
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1147, file: !597, line: 531, baseType: !1033, size: 256)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !1147, file: !597, line: 540, baseType: !1018, size: 64, offset: 256)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !1030, file: !597, line: 751, baseType: !1152, size: 704)
!1152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !597, line: 546, size: 704, elements: !1153)
!1153 = !{!1154, !1155, !1156, !1157, !1158, !1159, !1160}
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !1152, file: !597, line: 549, baseType: !1082, size: 512)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !1152, file: !597, line: 553, baseType: !701, size: 64, offset: 512)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !1152, file: !597, line: 557, baseType: !695, size: 8, offset: 576)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !1152, file: !597, line: 558, baseType: !695, size: 8, offset: 584)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !1152, file: !597, line: 559, baseType: !695, size: 8, offset: 592)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !1152, file: !597, line: 560, baseType: !695, size: 8, offset: 600)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !1152, file: !597, line: 566, baseType: !1080, size: 64, offset: 640)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !1030, file: !597, line: 752, baseType: !1162, size: 384)
!1162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !597, line: 571, size: 384, elements: !1163)
!1163 = !{!1164, !1165}
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1162, file: !597, line: 573, baseType: !1093, size: 320)
!1165 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1162, file: !597, line: 577, baseType: !704, size: 64, offset: 320)
!1166 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !1030, file: !597, line: 753, baseType: !1167, size: 576)
!1167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !597, line: 600, size: 576, elements: !1168)
!1168 = !{!1169, !1170, !1171, !1174, !1183}
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1167, file: !597, line: 602, baseType: !1093, size: 320)
!1170 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1167, file: !597, line: 605, baseType: !704, size: 64, offset: 320)
!1171 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !1167, file: !597, line: 609, baseType: !1172, size: 64, offset: 384)
!1172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !1173, line: 46, baseType: !758)
!1173 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !1167, file: !597, line: 612, baseType: !1175, size: 64, offset: 448)
!1175 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1176, size: 64)
!1176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !597, line: 581, size: 320, elements: !1177)
!1177 = !{!1178, !1179, !1180, !1181, !1182}
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !1176, file: !597, line: 583, baseType: !134, size: 32)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1176, file: !597, line: 586, baseType: !704, size: 64, offset: 64)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !1176, file: !597, line: 589, baseType: !704, size: 64, offset: 128)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !1176, file: !597, line: 592, baseType: !704, size: 64, offset: 192)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !1176, file: !597, line: 595, baseType: !704, size: 64, offset: 256)
!1183 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !1167, file: !597, line: 616, baseType: !1018, size: 64, offset: 512)
!1184 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !1030, file: !597, line: 754, baseType: !1185, size: 512)
!1185 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !597, line: 622, size: 512, elements: !1186)
!1186 = !{!1187, !1188, !1189, !1190}
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1185, file: !597, line: 624, baseType: !1093, size: 320)
!1188 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1185, file: !597, line: 628, baseType: !704, size: 64, offset: 320)
!1189 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !1185, file: !597, line: 632, baseType: !704, size: 64, offset: 384)
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !1185, file: !597, line: 636, baseType: !704, size: 64, offset: 448)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !1030, file: !597, line: 755, baseType: !1192, size: 704)
!1192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !597, line: 642, size: 704, elements: !1193)
!1193 = !{!1194, !1195, !1196, !1197}
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !1192, file: !597, line: 644, baseType: !1185, size: 512)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !1192, file: !597, line: 648, baseType: !704, size: 64, offset: 512)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !1192, file: !597, line: 652, baseType: !704, size: 64, offset: 576)
!1197 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !1192, file: !597, line: 653, baseType: !704, size: 64, offset: 640)
!1198 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !1030, file: !597, line: 756, baseType: !1199, size: 448)
!1199 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !597, line: 663, size: 448, elements: !1200)
!1200 = !{!1201, !1202, !1203}
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1199, file: !597, line: 665, baseType: !1093, size: 320)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1199, file: !597, line: 668, baseType: !704, size: 64, offset: 320)
!1203 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !1199, file: !597, line: 673, baseType: !704, size: 64, offset: 384)
!1204 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !1030, file: !597, line: 757, baseType: !1205, size: 384)
!1205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !597, line: 694, size: 384, elements: !1206)
!1206 = !{!1207, !1208}
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !1205, file: !597, line: 696, baseType: !1093, size: 320)
!1208 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !1205, file: !597, line: 699, baseType: !704, size: 64, offset: 320)
!1209 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !1030, file: !597, line: 758, baseType: !1210, size: 384)
!1210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !597, line: 681, size: 384, elements: !1211)
!1211 = !{!1212, !1213, !1214}
!1212 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1210, file: !597, line: 683, baseType: !1033, size: 256)
!1213 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !1210, file: !597, line: 686, baseType: !704, size: 64, offset: 256)
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !1210, file: !597, line: 689, baseType: !704, size: 64, offset: 320)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !1030, file: !597, line: 759, baseType: !1216, size: 384)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !597, line: 707, size: 384, elements: !1217)
!1217 = !{!1218, !1219, !1220}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1216, file: !597, line: 709, baseType: !1033, size: 256)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !1216, file: !597, line: 712, baseType: !704, size: 64, offset: 256)
!1220 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !1216, file: !597, line: 712, baseType: !704, size: 64, offset: 320)
!1221 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !1030, file: !597, line: 760, baseType: !1222, size: 320)
!1222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !597, line: 718, size: 320, elements: !1223)
!1223 = !{!1224, !1225}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !1222, file: !597, line: 720, baseType: !1033, size: 256)
!1225 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !1222, file: !597, line: 723, baseType: !704, size: 64, offset: 256)
!1226 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !1025, file: !597, line: 138, baseType: !1024, size: 64, offset: 64)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1025, file: !597, line: 139, baseType: !1024, size: 64, offset: 128)
!1228 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !1020, file: !597, line: 146, baseType: !1023, size: 64, offset: 64)
!1229 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !1020, file: !597, line: 152, baseType: !1018, size: 64, offset: 128)
!1230 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !1015, file: !337, line: 130, baseType: !879, size: 64)
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !1010, file: !337, line: 134, baseType: !700, size: 64, offset: 192)
!1232 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !1010, file: !337, line: 137, baseType: !704, size: 64, offset: 256)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !1010, file: !337, line: 138, baseType: !829, size: 32, offset: 320)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !1010, file: !337, line: 142, baseType: !7, size: 32, offset: 352)
!1235 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1010, file: !337, line: 144, baseType: !696, size: 32, offset: 384)
!1236 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !1010, file: !337, line: 145, baseType: !696, size: 32, offset: 416)
!1237 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !1010, file: !337, line: 146, baseType: !1238, size: 64, offset: 448)
!1238 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !337, line: 119, baseType: !760)
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !993, file: !337, line: 220, baseType: !996, size: 64, offset: 64)
!1240 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !993, file: !337, line: 223, baseType: !700, size: 64, offset: 128)
!1241 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !993, file: !337, line: 226, baseType: !1242, size: 64, offset: 192)
!1242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1243, size: 64)
!1243 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !337, line: 185, flags: DIFlagFwdDecl)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !993, file: !337, line: 229, baseType: !1245, size: 128, offset: 256)
!1245 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1246, size: 128, elements: !947)
!1246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1247, size: 64)
!1247 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !337, line: 229, flags: DIFlagFwdDecl)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !993, file: !337, line: 232, baseType: !992, size: 64, offset: 384)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !993, file: !337, line: 233, baseType: !992, size: 64, offset: 448)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !993, file: !337, line: 238, baseType: !1251, size: 64, offset: 512)
!1251 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !337, line: 235, size: 64, elements: !1252)
!1252 = !{!1253, !1259}
!1253 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1251, file: !337, line: 236, baseType: !1254, size: 64)
!1254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1255, size: 64)
!1255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !337, line: 273, size: 128, elements: !1256)
!1256 = !{!1257, !1258}
!1257 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1255, file: !337, line: 275, baseType: !1018, size: 64)
!1258 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1255, file: !337, line: 278, baseType: !1018, size: 64, offset: 64)
!1259 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1251, file: !337, line: 237, baseType: !1260, size: 64)
!1260 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1261, size: 64)
!1261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !337, line: 259, size: 320, elements: !1262)
!1262 = !{!1263, !1264, !1265, !1266, !1267}
!1263 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1261, file: !337, line: 261, baseType: !879, size: 64)
!1264 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1261, file: !337, line: 262, baseType: !879, size: 64, offset: 64)
!1265 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1261, file: !337, line: 266, baseType: !879, size: 64, offset: 128)
!1266 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1261, file: !337, line: 267, baseType: !879, size: 64, offset: 192)
!1267 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1261, file: !337, line: 270, baseType: !696, size: 32, offset: 256)
!1268 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !993, file: !337, line: 241, baseType: !1238, size: 64, offset: 576)
!1269 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !993, file: !337, line: 244, baseType: !696, size: 32, offset: 640)
!1270 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !993, file: !337, line: 247, baseType: !696, size: 32, offset: 672)
!1271 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !993, file: !337, line: 250, baseType: !696, size: 32, offset: 704)
!1272 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !993, file: !337, line: 253, baseType: !696, size: 32, offset: 736)
!1273 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !993, file: !337, line: 256, baseType: !696, size: 32, offset: 768)
!1274 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !900, file: !882, line: 179, baseType: !1275, size: 64)
!1275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1276, size: 64)
!1276 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !882, line: 150, baseType: !1277)
!1277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !882, line: 142, size: 320, elements: !1278)
!1278 = !{!1279, !1280, !1281, !1282, !1285, !1286}
!1279 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1277, file: !882, line: 144, baseType: !704, size: 64)
!1280 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1277, file: !882, line: 145, baseType: !879, size: 64, offset: 64)
!1281 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1277, file: !882, line: 146, baseType: !879, size: 64, offset: 128)
!1282 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1277, file: !882, line: 147, baseType: !1283, size: 32, offset: 192)
!1283 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1284, line: 31, baseType: !696)
!1284 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1285 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1277, file: !882, line: 148, baseType: !7, size: 32, offset: 224)
!1286 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1277, file: !882, line: 149, baseType: !695, size: 8, offset: 256)
!1287 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !900, file: !882, line: 180, baseType: !1288, size: 64)
!1288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1289, size: 64)
!1289 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !882, line: 162, baseType: !1290)
!1290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !882, line: 159, size: 128, elements: !1291)
!1291 = !{!1292, !1293}
!1292 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1290, file: !882, line: 160, baseType: !704, size: 64)
!1293 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1290, file: !882, line: 161, baseType: !760, size: 64, offset: 64)
!1294 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !900, file: !882, line: 181, baseType: !1295, size: 64)
!1295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1296, size: 64)
!1296 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !882, line: 181, flags: DIFlagFwdDecl)
!1297 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !895, file: !882, line: 317, baseType: !1298, size: 64)
!1298 = !DICompositeType(tag: DW_TAG_array_type, baseType: !760, size: 64, elements: !803)
!1299 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !895, file: !882, line: 318, baseType: !1300, size: 320)
!1300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !882, line: 188, size: 320, elements: !1301)
!1301 = !{!1302, !1304, !1327}
!1302 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1300, file: !882, line: 190, baseType: !1303, size: 192)
!1303 = !DICompositeType(tag: DW_TAG_array_type, baseType: !899, size: 192, elements: !778)
!1304 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1300, file: !882, line: 193, baseType: !1305, size: 64, offset: 192)
!1305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1306, size: 64)
!1306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !882, line: 206, size: 320, elements: !1307)
!1307 = !{!1308, !1312, !1313, !1314, !1326}
!1308 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1306, file: !882, line: 208, baseType: !1309, size: 64)
!1309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1310, size: 64)
!1310 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !705, line: 62, baseType: !1311)
!1311 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !705, line: 61, flags: DIFlagFwdDecl)
!1312 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1306, file: !882, line: 211, baseType: !7, size: 32, offset: 64)
!1313 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1306, file: !882, line: 214, baseType: !760, size: 64, offset: 128)
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1306, file: !882, line: 224, baseType: !1315, size: 64, offset: 192)
!1315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1316, size: 64)
!1316 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !882, line: 202, baseType: !1317)
!1317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !882, line: 202, size: 128, elements: !1318)
!1318 = !{!1319}
!1319 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1317, file: !882, line: 202, baseType: !1320, size: 128)
!1320 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !882, line: 200, baseType: !1321)
!1321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !882, line: 200, size: 128, elements: !1322)
!1322 = !{!1323, !1324, !1325}
!1323 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1321, file: !882, line: 200, baseType: !7, size: 32)
!1324 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1321, file: !882, line: 200, baseType: !7, size: 32, offset: 32)
!1325 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1321, file: !882, line: 200, baseType: !913, size: 64, offset: 64)
!1326 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1306, file: !882, line: 234, baseType: !1315, size: 64, offset: 256)
!1327 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1300, file: !882, line: 197, baseType: !760, size: 64, offset: 256)
!1328 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !895, file: !882, line: 319, baseType: !767, size: 256)
!1329 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !895, file: !882, line: 320, baseType: !786, size: 192)
!1330 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !707, file: !135, line: 3384, baseType: !1331, size: 1472)
!1331 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1332)
!1332 = !{!1333, !1354, !1355, !1356, !1357}
!1333 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1331, file: !135, line: 3115, baseType: !1334, size: 1216)
!1334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1335)
!1335 = !{!1336, !1337, !1338, !1339, !1340, !1341, !1342, !1343, !1344, !1345, !1346, !1347, !1348, !1349, !1350, !1351, !1352, !1353}
!1336 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1334, file: !135, line: 2985, baseType: !875, size: 960)
!1337 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1334, file: !135, line: 2986, baseType: !704, size: 64, offset: 960)
!1338 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1334, file: !135, line: 2987, baseType: !704, size: 64, offset: 1024)
!1339 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1334, file: !135, line: 2988, baseType: !704, size: 64, offset: 1088)
!1340 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1334, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1341 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1334, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1342 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1334, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1343 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1334, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1344 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1334, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1345 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1334, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1346 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1334, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1347 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1334, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1348 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1334, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1349 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1334, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1350 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1334, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1351 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1334, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1352 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1334, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1353 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1334, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1354 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1331, file: !135, line: 3117, baseType: !704, size: 64, offset: 1216)
!1355 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1331, file: !135, line: 3119, baseType: !704, size: 64, offset: 1280)
!1356 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1331, file: !135, line: 3121, baseType: !704, size: 64, offset: 1344)
!1357 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1331, file: !135, line: 3123, baseType: !704, size: 64, offset: 1408)
!1358 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !707, file: !135, line: 3385, baseType: !1359, size: 1088)
!1359 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1360)
!1360 = !{!1361, !1362, !1363}
!1361 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1359, file: !135, line: 2875, baseType: !875, size: 960)
!1362 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1359, file: !135, line: 2876, baseType: !879, size: 64, offset: 960)
!1363 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1359, file: !135, line: 2877, baseType: !1364, size: 64, offset: 1024)
!1364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1365, size: 64)
!1365 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1366, line: 172, size: 128, elements: !1367)
!1366 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1367 = !{!1368, !1369, !1370, !1371, !1372, !1373, !1374}
!1368 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1365, file: !1366, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1369 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1365, file: !1366, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1370 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1365, file: !1366, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1371 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1365, file: !1366, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1372 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1365, file: !1366, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1373 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1365, file: !1366, line: 195, baseType: !7, size: 32, offset: 32)
!1374 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1365, file: !1366, line: 199, baseType: !704, size: 64, offset: 64)
!1375 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !707, file: !135, line: 3386, baseType: !1334, size: 1216)
!1376 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !707, file: !135, line: 3387, baseType: !1377, size: 1280)
!1377 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1378)
!1378 = !{!1379, !1380}
!1379 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1377, file: !135, line: 3094, baseType: !1334, size: 1216)
!1380 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1377, file: !135, line: 3095, baseType: !1364, size: 64, offset: 1216)
!1381 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !707, file: !135, line: 3388, baseType: !1382, size: 1216)
!1382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1383)
!1383 = !{!1384, !1385, !1386, !1387, !1388, !1389}
!1384 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1382, file: !135, line: 2825, baseType: !837, size: 896)
!1385 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1382, file: !135, line: 2827, baseType: !704, size: 64, offset: 896)
!1386 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1382, file: !135, line: 2828, baseType: !704, size: 64, offset: 960)
!1387 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1382, file: !135, line: 2829, baseType: !704, size: 64, offset: 1024)
!1388 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1382, file: !135, line: 2830, baseType: !704, size: 64, offset: 1088)
!1389 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1382, file: !135, line: 2831, baseType: !704, size: 64, offset: 1152)
!1390 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !707, file: !135, line: 3389, baseType: !1391, size: 1024)
!1391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1392)
!1392 = !{!1393, !1394, !1395}
!1393 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1391, file: !135, line: 2851, baseType: !875, size: 960)
!1394 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1391, file: !135, line: 2852, baseType: !696, size: 32, offset: 960)
!1395 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1391, file: !135, line: 2853, baseType: !696, size: 32, offset: 992)
!1396 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !707, file: !135, line: 3390, baseType: !1397, size: 1024)
!1397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1398)
!1398 = !{!1399, !1400}
!1399 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1397, file: !135, line: 2858, baseType: !875, size: 960)
!1400 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1397, file: !135, line: 2859, baseType: !1364, size: 64, offset: 960)
!1401 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !707, file: !135, line: 3391, baseType: !1402, size: 960)
!1402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1403)
!1403 = !{!1404}
!1404 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1402, file: !135, line: 2863, baseType: !875, size: 960)
!1405 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !707, file: !135, line: 3392, baseType: !1406, size: 1472)
!1406 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1407)
!1407 = !{!1408}
!1408 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1406, file: !135, line: 3305, baseType: !1331, size: 1472)
!1409 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !707, file: !135, line: 3393, baseType: !1410, size: 1792)
!1410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1411)
!1411 = !{!1412, !1413, !1725, !1726, !1727, !1728, !1729, !1730, !1731, !1732, !1733, !1734, !1735, !1736, !1737, !1738, !1739, !1740, !1741, !1742, !1743, !1744, !1745}
!1412 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1410, file: !135, line: 3249, baseType: !1331, size: 1472)
!1413 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1410, file: !135, line: 3251, baseType: !1414, size: 64, offset: 1472)
!1414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1415, size: 64)
!1415 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1416, line: 463, size: 1152, elements: !1417)
!1416 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1417 = !{!1418, !1579, !1610, !1611, !1666, !1669, !1670, !1671, !1672, !1673, !1674, !1698, !1701, !1702, !1703, !1704, !1705, !1706, !1707, !1708, !1709, !1710, !1711, !1712, !1713, !1714, !1715, !1716, !1717, !1718, !1719, !1720, !1721, !1722, !1723, !1724}
!1418 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1415, file: !1416, line: 464, baseType: !1419, size: 64)
!1419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1420, size: 64)
!1420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !330, line: 194, size: 384, elements: !1421)
!1421 = !{!1422, !1471, !1484, !1498, !1548, !1560}
!1422 = !DIDerivedType(tag: DW_TAG_member, name: "region_tree", scope: !1420, file: !330, line: 197, baseType: !1423, size: 64)
!1423 = !DIDerivedType(tag: DW_TAG_typedef, name: "eh_region", file: !330, line: 182, baseType: !1424)
!1424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1425, size: 64)
!1425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_d", file: !330, line: 116, size: 704, elements: !1426)
!1426 = !{!1427, !1428, !1429, !1430, !1431, !1432, !1459, !1468, !1469, !1470}
!1427 = !DIDerivedType(tag: DW_TAG_member, name: "outer", scope: !1425, file: !330, line: 119, baseType: !1424, size: 64)
!1428 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !1425, file: !330, line: 122, baseType: !1424, size: 64, offset: 64)
!1429 = !DIDerivedType(tag: DW_TAG_member, name: "next_peer", scope: !1425, file: !330, line: 123, baseType: !1424, size: 64, offset: 128)
!1430 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1425, file: !330, line: 126, baseType: !696, size: 32, offset: 192)
!1431 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1425, file: !330, line: 129, baseType: !329, size: 32, offset: 224)
!1432 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !1425, file: !330, line: 165, baseType: !1433, size: 192, offset: 256)
!1433 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "eh_region_u", file: !330, line: 132, size: 192, elements: !1434)
!1434 = !{!1435, !1448, !1454}
!1435 = !DIDerivedType(tag: DW_TAG_member, name: "eh_try", scope: !1433, file: !330, line: 137, baseType: !1436, size: 128)
!1436 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_try", file: !330, line: 133, size: 128, elements: !1437)
!1437 = !{!1438, !1447}
!1438 = !DIDerivedType(tag: DW_TAG_member, name: "first_catch", scope: !1436, file: !330, line: 135, baseType: !1439, size: 64)
!1439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1440, size: 64)
!1440 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_catch_d", file: !330, line: 93, size: 320, elements: !1441)
!1441 = !{!1442, !1443, !1444, !1445, !1446}
!1442 = !DIDerivedType(tag: DW_TAG_member, name: "next_catch", scope: !1440, file: !330, line: 96, baseType: !1439, size: 64)
!1443 = !DIDerivedType(tag: DW_TAG_member, name: "prev_catch", scope: !1440, file: !330, line: 97, baseType: !1439, size: 64, offset: 64)
!1444 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1440, file: !330, line: 101, baseType: !704, size: 64, offset: 128)
!1445 = !DIDerivedType(tag: DW_TAG_member, name: "filter_list", scope: !1440, file: !330, line: 106, baseType: !704, size: 64, offset: 192)
!1446 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1440, file: !330, line: 111, baseType: !704, size: 64, offset: 256)
!1447 = !DIDerivedType(tag: DW_TAG_member, name: "last_catch", scope: !1436, file: !330, line: 136, baseType: !1439, size: 64, offset: 64)
!1448 = !DIDerivedType(tag: DW_TAG_member, name: "allowed", scope: !1433, file: !330, line: 151, baseType: !1449, size: 192)
!1449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_allowed", file: !330, line: 139, size: 192, elements: !1450)
!1450 = !{!1451, !1452, !1453}
!1451 = !DIDerivedType(tag: DW_TAG_member, name: "type_list", scope: !1449, file: !330, line: 141, baseType: !704, size: 64)
!1452 = !DIDerivedType(tag: DW_TAG_member, name: "label", scope: !1449, file: !330, line: 145, baseType: !704, size: 64, offset: 64)
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "filter", scope: !1449, file: !330, line: 150, baseType: !696, size: 32, offset: 128)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "must_not_throw", scope: !1433, file: !330, line: 164, baseType: !1455, size: 128)
!1455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_region_u_must_not_throw", file: !330, line: 153, size: 128, elements: !1456)
!1456 = !{!1457, !1458}
!1457 = !DIDerivedType(tag: DW_TAG_member, name: "failure_decl", scope: !1455, file: !330, line: 161, baseType: !704, size: 64)
!1458 = !DIDerivedType(tag: DW_TAG_member, name: "failure_loc", scope: !1455, file: !330, line: 163, baseType: !829, size: 32, offset: 64)
!1459 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pads", scope: !1425, file: !330, line: 168, baseType: !1460, size: 64, offset: 448)
!1460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1461, size: 64)
!1461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "eh_landing_pad_d", file: !330, line: 67, size: 320, elements: !1462)
!1462 = !{!1463, !1464, !1465, !1466, !1467}
!1463 = !DIDerivedType(tag: DW_TAG_member, name: "next_lp", scope: !1461, file: !330, line: 70, baseType: !1460, size: 64)
!1464 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !1461, file: !330, line: 73, baseType: !1424, size: 64, offset: 64)
!1465 = !DIDerivedType(tag: DW_TAG_member, name: "post_landing_pad", scope: !1461, file: !330, line: 78, baseType: !704, size: 64, offset: 128)
!1466 = !DIDerivedType(tag: DW_TAG_member, name: "landing_pad", scope: !1461, file: !330, line: 85, baseType: !879, size: 64, offset: 192)
!1467 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !1461, file: !330, line: 88, baseType: !696, size: 32, offset: 256)
!1468 = !DIDerivedType(tag: DW_TAG_member, name: "exc_ptr_reg", scope: !1425, file: !330, line: 173, baseType: !879, size: 64, offset: 512)
!1469 = !DIDerivedType(tag: DW_TAG_member, name: "filter_reg", scope: !1425, file: !330, line: 173, baseType: !879, size: 64, offset: 576)
!1470 = !DIDerivedType(tag: DW_TAG_member, name: "use_cxa_end_cleanup", scope: !1425, file: !330, line: 177, baseType: !695, size: 8, offset: 640)
!1471 = !DIDerivedType(tag: DW_TAG_member, name: "region_array", scope: !1420, file: !330, line: 200, baseType: !1472, size: 64, offset: 64)
!1472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1473, size: 64)
!1473 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_eh_region_gc", file: !330, line: 185, baseType: !1474)
!1474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_eh_region_gc", file: !330, line: 185, size: 128, elements: !1475)
!1475 = !{!1476}
