; ModuleID = 'tree-ssa-propagate.bc'
source_filename = "tree-ssa-propagate.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.function = type { %struct.eh_status*, %struct.control_flow_graph*, %struct.gimple_seq_d*, %struct.gimple_df*, %struct.loops*, %struct.htab*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.machine_function*, %struct.language_function*, %struct.htab*, i32, i32, i32, i32, i32, i32, i8*, i32 }
%struct.eh_status = type opaque
%struct.control_flow_graph = type { %struct.basic_block_def*, %struct.basic_block_def*, %struct.VEC_basic_block_gc*, i32, i32, i32, %struct.VEC_basic_block_gc*, i32, [2 x i32], [2 x i32], i32, i32 }
%struct.basic_block_def = type { %struct.VEC_edge_gc*, %struct.VEC_edge_gc*, i8*, %struct.loop*, [2 x %struct.et_node*], %struct.basic_block_def*, %struct.basic_block_def*, %union.basic_block_il_dependent, i64, i32, i32, i32, i32, i32 }
%struct.VEC_edge_gc = type { %struct.VEC_edge_base }
%struct.VEC_edge_base = type { i32, i32, [1 x %struct.edge_def*] }

!414 = !DIEnumerator(name: "GIMPLE_OMP_CONTINUE", value: 21, isUnsigned: true)
!415 = !DIEnumerator(name: "GIMPLE_OMP_CRITICAL", value: 22, isUnsigned: true)
!416 = !DIEnumerator(name: "GIMPLE_OMP_FOR", value: 23, isUnsigned: true)
!417 = !DIEnumerator(name: "GIMPLE_OMP_MASTER", value: 24, isUnsigned: true)
!418 = !DIEnumerator(name: "GIMPLE_OMP_ORDERED", value: 25, isUnsigned: true)
!419 = !DIEnumerator(name: "GIMPLE_OMP_PARALLEL", value: 26, isUnsigned: true)
!420 = !DIEnumerator(name: "GIMPLE_OMP_TASK", value: 27, isUnsigned: true)
!421 = !DIEnumerator(name: "GIMPLE_OMP_RETURN", value: 28, isUnsigned: true)
!422 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!423 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!424 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!425 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!426 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!427 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!428 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!429 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !391, line: 727, baseType: !7, size: 32, elements: !430)
!430 = !{!431, !432, !433, !434, !435, !436, !437, !438, !439, !440, !441, !442, !443, !444, !445, !446, !447, !448, !449, !450, !451, !452, !453, !454}
!431 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!432 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!433 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!434 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!435 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!436 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!437 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!438 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!439 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!440 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!441 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!442 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!443 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!444 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!445 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!446 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!447 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!448 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!449 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!450 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!451 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!452 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!453 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!454 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!455 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "plf_mask", file: !391, line: 130, baseType: !7, size: 32, elements: !456)
!456 = !{!457, !458}
!457 = !DIEnumerator(name: "GF_PLF_1", value: 1, isUnsigned: true)
!458 = !DIEnumerator(name: "GF_PLF_2", value: 2, isUnsigned: true)
!459 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !391, line: 80, baseType: !7, size: 32, elements: !460)
!460 = !{!461, !462, !463, !464}
!461 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!462 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!463 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!464 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!465 = !{!466, !467, !468, !469, !472, !473, !134, !475, !800, !1801, !833, !470, !1803, !7, !1312, !1808, !529, !1813, !459}
!466 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !467, size: 64)
!467 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!468 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!473 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !474, size: 64)
!474 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !471)
!475 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !476, line: 56, baseType: !477)
!476 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!477 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !478, size: 64)
!478 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !135, line: 3371, size: 1792, elements: !479)
!479 = !{!480, !513, !519, !532, !551, !562, !567, !576, !582, !595, !607, !645, !1136, !1164, !1181, !1182, !1187, !1196, !1202, !1207, !1211, !1215, !1452, !1499, !1505, !1511, !1518, !1531, !1545, !1562, !1574, !1596, !1611, !1783}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !478, file: !135, line: 3372, baseType: !481, size: 64)
!481 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !135, line: 360, size: 64, elements: !482)
!482 = !{!483, !484, !485, !486, !487, !488, !489, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !509, !510, !511, !512}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !481, file: !135, line: 361, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !481, file: !135, line: 363, baseType: !7, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!485 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !481, file: !135, line: 364, baseType: !7, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!486 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !481, file: !135, line: 365, baseType: !7, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !481, file: !135, line: 366, baseType: !7, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !481, file: !135, line: 367, baseType: !7, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !481, file: !135, line: 368, baseType: !7, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !481, file: !135, line: 369, baseType: !7, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !481, file: !135, line: 370, baseType: !7, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !481, file: !135, line: 372, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !481, file: !135, line: 373, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!494 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !481, file: !135, line: 374, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!495 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !481, file: !135, line: 375, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!496 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !481, file: !135, line: 376, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!497 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !481, file: !135, line: 377, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !481, file: !135, line: 378, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!499 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !481, file: !135, line: 379, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!500 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !481, file: !135, line: 381, baseType: !7, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!501 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !481, file: !135, line: 382, baseType: !7, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!502 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !481, file: !135, line: 383, baseType: !7, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!503 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !481, file: !135, line: 384, baseType: !7, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!504 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !481, file: !135, line: 385, baseType: !7, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !481, file: !135, line: 386, baseType: !7, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!506 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !481, file: !135, line: 387, baseType: !7, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !481, file: !135, line: 388, baseType: !7, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !481, file: !135, line: 390, baseType: !7, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !481, file: !135, line: 391, baseType: !7, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !481, file: !135, line: 392, baseType: !7, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !481, file: !135, line: 394, baseType: !7, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !481, file: !135, line: 399, baseType: !7, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !478, file: !135, line: 3373, baseType: !514, size: 192)
!514 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !135, line: 402, size: 192, elements: !515)
!515 = !{!516, !517, !518}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !514, file: !135, line: 403, baseType: !481, size: 64)
!517 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !514, file: !135, line: 404, baseType: !475, size: 64, offset: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !514, file: !135, line: 405, baseType: !475, size: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !478, file: !135, line: 3374, baseType: !520, size: 320)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !135, line: 1384, size: 320, elements: !521)
!521 = !{!522, !523}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !520, file: !135, line: 1385, baseType: !514, size: 192)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !520, file: !135, line: 1386, baseType: !524, size: 128, offset: 192)
!524 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !525, line: 58, baseType: !526)
!525 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!526 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !525, line: 54, size: 128, elements: !527)
!527 = !{!528, !530}
!528 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !526, file: !525, line: 56, baseType: !529, size: 64)
!529 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !526, file: !525, line: 57, baseType: !531, size: 64, offset: 64)
!531 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !478, file: !135, line: 3375, baseType: !533, size: 256)
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !135, line: 1397, size: 256, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !533, file: !135, line: 1398, baseType: !514, size: 192)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !533, file: !135, line: 1399, baseType: !537, size: 64, offset: 192)
!537 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !538, size: 64)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !539, line: 52, size: 256, elements: !540)
!539 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!540 = !{!541, !542, !543, !544, !545, !546, !547}
!541 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !538, file: !539, line: 56, baseType: !7, size: 2, flags: DIFlagBitField, extraData: i64 0)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !538, file: !539, line: 57, baseType: !7, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !538, file: !539, line: 58, baseType: !7, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !538, file: !539, line: 59, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !538, file: !539, line: 60, baseType: !7, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !538, file: !539, line: 61, baseType: !7, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !538, file: !539, line: 62, baseType: !548, size: 192, offset: 64)
!548 = !DICompositeType(tag: DW_TAG_array_type, baseType: !529, size: 192, elements: !549)
!549 = !{!550}
!550 = !DISubrange(count: 3)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !478, file: !135, line: 3376, baseType: !552, size: 256)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !135, line: 1408, size: 256, elements: !553)
!553 = !{!554, !555}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !552, file: !135, line: 1409, baseType: !514, size: 192)
!555 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !552, file: !135, line: 1410, baseType: !556, size: 64, offset: 192)
!556 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !557, size: 64)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !558, line: 27, size: 192, elements: !559)
!558 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!559 = !{!560, !561}
!560 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !557, file: !558, line: 29, baseType: !524, size: 128)
!561 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !557, file: !558, line: 30, baseType: !5, size: 32, offset: 128)
!562 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !478, file: !135, line: 3377, baseType: !563, size: 256)
!563 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !135, line: 1437, size: 256, elements: !564)
!564 = !{!565, !566}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !563, file: !135, line: 1438, baseType: !514, size: 192)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !563, file: !135, line: 1439, baseType: !475, size: 64, offset: 192)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !478, file: !135, line: 3378, baseType: !568, size: 256)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !135, line: 1418, size: 256, elements: !569)
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !568, file: !135, line: 1419, baseType: !514, size: 192)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !568, file: !135, line: 1420, baseType: !468, size: 32, offset: 192)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !568, file: !135, line: 1421, baseType: !573, size: 8, offset: 224)
!573 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 8, elements: !574)
!574 = !{!575}
!575 = !DISubrange(count: 1)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !478, file: !135, line: 3379, baseType: !577, size: 320)
!577 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !135, line: 1428, size: 320, elements: !578)
!578 = !{!579, !580, !581}
!579 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !577, file: !135, line: 1429, baseType: !514, size: 192)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !577, file: !135, line: 1430, baseType: !475, size: 64, offset: 192)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !577, file: !135, line: 1431, baseType: !475, size: 64, offset: 256)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !478, file: !135, line: 3380, baseType: !583, size: 320)
!583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !135, line: 1460, size: 320, elements: !584)
!584 = !{!585, !586}
!585 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !583, file: !135, line: 1461, baseType: !514, size: 192)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !583, file: !135, line: 1462, baseType: !587, size: 128, offset: 192)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !588, line: 31, size: 128, elements: !589)
!588 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!589 = !{!590, !593, !594}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !587, file: !588, line: 32, baseType: !591, size: 64)
!591 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !592, size: 64)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !467)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !587, file: !588, line: 33, baseType: !7, size: 32, offset: 64)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !587, file: !588, line: 34, baseType: !7, size: 32, offset: 96)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !478, file: !135, line: 3381, baseType: !596, size: 384)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !135, line: 2507, size: 384, elements: !597)
!597 = !{!598, !599, !604, !605, !606}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !596, file: !135, line: 2508, baseType: !514, size: 192)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !596, file: !135, line: 2509, baseType: !600, size: 32, offset: 192)
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !601, line: 58, baseType: !602)
!601 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !603, line: 44, baseType: !7)
!603 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!604 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !596, file: !135, line: 2510, baseType: !7, size: 32, offset: 224)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !596, file: !135, line: 2511, baseType: !475, size: 64, offset: 256)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !596, file: !135, line: 2512, baseType: !475, size: 64, offset: 320)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !478, file: !135, line: 3382, baseType: !608, size: 896)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !135, line: 2652, size: 896, elements: !609)
!609 = !{!610, !611, !612, !613, !614, !615, !616, !617, !618, !619, !620, !621, !622, !623, !624, !625, !626, !627, !628, !629, !630, !631, !632, !633, !634, !635, !636, !637, !638, !639, !640, !641, !642}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !608, file: !135, line: 2653, baseType: !596, size: 384)
!611 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !608, file: !135, line: 2654, baseType: !475, size: 64, offset: 384)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !608, file: !135, line: 2656, baseType: !7, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !608, file: !135, line: 2658, baseType: !7, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !608, file: !135, line: 2659, baseType: !7, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!615 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !608, file: !135, line: 2660, baseType: !7, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !608, file: !135, line: 2661, baseType: !7, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !608, file: !135, line: 2662, baseType: !7, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !608, file: !135, line: 2663, baseType: !7, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !608, file: !135, line: 2664, baseType: !7, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !608, file: !135, line: 2666, baseType: !7, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !608, file: !135, line: 2667, baseType: !7, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !608, file: !135, line: 2668, baseType: !7, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !608, file: !135, line: 2669, baseType: !7, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !608, file: !135, line: 2670, baseType: !7, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !608, file: !135, line: 2671, baseType: !7, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!626 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !608, file: !135, line: 2672, baseType: !7, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!627 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !608, file: !135, line: 2673, baseType: !7, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !608, file: !135, line: 2674, baseType: !7, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !608, file: !135, line: 2678, baseType: !7, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !608, file: !135, line: 2682, baseType: !7, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!631 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !608, file: !135, line: 2685, baseType: !7, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !608, file: !135, line: 2688, baseType: !7, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!633 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !608, file: !135, line: 2690, baseType: !7, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !608, file: !135, line: 2692, baseType: !7, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !608, file: !135, line: 2695, baseType: !7, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !608, file: !135, line: 2698, baseType: !7, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!637 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !608, file: !135, line: 2703, baseType: !7, size: 32, offset: 512)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !608, file: !135, line: 2705, baseType: !475, size: 64, offset: 576)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !608, file: !135, line: 2706, baseType: !475, size: 64, offset: 640)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !608, file: !135, line: 2707, baseType: !475, size: 64, offset: 704)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !608, file: !135, line: 2708, baseType: !475, size: 64, offset: 768)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !608, file: !135, line: 2711, baseType: !643, size: 64, offset: 832)
!643 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !644, size: 64)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !135, line: 2711, flags: DIFlagFwdDecl)
!645 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !478, file: !135, line: 3383, baseType: !646, size: 960)
!646 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !135, line: 2756, size: 960, elements: !647)
!647 = !{!648, !649}
!648 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !646, file: !135, line: 2757, baseType: !608, size: 896)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !646, file: !135, line: 2758, baseType: !650, size: 64, offset: 896)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !476, line: 50, baseType: !651)
!651 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !652, size: 64)
!652 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !653, line: 240, size: 384, elements: !654)
!653 = !DIFile(filename: "./rtl.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!654 = !{!655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !652, file: !653, line: 242, baseType: !7, size: 16, flags: DIFlagBitField, extraData: i64 0)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !652, file: !653, line: 245, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !652, file: !653, line: 252, baseType: !7, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !652, file: !653, line: 257, baseType: !7, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!659 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !652, file: !653, line: 265, baseType: !7, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !652, file: !653, line: 277, baseType: !7, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !652, file: !653, line: 291, baseType: !7, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !652, file: !653, line: 298, baseType: !7, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !652, file: !653, line: 305, baseType: !7, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !652, file: !653, line: 310, baseType: !7, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !652, file: !653, line: 321, baseType: !666, size: 320, offset: 64)
!666 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !653, line: 315, size: 320, elements: !667)
!667 = !{!668, !1069, !1071, !1134, !1135}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !666, file: !653, line: 316, baseType: !669, size: 64)
!669 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 64, elements: !574)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !653, line: 183, baseType: !671)
!671 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !653, line: 166, size: 64, elements: !672)
!672 = !{!673, !674, !675, !676, !677, !685, !686, !698, !701, !761, !762, !1046, !1059, !1066}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !671, file: !653, line: 168, baseType: !468, size: 32)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !671, file: !653, line: 169, baseType: !7, size: 32)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !671, file: !653, line: 170, baseType: !473, size: 64)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !671, file: !653, line: 171, baseType: !650, size: 64)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !671, file: !653, line: 172, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !476, line: 53, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !653, line: 359, size: 128, elements: !681)
!681 = !{!682, !683}
!682 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !680, file: !653, line: 360, baseType: !468, size: 32)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !680, file: !653, line: 361, baseType: !684, size: 64, offset: 64)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !650, size: 64, elements: !574)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !671, file: !653, line: 173, baseType: !5, size: 32)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !671, file: !653, line: 174, baseType: !687, size: 32)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !653, line: 133, baseType: !688)
!688 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !653, line: 115, size: 32, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697}
!690 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !688, file: !653, line: 118, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !688, file: !653, line: 120, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !688, file: !653, line: 121, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!693 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !688, file: !653, line: 123, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !688, file: !653, line: 125, baseType: !7, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !688, file: !653, line: 127, baseType: !7, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !688, file: !653, line: 130, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !688, file: !653, line: 132, baseType: !7, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !671, file: !653, line: 175, baseType: !699, size: 64)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !653, line: 175, flags: DIFlagFwdDecl)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !671, file: !653, line: 176, baseType: !702, size: 64)
!702 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !703, size: 64)
!703 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !704, line: 75, size: 256, elements: !705)
!704 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!705 = !{!706, !720, !721, !722}
!706 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !703, file: !704, line: 76, baseType: !707, size: 64)
!707 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !708, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !704, line: 68, baseType: !709)
!709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !704, line: 63, size: 320, elements: !710)
!710 = !{!711, !713, !714, !715}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !709, file: !704, line: 64, baseType: !712, size: 64)
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !709, size: 64)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !709, file: !704, line: 65, baseType: !712, size: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !709, file: !704, line: 66, baseType: !7, size: 32, offset: 128)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !709, file: !704, line: 67, baseType: !716, size: 128, offset: 192)
!716 = !DICompositeType(tag: DW_TAG_array_type, baseType: !717, size: 128, elements: !718)
!717 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !704, line: 29, baseType: !529)
!718 = !{!719}
!719 = !DISubrange(count: 2)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !703, file: !704, line: 77, baseType: !707, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !703, file: !704, line: 78, baseType: !7, size: 32, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !703, file: !704, line: 79, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !704, line: 49, baseType: !725)
!725 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !704, line: 45, size: 832, elements: !726)
!726 = !{!727, !728, !729}
!727 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !725, file: !704, line: 46, baseType: !712, size: 64)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !725, file: !704, line: 47, baseType: !702, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !725, file: !704, line: 48, baseType: !730, size: 704, offset: 128)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !731, line: 164, size: 704, elements: !732)
!731 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!732 = !{!733, !734, !744, !745, !746, !747, !748, !749, !753, !757, !758, !759, !760}
!733 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !730, file: !731, line: 166, baseType: !531, size: 64)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !730, file: !731, line: 167, baseType: !735, size: 64, offset: 64)
!735 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !736, size: 64)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !731, line: 157, size: 192, elements: !737)
!737 = !{!738, !739, !740}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !736, file: !731, line: 159, baseType: !470, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !736, file: !731, line: 160, baseType: !735, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !736, file: !731, line: 161, baseType: !741, size: 32, offset: 128)
!741 = !DICompositeType(tag: DW_TAG_array_type, baseType: !471, size: 32, elements: !742)
!742 = !{!743}
!743 = !DISubrange(count: 4)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !730, file: !731, line: 168, baseType: !470, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !730, file: !731, line: 169, baseType: !470, size: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !730, file: !731, line: 170, baseType: !470, size: 64, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !730, file: !731, line: 171, baseType: !531, size: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !730, file: !731, line: 172, baseType: !468, size: 32, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !730, file: !731, line: 176, baseType: !750, size: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DISubroutineType(types: !752)
!752 = !{!735, !472, !531}
!753 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !730, file: !731, line: 177, baseType: !754, size: 64, offset: 512)
!754 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !755, size: 64)
!755 = !DISubroutineType(types: !756)
!756 = !{null, !472, !735}
!757 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !730, file: !731, line: 178, baseType: !472, size: 64, offset: 576)
!758 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !730, file: !731, line: 179, baseType: !7, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !730, file: !731, line: 180, baseType: !7, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !730, file: !731, line: 184, baseType: !7, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !671, file: !653, line: 177, baseType: !475, size: 64)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !671, file: !653, line: 178, baseType: !763, size: 64)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !330, line: 217, size: 832, elements: !765)
!765 = !{!766, !1011, !1012, !1013, !1016, !1020, !1021, !1022, !1040, !1041, !1042, !1043, !1044, !1045}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !764, file: !330, line: 219, baseType: !767, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !330, line: 151, baseType: !769)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !330, line: 151, size: 128, elements: !770)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !769, file: !330, line: 151, baseType: !772, size: 128)
!772 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !330, line: 150, baseType: !773)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !330, line: 150, size: 128, elements: !774)
!774 = !{!775, !776, !777}
!775 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !773, file: !330, line: 150, baseType: !7, size: 32)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !773, file: !330, line: 150, baseType: !7, size: 32, offset: 32)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !773, file: !330, line: 150, baseType: !778, size: 64, offset: 64)
!778 = !DICompositeType(tag: DW_TAG_array_type, baseType: !779, size: 64, elements: !574)
!779 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !476, line: 108, baseType: !780)
!780 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !781, size: 64)
!781 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !330, line: 122, size: 512, elements: !782)
!782 = !{!783, !784, !785, !1003, !1004, !1005, !1006, !1007, !1008, !1009}
!783 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !781, file: !330, line: 124, baseType: !763, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !781, file: !330, line: 125, baseType: !763, size: 64, offset: 64)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !781, file: !330, line: 131, baseType: !786, size: 64, offset: 128)
!786 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !330, line: 128, size: 64, elements: !787)
!787 = !{!788, !1002}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !786, file: !330, line: 129, baseType: !789, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !476, line: 66, baseType: !790)
!790 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !791, size: 64)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !391, line: 143, size: 192, elements: !792)
!792 = !{!793, !1000, !1001}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !791, file: !391, line: 145, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !476, line: 69, baseType: !795)
!795 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !796, size: 64)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !391, line: 136, size: 192, elements: !797)
!797 = !{!798, !998, !999}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !796, file: !391, line: 137, baseType: !799, size: 64)
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !476, line: 58, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !391, line: 737, size: 768, elements: !802)
!802 = !{!803, !820, !853, !859, !864, !869, !876, !882, !888, !893, !907, !912, !918, !923, !933, !938, !956, !963, !970, !976, !981, !987, !993}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !801, file: !391, line: 738, baseType: !804, size: 256)
!804 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !391, line: 271, size: 256, elements: !805)
!805 = !{!806, !807, !808, !809, !810, !811, !812, !813, !814, !815, !816, !817, !818, !819}
!806 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !804, file: !391, line: 274, baseType: !7, size: 8, flags: DIFlagBitField, extraData: i64 0)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !804, file: !391, line: 277, baseType: !7, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !804, file: !391, line: 281, baseType: !7, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !804, file: !391, line: 284, baseType: !7, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !804, file: !391, line: 291, baseType: !7, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !804, file: !391, line: 295, baseType: !7, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !804, file: !391, line: 298, baseType: !7, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !804, file: !391, line: 301, baseType: !7, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !804, file: !391, line: 307, baseType: !7, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !804, file: !391, line: 312, baseType: !7, size: 32, offset: 32)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !804, file: !391, line: 316, baseType: !600, size: 32, offset: 64)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !804, file: !391, line: 319, baseType: !7, size: 32, offset: 96)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !804, file: !391, line: 323, baseType: !763, size: 64, offset: 128)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !804, file: !391, line: 327, baseType: !475, size: 64, offset: 192)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !801, file: !391, line: 739, baseType: !821, size: 448)
!821 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !391, line: 350, size: 448, elements: !822)
!822 = !{!823, !851}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !821, file: !391, line: 353, baseType: !824, size: 384)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !391, line: 333, size: 384, elements: !825)
!825 = !{!826, !827, !834}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !824, file: !391, line: 336, baseType: !804, size: 256)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !824, file: !391, line: 343, baseType: !828, size: 64, offset: 256)
!828 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !829, size: 64)
!829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !378, line: 37, size: 128, elements: !830)
!830 = !{!831, !832}
!831 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !829, file: !378, line: 39, baseType: !828, size: 64)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !829, file: !378, line: 40, baseType: !833, size: 64, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !824, file: !391, line: 344, baseType: !835, size: 64, offset: 320)
!835 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !836, size: 64)
!836 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !378, line: 45, size: 320, elements: !837)
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !836, file: !378, line: 47, baseType: !835, size: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !836, file: !378, line: 48, baseType: !840, size: 256, offset: 64)
!840 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !135, line: 1883, size: 256, elements: !841)
!841 = !{!842, !844, !845, !850}
!842 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !840, file: !135, line: 1884, baseType: !843, size: 64)
!843 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !840, size: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !840, file: !135, line: 1885, baseType: !843, size: 64, offset: 64)
!845 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !840, file: !135, line: 1891, baseType: !846, size: 64, offset: 128)
!846 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !840, file: !135, line: 1891, size: 64, elements: !847)
!847 = !{!848, !849}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !846, file: !135, line: 1891, baseType: !799, size: 64)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !846, file: !135, line: 1891, baseType: !475, size: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !840, file: !135, line: 1892, baseType: !833, size: 64, offset: 192)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !821, file: !391, line: 359, baseType: !852, size: 64, offset: 384)
!852 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 64, elements: !574)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !801, file: !391, line: 740, baseType: !854, size: 512)
!854 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !391, line: 365, size: 512, elements: !855)
!855 = !{!856, !857, !858}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !854, file: !391, line: 368, baseType: !824, size: 384)
!857 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !854, file: !391, line: 373, baseType: !475, size: 64, offset: 384)
!858 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !854, file: !391, line: 374, baseType: !475, size: 64, offset: 448)
!859 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !801, file: !391, line: 741, baseType: !860, size: 576)
!860 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !391, line: 380, size: 576, elements: !861)
!861 = !{!862, !863}
!862 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !860, file: !391, line: 383, baseType: !854, size: 512)
!863 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !860, file: !391, line: 389, baseType: !852, size: 64, offset: 512)
!864 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !801, file: !391, line: 742, baseType: !865, size: 320)
!865 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !391, line: 395, size: 320, elements: !866)
!866 = !{!867, !868}
!867 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !865, file: !391, line: 397, baseType: !804, size: 256)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !865, file: !391, line: 400, baseType: !789, size: 64, offset: 256)
!869 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !801, file: !391, line: 743, baseType: !870, size: 448)
!870 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !391, line: 406, size: 448, elements: !871)
!871 = !{!872, !873, !874, !875}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !870, file: !391, line: 408, baseType: !804, size: 256)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !870, file: !391, line: 412, baseType: !475, size: 64, offset: 256)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !870, file: !391, line: 420, baseType: !475, size: 64, offset: 320)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !870, file: !391, line: 423, baseType: !789, size: 64, offset: 384)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !801, file: !391, line: 744, baseType: !877, size: 384)
!877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !391, line: 429, size: 384, elements: !878)
!878 = !{!879, !880, !881}
!879 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !877, file: !391, line: 431, baseType: !804, size: 256)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !877, file: !391, line: 434, baseType: !475, size: 64, offset: 256)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !877, file: !391, line: 437, baseType: !789, size: 64, offset: 320)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !801, file: !391, line: 745, baseType: !883, size: 384)
!883 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !391, line: 443, size: 384, elements: !884)
!884 = !{!885, !886, !887}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !883, file: !391, line: 445, baseType: !804, size: 256)
!886 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !883, file: !391, line: 449, baseType: !475, size: 64, offset: 256)
!887 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !883, file: !391, line: 453, baseType: !789, size: 64, offset: 320)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !801, file: !391, line: 746, baseType: !889, size: 320)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !391, line: 459, size: 320, elements: !890)
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !889, file: !391, line: 461, baseType: !804, size: 256)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !889, file: !391, line: 464, baseType: !475, size: 64, offset: 256)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !801, file: !391, line: 747, baseType: !894, size: 768)
!894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !391, line: 469, size: 768, elements: !895)
!895 = !{!896, !897, !898, !899, !900}
!896 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !894, file: !391, line: 471, baseType: !804, size: 256)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !894, file: !391, line: 474, baseType: !7, size: 32, offset: 256)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !894, file: !391, line: 475, baseType: !7, size: 32, offset: 288)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !894, file: !391, line: 478, baseType: !475, size: 64, offset: 320)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !894, file: !391, line: 481, baseType: !901, size: 384, offset: 384)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !902, size: 384, elements: !574)
!902 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !135, line: 1917, size: 384, elements: !903)
!903 = !{!904, !905, !906}
!904 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !902, file: !135, line: 1920, baseType: !840, size: 256)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !902, file: !135, line: 1921, baseType: !475, size: 64, offset: 256)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !902, file: !135, line: 1922, baseType: !600, size: 32, offset: 320)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !801, file: !391, line: 748, baseType: !908, size: 320)
!908 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !391, line: 487, size: 320, elements: !909)
!909 = !{!910, !911}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !908, file: !391, line: 490, baseType: !804, size: 256)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !908, file: !391, line: 494, baseType: !468, size: 32, offset: 256)
!912 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !801, file: !391, line: 749, baseType: !913, size: 384)
!913 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !391, line: 500, size: 384, elements: !914)
!914 = !{!915, !916, !917}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !913, file: !391, line: 502, baseType: !804, size: 256)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !913, file: !391, line: 506, baseType: !789, size: 64, offset: 256)
!917 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !913, file: !391, line: 510, baseType: !789, size: 64, offset: 320)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !801, file: !391, line: 750, baseType: !919, size: 320)
!919 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !391, line: 529, size: 320, elements: !920)
!920 = !{!921, !922}
!921 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !919, file: !391, line: 531, baseType: !804, size: 256)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !919, file: !391, line: 540, baseType: !789, size: 64, offset: 256)
!923 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !801, file: !391, line: 751, baseType: !924, size: 704)
!924 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !391, line: 546, size: 704, elements: !925)
!925 = !{!926, !927, !928, !929, !930, !931, !932}
!926 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !924, file: !391, line: 549, baseType: !854, size: 512)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !924, file: !391, line: 553, baseType: !473, size: 64, offset: 512)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !924, file: !391, line: 557, baseType: !467, size: 8, offset: 576)
!929 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !924, file: !391, line: 558, baseType: !467, size: 8, offset: 584)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !924, file: !391, line: 559, baseType: !467, size: 8, offset: 592)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !924, file: !391, line: 560, baseType: !467, size: 8, offset: 600)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !924, file: !391, line: 566, baseType: !852, size: 64, offset: 640)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !801, file: !391, line: 752, baseType: !934, size: 384)
!934 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !391, line: 571, size: 384, elements: !935)
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !934, file: !391, line: 573, baseType: !865, size: 320)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !934, file: !391, line: 577, baseType: !475, size: 64, offset: 320)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !801, file: !391, line: 753, baseType: !939, size: 576)
!939 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !391, line: 600, size: 576, elements: !940)
!940 = !{!941, !942, !943, !946, !955}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !939, file: !391, line: 602, baseType: !865, size: 320)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !939, file: !391, line: 605, baseType: !475, size: 64, offset: 320)
!943 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !939, file: !391, line: 609, baseType: !944, size: 64, offset: 384)
!944 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !945, line: 46, baseType: !529)
!945 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!946 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !939, file: !391, line: 612, baseType: !947, size: 64, offset: 448)
!947 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !948, size: 64)
!948 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !391, line: 581, size: 320, elements: !949)
!949 = !{!950, !951, !952, !953, !954}
!950 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !948, file: !391, line: 583, baseType: !134, size: 32)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !948, file: !391, line: 586, baseType: !475, size: 64, offset: 64)
!952 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !948, file: !391, line: 589, baseType: !475, size: 64, offset: 128)
!953 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !948, file: !391, line: 592, baseType: !475, size: 64, offset: 192)
!954 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !948, file: !391, line: 595, baseType: !475, size: 64, offset: 256)
!955 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !939, file: !391, line: 616, baseType: !789, size: 64, offset: 512)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !801, file: !391, line: 754, baseType: !957, size: 512)
!957 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !391, line: 622, size: 512, elements: !958)
!958 = !{!959, !960, !961, !962}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !957, file: !391, line: 624, baseType: !865, size: 320)
!960 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !957, file: !391, line: 628, baseType: !475, size: 64, offset: 320)
!961 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !957, file: !391, line: 632, baseType: !475, size: 64, offset: 384)
!962 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !957, file: !391, line: 636, baseType: !475, size: 64, offset: 448)
!963 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !801, file: !391, line: 755, baseType: !964, size: 704)
!964 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !391, line: 642, size: 704, elements: !965)
!965 = !{!966, !967, !968, !969}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !964, file: !391, line: 644, baseType: !957, size: 512)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !964, file: !391, line: 648, baseType: !475, size: 64, offset: 512)
!968 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !964, file: !391, line: 652, baseType: !475, size: 64, offset: 576)
!969 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !964, file: !391, line: 653, baseType: !475, size: 64, offset: 640)
!970 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !801, file: !391, line: 756, baseType: !971, size: 448)
!971 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !391, line: 663, size: 448, elements: !972)
!972 = !{!973, !974, !975}
!973 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !971, file: !391, line: 665, baseType: !865, size: 320)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !971, file: !391, line: 668, baseType: !475, size: 64, offset: 320)
!975 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !971, file: !391, line: 673, baseType: !475, size: 64, offset: 384)
!976 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !801, file: !391, line: 757, baseType: !977, size: 384)
!977 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !391, line: 694, size: 384, elements: !978)
!978 = !{!979, !980}
!979 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !977, file: !391, line: 696, baseType: !865, size: 320)
!980 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !977, file: !391, line: 699, baseType: !475, size: 64, offset: 320)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !801, file: !391, line: 758, baseType: !982, size: 384)
!982 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !391, line: 681, size: 384, elements: !983)
!983 = !{!984, !985, !986}
!984 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !982, file: !391, line: 683, baseType: !804, size: 256)
!985 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !982, file: !391, line: 686, baseType: !475, size: 64, offset: 256)
!986 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !982, file: !391, line: 689, baseType: !475, size: 64, offset: 320)
!987 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !801, file: !391, line: 759, baseType: !988, size: 384)
!988 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !391, line: 707, size: 384, elements: !989)
!989 = !{!990, !991, !992}
!990 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !988, file: !391, line: 709, baseType: !804, size: 256)
!991 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !988, file: !391, line: 712, baseType: !475, size: 64, offset: 256)
!992 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !988, file: !391, line: 712, baseType: !475, size: 64, offset: 320)
!993 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !801, file: !391, line: 760, baseType: !994, size: 320)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !391, line: 718, size: 320, elements: !995)
!995 = !{!996, !997}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !994, file: !391, line: 720, baseType: !804, size: 256)
!997 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !994, file: !391, line: 723, baseType: !475, size: 64, offset: 256)
!998 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !796, file: !391, line: 138, baseType: !795, size: 64, offset: 64)
!999 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !796, file: !391, line: 139, baseType: !795, size: 64, offset: 128)
!1000 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !791, file: !391, line: 146, baseType: !794, size: 64, offset: 64)
!1001 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !791, file: !391, line: 152, baseType: !789, size: 64, offset: 128)
!1002 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !786, file: !330, line: 130, baseType: !650, size: 64)
!1003 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !781, file: !330, line: 134, baseType: !472, size: 64, offset: 192)
!1004 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !781, file: !330, line: 137, baseType: !475, size: 64, offset: 256)
!1005 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !781, file: !330, line: 138, baseType: !600, size: 32, offset: 320)
!1006 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !781, file: !330, line: 142, baseType: !7, size: 32, offset: 352)
!1007 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !781, file: !330, line: 144, baseType: !468, size: 32, offset: 384)
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !781, file: !330, line: 145, baseType: !468, size: 32, offset: 416)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !781, file: !330, line: 146, baseType: !1010, size: 64, offset: 448)
!1010 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !330, line: 119, baseType: !531)
!1011 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !764, file: !330, line: 220, baseType: !767, size: 64, offset: 64)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !764, file: !330, line: 223, baseType: !472, size: 64, offset: 128)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !764, file: !330, line: 226, baseType: !1014, size: 64, offset: 192)
!1014 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1015, size: 64)
!1015 = !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !330, line: 185, flags: DIFlagFwdDecl)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !764, file: !330, line: 229, baseType: !1017, size: 128, offset: 256)
!1017 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1018, size: 128, elements: !718)
!1018 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1019, size: 64)
!1019 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !330, line: 229, flags: DIFlagFwdDecl)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !764, file: !330, line: 232, baseType: !763, size: 64, offset: 384)
!1021 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !764, file: !330, line: 233, baseType: !763, size: 64, offset: 448)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !764, file: !330, line: 238, baseType: !1023, size: 64, offset: 512)
!1023 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !330, line: 235, size: 64, elements: !1024)
!1024 = !{!1025, !1031}
!1025 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !1023, file: !330, line: 236, baseType: !1026, size: 64)
!1026 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1027, size: 64)
!1027 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !330, line: 273, size: 128, elements: !1028)
!1028 = !{!1029, !1030}
!1029 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !1027, file: !330, line: 275, baseType: !789, size: 64)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !1027, file: !330, line: 278, baseType: !789, size: 64, offset: 64)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !1023, file: !330, line: 237, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1033 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !330, line: 259, size: 320, elements: !1034)
!1034 = !{!1035, !1036, !1037, !1038, !1039}
!1035 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !1033, file: !330, line: 261, baseType: !650, size: 64)
!1036 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !1033, file: !330, line: 262, baseType: !650, size: 64, offset: 64)
!1037 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !1033, file: !330, line: 266, baseType: !650, size: 64, offset: 128)
!1038 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !1033, file: !330, line: 267, baseType: !650, size: 64, offset: 192)
!1039 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !1033, file: !330, line: 270, baseType: !468, size: 32, offset: 256)
!1040 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !764, file: !330, line: 241, baseType: !1010, size: 64, offset: 576)
!1041 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !764, file: !330, line: 244, baseType: !468, size: 32, offset: 640)
!1042 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !764, file: !330, line: 247, baseType: !468, size: 32, offset: 672)
!1043 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !764, file: !330, line: 250, baseType: !468, size: 32, offset: 704)
!1044 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !764, file: !330, line: 253, baseType: !468, size: 32, offset: 736)
!1045 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !764, file: !330, line: 256, baseType: !468, size: 32, offset: 768)
!1046 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !671, file: !653, line: 179, baseType: !1047, size: 64)
!1047 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1048, size: 64)
!1048 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !653, line: 150, baseType: !1049)
!1049 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !653, line: 142, size: 320, elements: !1050)
!1050 = !{!1051, !1052, !1053, !1054, !1057, !1058}
!1051 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !1049, file: !653, line: 144, baseType: !475, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1049, file: !653, line: 145, baseType: !650, size: 64, offset: 64)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1049, file: !653, line: 146, baseType: !650, size: 64, offset: 128)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !1049, file: !653, line: 147, baseType: !1055, size: 32, offset: 192)
!1055 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !1056, line: 31, baseType: !468)
!1056 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !1049, file: !653, line: 148, baseType: !7, size: 32, offset: 224)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !1049, file: !653, line: 149, baseType: !467, size: 8, offset: 256)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !671, file: !653, line: 180, baseType: !1060, size: 64)
!1060 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1061, size: 64)
!1061 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !653, line: 162, baseType: !1062)
!1062 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !653, line: 159, size: 128, elements: !1063)
!1063 = !{!1064, !1065}
!1064 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1062, file: !653, line: 160, baseType: !475, size: 64)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1062, file: !653, line: 161, baseType: !531, size: 64, offset: 64)
!1066 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !671, file: !653, line: 181, baseType: !1067, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1068, size: 64)
!1068 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !653, line: 181, flags: DIFlagFwdDecl)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !666, file: !653, line: 317, baseType: !1070, size: 64)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !531, size: 64, elements: !574)
!1071 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !666, file: !653, line: 318, baseType: !1072, size: 320)
!1072 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !653, line: 188, size: 320, elements: !1073)
!1073 = !{!1074, !1076, !1133}
!1074 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !1072, file: !653, line: 190, baseType: !1075, size: 192)
!1075 = !DICompositeType(tag: DW_TAG_array_type, baseType: !670, size: 192, elements: !549)
!1076 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !1072, file: !653, line: 193, baseType: !1077, size: 64, offset: 192)
!1077 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1078, size: 64)
!1078 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !653, line: 206, size: 320, elements: !1079)
!1079 = !{!1080, !1118, !1119, !1120, !1132}
!1080 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !1078, file: !653, line: 208, baseType: !1081, size: 64)
!1081 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1082, size: 64)
!1082 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !476, line: 62, baseType: !1083)
!1083 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !1084, line: 538, size: 256, elements: !1085)
!1084 = !DIFile(filename: "./output.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1085 = !{!1086, !1090, !1096, !1109}
!1086 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1083, file: !1084, line: 539, baseType: !1087, size: 32)
!1087 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "section_common", file: !1084, line: 482, size: 32, elements: !1088)
!1088 = !{!1089}
!1089 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !1087, file: !1084, line: 484, baseType: !7, size: 32)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "named", scope: !1083, file: !1084, line: 540, baseType: !1091, size: 192)
!1091 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "named_section", file: !1084, line: 488, size: 192, elements: !1092)
!1092 = !{!1093, !1094, !1095}
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1091, file: !1084, line: 489, baseType: !1087, size: 32)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !1091, file: !1084, line: 492, baseType: !473, size: 64, offset: 64)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !1091, file: !1084, line: 496, baseType: !475, size: 64, offset: 128)
!1096 = !DIDerivedType(tag: DW_TAG_member, name: "unnamed", scope: !1083, file: !1084, line: 541, baseType: !1097, size: 256)
!1097 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "unnamed_section", file: !1084, line: 504, size: 256, elements: !1098)
!1098 = !{!1099, !1100, !1107, !1108}
!1099 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1097, file: !1084, line: 505, baseType: !1087, size: 32)
!1100 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1097, file: !1084, line: 509, baseType: !1101, size: 64, offset: 64)
!1101 = !DIDerivedType(tag: DW_TAG_typedef, name: "unnamed_section_callback", file: !1084, line: 501, baseType: !1102)
!1102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1103, size: 64)
!1103 = !DISubroutineType(types: !1104)
!1104 = !{null, !1105}
!1105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1106, size: 64)
!1106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!1107 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !1097, file: !1084, line: 510, baseType: !1105, size: 64, offset: 128)
!1108 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !1097, file: !1084, line: 513, baseType: !1081, size: 64, offset: 192)
!1109 = !DIDerivedType(tag: DW_TAG_member, name: "noswitch", scope: !1083, file: !1084, line: 542, baseType: !1110, size: 128)
!1110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "noswitch_section", file: !1084, line: 530, size: 128, elements: !1111)
!1111 = !{!1112, !1113}
!1112 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1110, file: !1084, line: 531, baseType: !1087, size: 32)
!1113 = !DIDerivedType(tag: DW_TAG_member, name: "callback", scope: !1110, file: !1084, line: 534, baseType: !1114, size: 64, offset: 64)
!1114 = !DIDerivedType(tag: DW_TAG_typedef, name: "noswitch_section_callback", file: !1084, line: 525, baseType: !1115)
!1115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1116, size: 64)
!1116 = !DISubroutineType(types: !1117)
!1117 = !{!467, !475, !473, !529, !529}
!1118 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !1078, file: !653, line: 211, baseType: !7, size: 32, offset: 64)
!1119 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !1078, file: !653, line: 214, baseType: !531, size: 64, offset: 128)
!1120 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !1078, file: !653, line: 224, baseType: !1121, size: 64, offset: 192)
!1121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1122, size: 64)
!1122 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !653, line: 202, baseType: !1123)
!1123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !653, line: 202, size: 128, elements: !1124)
!1124 = !{!1125}
!1125 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1123, file: !653, line: 202, baseType: !1126, size: 128)
!1126 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !653, line: 200, baseType: !1127)
!1127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !653, line: 200, size: 128, elements: !1128)
!1128 = !{!1129, !1130, !1131}
!1129 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1127, file: !653, line: 200, baseType: !7, size: 32)
!1130 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1127, file: !653, line: 200, baseType: !7, size: 32, offset: 32)
!1131 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1127, file: !653, line: 200, baseType: !684, size: 64, offset: 64)
!1132 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !1078, file: !653, line: 234, baseType: !1121, size: 64, offset: 256)
!1133 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1072, file: !653, line: 197, baseType: !531, size: 64, offset: 256)
!1134 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !666, file: !653, line: 319, baseType: !538, size: 256)
!1135 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !666, file: !653, line: 320, baseType: !557, size: 192)
!1136 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !478, file: !135, line: 3384, baseType: !1137, size: 1472)
!1137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !135, line: 3114, size: 1472, elements: !1138)
!1138 = !{!1139, !1160, !1161, !1162, !1163}
!1139 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1137, file: !135, line: 3115, baseType: !1140, size: 1216)
!1140 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !135, line: 2984, size: 1216, elements: !1141)
!1141 = !{!1142, !1143, !1144, !1145, !1146, !1147, !1148, !1149, !1150, !1151, !1152, !1153, !1154, !1155, !1156, !1157, !1158, !1159}
!1142 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1140, file: !135, line: 2985, baseType: !646, size: 960)
!1143 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !1140, file: !135, line: 2986, baseType: !475, size: 64, offset: 960)
!1144 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !1140, file: !135, line: 2987, baseType: !475, size: 64, offset: 1024)
!1145 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !1140, file: !135, line: 2988, baseType: !475, size: 64, offset: 1088)
!1146 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !1140, file: !135, line: 2991, baseType: !7, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!1147 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !1140, file: !135, line: 2992, baseType: !7, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!1148 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !1140, file: !135, line: 2993, baseType: !7, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!1149 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !1140, file: !135, line: 2994, baseType: !7, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!1150 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !1140, file: !135, line: 2995, baseType: !7, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!1151 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !1140, file: !135, line: 2996, baseType: !7, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!1152 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !1140, file: !135, line: 2998, baseType: !7, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!1153 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !1140, file: !135, line: 3000, baseType: !7, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!1154 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !1140, file: !135, line: 3002, baseType: !7, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!1155 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !1140, file: !135, line: 3003, baseType: !7, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!1156 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !1140, file: !135, line: 3004, baseType: !7, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!1157 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !1140, file: !135, line: 3005, baseType: !7, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!1158 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !1140, file: !135, line: 3007, baseType: !7, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!1159 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !1140, file: !135, line: 3010, baseType: !7, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!1160 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !1137, file: !135, line: 3117, baseType: !475, size: 64, offset: 1216)
!1161 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !1137, file: !135, line: 3119, baseType: !475, size: 64, offset: 1280)
!1162 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !1137, file: !135, line: 3121, baseType: !475, size: 64, offset: 1344)
!1163 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !1137, file: !135, line: 3123, baseType: !475, size: 64, offset: 1408)
!1164 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !478, file: !135, line: 3385, baseType: !1165, size: 1088)
!1165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !135, line: 2874, size: 1088, elements: !1166)
!1166 = !{!1167, !1168, !1169}
!1167 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1165, file: !135, line: 2875, baseType: !646, size: 960)
!1168 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !1165, file: !135, line: 2876, baseType: !650, size: 64, offset: 960)
!1169 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1165, file: !135, line: 2877, baseType: !1170, size: 64, offset: 1024)
!1170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1171, size: 64)
!1171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !1172, line: 172, size: 128, elements: !1173)
!1172 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1173 = !{!1174, !1175, !1176, !1177, !1178, !1179, !1180}
!1174 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !1171, file: !1172, line: 174, baseType: !7, size: 1, flags: DIFlagBitField, extraData: i64 0)
!1175 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !1171, file: !1172, line: 178, baseType: !7, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!1176 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !1171, file: !1172, line: 183, baseType: !7, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!1177 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !1171, file: !1172, line: 187, baseType: !7, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!1178 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !1171, file: !1172, line: 192, baseType: !7, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!1179 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !1171, file: !1172, line: 195, baseType: !7, size: 32, offset: 32)
!1180 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !1171, file: !1172, line: 199, baseType: !475, size: 64, offset: 64)
!1181 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !478, file: !135, line: 3386, baseType: !1140, size: 1216)
!1182 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !478, file: !135, line: 3387, baseType: !1183, size: 1280)
!1183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !135, line: 3093, size: 1280, elements: !1184)
!1184 = !{!1185, !1186}
!1185 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1183, file: !135, line: 3094, baseType: !1140, size: 1216)
!1186 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1183, file: !135, line: 3095, baseType: !1170, size: 64, offset: 1216)
!1187 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !478, file: !135, line: 3388, baseType: !1188, size: 1216)
!1188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !135, line: 2824, size: 1216, elements: !1189)
!1189 = !{!1190, !1191, !1192, !1193, !1194, !1195}
!1190 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1188, file: !135, line: 2825, baseType: !608, size: 896)
!1191 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !1188, file: !135, line: 2827, baseType: !475, size: 64, offset: 896)
!1192 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !1188, file: !135, line: 2828, baseType: !475, size: 64, offset: 960)
!1193 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !1188, file: !135, line: 2829, baseType: !475, size: 64, offset: 1024)
!1194 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !1188, file: !135, line: 2830, baseType: !475, size: 64, offset: 1088)
!1195 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !1188, file: !135, line: 2831, baseType: !475, size: 64, offset: 1152)
!1196 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !478, file: !135, line: 3389, baseType: !1197, size: 1024)
!1197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !135, line: 2850, size: 1024, elements: !1198)
!1198 = !{!1199, !1200, !1201}
!1199 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1197, file: !135, line: 2851, baseType: !646, size: 960)
!1200 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !1197, file: !135, line: 2852, baseType: !468, size: 32, offset: 960)
!1201 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !1197, file: !135, line: 2853, baseType: !468, size: 32, offset: 992)
!1202 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !478, file: !135, line: 3390, baseType: !1203, size: 1024)
!1203 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !135, line: 2857, size: 1024, elements: !1204)
!1204 = !{!1205, !1206}
!1205 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1203, file: !135, line: 2858, baseType: !646, size: 960)
!1206 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !1203, file: !135, line: 2859, baseType: !1170, size: 64, offset: 960)
!1207 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !478, file: !135, line: 3391, baseType: !1208, size: 960)
!1208 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !135, line: 2862, size: 960, elements: !1209)
!1209 = !{!1210}
!1210 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1208, file: !135, line: 2863, baseType: !646, size: 960)
!1211 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !478, file: !135, line: 3392, baseType: !1212, size: 1472)
!1212 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !135, line: 3304, size: 1472, elements: !1213)
!1213 = !{!1214}
!1214 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1212, file: !135, line: 3305, baseType: !1137, size: 1472)
!1215 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !478, file: !135, line: 3393, baseType: !1216, size: 1792)
!1216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !135, line: 3248, size: 1792, elements: !1217)
!1217 = !{!1218, !1219, !1431, !1432, !1433, !1434, !1435, !1436, !1437, !1438, !1439, !1440, !1441, !1442, !1443, !1444, !1445, !1446, !1447, !1448, !1449, !1450, !1451}
!1218 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !1216, file: !135, line: 3249, baseType: !1137, size: 1472)
!1219 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !1216, file: !135, line: 3251, baseType: !1220, size: 64, offset: 1472)
!1220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1221, size: 64)
!1221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !1222, line: 463, size: 1152, elements: !1223)
!1222 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!1223 = !{!1224, !1227, !1258, !1259, !1372, !1375, !1376, !1377, !1378, !1379, !1380, !1404, !1407, !1408, !1409, !1410, !1411, !1412, !1413, !1414, !1415, !1416, !1417, !1418, !1419, !1420, !1421, !1422, !1423, !1424, !1425, !1426, !1427, !1428, !1429, !1430}
!1224 = !DIDerivedType(tag: DW_TAG_member, name: "eh", scope: !1221, file: !1222, line: 464, baseType: !1225, size: 64)
!1225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1226, size: 64)
!1226 = !DICompositeType(tag: DW_TAG_structure_type, name: "eh_status", file: !1222, line: 464, flags: DIFlagFwdDecl)
!1227 = !DIDerivedType(tag: DW_TAG_member, name: "cfg", scope: !1221, file: !1222, line: 467, baseType: !1228, size: 64, offset: 64)
!1228 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1229, size: 64)
!1229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "control_flow_graph", file: !330, line: 374, size: 640, elements: !1230)
!1230 = !{!1231, !1233, !1234, !1247, !1248, !1249, !1250, !1251, !1252, !1254, !1256, !1257}
!1231 = !DIDerivedType(tag: DW_TAG_member, name: "x_entry_block_ptr", scope: !1229, file: !330, line: 377, baseType: !1232, size: 64)
!1232 = !DIDerivedType(tag: DW_TAG_typedef, name: "basic_block", file: !476, line: 111, baseType: !763)
!1233 = !DIDerivedType(tag: DW_TAG_member, name: "x_exit_block_ptr", scope: !1229, file: !330, line: 378, baseType: !1232, size: 64, offset: 64)
!1234 = !DIDerivedType(tag: DW_TAG_member, name: "x_basic_block_info", scope: !1229, file: !330, line: 381, baseType: !1235, size: 64, offset: 128)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64)
!1236 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_gc", file: !330, line: 282, baseType: !1237)
!1237 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_gc", file: !330, line: 282, size: 128, elements: !1238)
!1238 = !{!1239}
!1239 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !1237, file: !330, line: 282, baseType: !1240, size: 128)
!1240 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_basic_block_base", file: !330, line: 281, baseType: !1241)
!1241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_basic_block_base", file: !330, line: 281, size: 128, elements: !1242)
!1242 = !{!1243, !1244, !1245}
!1243 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !1241, file: !330, line: 281, baseType: !7, size: 32)
!1244 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !1241, file: !330, line: 281, baseType: !7, size: 32, offset: 32)
!1245 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !1241, file: !330, line: 281, baseType: !1246, size: 64, offset: 64)
!1246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1232, size: 64, elements: !574)
!1247 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_basic_blocks", scope: !1229, file: !330, line: 384, baseType: !468, size: 32, offset: 192)
!1248 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_edges", scope: !1229, file: !330, line: 387, baseType: !468, size: 32, offset: 224)
!1249 = !DIDerivedType(tag: DW_TAG_member, name: "x_last_basic_block", scope: !1229, file: !330, line: 390, baseType: !468, size: 32, offset: 256)
!1250 = !DIDerivedType(tag: DW_TAG_member, name: "x_label_to_block_map", scope: !1229, file: !330, line: 394, baseType: !1235, size: 64, offset: 320)
!1251 = !DIDerivedType(tag: DW_TAG_member, name: "x_profile_status", scope: !1229, file: !330, line: 396, baseType: !329, size: 32, offset: 384)
!1252 = !DIDerivedType(tag: DW_TAG_member, name: "x_dom_computed", scope: !1229, file: !330, line: 399, baseType: !1253, size: 64, offset: 416)
!1253 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !718)
!1254 = !DIDerivedType(tag: DW_TAG_member, name: "x_n_bbs_in_dom_tree", scope: !1229, file: !330, line: 402, baseType: !1255, size: 64, offset: 480)
!1255 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 64, elements: !718)
!1256 = !DIDerivedType(tag: DW_TAG_member, name: "max_jumptable_ents", scope: !1229, file: !330, line: 406, baseType: !468, size: 32, offset: 544)
