; ModuleID = 'tree-vect-data-refs.bc'
source_filename = "tree-vect-data-refs.c"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.param_info = type { i8*, i32, i8, i32, i32, i8* }
%union.tree_node = type { %struct.tree_function_decl }
%struct.tree_function_decl = type { %struct.tree_decl_non_common, %struct.function*, %union.tree_node*, %union.tree_node*, %union.tree_node*, i32 }
%struct.tree_decl_non_common = type { %struct.tree_decl_with_vis, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node* }
%struct.tree_decl_with_vis = type { %struct.tree_decl_with_rtl, %union.tree_node*, %union.tree_node*, %union.tree_node*, i24 }
%struct.tree_decl_with_rtl = type { %struct.tree_decl_common, %struct.rtx_def* }
%struct.tree_decl_common = type { %struct.tree_decl_minimal, %union.tree_node*, i40, i32, %union.tree_node*, %union.tree_node*, %union.tree_node*, %union.tree_node*, %struct.lang_decl* }
%struct.tree_decl_minimal = type { %struct.tree_common, i32, i32, %union.tree_node*, %union.tree_node* }

!2113 = !DIEnumerator(name: "GIMPLE_OMP_SECTION", value: 29, isUnsigned: true)
!2114 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS", value: 30, isUnsigned: true)
!2115 = !DIEnumerator(name: "GIMPLE_OMP_SECTIONS_SWITCH", value: 31, isUnsigned: true)
!2116 = !DIEnumerator(name: "GIMPLE_OMP_SINGLE", value: 32, isUnsigned: true)
!2117 = !DIEnumerator(name: "GIMPLE_PREDICT", value: 33, isUnsigned: true)
!2118 = !DIEnumerator(name: "GIMPLE_WITH_CLEANUP_EXPR", value: 34, isUnsigned: true)
!2119 = !DIEnumerator(name: "LAST_AND_UNUSED_GIMPLE_CODE", value: 35, isUnsigned: true)
!2120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_rhs_class", file: !2082, line: 80, baseType: !5, size: 32, elements: !2121)
!2121 = !{!2122, !2123, !2124, !2125}
!2122 = !DIEnumerator(name: "GIMPLE_INVALID_RHS", value: 0, isUnsigned: true)
!2123 = !DIEnumerator(name: "GIMPLE_BINARY_RHS", value: 1, isUnsigned: true)
!2124 = !DIEnumerator(name: "GIMPLE_UNARY_RHS", value: 2, isUnsigned: true)
!2125 = !DIEnumerator(name: "GIMPLE_SINGLE_RHS", value: 3, isUnsigned: true)
!2126 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "gimple_statement_structure_enum", file: !2082, line: 727, baseType: !5, size: 32, elements: !2127)
!2127 = !{!2128, !2129, !2130, !2131, !2132, !2133, !2134, !2135, !2136, !2137, !2138, !2139, !2140, !2141, !2142, !2143, !2144, !2145, !2146, !2147, !2148, !2149, !2150, !2151}
!2128 = !DIEnumerator(name: "GSS_BASE", value: 0, isUnsigned: true)
!2129 = !DIEnumerator(name: "GSS_WITH_OPS", value: 1, isUnsigned: true)
!2130 = !DIEnumerator(name: "GSS_WITH_MEM_OPS_BASE", value: 2, isUnsigned: true)
!2131 = !DIEnumerator(name: "GSS_WITH_MEM_OPS", value: 3, isUnsigned: true)
!2132 = !DIEnumerator(name: "GSS_ASM", value: 4, isUnsigned: true)
!2133 = !DIEnumerator(name: "GSS_BIND", value: 5, isUnsigned: true)
!2134 = !DIEnumerator(name: "GSS_PHI", value: 6, isUnsigned: true)
!2135 = !DIEnumerator(name: "GSS_TRY", value: 7, isUnsigned: true)
!2136 = !DIEnumerator(name: "GSS_CATCH", value: 8, isUnsigned: true)
!2137 = !DIEnumerator(name: "GSS_EH_FILTER", value: 9, isUnsigned: true)
!2138 = !DIEnumerator(name: "GSS_EH_MNT", value: 10, isUnsigned: true)
!2139 = !DIEnumerator(name: "GSS_EH_CTRL", value: 11, isUnsigned: true)
!2140 = !DIEnumerator(name: "GSS_WCE", value: 12, isUnsigned: true)
!2141 = !DIEnumerator(name: "GSS_OMP", value: 13, isUnsigned: true)
!2142 = !DIEnumerator(name: "GSS_OMP_CRITICAL", value: 14, isUnsigned: true)
!2143 = !DIEnumerator(name: "GSS_OMP_FOR", value: 15, isUnsigned: true)
!2144 = !DIEnumerator(name: "GSS_OMP_PARALLEL", value: 16, isUnsigned: true)
!2145 = !DIEnumerator(name: "GSS_OMP_TASK", value: 17, isUnsigned: true)
!2146 = !DIEnumerator(name: "GSS_OMP_SECTIONS", value: 18, isUnsigned: true)
!2147 = !DIEnumerator(name: "GSS_OMP_SINGLE", value: 19, isUnsigned: true)
!2148 = !DIEnumerator(name: "GSS_OMP_CONTINUE", value: 20, isUnsigned: true)
!2149 = !DIEnumerator(name: "GSS_OMP_ATOMIC_LOAD", value: 21, isUnsigned: true)
!2150 = !DIEnumerator(name: "GSS_OMP_ATOMIC_STORE", value: 22, isUnsigned: true)
!2151 = !DIEnumerator(name: "LAST_GSS_ENUM", value: 23, isUnsigned: true)
!2152 = !{!2153, !2154, !2155, !2156, !2159, !2160, !2162, !2163, !2165, !132, !5, !2166, !2168, !2120, !2489, !3514, !2522, !2157, !3516, !3624, !2170, !3800, !3612, !2728, !3593, !3763, !3610, !3775, !3674, !2488, !3802, !3803, !3815, !3557}
!2153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2154, size: 64)
!2154 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!2155 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!2156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2157, size: 64)
!2157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2158, size: 64)
!2158 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!2159 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!2160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2161, size: 64)
!2161 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2158)
!2162 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!2163 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !2164, line: 46, baseType: !2162)
!2164 = !DIFile(filename: "/scratch/install/llvm-install-release/lib/clang/9.0.1/include/stddef.h", directory: "")
!2165 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!2166 = !DIDerivedType(tag: DW_TAG_typedef, name: "source_location", file: !2167, line: 44, baseType: !5)
!2167 = !DIFile(filename: "./line-map.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2168 = !DIDerivedType(tag: DW_TAG_typedef, name: "tree", file: !2169, line: 56, baseType: !2170)
!2169 = !DIFile(filename: "./coretypes.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2171, size: 64)
!2171 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "tree_node", file: !133, line: 3371, size: 1792, elements: !2172)
!2172 = !{!2173, !2206, !2212, !2224, !2243, !2254, !2259, !2268, !2274, !2287, !2297, !2335, !2842, !2870, !2887, !2888, !2893, !2902, !2908, !2913, !2917, !2921, !3165, !3212, !3218, !3224, !3231, !3244, !3258, !3275, !3287, !3309, !3324, !3496}
!2173 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2171, file: !133, line: 3372, baseType: !2174, size: 64)
!2174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_base", file: !133, line: 360, size: 64, elements: !2175)
!2175 = !{!2176, !2177, !2178, !2179, !2180, !2181, !2182, !2183, !2184, !2185, !2186, !2187, !2188, !2189, !2190, !2191, !2192, !2193, !2194, !2195, !2196, !2197, !2198, !2199, !2200, !2201, !2202, !2203, !2204, !2205}
!2176 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2174, file: !133, line: 361, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2177 = !DIDerivedType(tag: DW_TAG_member, name: "side_effects_flag", scope: !2174, file: !133, line: 363, baseType: !5, size: 1, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2178 = !DIDerivedType(tag: DW_TAG_member, name: "constant_flag", scope: !2174, file: !133, line: 364, baseType: !5, size: 1, offset: 17, flags: DIFlagBitField, extraData: i64 0)
!2179 = !DIDerivedType(tag: DW_TAG_member, name: "addressable_flag", scope: !2174, file: !133, line: 365, baseType: !5, size: 1, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!2180 = !DIDerivedType(tag: DW_TAG_member, name: "volatile_flag", scope: !2174, file: !133, line: 366, baseType: !5, size: 1, offset: 19, flags: DIFlagBitField, extraData: i64 0)
!2181 = !DIDerivedType(tag: DW_TAG_member, name: "readonly_flag", scope: !2174, file: !133, line: 367, baseType: !5, size: 1, offset: 20, flags: DIFlagBitField, extraData: i64 0)
!2182 = !DIDerivedType(tag: DW_TAG_member, name: "unsigned_flag", scope: !2174, file: !133, line: 368, baseType: !5, size: 1, offset: 21, flags: DIFlagBitField, extraData: i64 0)
!2183 = !DIDerivedType(tag: DW_TAG_member, name: "asm_written_flag", scope: !2174, file: !133, line: 369, baseType: !5, size: 1, offset: 22, flags: DIFlagBitField, extraData: i64 0)
!2184 = !DIDerivedType(tag: DW_TAG_member, name: "nowarning_flag", scope: !2174, file: !133, line: 370, baseType: !5, size: 1, offset: 23, flags: DIFlagBitField, extraData: i64 0)
!2185 = !DIDerivedType(tag: DW_TAG_member, name: "used_flag", scope: !2174, file: !133, line: 372, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2186 = !DIDerivedType(tag: DW_TAG_member, name: "nothrow_flag", scope: !2174, file: !133, line: 373, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2187 = !DIDerivedType(tag: DW_TAG_member, name: "static_flag", scope: !2174, file: !133, line: 374, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2188 = !DIDerivedType(tag: DW_TAG_member, name: "public_flag", scope: !2174, file: !133, line: 375, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2189 = !DIDerivedType(tag: DW_TAG_member, name: "private_flag", scope: !2174, file: !133, line: 376, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2190 = !DIDerivedType(tag: DW_TAG_member, name: "protected_flag", scope: !2174, file: !133, line: 377, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2191 = !DIDerivedType(tag: DW_TAG_member, name: "deprecated_flag", scope: !2174, file: !133, line: 378, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2192 = !DIDerivedType(tag: DW_TAG_member, name: "saturating_flag", scope: !2174, file: !133, line: 379, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2193 = !DIDerivedType(tag: DW_TAG_member, name: "default_def_flag", scope: !2174, file: !133, line: 381, baseType: !5, size: 1, offset: 32, flags: DIFlagBitField, extraData: i64 0)
!2194 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2174, file: !133, line: 382, baseType: !5, size: 1, offset: 33, flags: DIFlagBitField, extraData: i64 0)
!2195 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2174, file: !133, line: 383, baseType: !5, size: 1, offset: 34, flags: DIFlagBitField, extraData: i64 0)
!2196 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2174, file: !133, line: 384, baseType: !5, size: 1, offset: 35, flags: DIFlagBitField, extraData: i64 0)
!2197 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2174, file: !133, line: 385, baseType: !5, size: 1, offset: 36, flags: DIFlagBitField, extraData: i64 0)
!2198 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2174, file: !133, line: 386, baseType: !5, size: 1, offset: 37, flags: DIFlagBitField, extraData: i64 0)
!2199 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2174, file: !133, line: 387, baseType: !5, size: 1, offset: 38, flags: DIFlagBitField, extraData: i64 0)
!2200 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2174, file: !133, line: 388, baseType: !5, size: 1, offset: 39, flags: DIFlagBitField, extraData: i64 0)
!2201 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2174, file: !133, line: 390, baseType: !5, size: 1, offset: 40, flags: DIFlagBitField, extraData: i64 0)
!2202 = !DIDerivedType(tag: DW_TAG_member, name: "packed_flag", scope: !2174, file: !133, line: 391, baseType: !5, size: 1, offset: 41, flags: DIFlagBitField, extraData: i64 0)
!2203 = !DIDerivedType(tag: DW_TAG_member, name: "user_align", scope: !2174, file: !133, line: 392, baseType: !5, size: 1, offset: 42, flags: DIFlagBitField, extraData: i64 0)
!2204 = !DIDerivedType(tag: DW_TAG_member, name: "spare", scope: !2174, file: !133, line: 394, baseType: !5, size: 13, offset: 43, flags: DIFlagBitField, extraData: i64 0)
!2205 = !DIDerivedType(tag: DW_TAG_member, name: "address_space", scope: !2174, file: !133, line: 399, baseType: !5, size: 8, offset: 56, flags: DIFlagBitField, extraData: i64 0)
!2206 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2171, file: !133, line: 3373, baseType: !2207, size: 192)
!2207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_common", file: !133, line: 402, size: 192, elements: !2208)
!2208 = !{!2209, !2210, !2211}
!2209 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2207, file: !133, line: 403, baseType: !2174, size: 64)
!2210 = !DIDerivedType(tag: DW_TAG_member, name: "chain", scope: !2207, file: !133, line: 404, baseType: !2168, size: 64, offset: 64)
!2211 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !2207, file: !133, line: 405, baseType: !2168, size: 64, offset: 128)
!2212 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2171, file: !133, line: 3374, baseType: !2213, size: 320)
!2213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_int_cst", file: !133, line: 1384, size: 320, elements: !2214)
!2214 = !{!2215, !2216}
!2215 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2213, file: !133, line: 1385, baseType: !2207, size: 192)
!2216 = !DIDerivedType(tag: DW_TAG_member, name: "int_cst", scope: !2213, file: !133, line: 1386, baseType: !2217, size: 128, offset: 192)
!2217 = !DIDerivedType(tag: DW_TAG_typedef, name: "double_int", file: !2218, line: 58, baseType: !2219)
!2218 = !DIFile(filename: "./double-int.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2219 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !2218, line: 54, size: 128, elements: !2220)
!2220 = !{!2221, !2222}
!2221 = !DIDerivedType(tag: DW_TAG_member, name: "low", scope: !2219, file: !2218, line: 56, baseType: !2162, size: 64)
!2222 = !DIDerivedType(tag: DW_TAG_member, name: "high", scope: !2219, file: !2218, line: 57, baseType: !2223, size: 64, offset: 64)
!2223 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!2224 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst", scope: !2171, file: !133, line: 3375, baseType: !2225, size: 256)
!2225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_real_cst", file: !133, line: 1397, size: 256, elements: !2226)
!2226 = !{!2227, !2228}
!2227 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2225, file: !133, line: 1398, baseType: !2207, size: 192)
!2228 = !DIDerivedType(tag: DW_TAG_member, name: "real_cst_ptr", scope: !2225, file: !133, line: 1399, baseType: !2229, size: 64, offset: 192)
!2229 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2230, size: 64)
!2230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "real_value", file: !2231, line: 52, size: 256, elements: !2232)
!2231 = !DIFile(filename: "./real.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2232 = !{!2233, !2234, !2235, !2236, !2237, !2238, !2239}
!2233 = !DIDerivedType(tag: DW_TAG_member, name: "cl", scope: !2230, file: !2231, line: 56, baseType: !5, size: 2, flags: DIFlagBitField, extraData: i64 0)
!2234 = !DIDerivedType(tag: DW_TAG_member, name: "decimal", scope: !2230, file: !2231, line: 57, baseType: !5, size: 1, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2235 = !DIDerivedType(tag: DW_TAG_member, name: "sign", scope: !2230, file: !2231, line: 58, baseType: !5, size: 1, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!2236 = !DIDerivedType(tag: DW_TAG_member, name: "signalling", scope: !2230, file: !2231, line: 59, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2237 = !DIDerivedType(tag: DW_TAG_member, name: "canonical", scope: !2230, file: !2231, line: 60, baseType: !5, size: 1, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2238 = !DIDerivedType(tag: DW_TAG_member, name: "uexp", scope: !2230, file: !2231, line: 61, baseType: !5, size: 26, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!2239 = !DIDerivedType(tag: DW_TAG_member, name: "sig", scope: !2230, file: !2231, line: 62, baseType: !2240, size: 192, offset: 64)
!2240 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2162, size: 192, elements: !2241)
!2241 = !{!2242}
!2242 = !DISubrange(count: 3)
!2243 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst", scope: !2171, file: !133, line: 3376, baseType: !2244, size: 256)
!2244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_fixed_cst", file: !133, line: 1408, size: 256, elements: !2245)
!2245 = !{!2246, !2247}
!2246 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2244, file: !133, line: 1409, baseType: !2207, size: 192)
!2247 = !DIDerivedType(tag: DW_TAG_member, name: "fixed_cst_ptr", scope: !2244, file: !133, line: 1410, baseType: !2248, size: 64, offset: 192)
!2248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2249, size: 64)
!2249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fixed_value", file: !2250, line: 27, size: 192, elements: !2251)
!2250 = !DIFile(filename: "./fixed-value.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2251 = !{!2252, !2253}
!2252 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !2249, file: !2250, line: 29, baseType: !2217, size: 128)
!2253 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2249, file: !2250, line: 30, baseType: !3, size: 32, offset: 128)
!2254 = !DIDerivedType(tag: DW_TAG_member, name: "vector", scope: !2171, file: !133, line: 3377, baseType: !2255, size: 256)
!2255 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_vector", file: !133, line: 1437, size: 256, elements: !2256)
!2256 = !{!2257, !2258}
!2257 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2255, file: !133, line: 1438, baseType: !2207, size: 192)
!2258 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2255, file: !133, line: 1439, baseType: !2168, size: 64, offset: 192)
!2259 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2171, file: !133, line: 3378, baseType: !2260, size: 256)
!2260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_string", file: !133, line: 1418, size: 256, elements: !2261)
!2261 = !{!2262, !2263, !2264}
!2262 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2260, file: !133, line: 1419, baseType: !2207, size: 192)
!2263 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !2260, file: !133, line: 1420, baseType: !2155, size: 32, offset: 192)
!2264 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2260, file: !133, line: 1421, baseType: !2265, size: 8, offset: 224)
!2265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2158, size: 8, elements: !2266)
!2266 = !{!2267}
!2267 = !DISubrange(count: 1)
!2268 = !DIDerivedType(tag: DW_TAG_member, name: "complex", scope: !2171, file: !133, line: 3379, baseType: !2269, size: 320)
!2269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_complex", file: !133, line: 1428, size: 320, elements: !2270)
!2270 = !{!2271, !2272, !2273}
!2271 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2269, file: !133, line: 1429, baseType: !2207, size: 192)
!2272 = !DIDerivedType(tag: DW_TAG_member, name: "real", scope: !2269, file: !133, line: 1430, baseType: !2168, size: 64, offset: 192)
!2273 = !DIDerivedType(tag: DW_TAG_member, name: "imag", scope: !2269, file: !133, line: 1431, baseType: !2168, size: 64, offset: 256)
!2274 = !DIDerivedType(tag: DW_TAG_member, name: "identifier", scope: !2171, file: !133, line: 3380, baseType: !2275, size: 320)
!2275 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_identifier", file: !133, line: 1460, size: 320, elements: !2276)
!2276 = !{!2277, !2278}
!2277 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2275, file: !133, line: 1461, baseType: !2207, size: 192)
!2278 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !2275, file: !133, line: 1462, baseType: !2279, size: 128, offset: 192)
!2279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ht_identifier", file: !2280, line: 31, size: 128, elements: !2281)
!2280 = !DIFile(filename: "./symtab.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2281 = !{!2282, !2285, !2286}
!2282 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !2279, file: !2280, line: 32, baseType: !2283, size: 64)
!2283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2284, size: 64)
!2284 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !2154)
!2285 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !2279, file: !2280, line: 33, baseType: !5, size: 32, offset: 64)
!2286 = !DIDerivedType(tag: DW_TAG_member, name: "hash_value", scope: !2279, file: !2280, line: 34, baseType: !5, size: 32, offset: 96)
!2287 = !DIDerivedType(tag: DW_TAG_member, name: "decl_minimal", scope: !2171, file: !133, line: 3381, baseType: !2288, size: 384)
!2288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_minimal", file: !133, line: 2507, size: 384, elements: !2289)
!2289 = !{!2290, !2291, !2294, !2295, !2296}
!2290 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2288, file: !133, line: 2508, baseType: !2207, size: 192)
!2291 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2288, file: !133, line: 2509, baseType: !2292, size: 32, offset: 192)
!2292 = !DIDerivedType(tag: DW_TAG_typedef, name: "location_t", file: !2293, line: 58, baseType: !2166)
!2293 = !DIFile(filename: "./input.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2294 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2288, file: !133, line: 2510, baseType: !5, size: 32, offset: 224)
!2295 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2288, file: !133, line: 2511, baseType: !2168, size: 64, offset: 256)
!2296 = !DIDerivedType(tag: DW_TAG_member, name: "context", scope: !2288, file: !133, line: 2512, baseType: !2168, size: 64, offset: 320)
!2297 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common", scope: !2171, file: !133, line: 3382, baseType: !2298, size: 896)
!2298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_common", file: !133, line: 2652, size: 896, elements: !2299)
!2299 = !{!2300, !2301, !2302, !2303, !2304, !2305, !2306, !2307, !2308, !2309, !2310, !2311, !2312, !2313, !2314, !2315, !2316, !2317, !2318, !2319, !2320, !2321, !2322, !2323, !2324, !2325, !2326, !2327, !2328, !2329, !2330, !2331, !2332}
!2300 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2298, file: !133, line: 2653, baseType: !2288, size: 384)
!2301 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2298, file: !133, line: 2654, baseType: !2168, size: 64, offset: 384)
!2302 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2298, file: !133, line: 2656, baseType: !5, size: 8, offset: 448, flags: DIFlagBitField, extraData: i64 448)
!2303 = !DIDerivedType(tag: DW_TAG_member, name: "nonlocal_flag", scope: !2298, file: !133, line: 2658, baseType: !5, size: 1, offset: 456, flags: DIFlagBitField, extraData: i64 448)
!2304 = !DIDerivedType(tag: DW_TAG_member, name: "virtual_flag", scope: !2298, file: !133, line: 2659, baseType: !5, size: 1, offset: 457, flags: DIFlagBitField, extraData: i64 448)
!2305 = !DIDerivedType(tag: DW_TAG_member, name: "ignored_flag", scope: !2298, file: !133, line: 2660, baseType: !5, size: 1, offset: 458, flags: DIFlagBitField, extraData: i64 448)
!2306 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_flag", scope: !2298, file: !133, line: 2661, baseType: !5, size: 1, offset: 459, flags: DIFlagBitField, extraData: i64 448)
!2307 = !DIDerivedType(tag: DW_TAG_member, name: "artificial_flag", scope: !2298, file: !133, line: 2662, baseType: !5, size: 1, offset: 460, flags: DIFlagBitField, extraData: i64 448)
!2308 = !DIDerivedType(tag: DW_TAG_member, name: "preserve_flag", scope: !2298, file: !133, line: 2663, baseType: !5, size: 1, offset: 461, flags: DIFlagBitField, extraData: i64 448)
!2309 = !DIDerivedType(tag: DW_TAG_member, name: "debug_expr_is_from", scope: !2298, file: !133, line: 2664, baseType: !5, size: 1, offset: 462, flags: DIFlagBitField, extraData: i64 448)
!2310 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_0", scope: !2298, file: !133, line: 2666, baseType: !5, size: 1, offset: 463, flags: DIFlagBitField, extraData: i64 448)
!2311 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_1", scope: !2298, file: !133, line: 2667, baseType: !5, size: 1, offset: 464, flags: DIFlagBitField, extraData: i64 448)
!2312 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_2", scope: !2298, file: !133, line: 2668, baseType: !5, size: 1, offset: 465, flags: DIFlagBitField, extraData: i64 448)
!2313 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_3", scope: !2298, file: !133, line: 2669, baseType: !5, size: 1, offset: 466, flags: DIFlagBitField, extraData: i64 448)
!2314 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_4", scope: !2298, file: !133, line: 2670, baseType: !5, size: 1, offset: 467, flags: DIFlagBitField, extraData: i64 448)
!2315 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_5", scope: !2298, file: !133, line: 2671, baseType: !5, size: 1, offset: 468, flags: DIFlagBitField, extraData: i64 448)
!2316 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_6", scope: !2298, file: !133, line: 2672, baseType: !5, size: 1, offset: 469, flags: DIFlagBitField, extraData: i64 448)
!2317 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_7", scope: !2298, file: !133, line: 2673, baseType: !5, size: 1, offset: 470, flags: DIFlagBitField, extraData: i64 448)
!2318 = !DIDerivedType(tag: DW_TAG_member, name: "lang_flag_8", scope: !2298, file: !133, line: 2674, baseType: !5, size: 1, offset: 471, flags: DIFlagBitField, extraData: i64 448)
!2319 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_0", scope: !2298, file: !133, line: 2678, baseType: !5, size: 1, offset: 472, flags: DIFlagBitField, extraData: i64 448)
!2320 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_1", scope: !2298, file: !133, line: 2682, baseType: !5, size: 1, offset: 473, flags: DIFlagBitField, extraData: i64 448)
!2321 = !DIDerivedType(tag: DW_TAG_member, name: "decl_flag_2", scope: !2298, file: !133, line: 2685, baseType: !5, size: 1, offset: 474, flags: DIFlagBitField, extraData: i64 448)
!2322 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_reg_flag", scope: !2298, file: !133, line: 2688, baseType: !5, size: 1, offset: 475, flags: DIFlagBitField, extraData: i64 448)
!2323 = !DIDerivedType(tag: DW_TAG_member, name: "decl_by_reference_flag", scope: !2298, file: !133, line: 2690, baseType: !5, size: 1, offset: 476, flags: DIFlagBitField, extraData: i64 448)
!2324 = !DIDerivedType(tag: DW_TAG_member, name: "decl_restricted_flag", scope: !2298, file: !133, line: 2692, baseType: !5, size: 1, offset: 477, flags: DIFlagBitField, extraData: i64 448)
!2325 = !DIDerivedType(tag: DW_TAG_member, name: "decl_common_unused", scope: !2298, file: !133, line: 2695, baseType: !5, size: 2, offset: 478, flags: DIFlagBitField, extraData: i64 448)
!2326 = !DIDerivedType(tag: DW_TAG_member, name: "off_align", scope: !2298, file: !133, line: 2698, baseType: !5, size: 8, offset: 480, flags: DIFlagBitField, extraData: i64 448)
!2327 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2298, file: !133, line: 2703, baseType: !5, size: 32, offset: 512)
!2328 = !DIDerivedType(tag: DW_TAG_member, name: "size_unit", scope: !2298, file: !133, line: 2705, baseType: !2168, size: 64, offset: 576)
!2329 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2298, file: !133, line: 2706, baseType: !2168, size: 64, offset: 640)
!2330 = !DIDerivedType(tag: DW_TAG_member, name: "attributes", scope: !2298, file: !133, line: 2707, baseType: !2168, size: 64, offset: 704)
!2331 = !DIDerivedType(tag: DW_TAG_member, name: "abstract_origin", scope: !2298, file: !133, line: 2708, baseType: !2168, size: 64, offset: 768)
!2332 = !DIDerivedType(tag: DW_TAG_member, name: "lang_specific", scope: !2298, file: !133, line: 2711, baseType: !2333, size: 64, offset: 832)
!2333 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2334, size: 64)
!2334 = !DICompositeType(tag: DW_TAG_structure_type, name: "lang_decl", file: !133, line: 2711, flags: DIFlagFwdDecl)
!2335 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_rtl", scope: !2171, file: !133, line: 3383, baseType: !2336, size: 960)
!2336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_rtl", file: !133, line: 2756, size: 960, elements: !2337)
!2337 = !{!2338, !2339}
!2338 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2336, file: !133, line: 2757, baseType: !2298, size: 896)
!2339 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2336, file: !133, line: 2758, baseType: !2340, size: 64, offset: 896)
!2340 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtx", file: !2169, line: 50, baseType: !2341)
!2341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2342, size: 64)
!2342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtx_def", file: !447, line: 240, size: 384, elements: !2343)
!2343 = !{!2344, !2345, !2346, !2347, !2348, !2349, !2350, !2351, !2352, !2353, !2354}
!2344 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2342, file: !447, line: 242, baseType: !5, size: 16, flags: DIFlagBitField, extraData: i64 0)
!2345 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !2342, file: !447, line: 245, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2346 = !DIDerivedType(tag: DW_TAG_member, name: "jump", scope: !2342, file: !447, line: 252, baseType: !5, size: 1, offset: 24, flags: DIFlagBitField, extraData: i64 0)
!2347 = !DIDerivedType(tag: DW_TAG_member, name: "call", scope: !2342, file: !447, line: 257, baseType: !5, size: 1, offset: 25, flags: DIFlagBitField, extraData: i64 0)
!2348 = !DIDerivedType(tag: DW_TAG_member, name: "unchanging", scope: !2342, file: !447, line: 265, baseType: !5, size: 1, offset: 26, flags: DIFlagBitField, extraData: i64 0)
!2349 = !DIDerivedType(tag: DW_TAG_member, name: "volatil", scope: !2342, file: !447, line: 277, baseType: !5, size: 1, offset: 27, flags: DIFlagBitField, extraData: i64 0)
!2350 = !DIDerivedType(tag: DW_TAG_member, name: "in_struct", scope: !2342, file: !447, line: 291, baseType: !5, size: 1, offset: 28, flags: DIFlagBitField, extraData: i64 0)
!2351 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2342, file: !447, line: 298, baseType: !5, size: 1, offset: 29, flags: DIFlagBitField, extraData: i64 0)
!2352 = !DIDerivedType(tag: DW_TAG_member, name: "frame_related", scope: !2342, file: !447, line: 305, baseType: !5, size: 1, offset: 30, flags: DIFlagBitField, extraData: i64 0)
!2353 = !DIDerivedType(tag: DW_TAG_member, name: "return_val", scope: !2342, file: !447, line: 310, baseType: !5, size: 1, offset: 31, flags: DIFlagBitField, extraData: i64 0)
!2354 = !DIDerivedType(tag: DW_TAG_member, name: "u", scope: !2342, file: !447, line: 321, baseType: !2355, size: 320, offset: 64)
!2355 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "u", file: !447, line: 315, size: 320, elements: !2356)
!2356 = !{!2357, !2809, !2811, !2840, !2841}
!2357 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2355, file: !447, line: 316, baseType: !2358, size: 64)
!2358 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2359, size: 64, elements: !2266)
!2359 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtunion", file: !447, line: 183, baseType: !2360)
!2360 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "rtunion_def", file: !447, line: 166, size: 64, elements: !2361)
!2361 = !{!2362, !2363, !2364, !2365, !2366, !2374, !2375, !2387, !2390, !2450, !2451, !2786, !2799, !2806}
!2362 = !DIDerivedType(tag: DW_TAG_member, name: "rt_int", scope: !2360, file: !447, line: 168, baseType: !2155, size: 32)
!2363 = !DIDerivedType(tag: DW_TAG_member, name: "rt_uint", scope: !2360, file: !447, line: 169, baseType: !5, size: 32)
!2364 = !DIDerivedType(tag: DW_TAG_member, name: "rt_str", scope: !2360, file: !447, line: 170, baseType: !2160, size: 64)
!2365 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtx", scope: !2360, file: !447, line: 171, baseType: !2340, size: 64)
!2366 = !DIDerivedType(tag: DW_TAG_member, name: "rt_rtvec", scope: !2360, file: !447, line: 172, baseType: !2367, size: 64)
!2367 = !DIDerivedType(tag: DW_TAG_typedef, name: "rtvec", file: !2169, line: 53, baseType: !2368)
!2368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2369, size: 64)
!2369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtvec_def", file: !447, line: 359, size: 128, elements: !2370)
!2370 = !{!2371, !2372}
!2371 = !DIDerivedType(tag: DW_TAG_member, name: "num_elem", scope: !2369, file: !447, line: 360, baseType: !2155, size: 32)
!2372 = !DIDerivedType(tag: DW_TAG_member, name: "elem", scope: !2369, file: !447, line: 361, baseType: !2373, size: 64, offset: 64)
!2373 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2340, size: 64, elements: !2266)
!2374 = !DIDerivedType(tag: DW_TAG_member, name: "rt_type", scope: !2360, file: !447, line: 173, baseType: !3, size: 32)
!2375 = !DIDerivedType(tag: DW_TAG_member, name: "rt_addr_diff_vec_flags", scope: !2360, file: !447, line: 174, baseType: !2376, size: 32)
!2376 = !DIDerivedType(tag: DW_TAG_typedef, name: "addr_diff_vec_flags", file: !447, line: 133, baseType: !2377)
!2377 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !447, line: 115, size: 32, elements: !2378)
!2378 = !{!2379, !2380, !2381, !2382, !2383, !2384, !2385, !2386}
!2379 = !DIDerivedType(tag: DW_TAG_member, name: "min_align", scope: !2377, file: !447, line: 118, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2380 = !DIDerivedType(tag: DW_TAG_member, name: "base_after_vec", scope: !2377, file: !447, line: 120, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2381 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_vec", scope: !2377, file: !447, line: 121, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2382 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_vec", scope: !2377, file: !447, line: 123, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2383 = !DIDerivedType(tag: DW_TAG_member, name: "min_after_base", scope: !2377, file: !447, line: 125, baseType: !5, size: 1, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2384 = !DIDerivedType(tag: DW_TAG_member, name: "max_after_base", scope: !2377, file: !447, line: 127, baseType: !5, size: 1, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!2385 = !DIDerivedType(tag: DW_TAG_member, name: "offset_unsigned", scope: !2377, file: !447, line: 130, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2386 = !DIDerivedType(tag: DW_TAG_member, name: "scale", scope: !2377, file: !447, line: 132, baseType: !5, size: 8, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2387 = !DIDerivedType(tag: DW_TAG_member, name: "rt_cselib", scope: !2360, file: !447, line: 175, baseType: !2388, size: 64)
!2388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2389, size: 64)
!2389 = !DICompositeType(tag: DW_TAG_structure_type, name: "cselib_val_struct", file: !447, line: 175, flags: DIFlagFwdDecl)
!2390 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bit", scope: !2360, file: !447, line: 176, baseType: !2391, size: 64)
!2391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2392, size: 64)
!2392 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_head_def", file: !2393, line: 75, size: 256, elements: !2394)
!2393 = !DIFile(filename: "./bitmap.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2394 = !{!2395, !2409, !2410, !2411}
!2395 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2392, file: !2393, line: 76, baseType: !2396, size: 64)
!2396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2397, size: 64)
!2397 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_element", file: !2393, line: 68, baseType: !2398)
!2398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_element_def", file: !2393, line: 63, size: 320, elements: !2399)
!2399 = !{!2400, !2402, !2403, !2404}
!2400 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2398, file: !2393, line: 64, baseType: !2401, size: 64)
!2401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2398, size: 64)
!2402 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2398, file: !2393, line: 65, baseType: !2401, size: 64, offset: 64)
!2403 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2398, file: !2393, line: 66, baseType: !5, size: 32, offset: 128)
!2404 = !DIDerivedType(tag: DW_TAG_member, name: "bits", scope: !2398, file: !2393, line: 67, baseType: !2405, size: 128, offset: 192)
!2405 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2406, size: 128, elements: !2407)
!2406 = !DIDerivedType(tag: DW_TAG_typedef, name: "BITMAP_WORD", file: !2393, line: 29, baseType: !2162)
!2407 = !{!2408}
!2408 = !DISubrange(count: 2)
!2409 = !DIDerivedType(tag: DW_TAG_member, name: "current", scope: !2392, file: !2393, line: 77, baseType: !2396, size: 64, offset: 64)
!2410 = !DIDerivedType(tag: DW_TAG_member, name: "indx", scope: !2392, file: !2393, line: 78, baseType: !5, size: 32, offset: 128)
!2411 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2392, file: !2393, line: 79, baseType: !2412, size: 64, offset: 192)
!2412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2413, size: 64)
!2413 = !DIDerivedType(tag: DW_TAG_typedef, name: "bitmap_obstack", file: !2393, line: 49, baseType: !2414)
!2414 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bitmap_obstack", file: !2393, line: 45, size: 832, elements: !2415)
!2415 = !{!2416, !2417, !2418}
!2416 = !DIDerivedType(tag: DW_TAG_member, name: "elements", scope: !2414, file: !2393, line: 46, baseType: !2401, size: 64)
!2417 = !DIDerivedType(tag: DW_TAG_member, name: "heads", scope: !2414, file: !2393, line: 47, baseType: !2391, size: 64, offset: 64)
!2418 = !DIDerivedType(tag: DW_TAG_member, name: "obstack", scope: !2414, file: !2393, line: 48, baseType: !2419, size: 704, offset: 128)
!2419 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "obstack", file: !2420, line: 164, size: 704, elements: !2421)
!2420 = !DIFile(filename: "./include/obstack.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2421 = !{!2422, !2423, !2433, !2434, !2435, !2436, !2437, !2438, !2442, !2446, !2447, !2448, !2449}
!2422 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_size", scope: !2419, file: !2420, line: 166, baseType: !2223, size: 64)
!2423 = !DIDerivedType(tag: DW_TAG_member, name: "chunk", scope: !2419, file: !2420, line: 167, baseType: !2424, size: 64, offset: 64)
!2424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2425, size: 64)
!2425 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_obstack_chunk", file: !2420, line: 157, size: 192, elements: !2426)
!2426 = !{!2427, !2428, !2429}
!2427 = !DIDerivedType(tag: DW_TAG_member, name: "limit", scope: !2425, file: !2420, line: 159, baseType: !2157, size: 64)
!2428 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2425, file: !2420, line: 160, baseType: !2424, size: 64, offset: 64)
!2429 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !2425, file: !2420, line: 161, baseType: !2430, size: 32, offset: 128)
!2430 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2158, size: 32, elements: !2431)
!2431 = !{!2432}
!2432 = !DISubrange(count: 4)
!2433 = !DIDerivedType(tag: DW_TAG_member, name: "object_base", scope: !2419, file: !2420, line: 168, baseType: !2157, size: 64, offset: 128)
!2434 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2419, file: !2420, line: 169, baseType: !2157, size: 64, offset: 192)
!2435 = !DIDerivedType(tag: DW_TAG_member, name: "chunk_limit", scope: !2419, file: !2420, line: 170, baseType: !2157, size: 64, offset: 256)
!2436 = !DIDerivedType(tag: DW_TAG_member, name: "temp", scope: !2419, file: !2420, line: 171, baseType: !2223, size: 64, offset: 320)
!2437 = !DIDerivedType(tag: DW_TAG_member, name: "alignment_mask", scope: !2419, file: !2420, line: 172, baseType: !2155, size: 32, offset: 384)
!2438 = !DIDerivedType(tag: DW_TAG_member, name: "chunkfun", scope: !2419, file: !2420, line: 176, baseType: !2439, size: 64, offset: 448)
!2439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2440, size: 64)
!2440 = !DISubroutineType(types: !2441)
!2441 = !{!2424, !2159, !2223}
!2442 = !DIDerivedType(tag: DW_TAG_member, name: "freefun", scope: !2419, file: !2420, line: 177, baseType: !2443, size: 64, offset: 512)
!2443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2444, size: 64)
!2444 = !DISubroutineType(types: !2445)
!2445 = !{null, !2159, !2424}
!2446 = !DIDerivedType(tag: DW_TAG_member, name: "extra_arg", scope: !2419, file: !2420, line: 178, baseType: !2159, size: 64, offset: 576)
!2447 = !DIDerivedType(tag: DW_TAG_member, name: "use_extra_arg", scope: !2419, file: !2420, line: 179, baseType: !5, size: 1, offset: 640, flags: DIFlagBitField, extraData: i64 640)
!2448 = !DIDerivedType(tag: DW_TAG_member, name: "maybe_empty_object", scope: !2419, file: !2420, line: 180, baseType: !5, size: 1, offset: 641, flags: DIFlagBitField, extraData: i64 640)
!2449 = !DIDerivedType(tag: DW_TAG_member, name: "alloc_failed", scope: !2419, file: !2420, line: 184, baseType: !5, size: 1, offset: 642, flags: DIFlagBitField, extraData: i64 640)
!2450 = !DIDerivedType(tag: DW_TAG_member, name: "rt_tree", scope: !2360, file: !447, line: 177, baseType: !2168, size: 64)
!2451 = !DIDerivedType(tag: DW_TAG_member, name: "rt_bb", scope: !2360, file: !447, line: 178, baseType: !2452, size: 64)
!2452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2453, size: 64)
!2453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "basic_block_def", file: !341, line: 217, size: 832, elements: !2454)
!2454 = !{!2455, !2698, !2699, !2700, !2756, !2760, !2761, !2762, !2780, !2781, !2782, !2783, !2784, !2785}
!2455 = !DIDerivedType(tag: DW_TAG_member, name: "preds", scope: !2453, file: !341, line: 219, baseType: !2456, size: 64)
!2456 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2457, size: 64)
!2457 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_gc", file: !341, line: 151, baseType: !2458)
!2458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_gc", file: !341, line: 151, size: 128, elements: !2459)
!2459 = !{!2460}
!2460 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2458, file: !341, line: 151, baseType: !2461, size: 128)
!2461 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_edge_base", file: !341, line: 150, baseType: !2462)
!2462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_edge_base", file: !341, line: 150, size: 128, elements: !2463)
!2463 = !{!2464, !2465, !2466}
!2464 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2462, file: !341, line: 150, baseType: !5, size: 32)
!2465 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2462, file: !341, line: 150, baseType: !5, size: 32, offset: 32)
!2466 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2462, file: !341, line: 150, baseType: !2467, size: 64, offset: 64)
!2467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2468, size: 64, elements: !2266)
!2468 = !DIDerivedType(tag: DW_TAG_typedef, name: "edge", file: !2169, line: 108, baseType: !2469)
!2469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2470, size: 64)
!2470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "edge_def", file: !341, line: 122, size: 512, elements: !2471)
!2471 = !{!2472, !2473, !2474, !2690, !2691, !2692, !2693, !2694, !2695, !2696}
!2472 = !DIDerivedType(tag: DW_TAG_member, name: "src", scope: !2470, file: !341, line: 124, baseType: !2452, size: 64)
!2473 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !2470, file: !341, line: 125, baseType: !2452, size: 64, offset: 64)
!2474 = !DIDerivedType(tag: DW_TAG_member, name: "insns", scope: !2470, file: !341, line: 131, baseType: !2475, size: 64, offset: 128)
!2475 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "edge_def_insns", file: !341, line: 128, size: 64, elements: !2476)
!2476 = !{!2477, !2689}
!2477 = !DIDerivedType(tag: DW_TAG_member, name: "g", scope: !2475, file: !341, line: 129, baseType: !2478, size: 64)
!2478 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq", file: !2169, line: 66, baseType: !2479)
!2479 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2480, size: 64)
!2480 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_d", file: !2082, line: 143, size: 192, elements: !2481)
!2481 = !{!2482, !2687, !2688}
!2482 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !2480, file: !2082, line: 145, baseType: !2483, size: 64)
!2483 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple_seq_node", file: !2169, line: 69, baseType: !2484)
!2484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2485, size: 64)
!2485 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_seq_node_d", file: !2082, line: 136, size: 192, elements: !2486)
!2486 = !{!2487, !2685, !2686}
!2487 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2485, file: !2082, line: 137, baseType: !2488, size: 64)
!2488 = !DIDerivedType(tag: DW_TAG_typedef, name: "gimple", file: !2169, line: 58, baseType: !2489)
!2489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2490, size: 64)
!2490 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "gimple_statement_d", file: !2082, line: 737, size: 768, elements: !2491)
!2491 = !{!2492, !2509, !2542, !2548, !2553, !2558, !2565, !2571, !2577, !2582, !2596, !2601, !2607, !2612, !2622, !2627, !2643, !2650, !2657, !2663, !2668, !2674, !2680}
!2492 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2490, file: !2082, line: 738, baseType: !2493, size: 256)
!2493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_base", file: !2082, line: 271, size: 256, elements: !2494)
!2494 = !{!2495, !2496, !2497, !2498, !2499, !2500, !2501, !2502, !2503, !2504, !2505, !2506, !2507, !2508}
!2495 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !2493, file: !2082, line: 274, baseType: !5, size: 8, flags: DIFlagBitField, extraData: i64 0)
!2496 = !DIDerivedType(tag: DW_TAG_member, name: "no_warning", scope: !2493, file: !2082, line: 277, baseType: !5, size: 1, offset: 8, flags: DIFlagBitField, extraData: i64 0)
!2497 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2493, file: !2082, line: 281, baseType: !5, size: 1, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!2498 = !DIDerivedType(tag: DW_TAG_member, name: "nontemporal_move", scope: !2493, file: !2082, line: 284, baseType: !5, size: 1, offset: 10, flags: DIFlagBitField, extraData: i64 0)
!2499 = !DIDerivedType(tag: DW_TAG_member, name: "plf", scope: !2493, file: !2082, line: 291, baseType: !5, size: 2, offset: 11, flags: DIFlagBitField, extraData: i64 0)
!2500 = !DIDerivedType(tag: DW_TAG_member, name: "modified", scope: !2493, file: !2082, line: 295, baseType: !5, size: 1, offset: 13, flags: DIFlagBitField, extraData: i64 0)
!2501 = !DIDerivedType(tag: DW_TAG_member, name: "has_volatile_ops", scope: !2493, file: !2082, line: 298, baseType: !5, size: 1, offset: 14, flags: DIFlagBitField, extraData: i64 0)
!2502 = !DIDerivedType(tag: DW_TAG_member, name: "pad", scope: !2493, file: !2082, line: 301, baseType: !5, size: 1, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!2503 = !DIDerivedType(tag: DW_TAG_member, name: "subcode", scope: !2493, file: !2082, line: 307, baseType: !5, size: 16, offset: 16, flags: DIFlagBitField, extraData: i64 0)
!2504 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !2493, file: !2082, line: 312, baseType: !5, size: 32, offset: 32)
!2505 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !2493, file: !2082, line: 316, baseType: !2292, size: 32, offset: 64)
!2506 = !DIDerivedType(tag: DW_TAG_member, name: "num_ops", scope: !2493, file: !2082, line: 319, baseType: !5, size: 32, offset: 96)
!2507 = !DIDerivedType(tag: DW_TAG_member, name: "bb", scope: !2493, file: !2082, line: 323, baseType: !2452, size: 64, offset: 128)
!2508 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2493, file: !2082, line: 327, baseType: !2168, size: 64, offset: 192)
!2509 = !DIDerivedType(tag: DW_TAG_member, name: "gsops", scope: !2490, file: !2082, line: 739, baseType: !2510, size: 448)
!2510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops", file: !2082, line: 350, size: 448, elements: !2511)
!2511 = !{!2512, !2540}
!2512 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !2510, file: !2082, line: 353, baseType: !2513, size: 384)
!2513 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_ops_base", file: !2082, line: 333, size: 384, elements: !2514)
!2514 = !{!2515, !2516, !2523}
!2515 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2513, file: !2082, line: 336, baseType: !2493, size: 256)
!2516 = !DIDerivedType(tag: DW_TAG_member, name: "def_ops", scope: !2513, file: !2082, line: 343, baseType: !2517, size: 64, offset: 256)
!2517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2518, size: 64)
!2518 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "def_optype_d", file: !440, line: 37, size: 128, elements: !2519)
!2519 = !{!2520, !2521}
!2520 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2518, file: !440, line: 39, baseType: !2517, size: 64)
!2521 = !DIDerivedType(tag: DW_TAG_member, name: "def_ptr", scope: !2518, file: !440, line: 40, baseType: !2522, size: 64, offset: 64)
!2522 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2168, size: 64)
!2523 = !DIDerivedType(tag: DW_TAG_member, name: "use_ops", scope: !2513, file: !2082, line: 344, baseType: !2524, size: 64, offset: 320)
!2524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2525, size: 64)
!2525 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "use_optype_d", file: !440, line: 45, size: 320, elements: !2526)
!2526 = !{!2527, !2528}
!2527 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2525, file: !440, line: 47, baseType: !2524, size: 64)
!2528 = !DIDerivedType(tag: DW_TAG_member, name: "use_ptr", scope: !2525, file: !440, line: 48, baseType: !2529, size: 256, offset: 64)
!2529 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ssa_use_operand_d", file: !133, line: 1883, size: 256, elements: !2530)
!2530 = !{!2531, !2533, !2534, !2539}
!2531 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2529, file: !133, line: 1884, baseType: !2532, size: 64)
!2532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2529, size: 64)
!2533 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2529, file: !133, line: 1885, baseType: !2532, size: 64, offset: 64)
!2534 = !DIDerivedType(tag: DW_TAG_member, name: "loc", scope: !2529, file: !133, line: 1891, baseType: !2535, size: 64, offset: 128)
!2535 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !2529, file: !133, line: 1891, size: 64, elements: !2536)
!2536 = !{!2537, !2538}
!2537 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2535, file: !133, line: 1891, baseType: !2488, size: 64)
!2538 = !DIDerivedType(tag: DW_TAG_member, name: "ssa_name", scope: !2535, file: !133, line: 1891, baseType: !2168, size: 64)
!2539 = !DIDerivedType(tag: DW_TAG_member, name: "use", scope: !2529, file: !133, line: 1892, baseType: !2522, size: 64, offset: 192)
!2540 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2510, file: !2082, line: 359, baseType: !2541, size: 64, offset: 384)
!2541 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2168, size: 64, elements: !2266)
!2542 = !DIDerivedType(tag: DW_TAG_member, name: "gsmembase", scope: !2490, file: !2082, line: 740, baseType: !2543, size: 512)
!2543 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops_base", file: !2082, line: 365, size: 512, elements: !2544)
!2544 = !{!2545, !2546, !2547}
!2545 = !DIDerivedType(tag: DW_TAG_member, name: "opbase", scope: !2543, file: !2082, line: 368, baseType: !2513, size: 384)
!2546 = !DIDerivedType(tag: DW_TAG_member, name: "vdef", scope: !2543, file: !2082, line: 373, baseType: !2168, size: 64, offset: 384)
!2547 = !DIDerivedType(tag: DW_TAG_member, name: "vuse", scope: !2543, file: !2082, line: 374, baseType: !2168, size: 64, offset: 448)
!2548 = !DIDerivedType(tag: DW_TAG_member, name: "gsmem", scope: !2490, file: !2082, line: 741, baseType: !2549, size: 576)
!2549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_with_memory_ops", file: !2082, line: 380, size: 576, elements: !2550)
!2550 = !{!2551, !2552}
!2551 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2549, file: !2082, line: 383, baseType: !2543, size: 512)
!2552 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2549, file: !2082, line: 389, baseType: !2541, size: 64, offset: 512)
!2553 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2490, file: !2082, line: 742, baseType: !2554, size: 320)
!2554 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp", file: !2082, line: 395, size: 320, elements: !2555)
!2555 = !{!2556, !2557}
!2556 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2554, file: !2082, line: 397, baseType: !2493, size: 256)
!2557 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2554, file: !2082, line: 400, baseType: !2478, size: 64, offset: 256)
!2558 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_bind", scope: !2490, file: !2082, line: 743, baseType: !2559, size: 448)
!2559 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_bind", file: !2082, line: 406, size: 448, elements: !2560)
!2560 = !{!2561, !2562, !2563, !2564}
!2561 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2559, file: !2082, line: 408, baseType: !2493, size: 256)
!2562 = !DIDerivedType(tag: DW_TAG_member, name: "vars", scope: !2559, file: !2082, line: 412, baseType: !2168, size: 64, offset: 256)
!2563 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2559, file: !2082, line: 420, baseType: !2168, size: 64, offset: 320)
!2564 = !DIDerivedType(tag: DW_TAG_member, name: "body", scope: !2559, file: !2082, line: 423, baseType: !2478, size: 64, offset: 384)
!2565 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_catch", scope: !2490, file: !2082, line: 744, baseType: !2566, size: 384)
!2566 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_catch", file: !2082, line: 429, size: 384, elements: !2567)
!2567 = !{!2568, !2569, !2570}
!2568 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2566, file: !2082, line: 431, baseType: !2493, size: 256)
!2569 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2566, file: !2082, line: 434, baseType: !2168, size: 64, offset: 256)
!2570 = !DIDerivedType(tag: DW_TAG_member, name: "handler", scope: !2566, file: !2082, line: 437, baseType: !2478, size: 64, offset: 320)
!2571 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_filter", scope: !2490, file: !2082, line: 745, baseType: !2572, size: 384)
!2572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_filter", file: !2082, line: 443, size: 384, elements: !2573)
!2573 = !{!2574, !2575, !2576}
!2574 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2572, file: !2082, line: 445, baseType: !2493, size: 256)
!2575 = !DIDerivedType(tag: DW_TAG_member, name: "types", scope: !2572, file: !2082, line: 449, baseType: !2168, size: 64, offset: 256)
!2576 = !DIDerivedType(tag: DW_TAG_member, name: "failure", scope: !2572, file: !2082, line: 453, baseType: !2478, size: 64, offset: 320)
!2577 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_mnt", scope: !2490, file: !2082, line: 746, baseType: !2578, size: 320)
!2578 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_mnt", file: !2082, line: 459, size: 320, elements: !2579)
!2579 = !{!2580, !2581}
!2580 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2578, file: !2082, line: 461, baseType: !2493, size: 256)
!2581 = !DIDerivedType(tag: DW_TAG_member, name: "fndecl", scope: !2578, file: !2082, line: 464, baseType: !2168, size: 64, offset: 256)
!2582 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_phi", scope: !2490, file: !2082, line: 747, baseType: !2583, size: 768)
!2583 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_phi", file: !2082, line: 469, size: 768, elements: !2584)
!2584 = !{!2585, !2586, !2587, !2588, !2589}
!2585 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2583, file: !2082, line: 471, baseType: !2493, size: 256)
!2586 = !DIDerivedType(tag: DW_TAG_member, name: "capacity", scope: !2583, file: !2082, line: 474, baseType: !5, size: 32, offset: 256)
!2587 = !DIDerivedType(tag: DW_TAG_member, name: "nargs", scope: !2583, file: !2082, line: 475, baseType: !5, size: 32, offset: 288)
!2588 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2583, file: !2082, line: 478, baseType: !2168, size: 64, offset: 320)
!2589 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !2583, file: !2082, line: 481, baseType: !2590, size: 384, offset: 384)
!2590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2591, size: 384, elements: !2266)
!2591 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "phi_arg_d", file: !133, line: 1917, size: 384, elements: !2592)
!2592 = !{!2593, !2594, !2595}
!2593 = !DIDerivedType(tag: DW_TAG_member, name: "imm_use", scope: !2591, file: !133, line: 1920, baseType: !2529, size: 256)
!2594 = !DIDerivedType(tag: DW_TAG_member, name: "def", scope: !2591, file: !133, line: 1921, baseType: !2168, size: 64, offset: 256)
!2595 = !DIDerivedType(tag: DW_TAG_member, name: "locus", scope: !2591, file: !133, line: 1922, baseType: !2292, size: 32, offset: 320)
!2596 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_eh_ctrl", scope: !2490, file: !2082, line: 748, baseType: !2597, size: 320)
!2597 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_eh_ctrl", file: !2082, line: 487, size: 320, elements: !2598)
!2598 = !{!2599, !2600}
!2599 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2597, file: !2082, line: 490, baseType: !2493, size: 256)
!2600 = !DIDerivedType(tag: DW_TAG_member, name: "region", scope: !2597, file: !2082, line: 494, baseType: !2155, size: 32, offset: 256)
!2601 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_try", scope: !2490, file: !2082, line: 749, baseType: !2602, size: 384)
!2602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_try", file: !2082, line: 500, size: 384, elements: !2603)
!2603 = !{!2604, !2605, !2606}
!2604 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2602, file: !2082, line: 502, baseType: !2493, size: 256)
!2605 = !DIDerivedType(tag: DW_TAG_member, name: "eval", scope: !2602, file: !2082, line: 506, baseType: !2478, size: 64, offset: 256)
!2606 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2602, file: !2082, line: 510, baseType: !2478, size: 64, offset: 320)
!2607 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_wce", scope: !2490, file: !2082, line: 750, baseType: !2608, size: 320)
!2608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_wce", file: !2082, line: 529, size: 320, elements: !2609)
!2609 = !{!2610, !2611}
!2610 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2608, file: !2082, line: 531, baseType: !2493, size: 256)
!2611 = !DIDerivedType(tag: DW_TAG_member, name: "cleanup", scope: !2608, file: !2082, line: 540, baseType: !2478, size: 64, offset: 256)
!2612 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_asm", scope: !2490, file: !2082, line: 751, baseType: !2613, size: 704)
!2613 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_asm", file: !2082, line: 546, size: 704, elements: !2614)
!2614 = !{!2615, !2616, !2617, !2618, !2619, !2620, !2621}
!2615 = !DIDerivedType(tag: DW_TAG_member, name: "membase", scope: !2613, file: !2082, line: 549, baseType: !2543, size: 512)
!2616 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !2613, file: !2082, line: 553, baseType: !2160, size: 64, offset: 512)
!2617 = !DIDerivedType(tag: DW_TAG_member, name: "ni", scope: !2613, file: !2082, line: 557, baseType: !2154, size: 8, offset: 576)
!2618 = !DIDerivedType(tag: DW_TAG_member, name: "no", scope: !2613, file: !2082, line: 558, baseType: !2154, size: 8, offset: 584)
!2619 = !DIDerivedType(tag: DW_TAG_member, name: "nc", scope: !2613, file: !2082, line: 559, baseType: !2154, size: 8, offset: 592)
!2620 = !DIDerivedType(tag: DW_TAG_member, name: "nl", scope: !2613, file: !2082, line: 560, baseType: !2154, size: 8, offset: 600)
!2621 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !2613, file: !2082, line: 566, baseType: !2541, size: 64, offset: 640)
!2622 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_critical", scope: !2490, file: !2082, line: 752, baseType: !2623, size: 384)
!2623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_critical", file: !2082, line: 571, size: 384, elements: !2624)
!2624 = !{!2625, !2626}
!2625 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2623, file: !2082, line: 573, baseType: !2554, size: 320)
!2626 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !2623, file: !2082, line: 577, baseType: !2168, size: 64, offset: 320)
!2627 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_for", scope: !2490, file: !2082, line: 753, baseType: !2628, size: 576)
!2628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_for", file: !2082, line: 600, size: 576, elements: !2629)
!2629 = !{!2630, !2631, !2632, !2633, !2642}
!2630 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2628, file: !2082, line: 602, baseType: !2554, size: 320)
!2631 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2628, file: !2082, line: 605, baseType: !2168, size: 64, offset: 320)
!2632 = !DIDerivedType(tag: DW_TAG_member, name: "collapse", scope: !2628, file: !2082, line: 609, baseType: !2163, size: 64, offset: 384)
!2633 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !2628, file: !2082, line: 612, baseType: !2634, size: 64, offset: 448)
!2634 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2635, size: 64)
!2635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_omp_for_iter", file: !2082, line: 581, size: 320, elements: !2636)
!2636 = !{!2637, !2638, !2639, !2640, !2641}
!2637 = !DIDerivedType(tag: DW_TAG_member, name: "cond", scope: !2635, file: !2082, line: 583, baseType: !132, size: 32)
!2638 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2635, file: !2082, line: 586, baseType: !2168, size: 64, offset: 64)
!2639 = !DIDerivedType(tag: DW_TAG_member, name: "initial", scope: !2635, file: !2082, line: 589, baseType: !2168, size: 64, offset: 128)
!2640 = !DIDerivedType(tag: DW_TAG_member, name: "final", scope: !2635, file: !2082, line: 592, baseType: !2168, size: 64, offset: 192)
!2641 = !DIDerivedType(tag: DW_TAG_member, name: "incr", scope: !2635, file: !2082, line: 595, baseType: !2168, size: 64, offset: 256)
!2642 = !DIDerivedType(tag: DW_TAG_member, name: "pre_body", scope: !2628, file: !2082, line: 616, baseType: !2478, size: 64, offset: 512)
!2643 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_parallel", scope: !2490, file: !2082, line: 754, baseType: !2644, size: 512)
!2644 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_parallel", file: !2082, line: 622, size: 512, elements: !2645)
!2645 = !{!2646, !2647, !2648, !2649}
!2646 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2644, file: !2082, line: 624, baseType: !2554, size: 320)
!2647 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2644, file: !2082, line: 628, baseType: !2168, size: 64, offset: 320)
!2648 = !DIDerivedType(tag: DW_TAG_member, name: "child_fn", scope: !2644, file: !2082, line: 632, baseType: !2168, size: 64, offset: 384)
!2649 = !DIDerivedType(tag: DW_TAG_member, name: "data_arg", scope: !2644, file: !2082, line: 636, baseType: !2168, size: 64, offset: 448)
!2650 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_task", scope: !2490, file: !2082, line: 755, baseType: !2651, size: 704)
!2651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_task", file: !2082, line: 642, size: 704, elements: !2652)
!2652 = !{!2653, !2654, !2655, !2656}
!2653 = !DIDerivedType(tag: DW_TAG_member, name: "par", scope: !2651, file: !2082, line: 644, baseType: !2644, size: 512)
!2654 = !DIDerivedType(tag: DW_TAG_member, name: "copy_fn", scope: !2651, file: !2082, line: 648, baseType: !2168, size: 64, offset: 512)
!2655 = !DIDerivedType(tag: DW_TAG_member, name: "arg_size", scope: !2651, file: !2082, line: 652, baseType: !2168, size: 64, offset: 576)
!2656 = !DIDerivedType(tag: DW_TAG_member, name: "arg_align", scope: !2651, file: !2082, line: 653, baseType: !2168, size: 64, offset: 640)
!2657 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_sections", scope: !2490, file: !2082, line: 756, baseType: !2658, size: 448)
!2658 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_sections", file: !2082, line: 663, size: 448, elements: !2659)
!2659 = !{!2660, !2661, !2662}
!2660 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2658, file: !2082, line: 665, baseType: !2554, size: 320)
!2661 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2658, file: !2082, line: 668, baseType: !2168, size: 64, offset: 320)
!2662 = !DIDerivedType(tag: DW_TAG_member, name: "control", scope: !2658, file: !2082, line: 673, baseType: !2168, size: 64, offset: 384)
!2663 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_single", scope: !2490, file: !2082, line: 757, baseType: !2664, size: 384)
!2664 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_single", file: !2082, line: 694, size: 384, elements: !2665)
!2665 = !{!2666, !2667}
!2666 = !DIDerivedType(tag: DW_TAG_member, name: "omp", scope: !2664, file: !2082, line: 696, baseType: !2554, size: 320)
!2667 = !DIDerivedType(tag: DW_TAG_member, name: "clauses", scope: !2664, file: !2082, line: 699, baseType: !2168, size: 64, offset: 320)
!2668 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_continue", scope: !2490, file: !2082, line: 758, baseType: !2669, size: 384)
!2669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_continue", file: !2082, line: 681, size: 384, elements: !2670)
!2670 = !{!2671, !2672, !2673}
!2671 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2669, file: !2082, line: 683, baseType: !2493, size: 256)
!2672 = !DIDerivedType(tag: DW_TAG_member, name: "control_def", scope: !2669, file: !2082, line: 686, baseType: !2168, size: 64, offset: 256)
!2673 = !DIDerivedType(tag: DW_TAG_member, name: "control_use", scope: !2669, file: !2082, line: 689, baseType: !2168, size: 64, offset: 320)
!2674 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_load", scope: !2490, file: !2082, line: 759, baseType: !2675, size: 384)
!2675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_load", file: !2082, line: 707, size: 384, elements: !2676)
!2676 = !{!2677, !2678, !2679}
!2677 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2675, file: !2082, line: 709, baseType: !2493, size: 256)
!2678 = !DIDerivedType(tag: DW_TAG_member, name: "rhs", scope: !2675, file: !2082, line: 712, baseType: !2168, size: 64, offset: 256)
!2679 = !DIDerivedType(tag: DW_TAG_member, name: "lhs", scope: !2675, file: !2082, line: 712, baseType: !2168, size: 64, offset: 320)
!2680 = !DIDerivedType(tag: DW_TAG_member, name: "gimple_omp_atomic_store", scope: !2490, file: !2082, line: 760, baseType: !2681, size: 320)
!2681 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_statement_omp_atomic_store", file: !2082, line: 718, size: 320, elements: !2682)
!2682 = !{!2683, !2684}
!2683 = !DIDerivedType(tag: DW_TAG_member, name: "gsbase", scope: !2681, file: !2082, line: 720, baseType: !2493, size: 256)
!2684 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !2681, file: !2082, line: 723, baseType: !2168, size: 64, offset: 256)
!2685 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2485, file: !2082, line: 138, baseType: !2484, size: 64, offset: 64)
!2686 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2485, file: !2082, line: 139, baseType: !2484, size: 64, offset: 128)
!2687 = !DIDerivedType(tag: DW_TAG_member, name: "last", scope: !2480, file: !2082, line: 146, baseType: !2483, size: 64, offset: 64)
!2688 = !DIDerivedType(tag: DW_TAG_member, name: "next_free", scope: !2480, file: !2082, line: 152, baseType: !2478, size: 64, offset: 128)
!2689 = !DIDerivedType(tag: DW_TAG_member, name: "r", scope: !2475, file: !341, line: 130, baseType: !2340, size: 64)
!2690 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2470, file: !341, line: 134, baseType: !2159, size: 64, offset: 192)
!2691 = !DIDerivedType(tag: DW_TAG_member, name: "goto_block", scope: !2470, file: !341, line: 137, baseType: !2168, size: 64, offset: 256)
!2692 = !DIDerivedType(tag: DW_TAG_member, name: "goto_locus", scope: !2470, file: !341, line: 138, baseType: !2292, size: 32, offset: 320)
!2693 = !DIDerivedType(tag: DW_TAG_member, name: "dest_idx", scope: !2470, file: !341, line: 142, baseType: !5, size: 32, offset: 352)
!2694 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2470, file: !341, line: 144, baseType: !2155, size: 32, offset: 384)
!2695 = !DIDerivedType(tag: DW_TAG_member, name: "probability", scope: !2470, file: !341, line: 145, baseType: !2155, size: 32, offset: 416)
!2696 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2470, file: !341, line: 146, baseType: !2697, size: 64, offset: 448)
!2697 = !DIDerivedType(tag: DW_TAG_typedef, name: "gcov_type", file: !341, line: 119, baseType: !2223)
!2698 = !DIDerivedType(tag: DW_TAG_member, name: "succs", scope: !2453, file: !341, line: 220, baseType: !2456, size: 64, offset: 64)
!2699 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2453, file: !341, line: 223, baseType: !2159, size: 64, offset: 128)
!2700 = !DIDerivedType(tag: DW_TAG_member, name: "loop_father", scope: !2453, file: !341, line: 226, baseType: !2701, size: 64, offset: 192)
!2701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2702, size: 64)
!2702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop", file: !328, line: 100, size: 1216, elements: !2703)
!2703 = !{!2704, !2705, !2706, !2707, !2708, !2713, !2714, !2715, !2729, !2730, !2731, !2732, !2733, !2734, !2735, !2736, !2737, !2738, !2746, !2754, !2755}
!2704 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2702, file: !328, line: 102, baseType: !2155, size: 32)
!2705 = !DIDerivedType(tag: DW_TAG_member, name: "ninsns", scope: !2702, file: !328, line: 105, baseType: !5, size: 32, offset: 32)
!2706 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2702, file: !328, line: 108, baseType: !2452, size: 64, offset: 64)
!2707 = !DIDerivedType(tag: DW_TAG_member, name: "latch", scope: !2702, file: !328, line: 111, baseType: !2452, size: 64, offset: 128)
!2708 = !DIDerivedType(tag: DW_TAG_member, name: "lpt_decision", scope: !2702, file: !328, line: 114, baseType: !2709, size: 64, offset: 192)
!2709 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "lpt_decision", file: !328, line: 41, size: 64, elements: !2710)
!2710 = !{!2711, !2712}
!2711 = !DIDerivedType(tag: DW_TAG_member, name: "decision", scope: !2709, file: !328, line: 42, baseType: !327, size: 32)
!2712 = !DIDerivedType(tag: DW_TAG_member, name: "times", scope: !2709, file: !328, line: 43, baseType: !5, size: 32, offset: 32)
!2713 = !DIDerivedType(tag: DW_TAG_member, name: "av_ninsns", scope: !2702, file: !328, line: 117, baseType: !5, size: 32, offset: 256)
!2714 = !DIDerivedType(tag: DW_TAG_member, name: "num_nodes", scope: !2702, file: !328, line: 120, baseType: !5, size: 32, offset: 288)
!2715 = !DIDerivedType(tag: DW_TAG_member, name: "superloops", scope: !2702, file: !328, line: 123, baseType: !2716, size: 64, offset: 320)
!2716 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2717, size: 64)
!2717 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_gc", file: !328, line: 87, baseType: !2718)
!2718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_gc", file: !328, line: 87, size: 128, elements: !2719)
!2719 = !{!2720}
!2720 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2718, file: !328, line: 87, baseType: !2721, size: 128)
!2721 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_loop_p_base", file: !328, line: 85, baseType: !2722)
!2722 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_loop_p_base", file: !328, line: 85, size: 128, elements: !2723)
!2723 = !{!2724, !2725, !2726}
!2724 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2722, file: !328, line: 85, baseType: !5, size: 32)
!2725 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2722, file: !328, line: 85, baseType: !5, size: 32, offset: 32)
!2726 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2722, file: !328, line: 85, baseType: !2727, size: 64, offset: 64)
!2727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2728, size: 64, elements: !2266)
!2728 = !DIDerivedType(tag: DW_TAG_typedef, name: "loop_p", file: !328, line: 84, baseType: !2701)
!2729 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !2702, file: !328, line: 126, baseType: !2701, size: 64, offset: 384)
!2730 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2702, file: !328, line: 129, baseType: !2701, size: 64, offset: 448)
!2731 = !DIDerivedType(tag: DW_TAG_member, name: "aux", scope: !2702, file: !328, line: 132, baseType: !2159, size: 64, offset: 512)
!2732 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations", scope: !2702, file: !328, line: 139, baseType: !2168, size: 64, offset: 576)
!2733 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_upper_bound", scope: !2702, file: !328, line: 143, baseType: !2217, size: 128, offset: 640)
!2734 = !DIDerivedType(tag: DW_TAG_member, name: "nb_iterations_estimate", scope: !2702, file: !328, line: 146, baseType: !2217, size: 128, offset: 768)
!2735 = !DIDerivedType(tag: DW_TAG_member, name: "any_upper_bound", scope: !2702, file: !328, line: 148, baseType: !2154, size: 8, offset: 896)
!2736 = !DIDerivedType(tag: DW_TAG_member, name: "any_estimate", scope: !2702, file: !328, line: 149, baseType: !2154, size: 8, offset: 904)
!2737 = !DIDerivedType(tag: DW_TAG_member, name: "estimate_state", scope: !2702, file: !328, line: 153, baseType: !336, size: 32, offset: 928)
!2738 = !DIDerivedType(tag: DW_TAG_member, name: "bounds", scope: !2702, file: !328, line: 156, baseType: !2739, size: 64, offset: 960)
!2739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2740, size: 64)
!2740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "nb_iter_bound", file: !328, line: 48, size: 320, elements: !2741)
!2741 = !{!2742, !2743, !2744, !2745}
!2742 = !DIDerivedType(tag: DW_TAG_member, name: "stmt", scope: !2740, file: !328, line: 50, baseType: !2488, size: 64)
!2743 = !DIDerivedType(tag: DW_TAG_member, name: "bound", scope: !2740, file: !328, line: 59, baseType: !2217, size: 128, offset: 64)
!2744 = !DIDerivedType(tag: DW_TAG_member, name: "is_exit", scope: !2740, file: !328, line: 64, baseType: !2154, size: 8, offset: 192)
!2745 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2740, file: !328, line: 67, baseType: !2739, size: 64, offset: 256)
!2746 = !DIDerivedType(tag: DW_TAG_member, name: "exits", scope: !2702, file: !328, line: 159, baseType: !2747, size: 64, offset: 1024)
!2747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2748, size: 64)
!2748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "loop_exit", file: !328, line: 72, size: 256, elements: !2749)
!2749 = !{!2750, !2751, !2752, !2753}
!2750 = !DIDerivedType(tag: DW_TAG_member, name: "e", scope: !2748, file: !328, line: 74, baseType: !2469, size: 64)
!2751 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !2748, file: !328, line: 77, baseType: !2747, size: 64, offset: 64)
!2752 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !2748, file: !328, line: 78, baseType: !2747, size: 64, offset: 128)
!2753 = !DIDerivedType(tag: DW_TAG_member, name: "next_e", scope: !2748, file: !328, line: 81, baseType: !2747, size: 64, offset: 192)
!2754 = !DIDerivedType(tag: DW_TAG_member, name: "can_be_parallel", scope: !2702, file: !328, line: 162, baseType: !2154, size: 8, offset: 1088)
!2755 = !DIDerivedType(tag: DW_TAG_member, name: "single_iv", scope: !2702, file: !328, line: 166, baseType: !2168, size: 64, offset: 1152)
!2756 = !DIDerivedType(tag: DW_TAG_member, name: "dom", scope: !2453, file: !341, line: 229, baseType: !2757, size: 128, offset: 256)
!2757 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2758, size: 128, elements: !2407)
!2758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2759, size: 64)
!2759 = !DICompositeType(tag: DW_TAG_structure_type, name: "et_node", file: !341, line: 229, flags: DIFlagFwdDecl)
!2760 = !DIDerivedType(tag: DW_TAG_member, name: "prev_bb", scope: !2453, file: !341, line: 232, baseType: !2452, size: 64, offset: 384)
!2761 = !DIDerivedType(tag: DW_TAG_member, name: "next_bb", scope: !2453, file: !341, line: 233, baseType: !2452, size: 64, offset: 448)
!2762 = !DIDerivedType(tag: DW_TAG_member, name: "il", scope: !2453, file: !341, line: 238, baseType: !2763, size: 64, offset: 512)
!2763 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "basic_block_il_dependent", file: !341, line: 235, size: 64, elements: !2764)
!2764 = !{!2765, !2771}
!2765 = !DIDerivedType(tag: DW_TAG_member, name: "gimple", scope: !2763, file: !341, line: 236, baseType: !2766, size: 64)
!2766 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2767, size: 64)
!2767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gimple_bb_info", file: !341, line: 273, size: 128, elements: !2768)
!2768 = !{!2769, !2770}
!2769 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !2767, file: !341, line: 275, baseType: !2478, size: 64)
!2770 = !DIDerivedType(tag: DW_TAG_member, name: "phi_nodes", scope: !2767, file: !341, line: 278, baseType: !2478, size: 64, offset: 64)
!2771 = !DIDerivedType(tag: DW_TAG_member, name: "rtl", scope: !2763, file: !341, line: 237, baseType: !2772, size: 64)
!2772 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2773, size: 64)
!2773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rtl_bb_info", file: !341, line: 259, size: 320, elements: !2774)
!2774 = !{!2775, !2776, !2777, !2778, !2779}
!2775 = !DIDerivedType(tag: DW_TAG_member, name: "head_", scope: !2773, file: !341, line: 261, baseType: !2340, size: 64)
!2776 = !DIDerivedType(tag: DW_TAG_member, name: "end_", scope: !2773, file: !341, line: 262, baseType: !2340, size: 64, offset: 64)
!2777 = !DIDerivedType(tag: DW_TAG_member, name: "header", scope: !2773, file: !341, line: 266, baseType: !2340, size: 64, offset: 128)
!2778 = !DIDerivedType(tag: DW_TAG_member, name: "footer", scope: !2773, file: !341, line: 267, baseType: !2340, size: 64, offset: 192)
!2779 = !DIDerivedType(tag: DW_TAG_member, name: "visited", scope: !2773, file: !341, line: 270, baseType: !2155, size: 32, offset: 256)
!2780 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !2453, file: !341, line: 241, baseType: !2697, size: 64, offset: 576)
!2781 = !DIDerivedType(tag: DW_TAG_member, name: "index", scope: !2453, file: !341, line: 244, baseType: !2155, size: 32, offset: 640)
!2782 = !DIDerivedType(tag: DW_TAG_member, name: "loop_depth", scope: !2453, file: !341, line: 247, baseType: !2155, size: 32, offset: 672)
!2783 = !DIDerivedType(tag: DW_TAG_member, name: "frequency", scope: !2453, file: !341, line: 250, baseType: !2155, size: 32, offset: 704)
!2784 = !DIDerivedType(tag: DW_TAG_member, name: "discriminator", scope: !2453, file: !341, line: 253, baseType: !2155, size: 32, offset: 736)
!2785 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !2453, file: !341, line: 256, baseType: !2155, size: 32, offset: 768)
!2786 = !DIDerivedType(tag: DW_TAG_member, name: "rt_mem", scope: !2360, file: !447, line: 179, baseType: !2787, size: 64)
!2787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2788, size: 64)
!2788 = !DIDerivedType(tag: DW_TAG_typedef, name: "mem_attrs", file: !447, line: 150, baseType: !2789)
!2789 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "mem_attrs", file: !447, line: 142, size: 320, elements: !2790)
!2790 = !{!2791, !2792, !2793, !2794, !2797, !2798}
!2791 = !DIDerivedType(tag: DW_TAG_member, name: "expr", scope: !2789, file: !447, line: 144, baseType: !2168, size: 64)
!2792 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2789, file: !447, line: 145, baseType: !2340, size: 64, offset: 64)
!2793 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2789, file: !447, line: 146, baseType: !2340, size: 64, offset: 128)
!2794 = !DIDerivedType(tag: DW_TAG_member, name: "alias", scope: !2789, file: !447, line: 147, baseType: !2795, size: 32, offset: 192)
!2795 = !DIDerivedType(tag: DW_TAG_typedef, name: "alias_set_type", file: !2796, line: 31, baseType: !2155)
!2796 = !DIFile(filename: "./alias.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2797 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !2789, file: !447, line: 148, baseType: !5, size: 32, offset: 224)
!2798 = !DIDerivedType(tag: DW_TAG_member, name: "addrspace", scope: !2789, file: !447, line: 149, baseType: !2154, size: 8, offset: 256)
!2799 = !DIDerivedType(tag: DW_TAG_member, name: "rt_reg", scope: !2360, file: !447, line: 180, baseType: !2800, size: 64)
!2800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2801, size: 64)
!2801 = !DIDerivedType(tag: DW_TAG_typedef, name: "reg_attrs", file: !447, line: 162, baseType: !2802)
!2802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "reg_attrs", file: !447, line: 159, size: 128, elements: !2803)
!2803 = !{!2804, !2805}
!2804 = !DIDerivedType(tag: DW_TAG_member, name: "decl", scope: !2802, file: !447, line: 160, baseType: !2168, size: 64)
!2805 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2802, file: !447, line: 161, baseType: !2223, size: 64, offset: 64)
!2806 = !DIDerivedType(tag: DW_TAG_member, name: "rt_constant", scope: !2360, file: !447, line: 181, baseType: !2807, size: 64)
!2807 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2808, size: 64)
!2808 = !DICompositeType(tag: DW_TAG_structure_type, name: "constant_descriptor_rtx", file: !447, line: 181, flags: DIFlagFwdDecl)
!2809 = !DIDerivedType(tag: DW_TAG_member, name: "hwint", scope: !2355, file: !447, line: 317, baseType: !2810, size: 64)
!2810 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2223, size: 64, elements: !2266)
!2811 = !DIDerivedType(tag: DW_TAG_member, name: "block_sym", scope: !2355, file: !447, line: 318, baseType: !2812, size: 320)
!2812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "block_symbol", file: !447, line: 188, size: 320, elements: !2813)
!2813 = !{!2814, !2816, !2839}
!2814 = !DIDerivedType(tag: DW_TAG_member, name: "fld", scope: !2812, file: !447, line: 190, baseType: !2815, size: 192)
!2815 = !DICompositeType(tag: DW_TAG_array_type, baseType: !2359, size: 192, elements: !2241)
!2816 = !DIDerivedType(tag: DW_TAG_member, name: "block", scope: !2812, file: !447, line: 193, baseType: !2817, size: 64, offset: 192)
!2817 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2818, size: 64)
!2818 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "object_block", file: !447, line: 206, size: 320, elements: !2819)
!2819 = !{!2820, !2824, !2825, !2826, !2838}
!2820 = !DIDerivedType(tag: DW_TAG_member, name: "sect", scope: !2818, file: !447, line: 208, baseType: !2821, size: 64)
!2821 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2822, size: 64)
!2822 = !DIDerivedType(tag: DW_TAG_typedef, name: "section", file: !2169, line: 62, baseType: !2823)
!2823 = !DICompositeType(tag: DW_TAG_union_type, name: "section", file: !2169, line: 61, flags: DIFlagFwdDecl)
!2824 = !DIDerivedType(tag: DW_TAG_member, name: "alignment", scope: !2818, file: !447, line: 211, baseType: !5, size: 32, offset: 64)
!2825 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !2818, file: !447, line: 214, baseType: !2223, size: 64, offset: 128)
!2826 = !DIDerivedType(tag: DW_TAG_member, name: "objects", scope: !2818, file: !447, line: 224, baseType: !2827, size: 64, offset: 192)
!2827 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2828, size: 64)
!2828 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_gc", file: !447, line: 202, baseType: !2829)
!2829 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_gc", file: !447, line: 202, size: 128, elements: !2830)
!2830 = !{!2831}
!2831 = !DIDerivedType(tag: DW_TAG_member, name: "base", scope: !2829, file: !447, line: 202, baseType: !2832, size: 128)
!2832 = !DIDerivedType(tag: DW_TAG_typedef, name: "VEC_rtx_base", file: !447, line: 200, baseType: !2833)
!2833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "VEC_rtx_base", file: !447, line: 200, size: 128, elements: !2834)
!2834 = !{!2835, !2836, !2837}
!2835 = !DIDerivedType(tag: DW_TAG_member, name: "num", scope: !2833, file: !447, line: 200, baseType: !5, size: 32)
!2836 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !2833, file: !447, line: 200, baseType: !5, size: 32, offset: 32)
!2837 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !2833, file: !447, line: 200, baseType: !2373, size: 64, offset: 64)
!2838 = !DIDerivedType(tag: DW_TAG_member, name: "anchors", scope: !2818, file: !447, line: 234, baseType: !2827, size: 64, offset: 256)
!2839 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2812, file: !447, line: 197, baseType: !2223, size: 64, offset: 256)
!2840 = !DIDerivedType(tag: DW_TAG_member, name: "rv", scope: !2355, file: !447, line: 319, baseType: !2230, size: 256)
!2841 = !DIDerivedType(tag: DW_TAG_member, name: "fv", scope: !2355, file: !447, line: 320, baseType: !2249, size: 192)
!2842 = !DIDerivedType(tag: DW_TAG_member, name: "decl_non_common", scope: !2171, file: !133, line: 3384, baseType: !2843, size: 1472)
!2843 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_non_common", file: !133, line: 3114, size: 1472, elements: !2844)
!2844 = !{!2845, !2866, !2867, !2868, !2869}
!2845 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2843, file: !133, line: 3115, baseType: !2846, size: 1216)
!2846 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_decl_with_vis", file: !133, line: 2984, size: 1216, elements: !2847)
!2847 = !{!2848, !2849, !2850, !2851, !2852, !2853, !2854, !2855, !2856, !2857, !2858, !2859, !2860, !2861, !2862, !2863, !2864, !2865}
!2848 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2846, file: !133, line: 2985, baseType: !2336, size: 960)
!2849 = !DIDerivedType(tag: DW_TAG_member, name: "assembler_name", scope: !2846, file: !133, line: 2986, baseType: !2168, size: 64, offset: 960)
!2850 = !DIDerivedType(tag: DW_TAG_member, name: "section_name", scope: !2846, file: !133, line: 2987, baseType: !2168, size: 64, offset: 1024)
!2851 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_group", scope: !2846, file: !133, line: 2988, baseType: !2168, size: 64, offset: 1088)
!2852 = !DIDerivedType(tag: DW_TAG_member, name: "defer_output", scope: !2846, file: !133, line: 2991, baseType: !5, size: 1, offset: 1152, flags: DIFlagBitField, extraData: i64 1152)
!2853 = !DIDerivedType(tag: DW_TAG_member, name: "hard_register", scope: !2846, file: !133, line: 2992, baseType: !5, size: 1, offset: 1153, flags: DIFlagBitField, extraData: i64 1152)
!2854 = !DIDerivedType(tag: DW_TAG_member, name: "thread_local", scope: !2846, file: !133, line: 2993, baseType: !5, size: 1, offset: 1154, flags: DIFlagBitField, extraData: i64 1152)
!2855 = !DIDerivedType(tag: DW_TAG_member, name: "common_flag", scope: !2846, file: !133, line: 2994, baseType: !5, size: 1, offset: 1155, flags: DIFlagBitField, extraData: i64 1152)
!2856 = !DIDerivedType(tag: DW_TAG_member, name: "in_text_section", scope: !2846, file: !133, line: 2995, baseType: !5, size: 1, offset: 1156, flags: DIFlagBitField, extraData: i64 1152)
!2857 = !DIDerivedType(tag: DW_TAG_member, name: "dllimport_flag", scope: !2846, file: !133, line: 2996, baseType: !5, size: 1, offset: 1157, flags: DIFlagBitField, extraData: i64 1152)
!2858 = !DIDerivedType(tag: DW_TAG_member, name: "shadowed_for_var_p", scope: !2846, file: !133, line: 2998, baseType: !5, size: 1, offset: 1158, flags: DIFlagBitField, extraData: i64 1152)
!2859 = !DIDerivedType(tag: DW_TAG_member, name: "weak_flag", scope: !2846, file: !133, line: 3000, baseType: !5, size: 1, offset: 1159, flags: DIFlagBitField, extraData: i64 1152)
!2860 = !DIDerivedType(tag: DW_TAG_member, name: "seen_in_bind_expr", scope: !2846, file: !133, line: 3002, baseType: !5, size: 1, offset: 1160, flags: DIFlagBitField, extraData: i64 1152)
!2861 = !DIDerivedType(tag: DW_TAG_member, name: "comdat_flag", scope: !2846, file: !133, line: 3003, baseType: !5, size: 1, offset: 1161, flags: DIFlagBitField, extraData: i64 1152)
!2862 = !DIDerivedType(tag: DW_TAG_member, name: "visibility", scope: !2846, file: !133, line: 3004, baseType: !5, size: 2, offset: 1162, flags: DIFlagBitField, extraData: i64 1152)
!2863 = !DIDerivedType(tag: DW_TAG_member, name: "visibility_specified", scope: !2846, file: !133, line: 3005, baseType: !5, size: 1, offset: 1164, flags: DIFlagBitField, extraData: i64 1152)
!2864 = !DIDerivedType(tag: DW_TAG_member, name: "tls_model", scope: !2846, file: !133, line: 3007, baseType: !5, size: 3, offset: 1165, flags: DIFlagBitField, extraData: i64 1152)
!2865 = !DIDerivedType(tag: DW_TAG_member, name: "init_priority_p", scope: !2846, file: !133, line: 3010, baseType: !5, size: 1, offset: 1168, flags: DIFlagBitField, extraData: i64 1152)
!2866 = !DIDerivedType(tag: DW_TAG_member, name: "saved_tree", scope: !2843, file: !133, line: 3117, baseType: !2168, size: 64, offset: 1216)
!2867 = !DIDerivedType(tag: DW_TAG_member, name: "arguments", scope: !2843, file: !133, line: 3119, baseType: !2168, size: 64, offset: 1280)
!2868 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !2843, file: !133, line: 3121, baseType: !2168, size: 64, offset: 1344)
!2869 = !DIDerivedType(tag: DW_TAG_member, name: "vindex", scope: !2843, file: !133, line: 3123, baseType: !2168, size: 64, offset: 1408)
!2870 = !DIDerivedType(tag: DW_TAG_member, name: "parm_decl", scope: !2171, file: !133, line: 3385, baseType: !2871, size: 1088)
!2871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_parm_decl", file: !133, line: 2874, size: 1088, elements: !2872)
!2872 = !{!2873, !2874, !2875}
!2873 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2871, file: !133, line: 2875, baseType: !2336, size: 960)
!2874 = !DIDerivedType(tag: DW_TAG_member, name: "incoming_rtl", scope: !2871, file: !133, line: 2876, baseType: !2340, size: 64, offset: 960)
!2875 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2871, file: !133, line: 2877, baseType: !2876, size: 64, offset: 1024)
!2876 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2877, size: 64)
!2877 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "var_ann_d", file: !2878, line: 172, size: 128, elements: !2879)
!2878 = !DIFile(filename: "./tree-flow.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
!2879 = !{!2880, !2881, !2882, !2883, !2884, !2885, !2886}
!2880 = !DIDerivedType(tag: DW_TAG_member, name: "base_var_processed", scope: !2877, file: !2878, line: 174, baseType: !5, size: 1, flags: DIFlagBitField, extraData: i64 0)
!2881 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !2877, file: !2878, line: 178, baseType: !5, size: 1, offset: 1, flags: DIFlagBitField, extraData: i64 0)
!2882 = !DIDerivedType(tag: DW_TAG_member, name: "need_phi_state", scope: !2877, file: !2878, line: 183, baseType: !5, size: 2, offset: 2, flags: DIFlagBitField, extraData: i64 0)
!2883 = !DIDerivedType(tag: DW_TAG_member, name: "is_heapvar", scope: !2877, file: !2878, line: 187, baseType: !5, size: 1, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!2884 = !DIDerivedType(tag: DW_TAG_member, name: "noalias_state", scope: !2877, file: !2878, line: 192, baseType: !5, size: 2, offset: 5, flags: DIFlagBitField, extraData: i64 0)
!2885 = !DIDerivedType(tag: DW_TAG_member, name: "base_index", scope: !2877, file: !2878, line: 195, baseType: !5, size: 32, offset: 32)
!2886 = !DIDerivedType(tag: DW_TAG_member, name: "current_def", scope: !2877, file: !2878, line: 199, baseType: !2168, size: 64, offset: 64)
!2887 = !DIDerivedType(tag: DW_TAG_member, name: "decl_with_vis", scope: !2171, file: !133, line: 3386, baseType: !2846, size: 1216)
!2888 = !DIDerivedType(tag: DW_TAG_member, name: "var_decl", scope: !2171, file: !133, line: 3387, baseType: !2889, size: 1280)
!2889 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_var_decl", file: !133, line: 3093, size: 1280, elements: !2890)
!2890 = !{!2891, !2892}
!2891 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2889, file: !133, line: 3094, baseType: !2846, size: 1216)
!2892 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2889, file: !133, line: 3095, baseType: !2876, size: 64, offset: 1216)
!2893 = !DIDerivedType(tag: DW_TAG_member, name: "field_decl", scope: !2171, file: !133, line: 3388, baseType: !2894, size: 1216)
!2894 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_field_decl", file: !133, line: 2824, size: 1216, elements: !2895)
!2895 = !{!2896, !2897, !2898, !2899, !2900, !2901}
!2896 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2894, file: !133, line: 2825, baseType: !2298, size: 896)
!2897 = !DIDerivedType(tag: DW_TAG_member, name: "offset", scope: !2894, file: !133, line: 2827, baseType: !2168, size: 64, offset: 896)
!2898 = !DIDerivedType(tag: DW_TAG_member, name: "bit_field_type", scope: !2894, file: !133, line: 2828, baseType: !2168, size: 64, offset: 960)
!2899 = !DIDerivedType(tag: DW_TAG_member, name: "qualifier", scope: !2894, file: !133, line: 2829, baseType: !2168, size: 64, offset: 1024)
!2900 = !DIDerivedType(tag: DW_TAG_member, name: "bit_offset", scope: !2894, file: !133, line: 2830, baseType: !2168, size: 64, offset: 1088)
!2901 = !DIDerivedType(tag: DW_TAG_member, name: "fcontext", scope: !2894, file: !133, line: 2831, baseType: !2168, size: 64, offset: 1152)
!2902 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl", scope: !2171, file: !133, line: 3389, baseType: !2903, size: 1024)
!2903 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_label_decl", file: !133, line: 2850, size: 1024, elements: !2904)
!2904 = !{!2905, !2906, !2907}
!2905 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2903, file: !133, line: 2851, baseType: !2336, size: 960)
!2906 = !DIDerivedType(tag: DW_TAG_member, name: "label_decl_uid", scope: !2903, file: !133, line: 2852, baseType: !2155, size: 32, offset: 960)
!2907 = !DIDerivedType(tag: DW_TAG_member, name: "eh_landing_pad_nr", scope: !2903, file: !133, line: 2853, baseType: !2155, size: 32, offset: 992)
!2908 = !DIDerivedType(tag: DW_TAG_member, name: "result_decl", scope: !2171, file: !133, line: 3390, baseType: !2909, size: 1024)
!2909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_result_decl", file: !133, line: 2857, size: 1024, elements: !2910)
!2910 = !{!2911, !2912}
!2911 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2909, file: !133, line: 2858, baseType: !2336, size: 960)
!2912 = !DIDerivedType(tag: DW_TAG_member, name: "ann", scope: !2909, file: !133, line: 2859, baseType: !2876, size: 64, offset: 960)
!2913 = !DIDerivedType(tag: DW_TAG_member, name: "const_decl", scope: !2171, file: !133, line: 3391, baseType: !2914, size: 960)
!2914 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_const_decl", file: !133, line: 2862, size: 960, elements: !2915)
!2915 = !{!2916}
!2916 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2914, file: !133, line: 2863, baseType: !2336, size: 960)
!2917 = !DIDerivedType(tag: DW_TAG_member, name: "type_decl", scope: !2171, file: !133, line: 3392, baseType: !2918, size: 1472)
!2918 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_type_decl", file: !133, line: 3304, size: 1472, elements: !2919)
!2919 = !{!2920}
!2920 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2918, file: !133, line: 3305, baseType: !2843, size: 1472)
!2921 = !DIDerivedType(tag: DW_TAG_member, name: "function_decl", scope: !2171, file: !133, line: 3393, baseType: !2922, size: 1792)
!2922 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tree_function_decl", file: !133, line: 3248, size: 1792, elements: !2923)
!2923 = !{!2924, !2925, !3144, !3145, !3146, !3147, !3148, !3149, !3150, !3151, !3152, !3153, !3154, !3155, !3156, !3157, !3158, !3159, !3160, !3161, !3162, !3163, !3164}
!2924 = !DIDerivedType(tag: DW_TAG_member, name: "common", scope: !2922, file: !133, line: 3249, baseType: !2843, size: 1472)
!2925 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !2922, file: !133, line: 3251, baseType: !2926, size: 64, offset: 1472)
!2926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !2927, size: 64)
!2927 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "function", file: !2928, line: 463, size: 1152, elements: !2929)
!2928 = !DIFile(filename: "./function.h", directory: "/u/ziyangx/old_or_raw_benchmarks/spec2017-workspace/benchspec/CPU/502.gcc_r/src")
